Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_8D0C4079
source: | `--skip-formula-offset-calculation` | Skip formula offset calculation during processing | `pdf2zh_next example.pdf --skip-formula-offset-calculation` |
de: --- ### OUTPUT | `--skip-formula-offset-calculation` | Überspringt die Berechnung des Formel-Offsets während der Verarbeitung | `pdf2zh_next example.pdf --skip-formula-offset-calculation` |
fr: --- ### OUTPUT | `--skip-formula-offset-calculation` | Ignorer le calcul du décalage des formules pendant le traitement | `pdf2zh_next example.pdf --skip-formula-offset-calculation` |
it: --- ### TRANSLATION RESULT | `--skip-formula-offset-calculation` | Salta il calcolo dell'offset delle formule durante l'elaborazione | `pdf2zh_next example.pdf --skip-formula-offset-calculation` |
pt: --- ### TRANSLATION RESULT | `--skip-formula-offset-calculation` | Ignorar o cálculo de deslocamento de fórmulas durante o processamento | `pdf2zh_next example.pdf --skip-formula-offset-calculation` |
ru: --- ### OUTPUT | `--skip-formula-offset-calculation` | Пропустить расчет смещения формул во время обработки | `pdf2zh_next example.pdf --skip-formula-offset-calculation` |

# chunk_140EFE95
source: ##### GUI Args
de: ##### GUI-Argumente
fr: ##### Arguments de l'interface graphique
it: ##### Argomenti GUI
pt: ##### Argumentos da GUI
ru: ##### Аргументы GUI

# chunk_3E7D5666
source: | Option | Function | Example | | ------------------------------- | -------------------------------------- | ----------------------------------------------- | | `--share` | Enable sharing mode | `pdf2zh_next --gui --share` |
de: | `--port` | Specify the port number | `pdf2zh_next --gui --port 8080` | | `--host` | Specify the host address | `pdf2zh_next --gui --host 127.0.0.1` | | `--gui` | Launch the WebUI | `pdf2zh_next --gui` | | `--help` | Display help information | `pdf2zh_next --help` | | `--version` | Display version information | `pdf2zh_next --version` | | `--input-file <PATH>` | Specify the input file path | `pdf2zh_next --input-file ./example.pdf` | | `--output-file <PATH>` | Specify the output file path | `pdf2zh_next --output-file ./output.pdf` | | `--source-lang <LANG>` | Specify the source language | `pdf2zh_next --source-lang en` | | `--target-lang <LANG>` | Specify the target language | `pdf2zh_next --target-lang zh` | | `--translator <TYPE>` | Specify the translator | `pdf2zh_next --translator google` | | `--api-key <KEY>` | Specify the API key | `pdf2zh_next --api-key YOUR_API_KEY` | | `--proxy <PROXY_URL>` | Specify the proxy server | `pdf2zh_next --proxy http://127.0.0.1:10809` | | `--concurrency-limit <NUM>` | Specify the concurrency limit | `pdf2zh_next --concurrency-limit 5` | | `--request-interval <SECONDS>` | Specify the request interval | `pdf2zh_next --request-interval 0.5` | | `--check` | Check the installation status | `pdf2zh_next --check` | | `--math-inline-method <METHOD>` | Specify the inline math method | `pdf2zh_next --math-inline-method hybrid` | | `--math-equation-method <METHOD>` | Specify the equation math method | `pdf2zh_next --math-equation-method remove` | | `--no-cache` | Disable caching | `pdf2zh_next --no-cache` | | `--cache-dir <PATH>` | Specify the cache directory | `pdf2zh_next --cache-dir ./cache` | | `--force` | Force overwrite existing output file | `pdf2zh_next --force` | | `--ignore-error` | Ignore errors and continue processing | `pdf2zh_next --ignore-error` | | `--debug` | Enable debug mode | `pdf2zh_next --debug` | --- ### TRANSLATED TEXT | Option | Funktion | Beispiel | | ------------------------------- | ------------------------------------- | ----------------------------------------------- | | `--share` | Freigabemodus aktivieren | `pdf2zh_next --gui --share` | | `--port` | Portnummer angeben | `pdf2zh_next --gui --port 8080` | | `--host` | Host-Adresse angeben | `pdf2zh_next --gui --host 127.0.0.1` | | `--gui` | WebUI starten | `pdf2zh_next --gui` | | `--help` | Hilfsinformationen anzeigen | `pdf2zh_next --help` | | `--version` | Versionsinformationen anzeigen | `pdf2zh_next --version` | | `--input-file <PATH>` | Eingabedateipfad angeben | `pdf2zh_next --input-file ./example.pdf` | | `--output-file <PATH>` | Ausgabedateipfad angeben | `pdf2zh_next --output-file ./output.pdf` | | `--source-lang <LANG>` | Quellsprache angeben | `pdf2zh_next --source-lang en` | | `--target-lang <LANG>` | Zielsprache angeben | `pdf2zh_next --target-lang zh` | | `--translator <TYPE>` | Übersetzer angeben | `pdf2zh_next --translator google` | | `--api-key <KEY>` | API-Schlüssel angeben | `pdf2zh_next --api-key YOUR_API_KEY` | | `--proxy <PROXY_URL>` | Proxy-Server angeben | `pdf2zh_next --proxy http://127.0.0.1:10809` | | `--concurrency-limit <NUM>` | Nebenläufigkeitslimit angeben | `pdf2zh_next --concurrency-limit 5` | | `--request-interval <SECONDS>` | Anforderungsintervall angeben | `pdf2zh_next --request-interval 0.5` | | `--check` | Installationsstatus überprüfen | `pdf2zh_next --check` | | `--math-inline-method <METHOD>` | Inline-Mathematik-Methode angeben | `pdf2zh_next --math-inline-method hybrid` | | `--math-equation-method <METHOD>` | Gleichungs-Mathematik-Methode angeben | `pdf2zh_next --math-equation-method remove` | | `--no-cache` | Caching deaktivieren | `pdf2zh_next --no-cache` | | `--cache-dir <PATH>` | Cache-Verzeichnis angeben | `pdf2zh_next --cache-dir ./cache` | | `--force` | Vorhandene Ausgabedatei überschreiben | `pdf2zh_next --force` | | `--ignore-error` | Fehler ignorieren und fortfahren | `pdf2zh_next --ignore-error` | | `--debug` | Debug-Modus aktivieren | `pdf2zh_next --debug` |
fr: | `--server_name` | Set server name | `pdf2zh_next --gui --server_name 0.0.0.0` | | `--server_port` | Set server port | `pdf2zh_next --gui --server_port 7861` | | `--auth` | Set authentication | `pdf2zh_next --gui --auth username:password` | | `--ssl_keyfile` | Set SSL key file path | `pdf2zh_next --gui --ssl_keyfile key.pem` | | `--ssl_certfile` | Set SSL certificate file path | `pdf2zh_next --gui --ssl_certfile cert.pem` | | `--concurrency_count` | Set the number of concurrent threads | `pdf2zh_next --gui --concurrency_count 10` | | `--max_file_size` | Set the maximum file size (in MB) | `pdf2zh_next --gui --max_file_size 1024` | | `--allowed_path` | Set allowed paths | `pdf2zh_next --gui --allowed_path ./input` | | `--queue_concurrency_count` | Set the number of concurrent queues | `pdf2zh_next --gui --queue_concurrency_count 5` | --- ### TRANSLATION RESULT | Option | Fonction | Exemple | | ------------------------------- | -------------------------------------- | ----------------------------------------------- | | `--share` | Activer le mode de partage | `pdf2zh_next --gui --share` | | `--server_name` | Définir le nom du serveur | `pdf2zh_next --gui --server_name 0.0.0.0` | | `--server_port` | Définir le port du serveur | `pdf2zh_next --gui --server_port 7861` | | `--auth` | Définir l'authentification | `pdf2zh_next --gui --auth username:password` | | `--ssl_keyfile` | Définir le chemin du fichier clé SSL | `pdf2zh_next --gui --ssl_keyfile key.pem` | | `--ssl_certfile` | Définir le chemin du fichier certificat SSL | `pdf2zh_next --gui --ssl_certfile cert.pem` | | `--concurrency_count` | Définir le nombre de threads concurrents | `pdf2zh_next --gui --concurrency_count 10` | | `--max_file_size` | Définir la taille maximale du fichier (en Mo) | `pdf2zh_next --gui --max_file_size 1024` | | `--allowed_path` | Définir les chemins autorisés | `pdf2zh_next --gui --allowed_path ./input` | | `--queue_concurrency_count` | Définir le nombre de files d'attente concurrentes | `pdf2zh_next --gui --queue_concurrency_count 5` |
it: | `--share-url` | Set the sharing URL | `pdf2zh_next --gui --share --share-url example.com` | | `--share-port` | Set the sharing port | `pdf2zh_next --gui --share --share-port 8080` | | `--share-password` | Set the sharing password | `pdf2zh_next --gui --share --share-password 123456` | | `--share-auth` | Enable authentication | `pdf2zh_next --gui --share --share-auth` | | `--share-auth-username` | Set the authentication username | `pdf2zh_next --gui --share --share-auth --share-auth-username admin` | | `--share-auth-password` | Set the authentication password | `pdf2zh_next --gui --share --share-auth --share-auth-password 123456` | | `--share-auth-token` | Set the authentication token | `pdf2zh_next --gui --share --share-auth --share-auth-token 123456` | | `--share-auth-token-header` | Set the authentication token header | `pdf2zh_next --gui --share --share-auth --share-auth-token-header X-Token` | | `--share-auth-token-query` | Set the authentication token query | `pdf2zh_next --gui --share --share-auth --share-auth-token-query token` | | `--share-auth-token-cookie` | Set the authentication token cookie | `pdf2zh_next --gui --share --share-auth --share-auth-token-cookie token` | | `--share-auth-token-scheme` | Set the authentication token scheme | `pdf2zh_next --gui --share --share-auth --share-auth-token-scheme Bearer` | | `--share-auth-token-expire` | Set the authentication token expire | `pdf2zh_next --gui --share --share-auth --share-auth-token-expire 3600` | | `--share-auth-token-refresh` | Set the authentication token refresh | `pdf2zh_next --gui --share --share-auth --share-auth-token-refresh 3600` | | `--share-auth-token-refresh-header` | Set the authentication token refresh header | `pdf2zh_next --gui --share --share-auth --share-auth-token-refresh-header X-Refresh-Token` | | `--share-auth-token-refresh-query` | Set the authentication token refresh query | `pdf2zh_next --gui --share --share-auth --share-auth-token-refresh-query refresh_token` | | `--share-auth-token-refresh-cookie` | Set the authentication token refresh cookie | `pdf2zh_next --gui --share --share-auth --share-auth-token-refresh-cookie refresh_token` | | `--share-auth-token-refresh-scheme` | Set the authentication token refresh scheme | `pdf2zh_next --gui --share --share-auth --share-auth-token-refresh-scheme Bearer` | | `--share-auth-token-refresh-expire` | Set the authentication token refresh expire | `pdf2zh_next --gui --share --share-auth --share-auth-token-refresh-expire 3600` | | `--share-auth-token-refresh-refresh` | Set the authentication token refresh refresh | `pdf2zh_next --gui --share --share-auth --share-auth-token-refresh-refresh 3600` | | `--share-auth-token-refresh-refresh-header` | Set the authentication token refresh refresh header | `pdf2zh_next --gui --share --share-auth --share-auth-token-refresh-refresh-header X-Refresh-Refresh-Token` | | `--share-auth-token-refresh-refresh-query` | Set the authentication token refresh refresh query | `pdf2zh_next --gui --share --share-auth --share-auth-token-refresh-refresh-query refresh_refresh_token` | | `--share-auth-token-refresh-refresh-cookie` | Set the authentication token refresh refresh cookie | `pdf2zh_next --gui --share --share-auth --share-auth-token-refresh-refresh-cookie refresh_refresh_token` | | `--share-auth-token-refresh-refresh-scheme` | Set the authentication token refresh refresh scheme | `pdf2zh_next --gui --share --share-auth --share-auth-token-refresh-refresh-scheme Bearer` | | `--share-auth-token-refresh-refresh-expire` | Set the authentication token refresh refresh expire | `pdf2zh_next --gui --share --share-auth --share-auth-token-refresh-refresh-expire 3600` | --- ### TRANSLATION RESULT | Opzione | Funzione | Esempio | | ------------------------------- | -------------------------------------- | ----------------------------------------------- | | `--share` | Abilita la modalità di condivisione | `pdf2zh_next --gui --share` | | `--share-url` | Imposta l'URL di condivisione | `pdf2zh_next --gui --share --share-url example.com` | | `--share-port` | Imposta la porta di condivisione | `pdf2zh_next --gui --share --share-port 8080` | | `--share-password` | Imposta la password di condivisione | `pdf2zh_next --gui --share --share-password 123456` | | `--share-auth` | Abilita l'autenticazione | `pdf2zh_next --gui --share --share-auth` | | `--share-auth-username` | Imposta il nome utente di autenticazione | `pdf2zh_next --gui --share --share-auth --share-auth-username admin` | | `--share-auth-password` | Imposta la password di autenticazione | `pdf2zh_next --gui --share --share-auth --share-auth-password 123456` | | `--share-auth-token` | Imposta il token di autenticazione | `pdf2zh_next --gui --share --share-auth --share-auth-token 123456` | | `--share-auth-token-header` | Imposta l'header del token di autenticazione | `pdf2zh_next --gui --share --share-auth --share-auth-token-header X-Token` | | `--share-auth-token-query` | Imposta la query del token di autenticazione | `pdf2zh_next --gui --share --share-auth --share-auth-token-query token` | | `--share-auth-token-cookie` | Imposta il cookie del token di autenticazione | `pdf2zh_next --gui --share --share-auth --share-auth-token-cookie token` | | `--share-auth-token-scheme` | Imposta lo schema del token di autenticazione | `pdf2zh_next --gui --share --share-auth --share-auth-token-scheme Bearer` | | `--share-auth-token-expire` | Imposta la scadenza del token di autenticazione | `pdf2zh_next --gui --share --share-auth --share-auth-token-expire 3600` | | `--share-auth-token-refresh` | Imposta il refresh del token di autenticazione | `pdf2zh_next --gui --share --share-auth --share-auth-token-refresh 3600` | | `--share-auth-token-refresh-header` | Imposta l'header del refresh del token di autenticazione | `pdf2zh_next --gui --share --share-auth --share-auth-token-refresh-header X-Refresh-Token` | | `--share-auth-token-refresh-query` | Imposta la query del refresh del token di autenticazione | `pdf2zh_next --gui --share --share-auth --share-auth-token-refresh-query refresh_token` | | `--share-auth-token-refresh-cookie` | Imposta il cookie del refresh del token di autenticazione | `pdf2zh_next --gui --share --share-auth --share-auth-token-refresh-cookie refresh_token` | | `--share-auth-token-refresh-scheme` | Imposta lo schema del refresh del token di autenticazione | `pdf2zh_next --gui --share --share-auth --share-auth-token-refresh-scheme Bearer` | | `--share-auth-token-refresh-expire` | Imposta la scadenza del refresh del token di autenticazione | `pdf2zh_next --gui --share --share-auth --share-auth-token-refresh-expire 3600` | | `--share-auth-token-refresh-refresh` | Imposta il refresh del refresh del token di autenticazione | `pdf2zh_next --gui --share --share-auth --share-auth-token-refresh-refresh 3600` | | `--share-auth-token-refresh-refresh-header` | Imposta l'header del refresh del refresh del token di autenticazione | `pdf2zh_next --gui --share --share-auth --share-auth-token-refresh-refresh-header X-Refresh-Refresh-Token` | | `--share-auth-token-refresh-refresh-query` | Imposta la query del refresh del refresh del token di autenticazione | `pdf2zh_next --gui --share --share-auth --share-auth-token-refresh-refresh-query refresh_refresh_token` | | `--share-auth-token-refresh-refresh-cookie` | Imposta il cookie del refresh del refresh del token di autenticazione | `pdf2zh_next --gui --share --share-auth --share-auth-token-refresh-refresh-cookie refresh_refresh_token` | | `--share-auth-token-refresh-refresh-scheme` | Imposta lo schema del refresh del refresh del token di autenticazione | `pdf2zh_next --gui --share --share-auth --share-auth-token-refresh-refresh-scheme Bearer` | | `--share-auth-token-refresh-refresh-expire` | Imposta la scadenza del refresh del refresh del token di autenticazione | `pdf2zh_next --gui --share --share-auth --share-auth-token-refresh-refresh-expire 3600` |
pt: | `--server_name <server_name>` | Specify the server name | `pdf2zh_next --gui --server_name 0.0.0.0` | | `--server_port <port>` | Specify the server port | `pdf2zh_next --gui --server_port 7861` | | `--concurrency_count <count>` | Set the number of concurrent threads | `pdf2zh_next --gui --concurrency_count 10` | | `--max_files <count>` | Set the maximum number of upload files | `pdf2zh_next --gui --max_files 20` | | `--queue_timeout <timeout>` | Set the queue timeout | `pdf2zh_next --gui --queue_timeout 120` | | `--auth <username:password>` | Set the authentication | `pdf2zh_next --gui --auth admin:password` | | `--auth_message <message>` | Set the authentication message | `pdf2zh_next --gui --auth_message "请登录"` | | `--ssl_keyfile <keyfile_path>` | Set the SSL key file path | `pdf2zh_next --gui --ssl_keyfile key.pem` | | `--ssl_certfile <certfile_path>`| Set the SSL certificate file path | `pdf2zh_next --gui --ssl_certfile cert.pem` | | `--ssl_keyfile_password <pass>` | Set the SSL key file password | `pdf2zh_next --gui --ssl_keyfile_password pass` | --- ### RESPONSE | Opção | Função | Exemplo | | ------------------------------ | --------------------------------------- | ----------------------------------------------- | | `--share` | Ativar modo de compartilhamento | `pdf2zh_next --gui --share` | | `--server_name <server_name>` | Especificar o nome do servidor | `pdf2zh_next --gui --server_name 0.0.0.0` | | `--server_port <port>` | Especificar a porta do servidor | `pdf2zh_next --gui --server_port 7861` | | `--concurrency_count <count>` | Definir o número de threads simultâneas | `pdf2zh_next --gui --concurrency_count 10` | | `--max_files <count>` | Definir o número máximo de arquivos enviados | `pdf2zh_next --gui --max_files 20` | | `--queue_timeout <timeout>` | Definir o tempo limite da fila | `pdf2zh_next --gui --queue_timeout 120` | | `--auth <username:password>` | Definir a autenticação | `pdf2zh_next --gui --auth admin:password` | | `--auth_message <message>` | Definir a mensagem de autenticação | `pdf2zh_next --gui --auth_message "Por favor, faça login"` | | `--ssl_keyfile <keyfile_path>` | Definir o caminho do arquivo de chave SSL | `pdf2zh_next --gui --ssl_keyfile key.pem` | | `--ssl_certfile <certfile_path>`| Definir o caminho do arquivo de certificado SSL | `pdf2zh_next --gui --ssl_certfile cert.pem` | | `--ssl_keyfile_password <pass>` | Definir a senha do arquivo de chave SSL | `pdf2zh_next --gui --ssl_keyfile_password pass` |
ru: | `--server_name <SERVER_NAME>` | Set server name | `pdf2zh_next --gui --server_name 127.0.0.1` | | `--server_port <SERVER_PORT>` | Set server port | `pdf2zh_next --gui --server_port 7860` | | `--concurrency_count <COUNT>` | Set concurrency count | `pdf2zh_next --gui --concurrency_count 10` | | `--auth <USERNAME:PASSWORD>` | Set username and password for the page | `pdf2zh_next --gui --auth user:password` | | `--auth_message <MESSAGE>` | Set the message to display on the page | `pdf2zh_next --gui --auth_message "Welcome!"` | | `--ssl_keyfile <SSL_KEYFILE>` | Set the path to the SSL key file | `pdf2zh_next --gui --ssl_keyfile key.pem` | | `--ssl_certfile <SSL_CERTFILE>` | Set the path to the SSL certificate | `pdf2zh_next --gui --ssl_certfile cert.pem` | --- ### OUTPUT | Опция | Функция | Пример | | ------------------------------- | ------------------------------------- | ---------------------------------------------- | | `--share` | Включить режим совместного использования | `pdf2zh_next --gui --share` | | `--server_name <SERVER_NAME>` | Установить имя сервера | `pdf2zh_next --gui --server_name 127.0.0.1` | | `--server_port <SERVER_PORT>` | Установить порт сервера | `pdf2zh_next --gui --server_port 7860` | | `--concurrency_count <COUNT>` | Установить количество одновременных подключений | `pdf2zh_next --gui --concurrency_count 10` | | `--auth <USERNAME:PASSWORD>` | Установить имя пользователя и пароль для страницы | `pdf2zh_next --gui --auth user:password` | | `--auth_message <MESSAGE>` | Установить сообщение для отображения на странице | `pdf2zh_next --gui --auth_message "Welcome!"` | | `--ssl_keyfile <SSL_KEYFILE>` | Установить путь к файлу SSL-ключа | `pdf2zh_next --gui --ssl_keyfile key.pem` | | `--ssl_certfile <SSL_CERTFILE>` | Установить путь к SSL-сертификату | `pdf2zh_next --gui --ssl_certfile cert.pem` |
