Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_F75A4DB9
source: | `--pages` | Partial document translation | `pdf2zh_next example.pdf --pages 1,2,1-,-3,3-5` |
de: | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--target-lang` | Specify target language | `pdf2zh_next example.pdf --target-lang de` | | `--source-lang` | Specify source language (if you know it) | `pdf2zh_next example.pdf --source-lang en` | | `--engine` | Specify the translation engine to use | `pdf2zh_next example.pdf --engine google` | | `--proxy` | Set proxy for translation engine | `pdf2zh_next example.pdf --proxy http://127.0.0.1:7890` | | `--output` | Specify output file name | `pdf2zh_next example.pdf --output example_translated.pdf` | | `--no-ocr` | Disable OCR for the document | `pdf2zh_next example.pdf --no-ocr` | | `--ocr-only` | Only perform OCR on the document | `pdf2zh_next example.pdf --ocr-only` | | `--ocr-language` | Specify OCR language | `pdf2zh_next example.pdf --ocr-language en` | | `--ocr-timeout` | Set timeout for OCR | `pdf2zh_next example.pdf --ocr-timeout 30` | | `--ocr-ignore-existing-text` | Ignore existing text in the document during OCR | `pdf2zh_next example.pdf --ocr-ignore-existing-text` | | `--ocr-max-workers` | Set the maximum number of workers for OCR | `pdf2zh_next example.pdf --ocr-max-workers 4` | | `--ocr-retry` | Set the number of retries for OCR | `pdf2zh_next example.pdf --ocr-retry 3` | | `--ocr-max-task-count` | Set the maximum number of tasks for OCR | `pdf2zh_next example.pdf --ocr-max-task-count 10` | | `--ocr-options` | Specify additional options for OCR | `pdf2zh_next example.pdf --ocr-options '{"tesseract": {"dpi": 300}}'` | | `--translation-timeout` | Set timeout for translation | `pdf2zh_next example.pdf --translation-timeout 30` | | `--translation-max-workers` | Set the maximum number of workers for translation | `pdf2zh_next example.pdf --translation-max-workers 4` | | `--translation-retry` | Set the number of retries for translation | `pdf2zh_next example.pdf --translation-retry 3` | | `--translation-max-task-count` | Set the maximum number of tasks for translation | `pdf2zh_next example.pdf --translation-max-task-count 10` | | `--translation-options` | Specify additional options for translation | `pdf2zh_next example.pdf --translation-options '{"google": {"formality": "more"}}'` | | `--font` | Specify font for the translated document | `pdf2zh_next example.pdf --font "Noto Sans SC"` | | `--font-size` | Specify font size for the translated document | `pdf2zh_next example.pdf --font-size 12` | | `--line-spacing` | Specify line spacing for the translated document | `pdf2zh_next example.pdf --line-spacing 1.5` | | `--char-spacing` | Specify character spacing for the translated document | `pdf2zh_next example.pdf --char-spacing 0.1` | | `--margin` | Specify margin for the translated document | `pdf2zh_next example.pdf --margin 50` | | `--no-backup` | Disable backup of the original document | `pdf2zh_next example.pdf --no-backup` | | `--debug` | Enable debug mode | `pdf2zh_next example.pdf --debug` | | `--verbose` | Enable verbose output | `pdf2zh_next example.pdf --verbose` | | `--version` | Show version information | `pdf2zh_next --version` | | `--help` | Show help information | `pdf2zh_next --help` | --- ### TRANSLATION RESULT | `--pages` | Teilweise Übersetzung des Dokuments | `pdf2zh_next example.pdf --pages 1,2,1-,-3,3-5` | | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--target-lang` | Zielsprache angeben | `pdf2zh_next example.pdf --target-lang de` | | `--source-lang` | Quellsprache angeben (falls bekannt) | `pdf2zh_next example.pdf --source-lang en` | | `--engine` | Zu verwendende Übersetzungs-Engine angeben | `pdf2zh_next example.pdf --engine google` | | `--proxy` | Proxy für die Übersetzungs-Engine setzen | `pdf2zh_next example.pdf --proxy http://127.0.0.1:7890` | | `--output` | Ausgabedateinamen angeben | `pdf2zh_next example.pdf --output example_translated.pdf` | | `--no-ocr` | OCR für das Dokument deaktivieren | `pdf2zh_next example.pdf --no-ocr` | | `--ocr-only` | Nur OCR für das Dokument durchführen | `pdf2zh_next example.pdf --ocr-only` | | `--ocr-language` | OCR-Sprache angeben | `pdf2zh_next example.pdf --ocr-language en` | | `--ocr-timeout` | Timeout für OCR setzen | `pdf2zh_next example.pdf --ocr-timeout 30` | | `--ocr-ignore-existing-text` | Vorhandenen Text im Dokument während der OCR ignorieren | `pdf2zh_next example.pdf --ocr-ignore-existing-text` | | `--ocr-max-workers` | Maximale Anzahl von Workern für OCR setzen | `pdf2zh_next example.pdf --ocr-max-workers 4` | | `--ocr-retry` | Anzahl der Wiederholungen für OCR setzen | `pdf2zh_next example.pdf --ocr-retry 3` | | `--ocr-max-task-count` | Maximale Anzahl von Aufgaben für OCR setzen | `pdf2zh_next example.pdf --ocr-max-task-count 10` | | `--ocr-options` | Zusätzliche Optionen für OCR angeben | `pdf2zh_next example.pdf --ocr-options '{"tesseract": {"dpi": 300}}'` | | `--translation-timeout` | Timeout für Übersetzung setzen | `pdf2zh_next example.pdf --translation-timeout 30` | | `--translation-max-workers` | Maximale Anzahl von Workern für Übersetzung setzen | `pdf2zh_next example.pdf --translation-max-workers 4` | | `--translation-retry` | Anzahl der Wiederholungen für Übersetzung setzen | `pdf2zh_next example.pdf --translation-retry 3` | | `--translation-max-task-count` | Maximale Anzahl von Aufgaben für Übersetzung setzen | `pdf2zh_next example.pdf --translation-max-task-count 10` | | `--translation-options` | Zusätzliche Optionen für Übersetzung angeben | `pdf2zh_next example.pdf --translation-options '{"google": {"formality": "more"}}'` | | `--font` | Schriftart für das übersetzte Dokument angeben | `pdf2zh_next example.pdf --font "Noto Sans SC"` | | `--font-size` | Schriftgröße für das übersetzte Dokument angeben | `pdf2zh_next example.pdf --font-size 12` | | `--line-spacing` | Zeilenabstand für das übersetzte Dokument angeben | `pdf2zh_next example.pdf --line-spacing 1.5` | | `--char-spacing` | Zeichenabstand für das übersetzte Dokument angeben | `pdf2zh_next example.pdf --char-spacing 0.1` | | `--margin` | Rand für das übersetzte Dokument angeben | `pdf2zh_next example.pdf --margin 50` | | `--no-backup` | Sicherung des Originaldokuments deaktivieren | `pdf2zh_next example.pdf --no-backup` | | `--debug` | Debug-Modus aktivieren | `pdf2zh_next example.pdf --debug` | | `--verbose` | Ausführliche Ausgabe aktivieren | `pdf2zh_next example.pdf --verbose` | | `--version` | Versionsinformationen anzeigen | `pdf2zh_next --version` | | `--help` | Hilfeinformationen anzeigen | `pdf2zh_next --help` |
fr: [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | ----------------------------------------------------------------------------------------- | | `--output` | Specify the output file name | `pdf2zh_next example.pdf --output example-zh.pdf` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--model` | Specify the model to use for translation | `pdf2zh_next example.pdf --model gpt-4o` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--target-lang` | Specify the target language for translation | `pdf2zh_next example.pdf --target-lang fr` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--source-lang` | Specify the source language for translation | `pdf2zh_next example.pdf --source-lang en` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--api-key` | Specify the API key for the translation service | `pdf2zh_next example.pdf --api-key sk-xxxxxx` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--proxy` | Specify the proxy for the translation service | `pdf2zh_next example.pdf --proxy http://127.0.0.1:7890` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--tokens-per-chunk` | Specify the number of tokens per chunk for translation | `pdf2zh_next example.pdf --tokens-per-chunk 1024` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--tokens-overlap` | Specify the number of tokens to overlap between chunks for translation | `pdf2zh_next example.pdf --tokens-overlap 50` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--max-concurrent` | Specify the maximum number of concurrent translations | `pdf2zh_next example.pdf --max-concurrent 5` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--max-retries` | Specify the maximum number of retries for translation | `pdf2zh_next example.pdf --max-retries 3` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--timeout` | Specify the timeout for translation requests | `pdf2zh_next example.pdf --timeout 30` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--temperature` | Specify the temperature for translation | `pdf2zh_next example.pdf --temperature 0.1` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--translate-only` | Only translate the text without generating a new PDF | `pdf2zh_next example.pdf --translate-only` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--webui` | Start the web interface | `pdf2zh_next --webui` | [Using **WebUI**](https://pdf2zh-next.com/getting-started/USAGE_webui.html) | | `--webui-port` | Specify the port for the web interface | `pdf2zh_next --webui --webui-port 3000` | [Using **WebUI**](https://pdf2zh-next.com/getting-started/USAGE_webui.html) | | `--webui-host` | Specify the host for the web interface | `pdf2zh_next --webui --webui-host 0.0.0.0` | [Using **WebUI**](https://pdf2zh-next.com/getting-started/USAGE_webui.html) | | `--webui-base-url` | Specify the base URL for the web interface | `pdf2zh_next --webui --webui-base-url /pdf2zh` | [Using **WebUI**](https://pdf2zh-next.com/getting-started/USAGE_webui.html) | | `--webui-no-browser` | Do not open the browser automatically when starting the web interface | `pdf2zh_next --webui --webui-no-browser` | [Using **WebUI**](https://pdf2zh-next.com/getting-started/USAGE_webui.html) | | `--version` | Display the version of pdf2zh_next | `pdf2zh_next --version` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--help` | Display the help message | `pdf2zh_next --help` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | --- ### OUTPUT | `--pages` | Traduction partielle du document | `pdf2zh_next example.pdf --pages 1,2,1-,-3,3-5` | [Utilisation de la **Ligne de commande**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | ----------------------------------------------------------------------------------------- | | `--output` | Spécifier le nom du fichier de sortie | `pdf2zh_next example.pdf --output example-zh.pdf` | [Utilisation de la **Ligne de commande**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--model` | Spécifier le modèle à utiliser pour la traduction | `pdf2zh_next example.pdf --model gpt-4o` | [Utilisation de la **Ligne de commande**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--target-lang` | Spécifier la langue cible pour la traduction | `pdf2zh_next example.pdf --target-lang fr` | [Utilisation de la **Ligne de commande**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--source-lang` | Spécifier la langue source pour la traduction | `pdf2zh_next example.pdf --source-lang en` | [Utilisation de la **Ligne de commande**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--api-key` | Spécifier la clé API pour le service de traduction | `pdf2zh_next example.pdf --api-key sk-xxxxxx` | [Utilisation de la **Ligne de commande**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--proxy` | Spécifier le proxy pour le service de traduction | `pdf2zh_next example.pdf --proxy http://127.0.0.1:7890` | [Utilisation de la **Ligne de commande**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--tokens-per-chunk` | Spécifier le nombre de jetons par segment pour la traduction | `pdf2zh_next example.pdf --tokens-per-chunk 1024` | [Utilisation de la **Ligne de commande**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--tokens-overlap` | Spécifier le nombre de jetons à chevaucher entre les segments pour la traduction | `pdf2zh_next example.pdf --tokens-overlap 50` | [Utilisation de la **Ligne de commande**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--max-concurrent` | Spécifier le nombre maximum de traductions simultanées | `pdf2zh_next example.pdf --max-concurrent 5` | [Utilisation de la **Ligne de commande**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--max-retries` | Spécifier le nombre maximum de tentatives pour la traduction | `pdf2zh_next example.pdf --max-retries 3` | [Utilisation de la **Ligne de commande**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--timeout` | Spécifier le délai d’attente pour les requêtes de traduction | `pdf2zh_next example.pdf --timeout 30` | [Utilisation de la **Ligne de commande**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--temperature` | Spécifier la température pour la traduction | `pdf2zh_next example.pdf --temperature 0.1` | [Utilisation de la **Ligne de commande**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--translate-only` | Traduire uniquement le texte sans générer un nouveau PDF | `pdf2zh_next example.pdf --translate-only` | [Utilisation de la **Ligne de commande**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--webui` | Démarrer l’interface web | `pdf2zh_next --webui` | [Utilisation de **WebUI**](https://pdf2zh-next.com/getting-started/USAGE_webui.html) | | `--webui-port` | Spécifier le port pour l’interface web | `pdf2zh_next --webui --webui-port 3000` | [Utilisation de **WebUI**](https://pdf2zh-next.com/getting-started/USAGE_webui.html) | | `--webui-host` | Spécifier l’hôte pour l’interface web | `pdf2zh_next --webui --webui-host 0.0.0.0` | [Utilisation de **WebUI**](https://pdf2zh-next.com/getting-started/USAGE_webui.html) | | `--webui-base-url` | Spécifier l’URL de base pour l’interface web | `pdf2zh_next --webui --webui-base-url /pdf2zh` | [Utilisation de **WebUI**](https://pdf2zh-next.com/getting-started/USAGE_webui.html) | | `--webui-no-browser` | Ne pas ouvrir automatiquement le navigateur lors du démarrage de l’interface web | `pdf2zh_next --webui --webui-no-browser` | [Utilisation de **WebUI**](https://pdf2zh-next.com/getting-started/USAGE_webui.html) | | `--version` | Afficher la version de pdf2zh_next | `pdf2zh_next --version` | [Utilisation de la **Ligne de commande**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--help` | Afficher le message d’aide | `pdf2zh_next --help` | [Utilisation de la **Ligne de commande**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) |
it: Translate pages 1, 2, 1 to the end, from the beginning to page 3, and pages 3 to 5. | | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | ------------------------------------------------------------------------------------ | | `--output` | Specify the output file path | `pdf2zh_next example.pdf --output ./output/example_translated.pdf` | Output the translated document to `./output/example_translated.pdf`. | | `--lang` | Specify the target language | `pdf2zh_next example.pdf --lang ja` | Translate the document into Japanese. | | `--model` | Specify the translation model | `pdf2zh_next example.pdf --model gpt-4o` | Use the `gpt-4o` model for translation. | | `--api-key` | Specify the API key for the translation service | `pdf2zh_next example.pdf --api-key sk-...` | Use the specified API key for the translation service. | | `--api-base` | Specify the API base URL for the translation service | `pdf2zh_next example.pdf --api-base https://api.example.com` | Use the specified API base URL for the translation service. | | `--proxy` | Specify the proxy server for the translation service | `pdf2zh_next example.pdf --proxy http://127.0.0.1:7890` | Use the specified proxy server for the translation service. | | `--concurrency` | Specify the number of concurrent translation requests | `pdf2zh_next example.pdf --concurrency 5` | Use 5 concurrent translation requests. | | `--timeout` | Specify the timeout for each translation request | `pdf2zh_next example.pdf --timeout 60` | Set the timeout for each translation request to 60 seconds. | | `--retry` | Specify the number of retries for failed translation requests | `pdf2zh_next example.pdf --retry 3` | Retry failed translation requests up to 3 times. | | `--ignore-glossary` | Ignore the glossary during translation | `pdf2zh_next example.pdf --ignore-glossary` | Do not use the glossary during translation. | | `--ignore-translated` | Ignore previously translated content | `pdf2zh_next example.pdf --ignore-translated` | Do not use previously translated content. | | `--force-retranslate` | Force retranslation of all content | `pdf2zh_next example.pdf --force-retranslate` | Retranslate all content, ignoring any cached translations. | | `--no-cache` | Disable caching of translation results | `pdf2zh_next example.pdf --no-cache` | Do not cache translation results. | | `--cache-dir` | Specify the cache directory | `pdf2zh_next example.pdf --cache-dir ./cache` | Use `./cache` as the cache directory. | | `--log-level` | Specify the log level | `pdf2zh_next example.pdf --log-level debug` | Set the log level to `debug`. | | `--help` | Display help information | `pdf2zh_next --help` | Display help information for the command. | --- ### LANGUAGE CODE it
pt: | :------------------------------ | :-------------------------------------------------------------------------------------- | :--------------------------------------------------------------------------------------------------------------------- | | `--output_dir` | Specify the output directory | `pdf2zh_next example.pdf --output_dir ./output` | | `--output_filename` | Specify the output filename | `pdf2zh_next example.pdf --output_filename example_translated.pdf` | | `--cache_dir` | Specify the cache directory (for storing temporary files) | `pdf2zh_next example.pdf --cache_dir ./cache` | | `--cache` | Enable cache for translation results (default: `true`) | `pdf2zh_next example.pdf --cache false` | | `--overwrite` | Overwrite existing files (default: `false`) | `pdf2zh_next example.pdf --overwrite true` | | `--timeout` | Set the timeout for the translation service (in seconds) | `pdf2zh_next example.pdf --timeout 300` | | `--proxy` | Set the proxy for the translation service | `pdf2zh_next example.pdf --proxy http://127.0.0.1:7890` | | `--retry` | Set the number of retries for the translation service (default: `3`) | `pdf2zh_next example.pdf --retry 5` | | `--retry_delay` | Set the delay between retries (in seconds) (default: `5`) | `pdf2zh_next example.pdf --retry_delay 10` | | `--max_concurrent` | Set the maximum number of concurrent translation requests (default: `5`) | `pdf2zh_next example.pdf --max_concurrent 10` | | `--dry_run` | Perform a dry run without actually translating (default: `false`) | `pdf2zh_next example.pdf --dry_run true` | | `--verbose` | Enable verbose output (default: `false`) | `pdf2zh_next example.pdf --verbose true` | | `--version` | Show version information | `pdf2zh_next --version` | | `--help` | Show help information | `pdf2zh_next --help` | --- ### TRANSLATED TEXT | `--pages` | Tradução parcial do documento | `pdf2zh_next example.pdf --pages 1,2,1-,-3,3-5` | | :------------------------------ | :-------------------------------------------------------------------------------------- | :--------------------------------------------------------------------------------------------------------------------- | | `--output_dir` | Especificar o diretório de saída | `pdf2zh_next example.pdf --output_dir ./output` | | `--output_filename` | Especificar o nome do arquivo de saída | `pdf2zh_next example.pdf --output_filename example_translated.pdf` | | `--cache_dir` | Especificar o diretório de cache (para armazenar arquivos temporários) | `pdf2zh_next example.pdf --cache_dir ./cache` | | `--cache` | Ativar cache para resultados de tradução (padrão: `true`) | `pdf2zh_next example.pdf --cache false` | | `--overwrite` | Substituir arquivos existentes (padrão: `false`) | `pdf2zh_next example.pdf --overwrite true` | | `--timeout` | Definir o tempo limite para o serviço de tradução (em segundos) | `pdf2zh_next example.pdf --timeout 300` | | `--proxy` | Definir o proxy para o serviço de tradução | `pdf2zh_next example.pdf --proxy http://127.0.0.1:7890` | | `--retry` | Definir o número de tentativas para o serviço de tradução (padrão: `3`) | `pdf2zh_next example.pdf --retry 5` | | `--retry_delay` | Definir o atraso entre as tentativas (em segundos) (padrão: `5`) | `pdf2zh_next example.pdf --retry_delay 10` | | `--max_concurrent` | Definir o número máximo de solicitações de tradução simultâneas (padrão: `5`) | `pdf2zh_next example.pdf --max_concurrent 10` | | `--dry_run` | Executar uma simulação sem realmente traduzir (padrão: `false`) | `pdf2zh_next example.pdf --dry_run true` | | `--verbose` | Ativar saída detalhada (padrão: `false`) | `pdf2zh_next example.pdf --verbose true` | | `--version` | Mostrar informações de versão | `pdf2zh_next --version` | | `--help` | Mostrar informações de ajuda | `pdf2zh_next --help` |
ru: [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#pages) | | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------- | | `--ocr-version` | Specify the OCR engine | `pdf2zh_next example.pdf --ocr-version rapid` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#ocr-version) | | `--ocr-engine-args` | Pass additional arguments to the OCR engine | `pdf2zh_next example.pdf --ocr-engine-args '{"tessedit_pageseg_mode": "6"}'` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#ocr-engine-args) | | `--output-format` | Specify the output format | `pdf2zh_next example.pdf --output-format pdf` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#output-format) | | `--output-filename` | Specify the output filename | `pdf2zh_next example.pdf --output-filename example_zh.pdf` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#output-filename) | | `--output-directory` | Specify the output directory | `pdf2zh_next example.pdf --output-directory ./output` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#output-directory) | | `--target-language` | Specify the target language | `pdf2zh_next example.pdf --target-language ru` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#target-language) | | `--translate-service` | Specify the translation service | `pdf2zh_next example.pdf --translate-service google` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#translate-service) | | `--translate-service-args` | Pass additional arguments to the translation service | `pdf2zh_next example.pdf --translate-service-args '{"api_key": "your-api-key"}'` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#translate-service-args) | | `--translation-cache` | Enable or disable translation cache | `pdf2zh_next example.pdf --translation-cache false` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#translation-cache) | | `--cache-dir` | Specify the cache directory | `pdf2zh_next example.pdf --cache-dir ./cache` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#cache-dir) | | `--concurrency-limit` | Specify the concurrency limit for translation | `pdf2zh_next example.pdf --concurrency-limit 5` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#concurrency-limit) | | `--log-level` | Specify the log level | `pdf2zh_next example.pdf --log-level debug` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#log-level) | | `--log-file` | Specify the log file | `pdf2zh_next example.pdf --log-file ./log.txt` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#log-file) | | `--config-file` | Specify the config file | `pdf2zh_next example.pdf --config-file ./config.yaml` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#config-file) | | `--help` | Show help | `pdf2zh_next --help` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#help) | | `--version` | Show version | `pdf2zh_next --version` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#version) | --- ### OUTPUT | `--pages` | Частичный перевод документа | `pdf2zh_next example.pdf --pages 1,2,1-,-3,3-5` | [Использование **Командной строки**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#pages) | | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------- | | `--ocr-version` | Указание OCR-движка | `pdf2zh_next example.pdf --ocr-version rapid` | [Использование **Командной строки**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#ocr-version) | | `--ocr-engine-args` | Передача дополнительных аргументов в OCR-движок | `pdf2zh_next example.pdf --ocr-engine-args '{"tessedit_pageseg_mode": "6"}'` | [Использование **Командной строки**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#ocr-engine-args) | | `--output-format` | Указание формата вывода | `pdf2zh_next example.pdf --output-format pdf` | [Использование **Командной строки**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#output-format) | | `--output-filename` | Указание имени выходного файла | `pdf2zh_next example.pdf --output-filename example_zh.pdf` | [Использование **Командной строки**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#output-filename) | | `--output-directory` | Указание выходной директории | `pdf2zh_next example.pdf --output-directory ./output` | [Использование **Командной строки**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#output-directory) | | `--target-language` | Указание целевого языка | `pdf2zh_next example.pdf --target-language ru` | [Использование **Командной строки**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#target-language) | | `--translate-service` | Указание службы перевода | `pdf2zh_next example.pdf --translate-service google` | [Использование **Командной строки**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#translate-service) | | `--translate-service-args` | Передача дополнительных аргументов в службу перевода | `pdf2zh_next example.pdf --translate-service-args '{"api_key": "your-api-key"}'` | [Использование **Командной строки**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#translate-service-args) | | `--translation-cache` | Включение или отключение кэша переводов | `pdf2zh_next example.pdf --translation-cache false` | [Использование **Командной строки**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#translation-cache) | | `--cache-dir` | Указание директории кэша | `pdf2zh_next example.pdf --cache-dir ./cache` | [Использование **Командной строки**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#cache-dir) | | `--concurrency-limit` | Указание ограничения параллелизма для переводов | `pdf2zh_next example.pdf --concurrency-limit 5` | [Использование **Командной строки**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#concurrency-limit) | | `--log-level` | Указание уровня логирования | `pdf2zh_next example.pdf --log-level debug` | [Использование **Командной строки**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#log-level) | | `--log-file` | Указание файла лога | `pdf2zh_next example.pdf --log-file ./log.txt` | [Использование **Командной строки**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#log-file) | | `--config-file` | Указание конфигурационного файла | `pdf2zh_next example.pdf --config-file ./config.yaml` | [Использование **Командной строки**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#config-file) | | `--help` | Показать справку | `pdf2zh_next --help` | [Использование **Командной строки**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#help) | | `--version` | Показать версию | `pdf2zh_next --version` | [Использование **Командной строки**](https://pdf2zh-next.com/getting-started/USAGE_cli.html#version) |
