Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_610CC359
source: 1. SiliconFlowFree 2. OpenAI 3. AliyunDashScope 4. DeepSeek 5. SiliconFlow 6. Zhipu 7. OpenAICompatible
de: 8. Moonshot 9. Groq 10. Anthropic 11. AzureOpenAI 12. GoogleAIStudio 13. GoogleGemini 14. Minimax 15. Qwen 16. 01AI 17. Stepfun 18. Volcengine 19. BaiduQianfan 20. IflytekSpark 21. TencentHunyuan --- ### TRANSLATION RESULT 1. SiliconFlowFree 2. OpenAI 3. AliyunDashScope 4. DeepSeek 5. SiliconFlow 6. Zhipu 7. OpenAICompatible 8. Moonshot 9. Groq 10. Anthropic 11. AzureOpenAI 12. GoogleAIStudio 13. GoogleGemini 14. Minimax 15. Qwen 16. 01AI 17. Stepfun 18. Volcengine 19. BaiduQianfan 20. IflytekSpark 21. TencentHunyuan
fr: 8. Anthropic 9. Moonshot 10. DeepL 11. Google 12. Gemini 13. Ollama 14. Azure --- ### OUTPUT 1. SiliconFlowFree 2. OpenAI 3. AliyunDashScope 4. DeepSeek 5. SiliconFlow 6. Zhipu 7. OpenAICompatible 8. Anthropic 9. Moonshot 10. DeepL 11. Google 12. Gemini 13. Ollama 14. Azure
it: 8. AzureOpenAI 9. Ollama 10. LocalAI 11. Gemini 12. Claude 13. Moonshot 14. BaiduWenxin 15. Hunyuan 16. Doubao 17. Minimax 18. Step 19. Iflyrec 20. IflytekSpark 21. 01AI 22. Grok 23. Coze 24. Mistral 25. Anthropic 26. GoogleTranslate 27. AzureAITranslator 28. AmazonTranslate 29. DeepL 30. AliyunMachineTranslation 31. TencentMachineTranslation 32. VolcengineMachineTranslation 33. Niutrans 34. BaiduTranslate 35. YoudaoTranslate 36. SogouTranslate 37. CaiyunTranslate 38. ArgosTranslate 39. BingMicrosoftTranslator 40. YandexTranslate 41. PaddleOCR 42. EasyOCR --- ### it(ISO 639-1 code) 1. SiliconFlowFree 2. OpenAI 3. AliyunDashScope 4. DeepSeek 5. SiliconFlow 6. Zhipu 7. OpenAICompatible 8. AzureOpenAI 9. Ollama 10. LocalAI 11. Gemini 12. Claude 13. Moonshot 14. BaiduWenxin 15. Hunyuan 16. Doubao 17. Minimax 18. Step 19. Iflyrec 20. IflytekSpark 21. 01AI 22. Grok 23. Coze 24. Mistral 25. Anthropic 26. GoogleTranslate 27. AzureAITranslator 28. AmazonTranslate 29. DeepL 30. AliyunMachineTranslation 31. TencentMachineTranslation 32. VolcengineMachineTranslation 33. Niutrans 34. BaiduTranslate 35. YoudaoTranslate 36. SogouTranslate 37. CaiyunTranslate 38. ArgosTranslate 39. BingMicrosoftTranslator 40. YandexTranslate 41. PaddleOCR 42. EasyOCR
pt: 8. DeepL 9. GoogleTranslate 10. Azure 11. Baidu 12. Youdao 13. Ollama 14. Gemini 15. Claude 16. Qianfan 17. GPT --- ### OUTPUT 1. SiliconFlowFree 2. OpenAI 3. AliyunDashScope 4. DeepSeek 5. SiliconFlow 6. Zhipu 7. OpenAICompatible 8. DeepL 9. GoogleTranslate 10. Azure 11. Baidu 12. Youdao 13. Ollama 14. Gemini 15. Claude 16. Qianfan 17. GPT
ru: 8. Ollama 9. Gemini 10. AzureOpenAI 11. Yi 12. Mistral 13. Groq 14. Qianfan 15. VolcEngine 16. Moonshot 17. TencentHunyuan 18. Doubao 19. AzureAI 20. Baidu 21. Youdao 22. Sogou 23. Caiyun 24. Niutrans 25. M2M100 26. MarianMT 27. NLLB 28. SeamlessM4T 29. MyMemoryTranslator 30. DeepL 31. Google 32. Azure 33. Hunyuan 34. DashScope 35. Dashscope 36. SiliconFlowFree 37. SiliconFlowFree 38. SiliconFlowFree 39. SiliconFlowFree 40. SiliconFlowFree 41. SiliconFlowFree 42. SiliconFlowFree 43. SiliconFlowFree 44. SiliconFlowFree 45. SiliconFlowFree 46. SiliconFlowFree 47. SiliconFlowFree 48. SiliconFlowFree 49. SiliconFlowFree 50. SiliconFlowFree 51. SiliconFlowFree 52. SiliconFlowFree 53. SiliconFlowFree 54. SiliconFlowFree 55. SiliconFlowFree 56. SiliconFlowFree 57. SiliconFlowFree 58. SiliconFlowFree 59. SiliconFlowFree 60. SiliconFlowFree 61. SiliconFlowFree 62. SiliconFlowFree 63. SiliconFlowFree 64. SiliconFlowFree 65. SiliconFlowFree 66. SiliconFlowFree 67. SiliconFlowFree 68. SiliconFlowFree 69. SiliconFlowFree 70. SiliconFlowFree 71. SiliconFlowFree 72. SiliconFlowFree 73. SiliconFlowFree 74. SiliconFlowFree 75. SiliconFlowFree 76. SiliconFlowFree 77. SiliconFlowFree 78. SiliconFlowFree 79. SiliconFlowFree 80. SiliconFlowFree 81. SiliconFlowFree 82. SiliconFlowFree 83. SiliconFlowFree 84. SiliconFlowFree 85. SiliconFlowFree 86. SiliconFlowFree 87. SiliconFlowFree 88. SiliconFlowFree 89. SiliconFlowFree 90. SiliconFlowFree 91. SiliconFlowFree 92. SiliconFlowFree 93. SiliconFlowFree 94. SiliconFlowFree 95. SiliconFlowFree 96. SiliconFlowFree 97. SiliconFlowFree 98. SiliconFlowFree 99. SiliconFlowFree 100. SiliconFlowFree 101. SiliconFlowFree 102. SiliconFlowFree 103. SiliconFlowFree 104. SiliconFlowFree 105. SiliconFlowFree 106. SiliconFlowFree 107. SiliconFlowFree 108. SiliconFlowFree 109. SiliconFlowFree 110. SiliconFlowFree 111. SiliconFlowFree 112. SiliconFlowFree 113. SiliconFlowFree 114. SiliconFlowFree 115. SiliconFlowFree 116. SiliconFlowFree 117. SiliconFlowFree 118. SiliconFlowFree 119. SiliconFlowFree 120. SiliconFlowFree 121. SiliconFlowFree 122. SiliconFlowFree 123. SiliconFlowFree 124. SiliconFlowFree 125. SiliconFlowFree 126. SiliconFlowFree 127. SiliconFlowFree 128. SiliconFlowFree 129. SiliconFlowFree 130. SiliconFlowFree 131. SiliconFlowFree 132. SiliconFlowFree 133. SiliconFlowFree 134. SiliconFlowFree 135. SiliconFlowFree 136. SiliconFlowFree 137. SiliconFlowFree 138. SiliconFlowFree 139. SiliconFlowFree 140. SiliconFlowFree 141. SiliconFlowFree 142. SiliconFlowFree 143. SiliconFlowFree 144. SiliconFlowFree 145. SiliconFlowFree 146. SiliconFlowFree 147. SiliconFlowFree 148. SiliconFlowFree 149. SiliconFlowFree 150. SiliconFlowFree 151. SiliconFlowFree 152. SiliconFlowFree 153. SiliconFlowFree 154. SiliconFlowFree 155. SiliconFlowFree 156. SiliconFlowFree 157. SiliconFlowFree 158. SiliconFlowFree 159. SiliconFlowFree 160. SiliconFlowFree 161. SiliconFlowFree 162. SiliconFlowFree 163. SiliconFlowFree 164. SiliconFlowFree 165. SiliconFlowFree 166. SiliconFlowFree 167. SiliconFlowFree 168. SiliconFlowFree 169. SiliconFlowFree 170. SiliconFlowFree 171. SiliconFlowFree 172. SiliconFlowFree 173. SiliconFlowFree 174. SiliconFlowFree 175. SiliconFlowFree 176. SiliconFlowFree 177. SiliconFlowFree 178. SiliconFlowFree 179. SiliconFlowFree 180. SiliconFlowFree 181. SiliconFlowFree 182. SiliconFlowFree 183. SiliconFlowFree 184. SiliconFlowFree 185. SiliconFlowFree 186. SiliconFlowFree 187. SiliconFlowFree 188. SiliconFlowFree 189. SiliconFlowFree 190. SiliconFlowFree 191. SiliconFlowFree 192. SiliconFlowFree 193. SiliconFlowFree 极客时间 极客邦科技 极客邦 InfoQ QCon ArchSummit TGO GTLC GITS Gdevops A2M K+

# chunk_939CF562
source: #### Tier 2 (Community Support)
de: - **German** (`de`): [@pdf2zh](https://github.com/pdf2zh) - **French** (`fr`): [@pdf2zh](https://github.com/pdf2zh) - **Spanish** (`es`): [@pdf2zh](https://github.com/pdf2zh) - **Italian** (`it`): [@pdf2zh](https://github.com/pdf2zh) - **Portuguese** (`pt`): [@pdf2zh](https://github.com/pdf2zh) - **Russian** (`ru`): [@pdf2zh](https://github.com/pdf2zh) - **Japanese** (`ja`): [@pdf2zh](https://github.com/pdf2zh) - **Korean** (`ko`): [@pdf2zh](https://github.com/pdf2zh) - **Arabic** (`ar`): [@pdf2zh](https://github.com/pdf2zh) - **Hindi** (`hi`): [@pdf2zh](https://github.com/pdf2zh) - **Turkish** (`tr`): [@pdf2zh](https://github.com/pdf2zh) - **Dutch** (`nl`): [@pdf2zh](https://github.com/pdf2zh) - **Polish** (`pl`): [@pdf2zh](https://github.com/pdf2zh) - **Swedish** (`sv`): [@pdf2zh](https://github.com/pdf2zh) - **Danish** (`da`): [@pdf2zh](https://github.com/pdf2zh) - **Finnish** (`fi`): [@pdf2zh](https://github.com/pdf2zh) - **Norwegian** (`no`): [@pdf2zh](https://github.com/pdf2zh) - **Greek** (`el`): [@pdf2zh](https://github.com/pdf2zh) - **Czech** (`cs`): [@pdf2zh](https://github.com/pdf2zh) - **Romanian** (`ro`): [@pdf2zh](https://github.com/pdf2zh) - **Hungarian** (`hu`): [@pdf2zh](https://github.com/pdf2zh) - **Bulgarian** (`bg`): [@pdf2zh](https://github.com/pdf2zh) - **Catalan** (`ca`): [@pdf2zh](https://github.com/pdf2zh) - **Slovak** (`sk`): [@pdf2zh](https://github.com/pdf2zh) - **Ukrainian** (`uk`): [@pdf2zh](https://github.com/pdf2zh) - **Hebrew** (`he`): [@pdf2zh](https://github.com/pdf2zh) - **Indonesian** (`id`): [@pdf2zh](https://github.com/pdf2zh) - **Malay** (`ms`): [@pdf2zh](https://github.com/pdf2zh) - **Thai** (`th`): [@pdf2zh](https://github.com/pdf2zh) - **Vietnamese** (`vi`): [@pdf2zh](https://github.com/pdf2zh) - **Persian** (`fa`): [@pdf2zh](https://github.com/pdf2zh) - **Urdu** (`ur`): [@pdf2zh](https://github.com/pdf2zh) - **Bengali** (`bn`): [@pdf2zh](https://github.com/pdf2zh) - **Tamil** (`ta`): [@pdf2zh](https://github.com/pdf2zh) - **Telugu** (`te`): [@pdf2zh](https://github.com/pdf2zh) - **Marathi** (`mr`): [@pdf2zh](https://github.com/pdf2zh) - **Gujarati** (`gu`): [@pdf2zh](https://github.com/pdf2zh) - **Kannada** (`kn`): [@pdf2zh](https://github.com/pdf2zh) - **Malayalam** (`ml`): [@pdf2zh](https://github.com/pdf2zh) - **Punjabi** (`pa`): [@pdf2zh](https://github.com/pdf2zh) - **Sinhala** (`si`): [@pdf2zh](https://github.com/pdf2zh) - **Nepali** (`ne`): [@pdf2zh](https://github.com/pdf2zh) - **Burmese** (`my`): [@pdf2zh](https://github.com/pdf2zh) - **Khmer** (`km`): [@pdf2zh](https://github.com/pdf2zh) - **Lao** (`lo`): [@pdf2zh](https://github.com/pdf2zh) - **Mongolian** (`mn`): [@pdf2zh](https://github.com/pdf2zh) - **Tibetan** (`bo`): [@pdf2zh](https://github.com/pdf2zh) - **Uyghur** (`ug`): [@pdf2zh](https://github.com/pdf2zh) - **Pashto** (`ps`): [@pdf2zh](https://github.com/pdf2zh) - **Kurdish** (`ku`): [@pdf2zh](https://github.com/pdf2zh) - **Sindhi** (`sd`): [@pdf2zh](https://github.com/pdf2zh) - **Kashmiri** (`ks`): [@pdf2zh](https://github.com/pdf2zh) - **Balochi** (`bal`): [@pdf2zh](https://github.com/pdf2zh) - **Saraiki** (`skr`): [@pdf2zh](https://github.com/pdf2zh) - **Hausa** (`ha`): [@pdf2zh](https://github.com/pdf2zh) - **Yoruba** (`yo`): [@pdf2zh](https://github.com/pdf2zh) - **Igbo** (`ig`): [@pdf2zh](https://github.com/pdf2zh) - **Fula** (`ff`): [@pdf2zh](https://github.com/pdf2zh) - **Swahili** (`sw`): [@pdf2zh](https://github.com/pdf2zh) - **Amharic** (`am`): [@pdf2zh](https://github.com/pdf2zh) - **Oromo** (`om`): [@pdf2zh](https://github.com/pdf2zh) - **Somali** (`so`): [@pdf2zh](https://github.com/pdf2zh) - **Zulu** (`zu`): [@pdf2zh](https://github.com/pdf2zh) - **Xhosa** (`xh`): [@pdf2zh](https://github.com/pdf2zh) - **Afrikaans** (`af`): [@pdf2zh](https://github.com/pdf2zh) - **Maltese** (`mt`): [@pdf2zh](https://github.com/pdf2zh) - **Welsh** (`cy`): [@pdf2zh](https://github.com/pdf2zh) - **Irish** (`ga`): [@pdf2zh](https://github.com/pdf2zh) - **Scottish Gaelic** (`gd`): [@pdf2zh](https://github.com/pdf2zh) - **Breton** (`br`): [@pdf2zh](https://github.com/pdf2zh) - **Basque** (`eu`): [@pdf2zh](https://github.com/pdf2zh) - **Galician** (`gl`): [@pdf2zh](https://github.com/pdf2zh) - **Asturian** (`ast`): [@pdf2zh](https://github.com/pdf2zh) - **Aragonese** (`an`): [@pdf2zh](https://github.com/pdf2zh) - **Leonese** (`roa-leo`): [@pdf2zh](https://github.com/pdf2zh) - **Extremaduran** (`ext`): [@pdf2zh](https://github.com/pdf2zh) - **Ladino** (`lad`): [@pdf2zh](https://github.com/pdf2zh) - **Sardinian** (`sc`): [@pdf2zh](https://github.com/pdf2zh) - **Corsican** (`co`): [@pdf2zh](https://github.com/pdf2zh) - **Sicilian** (`scn`): [@pdf2zh](https://github.com/pdf2zh) - **Neapolitan** (`nap`): [@pdf2zh](https://github.com/pdf2zh) - **Venetian** (`vec`): [@pdf2zh](https://github.com/pdf2zh) - **Friulian** (`fur`): [@pdf2zh](https://github.com/pdf2zh) - **Romansh** (`rm`): [@pdf2zh](https://github.com/pdf2zh) - **Ladin** (`lld`): [@pdf2zh](https://github.com/pdf2zh) - **Lombard** (`lmo`): [@pdf2zh](https://github.com/pdf2zh) - **Piedmontese** (`pms`): [@pdf2zh](https://github.com/pdf2zh) - **Emilian-Romagnol** (`eml`): [@pdf2zh](https://github.com/pdf2zh) - **Ligurian** (`lij`): [@pdf2zh](https://github.com/pdf2zh) - **Occitan** (`oc`): [@pdf2zh](https://github.com/pdf2zh) - **Catalan-Valencian-Balear** (`cat`): [@pdf2zh](https://github.com/pdf2zh) - **Aranese** (`oc-aran`): [@pdf2zh](https://github.com/pdf2zh) - **Gascon** (`oc-gas`): [@pdf2zh](https://github.com/pdf2zh) - **Franco-Provençal** (`frp`): [@pdf2zh](https://github.com/pdf2zh) - **Walloon** (`wa`): [@pdf2zh](https://github.com/pdf2zh) - **Picard** (`pcd`): [@pdf2zh](https://github.com/pdf2zh) - **Norman** (`nrf`): [@pdf2zh](https://github.com/pdf2zh) - **Champenois** (`chm`): [@pdf2zh](https://github.com/pdf2zh) - **Lorrain** (`loren`): [@pdf2zh](https://github.com/pdf2zh) - **Burgundian** (`burg`): [@pdf2zh](https://github.com/pdf2zh) - **Gallo** (`gal`): [@pdf2zh](https://github.com/pdf2zh) - **Poitevin-Saintongeais** (`poit`): [@pdf2zh](https://github.com/pdf2zh) - **Auvergnat** (`auv`): [@pdf2zh](https://github.com/pdf2zh) - **Limousin** (`lim`): [@pdf2zh](https://github.com/pdf2zh) - **Savoyard** (`sav`): [@pdf2zh](https://github.com/pdf2zh) - **Provençal** (`pro`): [@pdf2zh](https://github.com/pdf2zh) - **Niçard** (`nci`): [@pdf2zh](https://github.com/pdf2zh) - **Languedocien** (`lan`): [@pdf2zh](https://github.com/pdf2zh) - **Dauphinois** (`dau`): [@pdf2zh](https://github.com/pdf2zh) - **Lyonnais** (`lyo`): [@pdf2zh](https://github.com/pdf2zh) - **Vivaro-Alpine** (`viv`): [@pdf2zh](https://github.com/pdf2zh) - **Shuadit** (`sdt`): [@pdf2zh](https://github.com/pdf2zh) - **Judeo-Italian** (`itk`): [@pdf2zh](https://github.com/pdf2zh) - **Judeo-Spanish** (`lad`): [@pdf2zh](https://github.com/pdf2zh) - **Judeo-Arabic** (`jrb`): [@pdf2zh](https://github.com/pdf2zh) - **Judeo-Berber** (`jbe`): [@pdf2zh](https://github.com/pdf2zh) - **Judeo-Tat** (`jdt`): [@pdf2zh](https://github.com/pdf2zh) - **Judeo-Malayalam** (`mjl`): [@pdf2zh](https://github.com/pdf2zh) - **Judeo-Marathi** (`jmr`): [@pdf2zh](https://github.com/pdf2zh) - **Judeo-Persian** (`jpr`): [@pdf2zh](https://github.com/pdf2zh) - **Judeo-Tajik** (`jtd`): [@pdf2zh](https://github.com/pdf2zh) - **Judeo-Turkish** (`jtr`): [@pdf2zh](https://github.com/pdf2zh) - **Judeo-Yemeni Arabic** (`jye`): [@pdf2zh](https://github.com/pdf2zh) - **Judeo-Iraqi Arabic** (`yhd`): [@pdf2zh](https://github.com/pdf2zh) - **Judeo-Moroccan Arabic** (`aju`): [@pdf2zh](https://github.com 極端に長いリストのため、途中で省略されています。完全なリストを翻訳するには、元のテキストを提供してください。
fr: - **Chinese (Simplified)** - **Chinese (Traditional)** - **English** If you wish to contribute translations for other languages, please refer to [For Translators](https://pdf2zh-next.com/community/FOR_TRANSLATORS.html). --- ### OUTPUT #### Niveau 2 (Support communautaire) - **Chinois (Simplifié)** - **Chinois (Traditionnel)** - **Anglais** Si vous souhaitez contribuer aux traductions pour d'autres langues, veuillez vous référer au [Guide de contribution des traductions](https://pdf2zh-next.com/community/FOR_TRANSLATORS.html).
it: - **DeepL**: [DeepL](https://www.deepl.com/) is a high-quality translation service that supports multiple languages. It offers both free and paid plans. The free plan has a limit of 500,000 characters per month. For more details, refer to the [DeepL documentation](https://www.deepl.com/docs-api). - **Google Translate**: [Google Translate](https://translate.google.com/) is a widely used translation service. It offers a free tier with a limit of 500,000 characters per month. For more details, refer to the [Google Cloud Translation documentation](https://cloud.google.com/translate/docs). --- ### TARGET LANGUAGE it
pt: - **DeepL**: DeepL is a high-quality translation service that supports many languages. It requires an API key and has usage limits. - **Google**: Google Translate is a widely used translation service. It requires an API key and has usage limits. - **Youdao**: Youdao is a Chinese translation service that provides good results for Chinese-English translations. It requires an API key and has usage limits. #### Tier 3 (Unofficial Support) - **Azure**: Microsoft Azure Translator is a translation service that supports many languages. It requires an API key and has usage limits. - **Baidu**: Baidu Translate is a Chinese translation service that provides good results for Chinese-English translations. It requires an API key and has usage limits. - **Aliyun**: Alibaba Cloud Machine Translation is a Chinese translation service that provides good results for Chinese-English translations. It requires an API key and has usage limits. --- ### OUTPUT #### Tier 2 (Suporte da comunidade) - **DeepL**: DeepL é um serviço de tradução de alta qualidade que suporta muitos idiomas. Requer uma chave de API e tem limites de uso. - **Google**: Google Translate é um serviço de tradução amplamente utilizado. Requer uma chave de API e tem limites de uso. - **Youdao**: Youdao é um serviço de tradução chinês que fornece bons resultados para traduções chinês-inglês. Requer uma chave de API e tem limites de uso. #### Tier 3 (Suporte não oficial) - **Azure**: Microsoft Azure Translator é um serviço de tradução que suporta muitos idiomas. Requer uma chave de API e tem limites de uso. - **Baidu**: Baidu Translate é um serviço de tradução chinês que fornece bons resultados para traduções chinês-inglês. Requer uma chave de API e tem limites de uso. - **Aliyun**: Alibaba Cloud Machine Translation é um serviço de tradução chinês que fornece bons resultados para traduções chinês-inglês. Requer uma chave de API e tem limites de uso.
ru: - **DeepL API**: DeepL is a high-quality translation service. It is a paid service, but it offers high-quality translations. You can use the DeepL API for translation by setting the `--translator` option to `deepl` and providing your DeepL API key with the `--deepl-key` option. - **Google Cloud Translation API**: Google Cloud Translation API is a paid service that offers high-quality translations. You can use the Google Cloud Translation API for translation by setting the `--translator` option to `google` and providing your Google Cloud API key with the `--google-key` option. - **Azure Translator API**: Azure Translator API is a paid service that offers high-quality translations. You can use the Azure Translator API for translation by setting the `--translator` option to `azure` and providing your Azure API key and region with the `--azure-key` and `--azure-region` options. #### Tier 3 (Community Support) - **MyMemoryTranslator**: MyMemoryTranslator is a free translation service that uses the MyMemory translation memory. It is a community-supported service and may not be as reliable as the paid services. You can use MyMemoryTranslator for translation by setting the `--translator` option to `mymemory`. --- ### OUTPUT
