Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_89A6F55A
source: > [!TIP] > > You do not need to wait until your development is fully complete to create a PR. Creating one early allows us to review your implementation and provide suggestions. > > If you have any questions about the source code or related matters, please contact the maintainer at aw@funstory.ai. > > Resource files for version 2.0 are shared with [BabelDOC](https://github.com/funstory-ai/BabelDOC). The code for downloading related resources is in BabelDOC. If you want to add new resource files, please contact the BabelDOC maintainer at aw@funstory.ai.
de: > [!TIP] > > Sie müssen nicht warten, bis Ihre Entwicklung vollständig abgeschlossen ist, um einen PR zu erstellen. Eine frühzeitige Erstellung ermöglicht es uns, Ihre Implementierung zu überprüfen und Vorschläge zu machen. > > Wenn Sie Fragen zum Quellcode oder verwandten Themen haben, wenden Sie sich bitte an den Maintainer unter aw@funstory.ai. > > Ressourcendateien für Version 2.0 werden mit [BabelDOC](https://github.com/funstory-ai/BabelDOC) geteilt. Der Code zum Herunterladen der relevanten Ressourcen befindet sich in BabelDOC. Wenn Sie neue Ressourcendateien hinzufügen möchten, wenden Sie sich bitte an den BabelDOC-Maintainer unter aw@funstory.ai.
fr: > [!TIP] > > Vous n'avez pas besoin d'attendre que votre développement soit entièrement terminé pour créer une PR. En créer une tôt nous permet d'examiner votre implémentation et de fournir des suggestions. > > Si vous avez des questions sur le code source ou des sujets connexes, veuillez contacter le mainteneur à aw@funstory.ai. > > Les fichiers de ressources pour la version 2.0 sont partagés avec [BabelDOC](https://github.com/funstory-ai/BabelDOC). Le code pour télécharger les ressources associées se trouve dans BabelDOC. Si vous souhaitez ajouter de nouveaux fichiers de ressources, veuillez contacter le mainteneur de BabelDOC à aw@funstory.ai.
it: > [!TIP] > > Non è necessario attendere che lo sviluppo sia completamente terminato per creare una PR. Crearne una in anticipo ci permette di esaminare la tua implementazione e fornire suggerimenti. > > Se hai domande sul codice sorgente o su questioni correlate, contatta il maintainer all'indirizzo aw@funstory.ai. > > I file delle risorse per la versione 2.0 sono condivisi con [BabelDOC](https://github.com/funstory-ai/BabelDOC). Il codice per scaricare le risorse correlate si trova in BabelDOC. Se desideri aggiungere nuovi file di risorse, contatta il maintainer di BabelDOC all'indirizzo aw@funstory.ai.
pt: > [!TIP] > > Você não precisa esperar até que seu desenvolvimento esteja totalmente completo para criar um PR. Criar um PR antecipadamente nos permite revisar sua implementação e fornecer sugestões. > > Se você tiver alguma dúvida sobre o código-fonte ou assuntos relacionados, entre em contato com o mantenedor em aw@funstory.ai. > > Os arquivos de recursos para a versão 2.0 são compartilhados com [BabelDOC](https://github.com/funstory-ai/BabelDOC). O código para baixar os recursos relacionados está no BabelDOC. Se você deseja adicionar novos arquivos de recursos, entre em contato com o mantenedor do BabelDOC em aw@funstory.ai.
ru: > [!TIP] > > Вам не нужно ждать, пока разработка будет полностью завершена, чтобы создать PR. Создание PR на раннем этапе позволяет нам проверить вашу реализацию и дать рекомендации. > > Если у вас есть вопросы по исходному коду или связанным вопросам, пожалуйста, свяжитесь с сопровождающим по адресу aw@funstory.ai. > > Файлы ресурсов для версии 2.0 доступны в [BabelDOC](https://github.com/funstory-ai/BabelDOC). Код для загрузки связанных ресурсов находится в BabelDOC. Если вы хотите добавить новые файлы ресурсов, пожалуйста, свяжитесь с сопровождающим BabelDOC по адресу aw@funstory.ai.

# chunk_E7638696
source: ## Basic Requirements
de: ## Grundlegende Anforderungen
fr: ## Exigences de base
it: ## Requisiti di base
pt: ## Requisitos básicos
ru: ## Основные требования

# chunk_4D251FB3
source: <h4 id="sop">1. Workflow</h4>
de: <h4 id="sop">1. Arbeitsablauf</h4>
fr: <h4 id="sop">1. Flux de travail</h4>
it: <h4 id="sop">1. Flusso di lavoro</h4>
pt: <h4 id="sop">1. Fluxo de trabalho</h4>
ru: <h4 id="sop">1. Рабочий процесс</h4>

# chunk_8FDDA473
source: - Please fork from the `main` branch and develop on your forked branch. - When submitting a Pull Request (PR), provide a detailed description of your changes. - If your PR does not pass automated checks (indicated by `checks failed` and a red cross), please review the corresponding `details` and modify your submission to ensure the new PR passes all checks.
de: - Bitte forken Sie vom `main`-Branch und entwickeln Sie auf Ihrem geforkten Branch. - Geben Sie beim Einreichen eines Pull Requests (PR) eine detaillierte Beschreibung Ihrer Änderungen an. - Wenn Ihr PR die automatisierten Prüfungen nicht besteht (angezeigt durch `checks failed` und ein rotes Kreuz), überprüfen Sie bitte die entsprechenden `details` und passen Sie Ihre Einreichung an, um sicherzustellen, dass der neue PR alle Prüfungen besteht.
fr: - Veuillez forker à partir de la branche `main` et développer sur votre branche forké. - Lors de la soumission d'une Pull Request (PR), fournissez une description détaillée de vos modifications. - Si votre PR ne passe pas les vérifications automatisées (indiquées par `checks failed` et une croix rouge), veuillez consulter les `details` correspondants et modifier votre soumission pour vous assurer que la nouvelle PR passe toutes les vérifications.
it: - Si prega di effettuare il fork dal branch `main` e sviluppare sul proprio branch forkato. - Quando si invia una Pull Request (PR), fornire una descrizione dettagliata delle modifiche apportate. - Se la PR non supera i controlli automatizzati (indicati da `checks failed` e una croce rossa), si prega di rivedere i corrispondenti `details` e modificare l'invio per garantire che la nuova PR superi tutti i controlli.
pt: - Por favor, faça um fork a partir do branch `main` e desenvolva no seu branch bifurcado. - Ao enviar um Pull Request (PR), forneça uma descrição detalhada das suas alterações. - Se o seu PR não passar nas verificações automatizadas (indicado por `checks failed` e um cruz vermelho), revise os `details` correspondentes e modifique sua submissão para garantir que o novo PR passe em todas as verificações.
ru: - Пожалуйста, создайте форк из ветки `main` и разрабатывайте на своей форкнутой ветке. - При отправке Pull Request (PR) предоставьте подробное описание ваших изменений. - Если ваш PR не проходит автоматические проверки (обозначается как `checks failed` с красным крестиком), пожалуйста, просмотрите соответствующие `details` и внесите изменения в свою заявку, чтобы новый PR прошел все проверки.

# chunk_19D447DF
source: <h4 id="dev&test">2. Development and Testing</h4>
de: <h4 id="dev&test">2. Entwicklung und Test</h4>
fr: <h4 id="dev&test">2. Développement et tests</h4>
it: <h4 id="dev&test">2. Sviluppo e Test</h4>
pt: <h4 id="dev&test">2. Desenvolvimento e Teste</h4>
ru: <h4 id="dev&test">2. Разработка и тестирование</h4>

# chunk_65AB8932
source: - Use the command `pip install -e .` for development and testing.
de: - Verwenden Sie den Befehl `pip install -e .` für Entwicklung und Tests.
fr: - Utilisez la commande `pip install -e .` pour le développement et les tests.
it: - Utilizzare il comando `pip install -e .` per sviluppo e test.
pt: - Use o comando `pip install -e .` para desenvolvimento e teste.
ru: - Для разработки и тестирования используйте команду `pip install -e .`.

# chunk_B4865580
source: <h4 id="format">3. Code Formatting</h4>
de: <h4 id="format">3. Code-Formatierung</h4>
fr: <h4 id="format">3. Formatage du code</h4>
it: <h4 id="formato">3. Formattazione del Codice</h4>
pt: <h4 id="format">3. Formatação de Código</h4>
ru: <h4 id="format">3. Форматирование кода</h4>

# chunk_E8324FFA
source: - Configure the `pre-commit` tool and enable `black` and `flake8` for code formatting.
de: - Konfigurieren Sie das `pre-commit`-Tool und aktivieren Sie `black` und `flake8` für die Codeformatierung.
fr: - Configurez l'outil `pre-commit` et activez `black` et `flake8` pour le formatage du code.
it: - Configura lo strumento `pre-commit` e abilita `black` e `flake8` per la formattazione del codice.
pt: - Configure a ferramenta `pre-commit` e ative `black` e `flake8` para formatação de código.
ru: - Настройте инструмент `pre-commit` и включите `black` и `flake8` для форматирования кода.

# chunk_7A584B10
source: <h4 id="requpdate">4. Dependency Updates</h4>
de: <h4 id="requpdate">4. Abhängigkeitsaktualisierungen</h4>
fr: <h4 id="requpdate">4. Mises à jour des dépendances</h4>
it: <h4 id="requpdate">4. Aggiornamenti delle dipendenze</h4>
pt: <h4 id="requpdate">4. Atualizações de Dependências</h4>
ru: <h4 id="requpdate">4. Обновление зависимостей</h4>

# chunk_BE2E8298
source: - If you introduce new dependencies, please update the dependency list in the `pyproject.toml` file in a timely manner.
de: - Wenn Sie neue Abhängigkeiten einführen, aktualisieren Sie bitte die Abhängigkeitsliste in der `pyproject.toml`-Datei zeitnah.
fr: - Si vous introduisez de nouvelles dépendances, veuillez mettre à jour la liste des dépendances dans le fichier `pyproject.toml` en temps opportun.
it: - Se introduci nuove dipendenze, aggiorna tempestivamente l'elenco delle dipendenze nel file `pyproject.toml`.
pt: - Se você introduzir novas dependências, atualize a lista de dependências no arquivo `pyproject.toml` em tempo hábil.
ru: - Если вы добавляете новые зависимости, пожалуйста, своевременно обновляйте список зависимостей в файле `pyproject.toml`.

# chunk_1615D8D8
source: <h4 id="docupdate">5. Documentation Updates</h4>
de: <h4 id="docupdate">5. Dokumentationsaktualisierungen</h4>
fr: <h4 id="docupdate">5. Mises à jour de la documentation</h4>
it: <h4 id="docupdate">5. Aggiornamenti della documentazione</h4>
pt: <h4 id="docupdate">5. Atualizações da Documentação</h4>
ru: <h4 id="docupdate">5. Обновления документации</h4>

# chunk_725E4B8A
source: - If you add new command-line options, please update the list of command-line options in all language versions of the `README.md` file accordingly.
de: - Wenn Sie neue Kommandozeilenoptionen hinzufügen, aktualisieren Sie bitte die Liste der Kommandozeilenoptionen in allen Sprachversionen der `README.md`-Datei entsprechend.
fr: - Si vous ajoutez de nouvelles options de ligne de commande, veuillez mettre à jour la liste des options de ligne de commande dans toutes les versions linguistiques du fichier `README.md` en conséquence.
it: - Se aggiungi nuove opzioni da riga di comando, aggiorna l'elenco delle opzioni da riga di comando in tutte le versioni linguistiche del file `README.md` di conseguenza.
pt: - Se você adicionar novas opções de linha de comando, atualize a lista de opções de linha de comando em todas as versões de idioma do arquivo `README.md` de acordo.
ru: - Если вы добавляете новые параметры командной строки, пожалуйста, обновите список параметров командной строки во всех языковых версиях файла `README.md` соответствующим образом.

# chunk_09178615
source: <h4 id="commitmsg">6. Commit Messages</h4>
de: <h4 id="commitmsg">6. Commit-Nachrichten</h4>
fr: <h4 id="commitmsg">6. Messages de commit</h4>
it: <h4 id="commitmsg">6. Messaggi di Commit</h4>
pt: <h4 id="commitmsg">6. Mensagens de Commit</h4>
ru: <h4 id="commitmsg">6. Сообщения коммитов</h4>

# chunk_8007BC97
source: - Use [Conventional Commits](https://www.conventionalcommits.org/en/v1.0.0/), for example: `feat(translator): add openai`.
de: - Verwenden Sie [Conventional Commits](https://www.conventionalcommits.org/en/v1.0.0/), zum Beispiel: `feat(translator): add openai`.
fr: - Utilisez [Conventional Commits](https://www.conventionalcommits.org/en/v1.0.0/), par exemple : `feat(translator): add openai`.
it: - Utilizzare [Conventional Commits](https://www.conventionalcommits.org/en/v1.0.0/), ad esempio: `feat(translator): add openai`.
pt: - Use [Conventional Commits](https://www.conventionalcommits.org/en/v1.0.0/), por exemplo: `feat(translator): add openai`.
ru: - Используйте [Conventional Commits](https://www.conventionalcommits.org/en/v1.0.0/), например: `feat(translator): add openai`.

# chunk_F5439516
source: <h4 id="codestyle">7. Coding Style</h4>
de: <h4 id="codestyle">7. Codierungsstil</h4>
fr: <h4 id="codestyle">7. Style de codage</h4>
it: <h4 id="codestyle">7. Stile di Codifica</h4>
pt: <h4 id="codestyle">7. Estilo de Codificação</h4>
ru: <h4 id="codestyle">7. Стиль кодирования</h4>

# chunk_22ECCE1D
source: - Ensure your submitted code adheres to basic coding style standards. - Use either snake_case or camelCase for variable naming.
de: - Stellen Sie sicher, dass Ihr eingereichter Code grundlegende Codierungsstilstandards einhält. - Verwenden Sie entweder snake_case oder camelCase für die Benennung von Variablen.
fr: - Assurez-vous que le code soumis respecte les normes de base de style de codage. - Utilisez soit snake_case soit camelCase pour la dénomination des variables.
it: - Assicurati che il codice inviato rispetti gli standard di base dello stile di codifica. - Utilizza snake_case o camelCase per la denominazione delle variabili.
pt: - Certifique-se de que o código enviado adere aos padrões básicos de estilo de codificação. - Use snake_case ou camelCase para nomeação de variáveis.
ru: - Убедитесь, что ваш код соответствует базовым стандартам стиля кодирования. - Используйте либо snake_case, либо camelCase для именования переменных.

# chunk_2F60B8EB
source: <h4 id="doctypo">8. Documentation Formatting</h4>
de: <h4 id="doctypo">8. Dokumentationsformatierung</h4>
fr: <h4 id="doctypo">8. Formatage de la documentation</h4>
it: <h4 id="doctypo">8. Formattazione della Documentazione</h4>
pt: <h4 id="doctypo">8. Formatação de Documentação</h4>
ru: <h4 id="doctypo">8. Форматирование документации</h4>

# chunk_320F91BE
source: - For `README.md` formatting, please follow the [Chinese Copywriting Guidelines](https://github.com/sparanoid/chinese-copywriting-guidelines). - Ensure that both English and Chinese documentation are always up to date; other language documentation updates are optional.
de: - Für die Formatierung von `README.md` folgen Sie bitte den [Chinesischen Copywriting-Richtlinien](https://github.com/sparanoid/chinese-copywriting-guidelines). - Stellen Sie sicher, dass sowohl die englische als auch die chinesische Dokumentation immer auf dem neuesten Stand sind; Aktualisierungen der Dokumentation in anderen Sprachen sind optional.
fr: - Pour le formatage de `README.md`, veuillez suivre les [Chinese Copywriting Guidelines](https://github.com/sparanoid/chinese-copywriting-guidelines). - Assurez-vous que la documentation en anglais et en chinois est toujours à jour ; les mises à jour de la documentation dans d'autres langues sont facultatives.
it: - Per la formattazione di `README.md`, seguire le [Linee guida per la scrittura in cinese](https://github.com/sparanoid/chinese-copywriting-guidelines). - Assicurarsi che la documentazione in inglese e cinese sia sempre aggiornata; gli aggiornamenti della documentazione in altre lingue sono facoltativi.
pt: - Para a formatação de `README.md`, siga as [Diretrizes de Redação em Chinês](https://github.com/sparanoid/chinese-copywriting-guidelines). - Certifique-se de que a documentação em inglês e chinês esteja sempre atualizada; as atualizações de documentação em outros idiomas são opcionais.
ru: - Для форматирования `README.md` следуйте [Chinese Copywriting Guidelines](https://github.com/sparanoid/chinese-copywriting-guidelines). - Убедитесь, что документация на английском и китайском языках всегда актуальна; обновления документации на других языках необязательны.

# chunk_126AF33C
source: ## Adding a Translation Engine
de: ## Hinzufügen einer Übersetzungsmaschine
fr: ## Ajout d'un moteur de traduction
it: ## Aggiunta di un motore di traduzione
pt: ## Adicionando um mecanismo de tradução
ru: ## Добавление движка перевода

# chunk_38A36DFF
source: 1. Add a new translator configuration class in the `pdf2zh/config/translate_engine_model.py` file. 2. Add an instance of the new translator configuration class to the `TRANSLATION_ENGINE_SETTING_TYPE` type alias in the same file. 3. Add the new translator implementation class in the `pdf2zh/translator/translator_impl` folder.
de: 1. Fügen Sie eine neue Übersetzer-Konfigurationsklasse in der Datei `pdf2zh/config/translate_engine_model.py` hinzu. 2. Fügen Sie eine Instanz der neuen Übersetzer-Konfigurationsklasse zum Typalias `TRANSLATION_ENGINE_SETTING_TYPE` in derselben Datei hinzu. 3. Fügen Sie die neue Übersetzer-Implementierungsklasse im Ordner `pdf2zh/translator/translator_impl` hinzu.
fr: 1. Ajoutez une nouvelle classe de configuration de traducteur dans le fichier `pdf2zh/config/translate_engine_model.py`. 2. Ajoutez une instance de la nouvelle classe de configuration de traducteur à l'alias de type `TRANSLATION_ENGINE_SETTING_TYPE` dans le même fichier. 3. Ajoutez la nouvelle classe d'implémentation du traducteur dans le dossier `pdf2zh/translator/translator_impl`.
it: 1. Aggiungi una nuova classe di configurazione del traduttore nel file `pdf2zh/config/translate_engine_model.py`. 2. Aggiungi un'istanza della nuova classe di configurazione del traduttore all'alias di tipo `TRANSLATION_ENGINE_SETTING_TYPE` nello stesso file. 3. Aggiungi la nuova classe di implementazione del traduttore nella cartella `pdf2zh/translator/translator_impl`.
pt: 1. Adicione uma nova classe de configuração de tradutor no arquivo `pdf2zh/config/translate_engine_model.py`. 2. Adicione uma instância da nova classe de configuração de tradutor ao alias de tipo `TRANSLATION_ENGINE_SETTING_TYPE` no mesmo arquivo. 3. Adicione a nova classe de implementação de tradutor na pasta `pdf2zh/translator/translator_impl`.
ru: 1. Добавьте новый класс конфигурации переводчика в файл `pdf2zh/config/translate_engine_model.py`. 2. Добавьте экземпляр нового класса конфигурации переводчика в псевдоним типа `TRANSLATION_ENGINE_SETTING_TYPE` в том же файле. 3. Добавьте новый класс реализации переводчика в папку `pdf2zh/translator/translator_impl`.

# chunk_D3058459
source: > [!NOTE] > > This project does not intend to support any translation engines with an RPS (requests per second) lower than 4. Please do not submit support for such engines. > The following types of translators will also not be integrated: > - Translators that have been discontinued by upstream maintainers (such as deeplx) > - Translators with large dependencies (such as those depending on pytorch) > - Unstable translators > - Translator Based on Reverse Engineering API > > When you are unsure whether a translator meets the requirements, you can send an issue to discuss with the maintainers.
de: > [!NOTE] > > Dieses Projekt beabsichtigt nicht, Übersetzungsmaschinen mit einer RPS (Anfragen pro Sekunde) von weniger als 4 zu unterstützen. Bitte reichen Sie keine Unterstützung für solche Maschinen ein. > Die folgenden Arten von Übersetzern werden ebenfalls nicht integriert: > - Übersetzer, die von den ursprünglichen Maintainern eingestellt wurden (wie deeplx) > - Übersetzer mit großen Abhängigkeiten (wie solche, die von pytorch abhängen) > - Instabile Übersetzer > - Übersetzer, die auf Reverse-Engineering-APIs basieren > > Wenn Sie unsicher sind, ob ein Übersetzer die Anforderungen erfüllt, können Sie ein Issue erstellen, um mit den Maintainern zu diskutieren.
fr: > [!NOTE] > > Ce projet n'a pas l'intention de prendre en charge les moteurs de traduction avec un RPS (requêtes par seconde) inférieur à 4. Veuillez ne pas soumettre de support pour de tels moteurs. > Les types de traducteurs suivants ne seront pas non plus intégrés : > - Les traducteurs qui ont été abandonnés par les mainteneurs en amont (comme deeplx) > - Les traducteurs avec des dépendances volumineuses (comme ceux dépendant de pytorch) > - Les traducteurs instables > - Les traducteurs basés sur une API d'ingénierie inverse > > Lorsque vous n'êtes pas sûr qu'un traducteur répond aux exigences, vous pouvez envoyer un problème pour en discuter avec les mainteneurs.
it: > [!NOTE] > > Questo progetto non intende supportare alcun motore di traduzione con un RPS (richieste al secondo) inferiore a 4. Si prega di non inviare supporto per tali motori. > Anche i seguenti tipi di traduttori non verranno integrati: > - Traduttori che sono stati interrotti dai manutentori upstream (come deeplx) > - Traduttori con dipendenze pesanti (come quelli che dipendono da pytorch) > - Traduttori instabili > - Traduttori basati su API di reverse engineering > > Quando non sei sicuro se un traduttore soddisfa i requisiti, puoi inviare un problema per discuterne con i manutentori.
pt: > [!NOTE] > > Este projeto não pretende suportar nenhum mecanismo de tradução com um RPS (solicitações por segundo) inferior a 4. Por favor, não envie suporte para tais mecanismos. > Os seguintes tipos de tradutores também não serão integrados: > - Tradutores que foram descontinuados pelos mantenedores upstream (como deeplx) > - Tradutores com grandes dependências (como aqueles que dependem de pytorch) > - Tradutores instáveis > - Tradutor Baseado em API de Engenharia Reversa > > Quando você não tem certeza se um tradutor atende aos requisitos, pode enviar um problema para discutir com os mantenedores.
ru: > [!NOTE] > > Этот проект не предназначен для поддержки каких-либо движков перевода с RPS (запросов в секунду) ниже 4. Пожалуйста, не предлагайте поддержку для таких движков. > Следующие типы переводчиков также не будут интегрированы: > - Переводчики, поддержка которых прекращена вышестоящими разработчиками (например, deeplx) > - Переводчики с большими зависимостями (например, те, которые зависят от pytorch) > - Нестабильные переводчики > - Переводчики, основанные на обратном инжиниринге API > > Если вы не уверены, соответствует ли переводчик требованиям, вы можете создать issue для обсуждения с сопровождающими.

# chunk_7ED6230D
source: ## Project Structure
de: ## Projektstruktur
fr: ## Structure du projet
it: ## Struttura del progetto
pt: ## Estrutura do Projeto
ru: ## Структура проекта
