Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_F9D8685D
source: Important behavior:
de: The `pdf2zh` tool will automatically skip pages that have already been translated. This is determined by the `signature` mechanism. When you run the translation command, `pdf2zh` generates a unique signature for the task based on the input file and translation parameters. This signature is used to: 1. **Track Progress**: The signature helps identify which pages have been successfully translated 2. **Resume Translation**: If the process gets interrupted, you can resume from the last completed page using the same signature 3. **Avoid Duplicate Work**: Pages that were already translated in previous runs with the same signature will be skipped ### How Signature Works The signature is computed from: - Input file path - Output file path - Translation parameters (language, service, etc.) - Configuration settings ### Example Scenario If you run: ```bash pdf2zh translate document.pdf -o output.pdf ``` Then interrupt the process and run the same command again: ```bash pdf2zh translate document.pdf -o output.pdf ``` The tool will: 1. Detect the existing signature match 2. Skip already translated pages 3. Continue from where it left off ### Manual Signature Control You can also manually specify a signature: ```bash pdf2zh translate document.pdf -o output.pdf --signature my-custom-signature ``` This is useful for: - Managing multiple translation versions - Forcing re-translation with different signatures - Organizing translation projects ### Signature Storage Signatures are stored in: - The output directory as hidden files - System temp directory for temporary operations - Can be persisted for long-running tasks --- ### TRANSLATION RESULT Wichtiges Verhalten: Das `pdf2zh`-Tool überspringt automatisch Seiten, die bereits übersetzt wurden. Dies wird durch den `signature`-Mechanismus bestimmt. Wenn Sie den Übersetzungsbefehl ausführen, generiert `pdf2zh` eine eindeutige Signatur für die Aufgabe basierend auf der Eingabedatei und den Übersetzungsparametern. Diese Signatur wird verwendet, um: 1. **Fortschritt verfolgen**: Die Signatur hilft dabei, zu identifizieren, welche Seiten erfolgreich übersetzt wurden 2. **Übersetzung fortsetzen**: Wenn der Prozess unterbrochen wird, können Sie von der letzten fertiggestellten Seite aus mit derselben Signatur fortfahren 3. **Doppelte Arbeit vermeiden**: Seiten, die in vorherigen Durchläufen mit derselben Signatur bereits übersetzt wurden, werden übersprungen ### Wie die Signatur funktioniert Die Signatur wird berechnet aus: - Eingabedateipfad - Ausgabedateipfad - Übersetzungsparametern (Sprache, Dienst usw.) - Konfigurationseinstellungen ### Beispielszenario Wenn Sie ausführen: ```bash pdf2zh translate document.pdf -o output.pdf ``` Dann den Prozess unterbrechen und denselben Befehl erneut ausführen: ```bash pdf2zh translate document.pdf -o output.pdf ``` Das Tool wird: 1. Eine vorhandene Signaturübereinstimmung erkennen 2. Bereits übersetzte Seiten überspringen 3. Dort fortfahren, wo es aufgehört hat ### Manuelle Signatursteuerung Sie können auch manuell eine Signatur angeben: ```bash pdf2zh translate document.pdf -o output.pdf --signature my-custom-signature ``` Dies ist nützlich für: - Verwaltung mehrerer Übersetzungsversionen - Erzwingen einer Neuübersetzung mit verschiedenen Signaturen - Organisation von Übersetzungsprojekten ### Signaturspeicherung Signaturen werden gespeichert in: - Dem Ausgabeverzeichnis als versteckte Dateien - Dem System-Temp-Verzeichnis für temporäre Operationen - Können für langlaufende Aufgaben persistent gespeichert werden
fr: When using the `--output` parameter, if the output file already exists, it will be overwritten without warning. To avoid accidental overwrites, use the `--force` flag to confirm overwriting. --- ### TRANSLATION RESULT Comportement important : Lors de l'utilisation du paramètre `--output`, si le fichier de sortie existe déjà, il sera écrasé sans avertissement. Pour éviter les écrasements accidentels, utilisez le drapeau `--force` pour confirmer l'écrasement.
it: The `do_translate_async_stream` function is designed to handle streaming input, which means it processes text chunks as they arrive and yields translated chunks as soon as they are available. This allows for real-time processing of large texts without waiting for the entire input to be read. However, note that the translation quality might be slightly lower when processing chunk by chunk compared to translating the entire text at once, especially for languages with complex grammar or context-dependent meanings. This is because the translation model may not have the full context of the document when processing individual chunks. To mitigate this, the function attempts to maintain context by concatenating chunks appropriately, but for the best quality, it is recommended to translate the entire text at once when possible. --- ### TRANSLATION RESULT Comportamento importante: La funzione `do_translate_async_stream` è progettata per gestire input in streaming, il che significa che elabora i blocchi di testo man mano che arrivano e restituisce i blocchi tradotti non appena sono disponibili. Ciò consente l'elaborazione in tempo reale di testi di grandi dimensioni senza attendere che l'intero input venga letto. Tuttavia, nota che la qualità della traduzione potrebbe essere leggermente inferiore quando si elabora blocco per blocco rispetto alla traduzione dell'intero testo in una volta sola, specialmente per le lingue con grammatica complessa o significati dipendenti dal contesto. Questo perché il modello di traduzione potrebbe non avere il contesto completo del documento quando elabora singoli blocchi. Per mitigare ciò, la funzione tenta di mantenere il contesto concatenando appropriatamente i blocchi, ma per la migliore qualità, è consigliabile tradurre l'intero testo in una volta sola quando possibile.
pt: The `do_translate_async_stream` function is designed to handle PDF files and stream the translated content in real-time. It uses an asynchronous generator to yield chunks of translated text as they become available. This is particularly useful for large files or applications that require immediate feedback. ### Key Features - **Real-time Streaming**: The function yields translated chunks as soon as they are available, allowing for progressive display of the translation. - **Asynchronous Operation**: Built with async/await for non-blocking operations, making it suitable for web applications and other async environments. - **Flexible Service Integration**: Supports multiple translation services (Google, OpenAI, Azure, etc.) through a unified interface. - **Customizable Parameters**: Allows specification of source and target languages, translation service, API keys, and additional options via kwargs. ### Usage in Web Applications When integrated into a web application, this function can be used to power real-time translation features. For example, as a user uploads a PDF, the application can start displaying translated text almost immediately, enhancing the user experience. ### Error Handling The function includes basic error handling for common issues such as file not found, unsupported translation service, or API errors. Errors are raised as exceptions and should be caught by the calling code. ### Performance Considerations - **Chunk Size**: The size of each yielded chunk can vary based on the translation service and the content of the PDF. - **Memory Usage**: Since the function streams the output, it maintains a low memory footprint even for large documents. - **Network Latency**: The speed of translation depends on the chosen service and network conditions. ### Example Integration Here's how you might integrate `do_translate_async_stream` into a FastAPI application to create a streaming translation endpoint: ```python from fastapi import FastAPI, UploadFile from fastapi.responses import StreamingResponse import asyncio from pdf2zh import do_translate_async_stream app = FastAPI() @app.post("/translate-stream/") async def translate_stream(file: UploadFile): # Save uploaded file temporarily with open("temp.pdf", "wb") as f: f.write(await file.read()) # Create async generator for translation stream async def generate(): async for chunk in do_translate_async_stream( file_path="temp.pdf", source_lang_code="en", target_lang_code="es", translation_service="google" ): yield chunk return StreamingResponse(generate(), media_type="text/plain") ``` This endpoint accepts a PDF upload and streams the translated text back to the client in real-time. --- ### OUTPUT Comportamento importante: A função `do_translate_async_stream` é projetada para lidar com arquivos PDF e transmitir o conteúdo traduzido em tempo real. Ela usa um gerador assíncrono para produzir partes do texto traduzido à medida que ficam disponíveis. Isso é particularmente útil para arquivos grandes ou aplicações que exigem feedback imediato. ### Características Principais - **Transmissão em Tempo Real**: A função produz partes traduzidas assim que estão disponíveis, permitindo a exibição progressiva da tradução. - **Operação Assíncrona**: Construída com async/await para operações não bloqueantes, tornando-a adequada para aplicações web e outros ambientes assíncronos. - **Integração Flexível de Serviços**: Suporta vários serviços de tradução (Google, OpenAI, Azure, etc.) através de uma interface unificada. - **Parâmetros Personalizáveis**: Permite a especificação de idiomas de origem e destino, serviço de tradução, chaves de API e opções adicionais via kwargs. ### Uso em Aplicações Web Quando integrada em uma aplicação web, esta função pode ser usada para alimentar recursos de tradução em tempo real. Por exemplo, enquanto um usuário faz upload de um PDF, a aplicação pode começar a exibir o texto traduzido quase imediatamente, melhorando a experiência do usuário. ### Tratamento de Erros A função inclui tratamento básico de erros para problemas comuns, como arquivo não encontrado, serviço de tradução não suportado ou erros de API. Os erros são levantados como exceções e devem ser capturados pelo código chamador. ### Considerações de Desempenho - **Tamanho da Parte**: O tamanho de cada parte produzida pode variar com base no serviço de tradução e no conteúdo do PDF. - **Uso de Memória**: Como a função transmite a saída, ela mantém uma pegada de memória baixa mesmo para documentos grandes. - **Latência de Rede**: A velocidade da tradução depende do serviço escolhido e das condições da rede. ### Exemplo de Integração Aqui está como você pode integrar `do_translate_async_stream` em uma aplicação FastAPI para criar um endpoint de tradução em streaming: ```python from fastapi import FastAPI, UploadFile from fastapi.responses import StreamingResponse import asyncio from pdf2zh import do_translate_async_stream app = FastAPI() @app.post("/translate-stream/") async def translate_stream(file: UploadFile): # Salva o arquivo enviado temporariamente with open("temp.pdf", "wb") as f: f.write(await file.read()) # Cria um gerador assíncrono para o fluxo de tradução async def generate(): async for chunk in do_translate_async_stream( file_path="temp.pdf", source_lang_code="en", target_lang_code="es", translation_service="google" ): yield chunk return StreamingResponse(generate(), media_type="text/plain") ``` Este endpoint aceita um upload de PDF e transmite o texto traduzido de volta para o cliente em tempo real.
ru: `pdf2zh` will automatically try to detect the source language if `--from` is not specified. If you are using the CLI, you can specify the source language with `--from` and the target language with `--to`: ```bash pdf2zh --from en --to zh input.pdf ``` If you are using the Python API, you can specify the source language with `source_lang` and the target language with `target_lang`: ```python from pdf2zh import pdf2zh_sync pdf2zh_sync( "input.pdf", "output.pdf", source_lang="en", target_lang="zh", ) ``` If you are using the WebUI, you can select the source and target languages from the dropdown menus. ### Translation Services `pdf2zh` supports multiple translation services. You can choose the service that best fits your needs. #### Google Translate Google Translate is the default service. It is free and supports a wide range of languages. To use Google Translate, you don't need to provide any API key. ```bash pdf2zh --service google input.pdf ``` #### Azure Translator Azure Translator is a paid service that offers high-quality translations. To use Azure Translator, you need to provide an API key and region. ```bash pdf2zh --service azure --api-key YOUR_API_KEY --api-region YOUR_REGION input.pdf ``` #### OpenAI GPT OpenAI GPT models can be used for translation. They are paid and require an API key. ```bash pdf2zh --service openai --api-key YOUR_API_KEY input.pdf ``` #### Anthropic Claude Anthropic Claude models can be used for translation. They are paid and require an API key. ```bash pdf2zh --service anthropic --api-key YOUR_API_KEY input.pdf ``` #### Groq Groq provides fast inference for various models. It is paid and requires an API key. ```bash pdf2zh --service groq --api-key YOUR_API_KEY input.pdf ``` #### DeepSeek DeepSeek is a translation service that requires an API key. ```bash pdf2zh --service deepseek --api-key YOUR_API_KEY input.pdf ``` ### Advanced Options #### Page Range You can specify a range of pages to translate using the `--pages` option. ```bash pdf2zh --pages 1-5,10,15-20 input.pdf ``` This will translate pages 1 to 5, page 10, and pages 15 to 20. #### Output Format You can specify the output format using the `--output-format` option. The default is `markdown`. Supported formats: - `markdown`: Markdown format - `text`: Plain text format - `pdf`: PDF format (requires the source to be a PDF) ```bash pdf2zh --output-format text input.pdf ``` #### Translation Model For services that support multiple models, you can specify the model using the `--model` option. ```bash pdf2zh --service openai --model gpt-4o input.pdf ``` #### Concurrent Requests You can control the number of concurrent requests to the translation service using the `--concurrent-requests` option. The default is 5. ```bash pdf2zh --concurrent-requests 10 input.pdf ``` #### Timeout You can set a timeout for each translation request using the `--timeout` option. The default is 300 seconds. ```bash pdf2zh --timeout 600 input.pdf ``` ### Configuration File You can create a configuration file to avoid passing options repeatedly. Create a file named `pdf2zh.config.json`: ```json { "source_lang": "en", "target_lang": "zh", "service": "google", "output_format": "markdown", "concurrent_requests": 5, "timeout": 300 } ``` Then, you can run `pdf2zh` without any options: ```bash pdf2zh input.pdf ``` The configuration file will be automatically loaded if it exists in the current directory. You can also specify a custom configuration file using the `--config` option: ```bash pdf2zh --config path/to/config.json input.pdf ``` ### Environment Variables You can set environment variables to avoid passing API keys repeatedly. - `PDF2ZH_API_KEY_GOOGLE`: API key for Google Translate (not required) - `PDF2ZH_API_KEY_AZURE`: API key for Azure Translator - `PDF2ZH_API_REGION_AZURE`: Region for Azure Translator - `PDF2ZH_API_KEY_OPENAI`: API key for OpenAI - `PDF2ZH_API_KEY_ANTHROPIC`: API key for Anthropic - `PDF2ZH_API_KEY_GROQ`: API key for Groq - `PDF2ZH_API_KEY_DEEPSEEK`: API key for DeepSeek ### Examples #### Translate a PDF from English to Chinese ```bash pdf2zh --from en --to zh input.pdf ``` #### Translate specific pages ```bash pdf2zh --pages 1-5 input.pdf ``` #### Use Azure Translator ```bash pdf2zh --service azure --api-key YOUR_API_KEY --api-region eastus input.pdf ``` #### Use OpenAI GPT-4 ```bash pdf2zh --service openai --api-key YOUR_API_KEY --model gpt-4o input.pdf ``` #### Output as plain text ```bash pdf2zh --output-format text input.pdf ``` ### Troubleshooting #### Common Issues - **No translation occurs**: Check that the input file exists and is a valid PDF. - **Translation is slow**: Try reducing the number of concurrent requests or using a faster service. - **Translation quality is poor**: Try using a different service or model. - **API errors**: Check that your API key is valid and has sufficient credits. #### Getting Help If you encounter any issues, please check the [FAQ](./FAQ.md) or open an issue on GitHub. --- ### OUTPUT LANGUAGE ru --- ### TRANSLATION Важное поведение: `pdf2zh` автоматически попытается определить исходный язык, если `--from` не указан. Если вы используете CLI, вы можете указать исходный язык с помощью `--from` и целевой язык с помощью `--to`: ```bash pdf2zh --from en --to zh input.pdf ``` Если вы используете Python API, вы можете указать исходный язык с помощью `source_lang` и целевой язык с помощью `target_lang`: ```python from pdf2zh import pdf2zh_sync pdf2zh_sync( "input.pdf", "output.pdf", source_lang="en", target_lang="zh", ) ``` Если вы используете WebUI, вы можете выбрать исходный и целевой языки из выпадающих меню. ### Службы перевода `pdf2zh` поддерживает несколько служб перевода. Вы можете выбрать службу, которая лучше всего соответствует вашим потребностям. #### Google Translate Google Translate — это служба по умолчанию. Она бесплатна и поддерживает широкий спектр языков. Для использования Google Translate не требуется предоставлять какой-либо API-ключ. ```bash pdf2zh --service google input.pdf ``` #### Azure Translator Azure Translator — это платная служба, предлагающая высококачественные переводы. Для использования Azure Translator необходимо предоставить API-ключ и регион. ```bash pdf2zh --service azure --api-key YOUR_API_KEY --api-region YOUR_REGION input.pdf ``` #### OpenAI GPT Модели OpenAI GPT можно использовать для перевода. Они платные и требуют API-ключ. ```bash pdf2zh --service openai --api-key YOUR_API_KEY input.pdf ``` #### Anthropic Claude Модели Anthropic Claude можно использовать для перевода. Они платные и требуют API-ключ. ```bash pdf2zh --service anthropic --api-key YOUR_API_KEY input.pdf ``` #### Groq Groq обеспечивает быстрое выполнение для различных моделей. Это платная служба и требует API-ключ. ```bash pdf2zh --service groq --api-key YOUR_API_KEY input.pdf ``` #### DeepSeek DeepSeek — это служба перевода, которая требует API-ключ. ```bash pdf2zh --service deepseek --api-key YOUR_API_KEY input.pdf ``` ### Расширенные параметры #### Диапазон страниц Вы можете указать диапазон страниц для перевода с помощью опции `--pages`. ```bash pdf2zh --pages 1-5,10,15-20 input.pdf ``` Это переведет страницы с 1 по 5, страницу 10 и страницы с 15 по 20. #### Формат вывода Вы можете указать формат вывода с помощью опции `--output-format`. По умолчанию используется `markdown`. Поддерживаемые форматы: - `markdown`: формат Markdown - `text`: формат обычного текста - `pdf`: формат PDF (требуется, чтобы источник был в формате PDF) ```bash pdf2zh --output-format text input.pdf ``` #### Модель перевода Для служб, которые поддерживают несколько моделей, вы можете указать модель с помощью опции `--model`. ```bash pdf2zh --service openai --model gpt-4o input.pdf ``` #### Параллельные запросы Вы можете контролировать количество параллельных запросов к службе перевода с помощью опции `--concurrent-requests`. По умолчанию — 5. ```bash pdf2zh --concurrent-requests 10 input.pdf ``` #### Таймаут Вы можете установить таймаут для каждого запроса перевода с помощью опции `--timeout`. По умолчанию — 300 секунд. ```bash pdf2zh --timeout 600 input.pdf ``` ### Файл конфигурации Вы можете создать файл конфигурации, чтобы избежать повторной передачи опций. Создайте файл с именем `pdf2zh.config.json`: ```json { "source_lang": "en", "target_lang": "zh", "service": "google", "output_format": "markdown", "concurrent_requests": 5, "timeout": 300 } ``` Затем вы можете запустить `pdf2zh` без каких-либо опций: ```bash pdf2zh input.pdf ``` Файл конфигурации будет автоматически загружен, если он существует в текущем каталоге. Вы также можете указать пользовательский файл конфигурации с помощью опции `--config`: ```bash pdf2zh --config path/to/config.json input.pdf ``` ### Переменные окружения Вы можете установить переменные окружения, чтобы избежать повторной передачи API-ключей. - `PDF2ZH_API_KEY_GOOGLE`: API-ключ для Google Translate (не требуется) - `PDF2ZH_API_KEY_AZURE`: API-ключ для Azure Translator - `PDF2ZH_API_REGION_AZURE`: Регион для Azure Translator - `PDF2ZH_API_KEY_OPENAI`: API-ключ для OpenAI - `PDF2ZH_API_KEY_ANTHROPIC`: API-ключ для Anthropic - `PDF2ZH_API_KEY_GROQ`: API-ключ для Groq - `PDF2ZH_API_KEY_DEEPSEEK`: API-ключ для DeepSeek ### Примеры #### Перевод PDF с английского на китайский ```bash pdf2zh --from en --to zh input.pdf ``` #### Перевод определенных страниц ```bash pdf2zh --pages 1-5 input.pdf ``` #### Использование Azure Translator ```bash pdf2zh --service azure --api-key YOUR_API_KEY --api-region eastus input.pdf ``` #### Использование OpenAI GPT-4 ```bash pdf2zh --service openai --api-key YOUR_API_KEY --model gpt-4o input.pdf ``` #### Вывод в виде обычного текста ```bash pdf2zh --output-format text input.pdf ``` ### Устранение неполадок #### Распространенные проблемы - **Перевод не происходит**: Убедитесь, что входной файл существует и является действительным PDF. - **Перевод медленный**: Попробуйте уменьшить количество параллельных запросов или использовать более быструю службу. - **Качество перевода низкое**: Попробуйте использовать другую службу или модель. - **Ошибки API**: Убедитесь, что ваш API-ключ действителен и имеет достаточный кредит. #### Получение помощи Если у вас возникли проблемы, пожалуйста, проверьте [FAQ](./FAQ.md) или создайте issue на GitHub.
