Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_41772AFF
source: | 土耳其语 | Turkish | `TR` | `source`, `target` |
de: | Türkisch | Turkish | `TR` | `source`, `target` |
fr: | Turc | Turkish | `TR` | `source`, `target` |
pt: | Turco | Turkish | `TR` | `source`, `target` |
ru: | Турецкий | Turkish | `TR` | `source`, `target` |

# chunk_95BAEB3E
source: | 乌克兰语 | Ukrainian | `UK` | `source`, `target` |
de: | Ukrainisch | Ukrainian | `UK` | `source`, `target` |
fr: | Ukrainien | Ukrainian | `UK` | `source`, `target` |
it: | Ucraino | Ukrainian | `UK` | `source`, `target` |
pt: | Ucraniano | Ukrainian | `UK` | `source`, `target` |
ru: | Украинский | Ukrainian | `UK` | `source`, `target` |

# chunk_DED8F856
source: | 中文 | Chinese | `ZH` | `source`, `target` |
de: | Deutsch | German | `DE` | `source`, `target` |
fr: | Français | French | `FR` | `source`, `target` |
it: | Italiano | Chinese | `ZH` | `source`, `target` |
pt: | Português | Portuguese | `PT` | `source`, `target` |
ru: | Русский | Russian | `RU` | `source`, `target` |

# chunk_8EC779FC
source: | 中文（简体） | Chinese (Simplified) | `ZH-HANS` | `target` |
fr: | Français | French | `FR` | `target` |
pt: | Português (Brasil) | Portuguese (Brazil) | `PT-BR` | `target` |

# chunk_357772FB
source: | 中文（繁体） | Chinese (Traditional) | `ZH-HANT` | `target` |
de: | Chinesisch (Traditionell) | Chinese (Traditional) | `ZH-HANT` | `target` |
fr: | Chinois traditionnel | Chinese (Traditional) | `ZH-HANT` | `target` |
it: | Cinese tradizionale | Chinese (Traditional) | `ZH-HANT` | `target` |
pt: | Português (Brasil) | Português (Brasil) | `PT-BR` | `target` |

# chunk_ED2346E0
source: It is recommended to use the `qwen-plus-latest` model. Reference configuration:
de: Es wird empfohlen, das Modell `qwen-plus-latest` zu verwenden. Referenzkonfiguration:
fr: Il est recommandé d'utiliser le modèle `qwen-plus-latest`. Configuration de référence :
it: Si consiglia di utilizzare il modello `qwen-plus-latest`. Configurazione di riferimento:
pt: Recomenda-se usar o modelo `qwen-plus-latest`. Configuração de referência:
ru: Рекомендуется использовать модель `qwen-plus-latest`. Пример конфигурации:

# chunk_B142B723
source: - Translation Service: `qwen-plus-latest` - Base URL: keep default - API key: your API key - Timeout (seconds): 500 - Temperature: 0.0 - Send temperature: True - Enable JSON mode: True
de: - Übersetzungsdienst: `qwen-plus-latest` - Basis-URL: Standard beibehalten - API-Schlüssel: Ihr API-Schlüssel - Timeout (Sekunden): 500 - Temperatur: 0.0 - Temperatur senden: Wahr - JSON-Modus aktivieren: Wahr
fr: - Service de traduction : `qwen-plus-latest` - URL de base : conserver par défaut - Clé API : votre clé API - Délai d'attente (secondes) : 500 - Température : 0.0 - Envoyer la température : Vrai - Activer le mode JSON : Vrai
it: - Servizio di traduzione: `qwen-plus-latest` - URL di base: mantenere predefinito - Chiave API: la tua chiave API - Timeout (secondi): 500 - Temperatura: 0.0 - Invia temperatura: Vero - Abilita modalità JSON: Vero
pt: - Serviço de tradução: `qwen-plus-latest` - URL base: manter padrão - Chave da API: sua chave da API - Tempo limite (segundos): 500 - Temperatura: 0.0 - Enviar temperatura: Verdadeiro - Ativar modo JSON: Verdadeiro
ru: - Сервис перевода: `qwen-plus-latest` - Базовый URL: оставить по умолчанию - API ключ: ваш API ключ - Таймаут (секунды): 500 - Температура: 0.0 - Отправлять температуру: Да - Включить JSON режим: Да

# chunk_BC8076A9
source: For rate limiting, use Custom mode:
de: Für Ratenbegrenzung verwenden Sie den benutzerdefinierten Modus:
fr: Pour limiter le débit, utilisez le mode personnalisé :
it: Per limitare la frequenza, utilizza la modalità Personalizzata:
pt: Para limitar a taxa, use o modo Personalizado:
ru: Для ограничения скорости используйте Пользовательский режим:

# chunk_7C20EF8C
source: - QPS: 30 or 40 - Pool Max Workers: 1000
de: - QPS: 30 oder 40 - Pool Max Workers: 1000
fr: - QPS : 30 ou 40 - Pool Max Workers : 1000
it: - QPS: 30 o 40 - Pool Max Workers: 1000
pt: - QPS: 30 ou 40 - Pool Max Workers: 1000
ru: - QPS: 30 или 40 - Pool Max Workers: 1000

# chunk_5EFF4D9F
source: ## Free Translation Service
de: ## Kostenloser Übersetzungsdienst
fr: ## Service de traduction gratuit
it: ## Servizio di traduzione gratuito
pt: ## Serviço de Tradução Gratuito
ru: ## Бесплатный сервис перевода

# chunk_3C2A41A9
source: [SiliconFlow](https://siliconflow.cn) provides free translation service for this project. Currently, the free translation service will use `THUDM/GLM-4-9B-0414` model.
de: [SiliconFlow](https://siliconflow.cn) bietet einen kostenlosen Übersetzungsdienst für dieses Projekt an. Derzeit wird für den kostenlosen Übersetzungsdienst das Modell `THUDM/GLM-4-9B-0414` verwendet.
fr: [SiliconFlow](https://siliconflow.cn) fournit un service de traduction gratuit pour ce projet. Actuellement, le service de traduction gratuit utilisera le modèle `THUDM/GLM-4-9B-0414`.
it: [SiliconFlow](https://siliconflow.cn) fornisce un servizio di traduzione gratuito per questo progetto. Attualmente, il servizio di traduzione gratuito utilizzerà il modello `THUDM/GLM-4-9B-0414`.
pt: [SiliconFlow](https://siliconflow.cn) fornece um serviço de tradução gratuito para este projeto. Atualmente, o serviço de tradução gratuito utilizará o modelo `THUDM/GLM-4-9B-0414`.
ru: [SiliconFlow](https://siliconflow.cn) предоставляет бесплатный сервис перевода для этого проекта. В настоящее время бесплатный сервис перевода будет использовать модель `THUDM/GLM-4-9B-0414`.

# chunk_FC529C81
source: #### cli
de: #### Kommandozeile
fr: #### Ligne de commande
pt: #### Linha de comando
ru: #### Командная строка

# chunk_0ACD2D6C
source: 1. Select "SiliconFlowFree" from the "Translation Options" - "Service" dropdown list. 2. Click the Translate button at the bottom of the page to start translation. 3. After translation is complete, you can find the translated PDF file in the "Translated" section at the bottom of the page.
de: 1. Wählen Sie "SiliconFlowFree" aus der Dropdown-Liste "Übersetzungsoptionen" - "Dienst" aus. 2. Klicken Sie auf die Schaltfläche "Übersetzen" am unteren Rand der Seite, um mit der Übersetzung zu beginnen. 3. Nach Abschluss der Übersetzung finden Sie die übersetzte `PDF`-Datei im Abschnitt "Übersetzt" am unteren Rand der Seite.
fr: 1. Sélectionnez "SiliconFlowFree" dans la liste déroulante "Options de traduction" - "Service". 2. Cliquez sur le bouton Traduire en bas de la page pour démarrer la traduction. 3. Une fois la traduction terminée, vous pouvez trouver le fichier PDF traduit dans la section "Traduit" en bas de la page.
it: 1. Selezionare "SiliconFlowFree" dall'elenco a discesa "Translation Options" - "Service". 2. Fare clic sul pulsante Translate nella parte inferiore della pagina per avviare la traduzione. 3. Al termine della traduzione, è possibile trovare il file PDF tradotto nella sezione "Translated" nella parte inferiore della pagina.
pt: 1. Selecione "SiliconFlowFree" na lista suspensa "Translation Options" - "Service". 2. Clique no botão "Translate" na parte inferior da página para iniciar a tradução. 3. Após a conclusão da tradução, você pode encontrar o arquivo PDF traduzido na seção "Translated" na parte inferior da página.
ru: 1. Выберите "SiliconFlowFree" из выпадающего списка "Translation Options" - "Service". 2. Нажмите кнопку "Translate" в нижней части страницы, чтобы начать перевод. 3. После завершения перевода вы можете найти переведённый файл PDF в разделе "Translated" в нижней части страницы.

# chunk_24653E80
source: ### Privacy Policy
de: ### Datenschutzrichtlinie
fr: ### Politique de confidentialité
it: ### Politica sulla privacy
pt: ### Política de Privacidade
ru: ### Политика конфиденциальности

# chunk_E40E083F
source: The file content will be sent to the server of the project maintainer [@awwaawwa](https://github.com/awwaawwa), and then forwarded to SiliconFlow for translation. The maintainers of this project will only collect error information returned by SiliconFlow for debugging related services. Your file content will not be collected. SiliconFlow Privacy Policy: [简体中文](https://docs.siliconflow.cn/cn/legals/privacy-policy)/[English](https://docs.siliconflow.cn/en/legals/privacy-policy)
de: Die Dateiinhalte werden an den Server des Projektbetreuers [@awwaawwa](https://github.com/awwaawwa) gesendet und dann an SiliconFlow zur Übersetzung weitergeleitet. Die Betreuer dieses Projekts sammeln nur Fehlerinformationen, die von SiliconFlow zurückgegeben werden, um damit verbundene Dienste zu debuggen. Ihre Dateiinhalte werden nicht gesammelt. SiliconFlow Datenschutzrichtlinie: [简体中文](https://docs.siliconflow.cn/cn/legals/privacy-policy)/[English](https://docs.siliconflow.cn/en/legals/privacy-policy)
fr: Le contenu du fichier sera envoyé au serveur du mainteneur du projet [@awwaawwa](https://github.com/awwaawwa), puis transmis à SiliconFlow pour traduction. Les mainteneurs de ce projet ne collecteront que les informations d'erreur renvoyées par SiliconFlow pour le débogage des services associés. Votre contenu de fichier ne sera pas collecté. Politique de confidentialité de SiliconFlow : [简体中文](https://docs.siliconflow.cn/cn/legals/privacy-policy)/[English](https://docs.siliconflow.cn/en/legals/privacy-policy)
it: Il contenuto del file verrà inviato al server del maintainer del progetto [@awwaawwa](https://github.com/awwaawwa), e poi inoltrato a SiliconFlow per la traduzione. I maintainer di questo progetto raccoglieranno solo le informazioni di errore restituite da SiliconFlow per il debug dei servizi correlati. Il contenuto del tuo file non verrà raccolto. Politica sulla privacy di SiliconFlow: [简体中文](https://docs.siliconflow.cn/cn/legals/privacy-policy)/[English](https://docs.siliconflow.cn/en/legals/privacy-policy)
pt: O conteúdo do arquivo será enviado para o servidor do mantenedor do projeto [@awwaawwa](https://github.com/awwaawwa) e, em seguida, encaminhado para o SiliconFlow para tradução. Os mantenedores deste projeto coletarão apenas informações de erro retornadas pelo SiliconFlow para depuração dos serviços relacionados. O conteúdo do seu arquivo não será coletado. Política de Privacidade do SiliconFlow: [简体中文](https://docs.siliconflow.cn/cn/legals/privacy-policy)/[English](https://docs.siliconflow.cn/en/legals/privacy-policy)
ru: Содержание файла будет отправлено на сервер сопровождающего проекта [@awwaawwa](https://github.com/awwaawwa), а затем перенаправлено в SiliconFlow для перевода. Сопровождающие этого проекта будут собирать только информацию об ошибках, возвращаемую SiliconFlow, для отладки связанных сервисов. Содержание вашего файла не будет собираться. Политика конфиденциальности SiliconFlow: [简体中文](https://docs.siliconflow.cn/cn/legals/privacy-policy)/[English](https://docs.siliconflow.cn/en/legals/privacy-policy)

# chunk_86238772
source: ## Use other models from SiliconFlow
de: ## Andere Modelle von SiliconFlow verwenden
fr: ## Utiliser d'autres modèles de SiliconFlow
it: ## Utilizzare altri modelli da SiliconFlow
pt: ## Usar outros modelos do SiliconFlow
ru: ## Использование других моделей от SiliconFlow

# chunk_6C8B20F2
source: [SiliconFlow](https://siliconflow.cn) also provides other models for translation.
de: [SiliconFlow](https://siliconflow.cn) bietet auch andere Modelle für die Übersetzung an.
fr: [SiliconFlow](https://siliconflow.cn) propose également d'autres modèles pour la traduction.
it: [SiliconFlow](https://siliconflow.cn) fornisce anche altri modelli per la traduzione.
pt: [SiliconFlow](https://siliconflow.cn) também fornece outros modelos para tradução.
ru: [SiliconFlow](https://siliconflow.cn) также предоставляет другие модели для перевода.

# chunk_71BE5099
source: 1. Register an account at [SiliconFlow](https://siliconflow.cn) 2. Create an API key at [SiliconFlow API Key](https://cloud.siliconflow.cn/me/account/ak). Then, click on the key to copy it.
de: 1. Registrieren Sie ein Konto bei [SiliconFlow](https://siliconflow.cn) 2. Erstellen Sie einen API-Schlüssel unter [SiliconFlow API Key](https://cloud.siliconflow.cn/me/account/ak). Klicken Sie dann auf den Schlüssel, um ihn zu kopieren.
fr: 1. Créez un compte sur [SiliconFlow](https://siliconflow.cn) 2. Générez une clé API sur [SiliconFlow API Key](https://cloud.siliconflow.cn/me/account/ak). Ensuite, cliquez sur la clé pour la copier.
it: 1. Registra un account su [SiliconFlow](https://siliconflow.cn) 2. Crea una chiave API su [SiliconFlow API Key](https://cloud.siliconflow.cn/me/account/ak). Quindi, fai clic sulla chiave per copiarla.
pt: 1. Registre uma conta no [SiliconFlow](https://siliconflow.cn) 2. Crie uma chave de API no [SiliconFlow API Key](https://cloud.siliconflow.cn/me/account/ak). Em seguida, clique na chave para copiá-la.
ru: 1. Зарегистрируйте аккаунт на [SiliconFlow](https://siliconflow.cn) 2. Создайте API-ключ на странице [SiliconFlow API Key](https://cloud.siliconflow.cn/me/account/ak). Затем нажмите на ключ, чтобы скопировать его.

# chunk_22AE44AB
source: 1. "Translation Options" - **"Service"** dropdown list: Select "SiliconFlow" 2. "Translation Options" - **"Base URL for SiliconFlow API"**: Keep default 3. "Translation Options" - **"SiliconFlow model to use"**: Enter "Pro/deepseek-ai/DeepSeek-V3" or other models 4. "Translation Options" - **"API key for SiliconFlow service"**: Paste your API key 5. Click the Translate button at the bottom of the page to start translation 6. After translation is complete, you can find the translated PDF file in the "Translated" section at the bottom of the page.
de: 1. "Übersetzungsoptionen" - **"Dienst"** Dropdown-Liste: Wählen Sie "SiliconFlow" 2. "Übersetzungsoptionen" - **"Basis-URL für SiliconFlow API"**: Behalten Sie den Standardwert bei 3. "Übersetzungsoptionen" - **"Zu verwendendes SiliconFlow-Modell"**: Geben Sie "Pro/deepseek-ai/DeepSeek-V3" oder andere Modelle ein 4. "Übersetzungsoptionen" - **"API-Schlüssel für SiliconFlow-Dienst"**: Fügen Sie Ihren API-Schlüssel ein 5. Klicken Sie auf die Schaltfläche "Übersetzen" am unteren Rand der Seite, um die Übersetzung zu starten 6. Nach Abschluss der Übersetzung finden Sie die übersetzte `PDF`-Datei im Abschnitt "Übersetzt" am unteren Rand der Seite.
fr: 1. "Options de traduction" - Liste déroulante **"Service"** : Sélectionnez "SiliconFlow" 2. "Options de traduction" - **"URL de base pour l'API SiliconFlow"** : Gardez la valeur par défaut 3. "Options de traduction" - **"Modèle SiliconFlow à utiliser"** : Entrez "Pro/deepseek-ai/DeepSeek-V3" ou d'autres modèles 4. "Options de traduction" - **"Clé API pour le service SiliconFlow"** : Collez votre clé API 5. Cliquez sur le bouton Traduire en bas de la page pour démarrer la traduction 6. Une fois la traduction terminée, vous pouvez trouver le fichier PDF traduit dans la section "Traduits" en bas de la page.
it: 1. "Opzioni di traduzione" - Menu a discesa **"Servizio"**: Selezionare "SiliconFlow" 2. "Opzioni di traduzione" - **"URL base per l'API SiliconFlow"**: Mantenere il valore predefinito 3. "Opzioni di traduzione" - **"Modello SiliconFlow da utilizzare"**: Inserire "Pro/deepseek-ai/DeepSeek-V3" o altri modelli 4. "Opzioni di traduzione" - **"Chiave API per il servizio SiliconFlow"**: Incollare la propria chiave API 5. Fare clic sul pulsante Traduci in fondo alla pagina per avviare la traduzione 6. Al termine della traduzione, è possibile trovare il file PDF tradotto nella sezione "Tradotti" in fondo alla pagina.
pt: 1. "Opções de Tradução" - Lista suspensa **"Serviço"**: Selecione "SiliconFlow" 2. "Opções de Tradução" - **"URL base para a API do SiliconFlow"**: Mantenha o padrão 3. "Opções de Tradução" - **"Modelo do SiliconFlow a ser usado"**: Insira "Pro/deepseek-ai/DeepSeek-V3" ou outros modelos 4. "Opções de Tradução" - **"Chave de API para o serviço SiliconFlow"**: Cole sua chave de API 5. Clique no botão "Traduzir" na parte inferior da página para iniciar a tradução 6. Após a conclusão da tradução, você pode encontrar o arquivo PDF traduzido na seção "Traduzido" na parte inferior da página.
ru: 1. "Параметры перевода" - выпадающий список **"Сервис"**: Выберите "SiliconFlow" 2. "Параметры перевода" - **"Базовый URL для API SiliconFlow"**: Оставьте значение по умолчанию 3. "Параметры перевода" - **"Модель SiliconFlow для использования"**: Введите "Pro/deepseek-ai/DeepSeek-V3" или другие модели 4. "Параметры перевода" - **"API-ключ для сервиса SiliconFlow"**: Вставьте ваш API-ключ 5. Нажмите кнопку "Перевести" в нижней части страницы, чтобы начать перевод 6. После завершения перевода вы можете найти переведенный `PDF` файл в разделе "Translated" внизу страницы.

# chunk_F44132D0
source: ## Acknowledgement
de: ## Danksagung
fr: ## Remerciements
it: ## Ringraziamenti
pt: ## Agradecimentos
ru: ## Благодарности

# chunk_ED8820C9
source: Thanks to [SiliconFlow](https://siliconflow.cn) for providing free translation service for this project.
de: Danke an [SiliconFlow](https://siliconflow.cn) für die Bereitstellung des kostenlosen Übersetzungsdienstes für dieses Projekt.
fr: Merci à [SiliconFlow](https://siliconflow.cn) pour avoir fourni un service de traduction gratuit pour ce projet.
it: Grazie a [SiliconFlow](https://siliconflow.cn) per aver fornito il servizio di traduzione gratuito per questo progetto.
pt: Obrigado ao [SiliconFlow](https://siliconflow.cn) por fornecer o serviço de tradução gratuito para este projeto.
ru: Спасибо [SiliconFlow](https://siliconflow.cn) за предоставление бесплатного сервиса перевода для этого проекта.

# chunk_DDD39913
source: [**Advanced**](./introduction.md) > **Advanced** _(current)_
de: [**Erweiterte Optionen**](./introduction.md) > **Erweiterte Optionen** _(aktuell)_
fr: [**Options avancées**](./introduction.md) > **Options avancées** _(actuel)_
it: [**Opzioni avanzate**](./introduction.md) > **Opzioni avanzate** _(current)_
pt: [**Opções avançadas**](./introduction.md) > **Opções avançadas** _(atual)_
ru: [**Расширенные параметры**](./introduction.md) > **Расширенные параметры** _(текущая)_

# chunk_D9B293FF
source: <h3 id="toc">Table of Contents</h3>
de: <h3 id="toc">Inhaltsverzeichnis</h3>
fr: <h3 id="toc">Table des matières</h3>
it: <h3 id="toc">Indice</h3>
pt: <h3 id="toc">Índice</h3>
ru: <h3 id="содержание">Содержание</h3>

# chunk_F0A2B12C
source: - [Command Line Args](#command-line-args) - [Rate Limiting Configuration Guide](#rate-limiting-configuration-guide) - [Partial translation](#partial-translation) - [Specify source and target languages](#specify-source-and-target-languages) - [Translate wih exceptions](#translate-wih-exceptions) - [Custom prompt](#custom-prompt) - [Custom configuration](#custom-configuration) - [Skip clean](#skip-clean) - [Translation cache](#translation-cache) - [Deployment as a public services](#deployment-as-a-public-services) - [Authentication and welcome page](#authentication-and-welcome-page) - [Glossary Support](#glossary-support)
de: - [Kommandozeilenargumente](#kommandozeilenargumente) - [Rate-Limiting-Konfigurationsleitfaden](#rate-limiting-konfigurationsleitfaden) - [Partielle Übersetzung](#partielle-übersetzung) - [Quell- und Zielsprachen angeben](#quell--und-zielsprachen-angeben) - [Übersetzung mit Ausnahmen](#übersetzung-mit-ausnahmen) - [Benutzerdefinierte Eingabeaufforderung](#benutzerdefinierte-eingabeaufforderung) - [Benutzerdefinierte Konfiguration](#benutzerdefinierte-konfiguration) - [Bereinigung überspringen](#bereinigung-überspringen) - [Übersetzungscache](#übersetzungscache) - [Bereitstellung als öffentlicher Dienst](#bereitstellung-als-öffentlicher-dienst) - [Authentifizierung und Willkommensseite](#authentifizierung-und-willkommensseite) - [Glossarunterstützung](#glossarunterstützung)
fr: - [Arguments de ligne de commande](#arguments-de-ligne-de-commande) - [Guide de configuration de la limitation de débit](#guide-de-configuration-de-la-limitation-de-débit) - [Traduction partielle](#traduction-partielle) - [Spécifier les langues source et cible](#spécifier-les-langues-source-et-cible) - [Traduire avec exceptions](#traduire-avec-exceptions) - [Invite personnalisée](#invite-personnalisée) - [Configuration personnalisée](#configuration-personnalisée) - [Ignorer le nettoyage](#ignorer-le-nettoyage) - [Cache de traduction](#cache-de-traduction) - [Déploiement en tant que services publics](#déploiement-en-tant-que-services-publics) - [Authentification et page d'accueil](#authentification-et-page-daccueil) - [Support de glossaire](#support-de-glossaire)
it: - [Argomenti della riga di comando](#argomenti-della-riga-di-comando) - [Guida alla configurazione del rate limiting](#guida-alla-configurazione-del-rate-limiting) - [Traduzione parziale](#traduzione-parziale) - [Specificare le lingue di origine e di destinazione](#specificare-le-lingue-di-origine-e-di-destinazione) - [Tradurre con eccezioni](#tradurre-con-eccezioni) - [Prompt personalizzato](#prompt-personalizzato) - [Configurazione personalizzata](#configurazione-personalizzata) - [Salta la pulizia](#salta-la-pulizia) - [Cache delle traduzioni](#cache-delle-traduzioni) - [Distribuzione come servizi pubblici](#distribuzione-come-servizi-pubblici) - [Autenticazione e pagina di benvenuto](#autenticazione-e-pagina-di-benvenuto) - [Supporto per il glossario](#supporto-per-il-glossario)
pt: - [Argumentos da Linha de Comando](#argumentos-da-linha-de-comando) - [Guia de Configuração de Limitação de Taxa](#guia-de-configuração-de-limitação-de-taxa) - [Tradução parcial](#tradução-parcial) - [Especificar idiomas de origem e destino](#especificar-idiomas-de-origem-e-destino) - [Traduzir com exceções](#traduzir-com-exceções) - [Prompt personalizado](#prompt-personalizado) - [Configuração personalizada](#configuração-personalizada) - [Pular limpeza](#pular-limpeza) - [Cache de tradução](#cache-de-tradução) - [Implantação como serviços públicos](#implantação-como-serviços-públicos) - [Autenticação e página de boas-vindas](#autenticação-e-página-de-boas-vindas) - [Suporte a Glossário](#suporte-a-glossário)
ru: - [Аргументы командной строки](#аргументы-командной-строки) - [Руководство по настройке ограничения скорости](#руководство-по-настройке-ограничения-скорости) - [Частичный перевод](#частичный-перевод) - [Указание исходного и целевого языков](#указание-исходного-и-целевого-языков) - [Перевод с исключениями](#перевод-с-исключениями) - [Пользовательский промпт](#пользовательский-промпт) - [Пользовательская конфигурация](#пользовательская-конфигурация) - [Пропуск очистки](#пропуск-очистки) - [Кеширование перевода](#кеширование-перевода) - [Развертывание как публичный сервис](#развертывание-как-публичный-сервис) - [Аутентификация и приветственная страница](#аутентификация-и-приветственная-страница) - [Поддержка глоссария](#поддержка-глоссария)

# chunk_3BF1A9B5
source: #### Command Line Args
de: #### Kommandozeilen-Argumente
fr: #### Arguments de ligne de commande
it: #### Argomenti della riga di comando
pt: #### Argumentos da Linha de Comando
ru: #### Аргументы командной строки
