Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_0CA60CFA
source: | `--translate-table-text` | Translate table text (experimental) | `pdf2zh_next example.pdf --translate-table-text` |
de: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--translate-table-text-method` | How to translate table text, `inner` or `markdown` (experimental) | `pdf2zh_next example.pdf --translate-table-text --translate-table-text-method markdown` | | `--translate-table-text-delimiter` | Delimiter used to separate table cells when using the `markdown` method (experimental) | `pdf2zh_next example.pdf --translate-table-text --translate-table-text-method markdown --translate-table-text-delimiter "\\|"` | --- ### TRANSLATION RESULT | `--translate-table-text` | Tabellentext übersetzen (experimentell) | `pdf2zh_next example.pdf --translate-table-text` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--translate-table-text-method` | Methode zum Übersetzen von Tabellentext, `inner` oder `markdown` (experimentell) | `pdf2zh_next example.pdf --translate-table-text --translate-table-text-method markdown` | | `--translate-table-text-delimiter` | Trennzeichen zur Trennung von Tabellenzellen bei Verwendung der `markdown`-Methode (experimentell) | `pdf2zh_next example.pdf --translate-table-text --translate-table-text-method markdown --translate-table-text-delimiter "\\|"` |
fr: | :------------------------------ | :-------------------------------------------------------------------------------------- | :--------------------------------------------------------------------------------------------------------------------- | | `--translate-figure-text` | Translate figure text (experimental) | `pdf2zh_next example.pdf --translate-figure-text` | | `--translate-algorithm-text` | Translate algorithm text (experimental) | `pdf2zh_next example.pdf --translate-algorithm-text` | | `--translate-equation-text` | Translate equation text (experimental) | `pdf2zh_next example.pdf --translate-equation-text` | | `--translate-reference-text` | Translate reference text (experimental) | `pdf2zh_next example.pdf --translate-reference-text` | | `--translate-citation-text` | Translate citation text (experimental) | `pdf2zh_next example.pdf --translate-citation-text` | | `--translate-footnote-text` | Translate footnote text (experimental) | `pdf2zh_next example.pdf --translate-footnote-text` | | `--translate-header-text` | Translate header text (experimental) | `pdf2zh_next example.pdf --translate-header-text` | | `--translate-footer-text` | Translate footer text (experimental) | `pdf2zh_next example.pdf --translate-footer-text` | --- ### TRANSLATION | `--translate-table-text` | Traduire le texte des tableaux (expérimental) | `pdf2zh_next example.pdf --translate-table-text` | | :------------------------------ | :-------------------------------------------------------------------------------------- | :--------------------------------------------------------------------------------------------------------------------- | | `--translate-figure-text` | Traduire le texte des figures (expérimental) | `pdf2zh_next example.pdf --translate-figure-text` | | `--translate-algorithm-text` | Traduire le texte des algorithmes (expérimental) | `pdf2zh_next example.pdf --translate-algorithm-text` | | `--translate-equation-text` | Traduire le texte des équations (expérimental) | `pdf2zh_next example.pdf --translate-equation-text` | | `--translate-reference-text` | Traduire le texte des références (expérimental) | `pdf2zh_next example.pdf --translate-reference-text` | | `--translate-citation-text` | Traduire le texte des citations (expérimental) | `pdf2zh_next example.pdf --translate-citation-text` | | `--translate-footnote-text` | Traduire le texte des notes de bas de page (expérimental) | `pdf2zh_next example.pdf --translate-footnote-text` | | `--translate-header-text` | Traduire le texte de l'en-tête (expérimental) | `pdf2zh_next example.pdf --translate-header-text` | | `--translate-footer-text` | Traduire le texte du pied de page (expérimental) | `pdf2zh_next example.pdf --translate-footer-text` |
it: | :------------------------------ | :-------------------------------------------------------------------------------------- | :-------------------------------------------------------------------------------------------------------------------- | | `--translate-table-text-max-len` | Maximum number of characters in a table cell to be translated (default: 200) | `pdf2zh_next example.pdf --translate-table-text-max-len 500` | | `--translate-text-max-len` | Maximum number of characters in a text block to be translated (default: 500) | `pdf2zh_next example.pdf --translate-text-max-len 1000` | | `--translate-text-min-len` | Minimum number of characters in a text block to be translated (default: 0) | `pdf2zh_next example.pdf --translate-text-min-len 10` | | `--translate-text-max-line` | Maximum number of lines in a text block to be translated (default: 10) | `pdf2zh_next example.pdf --translate-text-max-line 20` | | `--translate-text-min-line` | Minimum number of lines in a text block to be translated (default: 0) | `pdf2zh_next example.pdf --translate-text-min-line 1` | | `--translate-text-split-len` | Split text block into smaller chunks if it exceeds this length (default: 500) | `pdf2zh_next example.pdf --translate-text-split-len 1000` | | `--translate-text-split-line` | Split text block into smaller chunks if it exceeds this number of lines (default: 10) | `pdf2zh_next example.pdf --translate-text-split-line 20` | --- ### OUTPUT | `--translate-table-text` | Tradurre il testo della tabella (sperimentale) | `pdf2zh_next example.pdf --translate-table-text` | | :------------------------------ | :-------------------------------------------------------------------------------------- | :-------------------------------------------------------------------------------------------------------------------- | | `--translate-table-text-max-len` | Numero massimo di caratteri in una cella di tabella da tradurre (predefinito: 200) | `pdf2zh_next example.pdf --translate-table-text-max-len 500` | | `--translate-text-max-len` | Numero massimo di caratteri in un blocco di testo da tradurre (predefinito: 500) | `pdf2zh_next example.pdf --translate-text-max-len 1000` | | `--translate-text-min-len` | Numero minimo di caratteri in un blocco di testo da tradurre (predefinito: 0) | `pdf2zh_next example.pdf --translate-text-min-len 10` | | `--translate-text-max-line` | Numero massimo di righe in un blocco di testo da tradurre (predefinito: 10) | `pdf2zh_next example.pdf --translate-text-max-line 20` | | `--translate-text-min-line` | Numero minimo di righe in un blocco di testo da tradurre (predefinito: 0) | `pdf2zh_next example.pdf --translate-text-min-line 1` | | `--translate-text-split-len` | Suddividere il blocco di testo in blocchi più piccoli se supera questa lunghezza (predefinito: 500) | `pdf2zh_next example.pdf --translate-text-split-len 1000` | | `--translate-text-split-line` | Suddividere il blocco di testo in blocchi più piccoli se supera questo numero di righe (predefinito: 10) | `pdf2zh_next example.pdf --translate-text-split-line 20` |
pt: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--translate-table-text-method` | Method for translating table text, `row` or `col` (default: `row`) | `pdf2zh_next example.pdf --translate-table-text --translate-table-text-method col` | | `--translate-table-text-limit` | Limit the number of rows or columns to translate (default: `10`) | `pdf2zh_next example.pdf --translate-table-text --translate-table-text-limit 5` | | `--translate-table-text-split` | Split table text into multiple parts for translation (default: `false`) | `pdf2zh_next example.pdf --translate-table-text --translate-table-text-split` | | `--translate-table-text-split-limit` | Limit the number of rows or columns to split (default: `5`) | `pdf2zh_next example.pdf --translate-table-text --translate-table-text-split --translate-table-text-split-limit 3` | --- ### OUTPUT | `--translate-table-text` | Traduzir texto de tabela (experimental) | `pdf2zh_next example.pdf --translate-table-text` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--translate-table-text-method` | Método para traduzir texto de tabela, `row` ou `col` (padrão: `row`) | `pdf2zh_next example.pdf --translate-table-text --translate-table-text-method col` | | `--translate-table-text-limit` | Limitar o número de linhas ou colunas a traduzir (padrão: `10`) | `pdf2zh_next example.pdf --translate-table-text --translate-table-text-limit 5` | | `--translate-table-text-split` | Dividir texto de tabela em várias partes para tradução (padrão: `false`) | `pdf2zh_next example.pdf --translate-table-text --translate-table-text-split` | | `--translate-table-text-split-limit` | Limitar o número de linhas ou colunas para dividir (padrão: `5`) | `pdf2zh_next example.pdf --translate-table-text --translate-table-text-split --translate-table-text-split-limit 3` |
ru: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--translate-table-text-method` | Method to translate table text, choose from `row`, `col`, `cell` (default: `row`) | `pdf2zh_next example.pdf --translate-table-text --translate-table-text-method=cell` | | `--translate-table-text-split` | Whether to split table text, which may improve translation accuracy (default: `false`) | `pdf2zh_next example.pdf --translate-table-text --translate-table-text-split` | | `--translate-table-text-merge` | Whether to merge table text, which may improve translation accuracy (default: `false`) | `pdf2zh_next example.pdf --translate-table-text --translate-table-text-merge` | | `--translate-table-text-limit` | The maximum number of words in a table text (default: `1000`) | `pdf2zh_next example.pdf --translate-table-text --translate-table-text-limit=500` | | `--translate-table-text-retry` | The maximum number of retries for table text translation (default: `3`) | `pdf2zh_next example.pdf --translate-table-text --translate-table-text-retry=5` | --- ### TRANSLATION RESULT | `--translate-table-text` | Перевести текст таблицы (экспериментальная функция) | `pdf2zh_next example.pdf --translate-table-text` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--translate-table-text-method` | Метод перевода текста таблицы, выбирается из `row`, `col`, `cell` (по умолчанию: `row`) | `pdf2zh_next example.pdf --translate-table-text --translate-table-text-method=cell` | | `--translate-table-text-split` | Разделять ли текст таблицы, что может повысить точность перевода (по умолчанию: `false`) | `pdf2zh_next example.pdf --translate-table-text --translate-table-text-split` | | `--translate-table-text-merge` | Объединять ли текст таблицы, что может повысить точность перевода (по умолчанию: `false`) | `pdf2zh_next example.pdf --translate-table-text --translate-table-text-merge` | | `--translate-table-text-limit` | Максимальное количество слов в тексте таблицы (по умолчанию: `1000`) | `pdf2zh_next example.pdf --translate-table-text --translate-table-text-limit=500` | | `--translate-table-text-retry` | Максимальное количество повторных попыток перевода текста таблицы (по умолчанию: `3`) | `pdf2zh_next example.pdf --translate-table-text --translate-table-text-retry=5` |
