Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_994E96A8
source: This Code of Conduct is adapted from the [Contributor Covenant][homepage], version 2.0, available at https://www.contributor-covenant.org/version/2/0/code_of_conduct.html. Community Impact Guidelines were inspired by [Mozilla's code of conduct enforcement ladder](https://github.com/mozilla/diversity). [homepage]: https://www.contributor-covenant.org For answers to common questions about this code of conduct, see the FAQ at https://www.contributor-covenant.org/faq. Translations are available at https://www.contributor-covenant.org/translations.
de: Dieser Verhaltenskodex ist angelehnt an den [Contributor Covenant][homepage], Version 2.0, verfügbar unter https://www.contributor-covenant.org/version/2/0/code_of_conduct.html. Die Richtlinien zur Gemeinschaftsauswirkung wurden inspiriert von [Mozillas Leiter zur Durchsetzung des Verhaltenskodex](https://github.com/mozilla/diversity). [homepage]: https://www.contributor-covenant.org Antworten auf häufig gestellte Fragen zu diesem Verhaltenskodex finden Sie in den FAQ unter https://www.contributor-covenant.org/faq. Übersetzungen sind verfügbar unter https://www.contributor-covenant.org/translations.
fr: Ce Code de Conduite est adapté du [Contributor Covenant][homepage], version 2.0, disponible à l'adresse https://www.contributor-covenant.org/version/2/0/code_of_conduct.html. Les directives d'impact communautaire ont été inspirées par [l'échelle d'application du code de conduite de Mozilla](https://github.com/mozilla/diversity). [homepage]: https://www.contributor-covenant.org Pour les réponses aux questions courantes concernant ce code de conduite, consultez la FAQ à l'adresse https://www.contributor-covenant.org/faq. Les traductions sont disponibles sur https://www.contributor-covenant.org/translations.
it: Questo Codice di Condotta è adattato dal [Contributor Covenant][homepage], versione 2.0, disponibile all'indirizzo https://www.contributor-covenant.org/version/2/0/code_of_conduct.html. Le Linee Guida sull'Impatto della Comunità sono state ispirate dalla [scala di applicazione del codice di condotta di Mozilla](https://github.com/mozilla/diversity). [homepage]: https://www.contributor-covenant.org Per risposte alle domande comuni su questo codice di condotta, consulta le Domande frequenti all'indirizzo https://www.contributor-covenant.org/faq. Le traduzioni sono disponibili all'indirizzo https://www.contributor-covenant.org/translations.
pt: Este Código de Conduta é adaptado do [Contributor Covenant][homepage], versão 2.0, disponível em https://www.contributor-covenant.org/version/2/0/code_of_conduct.html. As Diretrizes de Impacto na Comunidade foram inspiradas pela [escada de aplicação do código de conduta da Mozilla](https://github.com/mozilla/diversity). [homepage]: https://www.contributor-covenant.org Para respostas a perguntas comuns sobre este código de conduta, consulte as Perguntas frequentes em https://www.contributor-covenant.org/faq. Traduções estão disponíveis em https://www.contributor-covenant.org/translations.
ru: Этот Кодекс поведения адаптирован из [Contributor Covenant][homepage], версия 2.0, доступен по адресу https://www.contributor-covenant.org/version/2/0/code_of_conduct.html. Руководящие принципы воздействия на сообщество были вдохновлены [лестницей применения кодекса поведения Mozilla](https://github.com/mozilla/diversity). [homepage]: https://www.contributor-covenant.org Ответы на часто задаваемые вопросы об этом кодексе поведения можно найти в разделе FAQ по адресу https://www.contributor-covenant.org/faq. Переводы доступны по адресу https://www.contributor-covenant.org/translations.

# chunk_BBFC419C
source: Some questions are frequently asked, so we have provided a list for users who encounter similar issues.
de: Einige Fragen werden häufig gestellt, daher haben wir eine Liste für Benutzer bereitgestellt, die ähnliche Probleme haben.
fr: Certaines questions sont fréquemment posées, nous avons donc fourni une liste pour les utilisateurs qui rencontrent des problèmes similaires.
it: Alcune domande vengono poste frequentemente, quindi abbiamo fornito un elenco per gli utenti che incontrano problemi simili.
pt: Algumas perguntas são frequentemente feitas, por isso fornecemos uma lista para usuários que encontram problemas semelhantes.
ru: Некоторые вопросы задаются часто, поэтому мы предоставили список для пользователей, которые сталкиваются с подобными проблемами.

# chunk_2B5D23E7
source: ## Is a GPU required?
de: ## Wird eine GPU benötigt?
fr: ## Un GPU est-il nécessaire ?
it: ## È necessaria una GPU?
pt: ## É necessária uma GPU?
ru: ## Требуется ли GPU?

# chunk_A85F81AE
source: - **Question**:
de: - **Frage**:
fr: - **Question**: - **Question**:
it: - **Domanda**:
pt: - **Pergunta**:
ru: - **Вопрос**:

# chunk_8E573398
source: As the program uses artificial intelligence to recognize and extract documents, is GPU required?
de: Da das Programm künstliche Intelligenz zur Erkennung und Extraktion von Dokumenten verwendet, wird eine GPU benötigt?
fr: Le programme utilise l'intelligence artificielle pour reconnaître et extraire des documents, un GPU est-il nécessaire ?
it: Il programma utilizza l'intelligenza artificiale per riconoscere ed estrarre documenti, è necessaria una GPU?
pt: Como o programa usa inteligência artificial para reconhecer e extrair documentos, é necessária uma GPU?
ru: Поскольку программа использует искусственный интеллект для распознавания и извлечения документов, требуется ли GPU?

# chunk_FE846FC9
source: - **Answer**:
de: - **Antwort**:
fr: - **Réponse** :
it: - **Risposta**:
pt: - **Resposta**:
ru: - **Ответ**:

# chunk_63C892F6
source: **GPU is not required.** But if you have a GPU, the program will automatically use it for higher performance.
de: **Eine GPU ist nicht erforderlich.** Aber wenn Sie eine GPU haben, wird das Programm diese automatisch für eine höhere Leistung nutzen.
fr: **Un GPU n'est pas nécessaire.** Mais si vous avez un GPU, le programme l'utilisera automatiquement pour une meilleure performance.
it: **Non è necessaria una GPU.** Ma se hai una GPU, il programma la utilizzerà automaticamente per prestazioni più elevate.
pt: **Não é necessária uma GPU.** Mas se você tiver uma GPU, o programa irá usá-la automaticamente para melhor desempenho.
ru: **GPU не требуется.** Но если у вас есть GPU, программа автоматически использует его для повышения производительности.

# chunk_610DD2DC
source: ## Downloading interrupted?
de: ## Download unterbrochen?
fr: ## Téléchargement interrompu ?
it: ## Download interrotta?
pt: ## Download interrompido?
ru: ## Загрузка прервана?

# chunk_53B66922
source: I encountered the following interrupt error while downloading the model. What should I do?
de: Ich bin beim Herunterladen des Modells auf den folgenden Unterbrechungsfehler gestoßen. Was soll ich tun?
fr: J'ai rencontré l'erreur d'interruption suivante lors du téléchargement du modèle. Que dois-je faire ?
it: Ho riscontrato il seguente errore di interruzione durante il download del modello. Cosa devo fare?
pt: Encontrei o seguinte erro de interrupção ao baixar o modelo. O que devo fazer?
ru: При загрузке модели я столкнулся со следующей ошибкой прерывания. Что мне делать?

# chunk_2A133C40
source: The network is receiving interference, please use a stable network link or try to bypass network intervention.
de: Das Netzwerk erfährt Störungen, bitte verwenden Sie eine stabile Netzwerkverbindung oder versuchen Sie, die Netzwerkintervention zu umgehen.
fr: Le réseau subit des interférences, veuillez utiliser une connexion réseau stable ou essayer de contourner l'intervention du réseau.
it: La rete sta subendo interferenze, utilizza un collegamento di rete stabile o prova a bypassare l'intervento della rete.
pt: A rede está sofrendo interferência, por favor use uma conexão de rede estável ou tente contornar a intervenção da rede.
ru: Сеть подвергается помехам, пожалуйста, используйте стабильное сетевое соединение или попробуйте обойти вмешательство в сеть.

# chunk_ABB33668
source: ## How to update to the latest version?
de: ## Wie aktualisiert man auf die neueste Version?
fr: ## Comment mettre à jour vers la dernière version ?
it: ## Come aggiornare all'ultima versione?
pt: ## Como atualizar para a versão mais recente?
ru: ## Как обновиться до последней версии?

# chunk_981A22AF
source: I want to use some of the features of the latest version, how do I update it?
de: Ich möchte einige Funktionen der neuesten Version nutzen, wie aktualisiere ich sie?
fr: Je souhaite utiliser certaines fonctionnalités de la dernière version, comment puis-je la mettre à jour ?
it: Voglio utilizzare alcune funzionalità dell'ultima versione, come posso aggiornarla?
pt: Quero usar alguns dos recursos da versão mais recente, como posso atualizá-la?
ru: Я хочу использовать некоторые функции последней версии, как мне обновиться?

# chunk_9FB0E3EA
source: ## The following files do not exist: example.pdf
de: ## Die folgenden Dateien existieren nicht: example.pdf
fr: ## Les fichiers suivants n'existent pas : example.pdf
it: ## I seguenti file non esistono: example.pdf
pt: ## Os seguintes arquivos não existem: example.pdf
ru: ## Следующие файлы не существуют: example.pdf

# chunk_22B1E6C4
source: - **Issue**:
de: - **Problem**:
fr: - **Problème** :
it: - **Problema**:
pt: - **Problema**:
ru: - **Проблема**:

# chunk_FAB807CC
source: When executing the program, users would have the following outputs: `The following files do not exist: example.pdf` if the document was not found.
de: Beim Ausführen des Programms erhalten Benutzer die folgende Ausgabe: `The following files do not exist: example.pdf`, wenn das Dokument nicht gefunden wurde.
fr: Lors de l'exécution du programme, les utilisateurs auront les sorties suivantes : `The following files do not exist: example.pdf` si le document n'a pas été trouvé.
it: Durante l'esecuzione del programma, gli utenti otterranno i seguenti output: `The following files do not exist: example.pdf` se il documento non è stato trovato.
pt: Ao executar o programa, os usuários terão as seguintes saídas: `Os seguintes arquivos não existem: example.pdf` se o documento não for encontrado.
ru: При выполнении программы пользователи могут получить следующие сообщения: `The following files do not exist: example.pdf`, если документ не был найден.

# chunk_E7371FD6
source: - **Solution**: - Open the command line in the directory where the file is located, or - Enter the full path of the file directly after pdf2zh, or - Use the interactive mode `pdf2zh -i` to drag and drop files directly
de: - **Lösung**: - Öffnen Sie die Kommandozeile in dem Verzeichnis, in dem sich die Datei befindet, oder - Geben Sie den vollständigen Pfad der Datei direkt nach pdf2zh ein, oder - Verwenden Sie den interaktiven Modus `pdf2zh -i`, um Dateien direkt per Drag & Drop einzufügen
fr: - **Solution** : - Ouvrez la ligne de commande dans le répertoire où se trouve le fichier, ou - Entrez le chemin complet du fichier directement après pdf2zh, ou - Utilisez le mode interactif `pdf2zh -i` pour glisser-déposer les fichiers directement
it: - **Soluzione**: - Apri la riga di comando nella directory in cui si trova il file, oppure - Inserisci il percorso completo del file direttamente dopo pdf2zh, oppure - Usa la modalità interattiva `pdf2zh -i` per trascinare e rilasciare i file direttamente
pt: - **Solução**: - Abra a linha de comando no diretório onde o arquivo está localizado, ou - Insira o caminho completo do arquivo diretamente após pdf2zh, ou - Use o modo interativo `pdf2zh -i` para arrastar e soltar arquivos diretamente
ru: - **Решение**: - Откройте командную строку в директории, где находится файл, или - Введите полный путь к файлу непосредственно после pdf2zh, или - Используйте интерактивный режим `pdf2zh -i` для прямого перетаскивания файлов

# chunk_F523458B
source: ## SSL Error and Other Network Issues
de: ## SSL-Fehler und andere Netzwerkprobleme
fr: ## Erreur SSL et autres problèmes réseau
it: ## Errore SSL e altri problemi di rete Se riscontri errori SSL o altri problemi di rete durante l'utilizzo di `pdf2zh`, segui questi passaggi per risolverli: 1. **Verifica la connessione Internet**: - Assicurati che il tuo dispositivo sia connesso a Internet. - Prova ad accedere ad altri siti web per verificare la connessione. 2. **Aggiorna i certificati SSL**: - Su Windows, esegui `certmgr.msc` e aggiorna i certificati. - Su macOS/Linux, esegui `sudo update-ca-certificates`. 3. **Disabilita temporaneamente il firewall/antivirus**: - Alcuni firewall o software antivirus potrebbero bloccare la connessione. Prova a disabilitarli temporaneamente. 4. **Usa una VPN o cambia rete**: - Prova a connetterti tramite una VPN o cambia rete (ad esempio, da Wi-Fi a dati mobili). 5. **Controlla la data e l'ora del sistema**: - Un'ora o data errata può causare errori SSL. Assicurati che siano corrette. Se il problema persiste, contatta il supporto tecnico fornendo i dettagli dell'errore.
pt: ## Erro SSL e Outros Problemas de Rede [!NOTE] If you encounter SSL errors or other network issues when using **pdf2zh**, please try the following solutions: 1. **Check Your Internet Connection**: Ensure your device is connected to the internet and can access other websites normally. 2. **Update Your System's Root Certificates**: - On **Windows**, run `certmgr.msc` and update the certificates. - On **macOS**, use `Keychain Access` to update the certificates. - On **Linux**, run `sudo update-ca-certificates`. 3. **Disable SSL Verification (Not Recommended)**: - Add `--no-ssl-verify` to the command line when using **pdf2zh**. - Example: `pdf2zh --no-ssl-verify input.pdf`. 4. **Use a Proxy**: - If you are in a region with network restrictions, try using a proxy or VPN. 5. **Check the Server Status**: - Visit [PDFMathTranslate Status Page](https://status.pdf2zh.com) to see if there are any ongoing issues. If the problem persists, please contact our [Community](#community) or check the [FAQ](#faq) for more help.
ru: ## Ошибка SSL и другие сетевые проблемы

# chunk_DF99BBC1
source: When downloading hugging face models, users in China may get network error. For example, in [issue #55](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/issues/55), [#70](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/issues/70).
de: Beim Herunterladen von Hugging-Face-Modellen können Benutzer in China Netzwerkfehler erhalten. Zum Beispiel in [issue #55](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/issues/55), [#70](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/issues/70).
fr: Lors du téléchargement des modèles de hugging face, les utilisateurs en Chine peuvent rencontrer des erreurs réseau. Par exemple, dans [issue #55](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/issues/55), [#70](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/issues/70).
it: Durante il download dei modelli di Hugging Face, gli utenti in Cina potrebbero riscontrare errori di rete. Ad esempio, nei [issue #55](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/issues/55), [#70](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/issues/70).
pt: Ao baixar modelos do Hugging Face, usuários na China podem encontrar erros de rede. Por exemplo, nos [issues #55](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/issues/55), [#70](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/issues/70).
ru: При загрузке моделей с hugging face пользователи из Китая могут столкнуться с сетевой ошибкой. Например, в [issue #55](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/issues/55), [#70](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/issues/70).

# chunk_AC4D20E5
source: - **Solution**: - [Bypass GFW](https://github.com/clash-verge-rev/clash-verge-rev). - [Use Hugging Face Mirror](https://hf-mirror.com/). - [Use Portable version](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next?tab=readme-ov-file#method-ii-portable). - [Use Docker instead](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next#docker). - [Update Certificates](https://stackoverflow.com/questions/51925384/unable-to-get-local-issuer-certificate-when-using-requests), as suggested in [issue #55](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/issues/55).
de: - **Lösung**: - [GFW umgehen](https://github.com/clash-verge-rev/clash-verge-rev). - [Hugging Face Mirror verwenden](https://hf-mirror.com/). - [Portable Version verwenden](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next?tab=readme-ov-file#method-ii-portable). - [Stattdessen Docker verwenden](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next#docker). - [Zertifikate aktualisieren](https://stackoverflow.com/questions/51925384/unable-to-get-local-issuer-certificate-when-using-requests), wie in [Issue #55](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/issues/55) vorgeschlagen.
fr: - **Solution** : - [Contourner le GFW](https://github.com/clash-verge-rev/clash-verge-rev). - [Utiliser le miroir Hugging Face](https://hf-mirror.com/). - [Utiliser la version portable](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next?tab=readme-ov-file#method-ii-portable). - [Utiliser Docker à la place](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next#docker). - [Mettre à jour les certificats](https://stackoverflow.com/questions/51925384/unable-to-get-local-issuer-certificate-when-using-requests), comme suggéré dans [issue #55](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/issues/55).
it: - **Soluzione**: - [Bypass GFW](https://github.com/clash-verge-rev/clash-verge-rev). - [Usa Hugging Face Mirror](https://hf-mirror.com/). - [Usa la versione portatile](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next?tab=readme-ov-file#method-ii-portable). - [Usa Docker invece](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next#docker). - [Aggiorna i certificati](https://stackoverflow.com/questions/51925384/unable-to-get-local-issuer-certificate-when-using-requests), come suggerito nell'[issue #55](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/issues/55).
pt: - **Solução**: - [Bypass GFW](https://github.com/clash-verge-rev/clash-verge-rev). - [Usar Espelho do Hugging Face](https://hf-mirror.com/). - [Usar versão Portátil](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next?tab=readme-ov-file#method-ii-portable). - [Usar Docker em vez disso](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next#docker). - [Atualizar Certificados](https://stackoverflow.com/questions/51925384/unable-to-get-local-issuer-certificate-when-using-requests), como sugerido em [issue #55](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/issues/55).
ru: - **Решение**: - [Обход GFW](https://github.com/clash-verge-rev/clash-verge-rev). - [Использовать зеркало Hugging Face](https://hf-mirror.com/). - [Использовать портативную версию](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next?tab=readme-ov-file#method-ii-portable). - [Использовать Docker](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next#docker). - [Обновить сертификаты](https://stackoverflow.com/questions/51925384/unable-to-get-local-issuer-certificate-when-using-requests), как предложено в [issue #55](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/issues/55).

# chunk_8AA448AC
source: ## Localhost is not accessible
de: ## Localhost ist nicht erreichbar
fr: ## Localhost n'est pas accessible
it: ## Localhost non è accessibile
pt: ## O localhost não está acessível
ru: ## Локальный хост недоступен

# chunk_4E814B7B
source: Please see below.
de: Bitte sehen Sie unten.
fr: Veuillez voir ci-dessous.
it: Per favore, vedi sotto.
pt: Por favor, veja abaixo.
ru: Пожалуйста, смотрите ниже.

# chunk_EA897629
source: ## Error launching GUI using 0.0.0.0
de: ## Fehler beim Starten der GUI mit 0.0.0.0
fr: ## Erreur lors du lancement de l'interface graphique avec 0.0.0.0
it: ## Errore durante l'avvio della GUI utilizzando 0.0.0.0
pt: ## Erro ao iniciar a GUI usando 0.0.0.0
ru: ## Ошибка запуска GUI с использованием 0.0.0.0

# chunk_D65A22CE
source: Using proxy software in global mode may prevent Gradio from starting properly. For example, in [issue #77](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/issues/77).
de: Die Verwendung von Proxy-Software im globalen Modus kann verhindern, dass Gradio ordnungsgemäß startet. Zum Beispiel in [issue #77](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/issues/77).
fr: L'utilisation d'un logiciel proxy en mode global peut empêcher Gradio de démarrer correctement. Par exemple, dans [issue #77](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/issues/77).
it: L'utilizzo di software proxy in modalità globale potrebbe impedire il corretto avvio di Gradio. Ad esempio, nel [issue #77](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/issues/77).
pt: O uso de software de proxy no modo global pode impedir que o Gradio seja iniciado corretamente. Por exemplo, no [issue #77](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/issues/77).
ru: Использование прокси-программ в глобальном режиме может помешать правильному запуску Gradio. Например, в [issue #77](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/issues/77).

# chunk_587F7FBA
source: - **Solution**:
de: - **Lösung**:
it: - **Soluzione**:
pt: - **Solução**:
ru: - **Решение**:

# chunk_E7C819A4
source: Use rule mode
de: Verwenden Sie den Regelmodus
fr: Utiliser le mode règle
it: Modalità di utilizzo delle regole
pt: Usar modo de regra
ru: Использовать режим правил
