Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_A884E4C7
source: | `--pool-max-workers` | Maximum number of workers for translation pool. If not set, will use qps as the number of workers | `pdf2zh_next example.pdf --pool-max-workers 100` |
de: `number` | | `--pool-min-workers` | Minimum number of workers for translation pool. If not set, will use qps as the number of workers | `pdf2zh_next example.pdf --pool-min-workers 10` | `number` | | `--pool-max-tasks-per-child` | Maximum number of tasks per worker before it is replaced with a new one | `pdf2zh_next example.pdf --pool-max-tasks-per-child 100` | `number` | | `--pool-max-tasks-queued` | Maximum number of tasks that can be queued for execution in the pool | `pdf2zh_next example.pdf --pool-max-tasks-queued 1000` | `number` | --- ### TRANSLATION RESULT | `--pool-max-workers` | Maximale Anzahl von Workern für den Übersetzungspool. Wenn nicht festgelegt, wird qps als Anzahl der Worker verwendet | `pdf2zh_next example.pdf --pool-max-workers 100` | `number` | | `--pool-min-workers` | Minimale Anzahl von Workern für den Übersetzungspool. Wenn nicht festgelegt, wird qps als Anzahl der Worker verwendet | `pdf2zh_next example.pdf --pool-min-workers 10` | `number` | | `--pool-max-tasks-per-child` | Maximale Anzahl von Aufgaben pro Worker, bevor dieser durch einen neuen ersetzt wird | `pdf2zh_next example.pdf --pool-max-tasks-per-child 100` | `number` | | `--pool-max-tasks-queued` | Maximale Anzahl von Aufgaben, die für die Ausführung im Pool in die Warteschlange gestellt werden können | `pdf2zh_next example.pdf --pool-max-tasks-queued 1000` | `number` |
fr: | `--pool-max-workers` | Nombre maximum de travailleurs pour le pool de traduction. Si non défini, utilisera qps comme nombre de travailleurs | `pdf2zh_next example.pdf --pool-max-workers 100` |
it: | ------------------------------- | ------------------------------------------------------------------------------------------------ | ----------------------------------------------------------------------------------------------------------- | | `--pool-max-workers-per-domain` | Maximum number of workers for each domain. If not set, will use qps as the number of workers | `pdf2zh_next example.pdf --pool-max-workers-per-domain 100` | | `--pool-max-tasks-per-child` | Maximum number of tasks per worker before it gets replaced by a new one | `pdf2zh_next example.pdf --pool-max-tasks-per-child 100` | --- ### TRANSLATION RESULT | `--pool-max-workers` | Numero massimo di worker per il pool di traduzione. Se non impostato, verrà utilizzato qps come numero di worker | `pdf2zh_next example.pdf --pool-max-workers 100` | | ------------------------------- | ---------------------------------------------------------------------------------------------------------------- | ----------------------------------------------------------------------------------------------------------- | | `--pool-max-workers-per-domain` | Numero massimo di worker per ogni dominio. Se non impostato, verrà utilizzato qps come numero di worker | `pdf2zh_next example.pdf --pool-max-workers-per-domain 100` | | `--pool-max-tasks-per-child` | Numero massimo di task per worker prima che venga sostituito da uno nuovo | `pdf2zh_next example.pdf --pool-max-tasks-per-child 100` |
pt: | ------------------------------- | ------------------------------------------------------------------------------------------------ | ---------------------------------------------------------------------------------------------------------- | | `--pool-max-workers-per-service` | Maximum number of workers for each translation service. If not set, will use 10 | `pdf2zh_next example.pdf --pool-max-workers-per-service 10` | | `--pool-max-retries` | Maximum number of retries for translation pool. If not set, will use 3 | `pdf2zh_next example.pdf --pool-max-retries 3` | --- ### OUTPUT | `--pool-max-workers` | Número máximo de workers para o pool de tradução. Se não for definido, usará o qps como o número de workers | `pdf2zh_next example.pdf --pool-max-workers 100` | | ------------------------------- | ----------------------------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------- | | `--pool-max-workers-per-service` | Número máximo de workers para cada serviço de tradução. Se não for definido, usará 10 | `pdf2zh_next example.pdf --pool-max-workers-per-service 10` | | `--pool-max-retries` | Número máximo de tentativas para o pool de tradução. Se não for definido, usará 3 | `pdf2zh_next example.pdf --pool-max-retries 3` |
ru: `number` | `-` | |---------------------------------|---------------------------------------------------------------------------------------------------|------------------------------------------------------------------------------------------------------------|-----------|-------| | `--pool-timeout` | Timeout for translation pool. If not set, will use 10 seconds | `pdf2zh_next example.pdf --pool-timeout 60` | `number` | `-` | | `--pool-queue-size` | Queue size for translation pool. If not set, will use 1000 | `pdf2zh_next example.pdf --pool-queue-size 1000` | `number` | `-` | | `--pool-max-retries` | Maximum retries for translation pool. If not set, will use 3 | `pdf2zh_next example.pdf --pool-max-retries 5` | `number` | `-` | | `--pool-retry-delay` | Delay between retries for translation pool. If not set, will use 1 second | `pdf2zh_next example.pdf --pool-retry-delay 2` | `number` | `-` | --- ### TRANSLATION | `--pool-max-workers` | Максимальное количество воркеров для пула переводов. Если не установлено, будет использоваться qps в качестве количества воркеров | `pdf2zh_next example.pdf --pool-max-workers 100` | `number` | `-` | |---------------------------------|---------------------------------------------------------------------------------------------------|------------------------------------------------------------------------------------------------------------|-----------|-------| | `--pool-timeout` | Таймаут для пула переводов. Если не установлено, будет использоваться 10 секунд | `pdf2zh_next example.pdf --pool-timeout 60` | `number` | `-` | | `--pool-queue-size` | Размер очереди для пула переводов. Если не установлено, будет использоваться 1000 | `pdf2zh_next example.pdf --pool-queue-size 1000` | `number` | `-` | | `--pool-max-retries` | Максимальное количество повторных попыток для пула переводов. Если не установлено, будет использоваться 3 | `pdf2zh_next example.pdf --pool-max-retries 5` | `number` | `-` | | `--pool-retry-delay` | Задержка между повторными попытками для пула переводов. Если не установлено, будет использоваться 1 секунда | `pdf2zh_next example.pdf --pool-retry-delay 2` | `number` | `-` |
