Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_C006E91B
source: | `--term-pool-max-workers` | Maximum number of workers for term extraction translation pool. If not set or 0, will follow pool_max_workers. | `pdf2zh_next example.pdf --term-pool-max-workers 40` |
de: | ------------------------------- | ------------------------------------------------------------------------------------------------------------- | ----------------------------------------------------------------------------------------------------- | | `--term-pool-max-workers-per-id` | Maximum number of workers for term extraction translation pool per language ID. If not set or 0, will follow pool_max_workers_per_id. | `pdf2zh_next example.pdf --term-pool-max-workers-per-id 2` | --- ### OUTPUT | `--term-pool-max-workers` | Maximale Anzahl von Arbeitern für den Übersetzungspool zur Begriffsentnahme. Wenn nicht gesetzt oder 0, folgt es pool_max_workers. | `pdf2zh_next example.pdf --term-pool-max-workers 40` | | ------------------------------- | ------------------------------------------------------------------------------------------------------------- | ----------------------------------------------------------------------------------------------------- | | `--term-pool-max-workers-per-id` | Maximale Anzahl von Arbeitern für den Übersetzungspool zur Begriffsentnahme pro Sprach-ID. Wenn nicht gesetzt oder 0, folgt es pool_max_workers_per_id. | `pdf2zh_next example.pdf --term-pool-max-workers-per-id 2` |
fr: | :------------------------------ | :------------------------------------------------------------------------------------------------------------- | :---------------------------------------------------------------------------------------------------- | | `--term-pool-max-workers` | Nombre maximum de travailleurs pour le pool de traduction d'extraction de termes. Si non défini ou 0, suivra pool_max_workers. | `pdf2zh_next example.pdf --term-pool-max-workers 40` | --- ### OUTPUT | `--term-pool-max-workers` | Nombre maximum de travailleurs pour le pool de traduction d'extraction de termes. Si non défini ou 0, suivra pool_max_workers. | `pdf2zh_next example.pdf --term-pool-max-workers 40` | | :------------------------------ | :------------------------------------------------------------------------------------------------------------- | :---------------------------------------------------------------------------------------------------- |
it: No | | ------------------------------- | ------------------------------------------------------------------------------------------------------------- | ----------------------------------------------------------------------------------------------------- | -------- | | `--term-pool-max-queue-size` | Maximum queue size for term extraction translation pool. | `pdf2zh_next example.pdf --term-pool-max-queue-size 1000` | No | | `--term-pool-timeout` | Timeout for term extraction translation pool. | `pdf2zh_next example.pdf --term-pool-timeout 100` | No | --- ### TRANSLATION RESULT | `--term-pool-max-workers` | Numero massimo di worker per il pool di traduzione dell'estrazione dei termini. Se non impostato o 0, seguirà pool_max_workers. | `pdf2zh_next example.pdf --term-pool-max-workers 40` | No | | ------------------------------- | ------------------------------------------------------------------------------------------------------------------------------ | ----------------------------------------------------------------------------------------------------- | -------- | | `--term-pool-max-queue-size` | Dimensione massima della coda per il pool di traduzione dell'estrazione dei termini. | `pdf2zh_next example.pdf --term-pool-max-queue-size 1000` | No | | `--term-pool-timeout` | Timeout per il pool di traduzione dell'estrazione dei termini. | `pdf2zh_next example.pdf --term-pool-timeout 100` | No |
pt: | ------------------------------- | -------------------------------------------------------------------------------------------------------------- | ----------------------------------------------------------------------------------------------------- | | `--term-pool-max-workers` | Número máximo de workers para o pool de tradução de extração de termos. Se não definido ou 0, seguirá pool_max_workers. | `pdf2zh_next example.pdf --term-pool-max-workers 40` | --- ### OUTPUT | `--term-pool-max-workers` | Número máximo de workers para o pool de tradução de extração de termos. Se não definido ou 0, seguirá pool_max_workers. | `pdf2zh_next example.pdf --term-pool-max-workers 40` | | ------------------------------- | -------------------------------------------------------------------------------------------------------------- | ----------------------------------------------------------------------------------------------------- | | `--term-pool-max-workers` | Número máximo de workers para o pool de tradução de extração de termos. Se não definido ou 0, seguirá pool_max_workers. | `pdf2zh_next example.pdf --term-pool-max-workers 40` |
ru: | | `--term-pool-max-workers` | Максимальное количество рабочих процессов для пула перевода терминов. Если не установлено или равно 0, следует за pool_max_workers. | `pdf2zh_next example.pdf --term-pool-max-workers 40` | | --- ### TRANSLATION ```markdown | `--term-pool-max-workers` | Максимальное количество рабочих процессов для пула перевода терминов. Если не установлено или равно 0, следует за pool_max_workers. | `pdf2zh_next example.pdf --term-pool-max-workers 40` | | ```
