Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_751A0C21
source: | `--formular-char-pattern` | Character pattern to identify formula text | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)"` |
de: | `--formular-char-pattern-replace` | Replacement text for the matched formula character pattern | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-replace "\\1"` | | `--formular-char-pattern-ignore` | Ignore formula character pattern matches | `pdf2zh_next example.pdf --formular-char-pattern-ignore "(MS.*)"` | | `--formular-char-pattern-ignore-replace` | Replacement text for ignored formula character pattern matches | `pdf2zh_next example.pdf --formular-char-pattern-ignore "(MS.*)" --formular-char-pattern-ignore-replace "\\1"` | | `--formular-preserve-color` | Preserve color information in formulas | `pdf2zh_next example.pdf --formular-preserve-color` | | `--formular-preserve-font-family` | Preserve font family information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-family` | | `--formular-preserve-font-size` | Preserve font size information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-size` | | `--formular-preserve-font-style` | Preserve font style information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-style` | | `--formular-preserve-font-weight`| Preserve font weight information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-weight` | | `--formular-preserve-font-variant`| Preserve font variant information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-variant` | | `--formular-preserve-font-stretch`| Preserve font stretch information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-stretch` | | `--formular-preserve-font-decoration`| Preserve font decoration information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-decoration` | | `--formular-preserve-font-kerning`| Preserve font kerning information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-kerning` | | `--formular-preserve-font-ligatures`| Preserve font ligatures information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-ligatures` | | `--formular-preserve-font-variant-ligatures`| Preserve font variant ligatures information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-variant-ligatures` | | `--formular-preserve-font-variant-caps`| Preserve font variant caps information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-variant-caps` | | `--formular-preserve-font-variant-numeric`| Preserve font variant numeric information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-variant-numeric` | | `--formular-preserve-font-variant-alternates`| Preserve font variant alternates information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-variant-alternates` | | `--formular-preserve-font-variant-east-asian`| Preserve font variant east asian information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-variant-east-asian` | | `--formular-preserve-font-variant-position`| Preserve font variant position information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-variant-position` | | `--formular-preserve-font-variant-emoji`| Preserve font variant emoji information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-variant-emoji` | | `--formular-preserve-font-variant-annotation`| Preserve font variant annotation information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-variant-annotation` | | `--formular-preserve-font-feature-settings`| Preserve font feature settings information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-feature-settings` | | `--formular-preserve-font-variation-settings`| Preserve font variation settings information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-variation-settings` | | `--formular-preserve-font-palette`| Preserve font palette information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-palette` | | `--formular-preserve-font-synthesis`| Preserve font synthesis information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-synthesis` | | `--formular-preserve-font-synthesis-weight`| Preserve font synthesis weight information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-synthesis-weight` | | `--formular-preserve-font-synthesis-style`| Preserve font synthesis style information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-synthesis-style` | | `--formular-preserve-font-synthesis-small-caps`| Preserve font synthesis small caps information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-synthesis-small-caps` | | `--formular-preserve-font-synthesis-position`| Preserve font synthesis position information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-synthesis-position` | | `--formular-preserve-font-synthesis-emoji`| Preserve font synthesis emoji information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-synthesis-emoji` | | `--formular-preserve-font-synthesis-annotation`| Preserve font synthesis annotation information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-synthesis-annotation` | | `--formular-preserve-font-synthesis-feature-settings`| Preserve font synthesis feature settings information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-synthesis-feature-settings` | | `--formular-preserve-font-synthesis-variation-settings`| Preserve font synthesis variation settings information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-synthesis-variation-settings` | | `--formular-preserve-font-synthesis-palette`| Preserve font synthesis palette information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-synthesis-palette` | | `--formular-preserve-font-synthesis-optical-sizing`| Preserve font synthesis optical sizing information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-synthesis-optical-sizing` | | `--formular-preserve-font-synthesis-size-adjust`| Preserve font synthesis size adjust information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-synthesis-size-adjust` | | `--formular-preserve-font-synthesis-size`| Preserve font synthesis size information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-synthesis-size` | | `--formular-preserve-font-synthesis-size-adjust`| Preserve font synthesis size adjust information in formulas | `pdf2zh_next example.pdf --formular-preserve-font-synthesis-size-adjust` | --- ### TRANSLATION | `--formular-char-pattern` | Zeichenmuster zur Identifizierung von Formeltext | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)"` | | `--formular-char-pattern-replace` | Ersatztext für das übereinstimmende Formelzeichenmuster | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-replace "\\1"` | | `--formular-char-pattern-ignore` | Ignoriere Übereinstimmungen mit Formelzeichenmustern | `pdf2zh_next example.pdf --formular-char-pattern-ignore "(MS.*)"` | | `--formular-char-pattern-ignore-replace` | Ersatztext für ignorierte Übereinstimmungen mit Formelzeichenmustern | `pdf2zh_next example.pdf --formular-char-pattern-ignore "(MS.*)" --formular-char-pattern-ignore-replace "\\1"` | | `--formular-preserve-color` | Behalte Farbinformationen in Formeln | `pdf2zh_next example.pdf --formular-preserve-color` | | `--formular-preserve-font-family` | Behalte Schriftartinformationen in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-family` | | `--formular-preserve-font-size` | Behalte Schriftgrößeninformationen in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-size` | | `--formular-preserve-font-style` | Behalte Schriftstilinformationen in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-style` | | `--formular-preserve-font-weight`| Behalte Schriftdickeninformationen in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-weight` | | `--formular-preserve-font-variant`| Behalte Schriftvariationsinformationen in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-variant` | | `--formular-preserve-font-stretch`| Behalte Schriftdehnungsinformationen in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-stretch` | | `--formular-preserve-font-decoration`| Behalte Schriftdekorationeninformationen in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-decoration` | | `--formular-preserve-font-kerning`| Behalte Schriftabstandsausgleichsinformationen in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-kerning` | | `--formular-preserve-font-ligatures`| Behalte Ligatureninformationen in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-ligatures` | | `--formular-preserve-font-variant-ligatures`| Behalte Informationen zu Schriftvariantenligaturen in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-variant-ligatures` | | `--formular-preserve-font-variant-caps`| Behalte Informationen zu Schriftvariantengroßbuchstaben in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-variant-caps` | | `--formular-preserve-font-variant-numeric`| Behalte Informationen zu Schriftvariantenzahlen in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-variant-numeric` | | `--formular-preserve-font-variant-alternates`| Behalte Informationen zu Schriftvariantenalternativen in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-variant-alternates` | | `--formular-preserve-font-variant-east-asian`| Behalte Informationen zu Schriftvariantenostasiatischen Zeichen in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-variant-east-asian` | | `--formular-preserve-font-variant-position`| Behalte Informationen zu Schriftvariantenpositionen in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-variant-position` | | `--formular-preserve-font-variant-emoji`| Behalte Informationen zu Schriftvariantenemojis in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-variant-emoji` | | `--formular-preserve-font-variant-annotation`| Behalte Informationen zu Schriftvariantenanmerkungen in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-variant-annotation` | | `--formular-preserve-font-feature-settings`| Behalte Informationen zu Schriftspezialfunktionen in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-feature-settings` | | `--formular-preserve-font-variation-settings`| Behalte Informationen zu Schriftvariationseinstellungen in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-variation-settings` | | `--formular-preserve-font-palette`| Behalte Informationen zu Schriftfarbpaletten in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-palette` | | `--formular-preserve-font-synthesis`| Behalte Informationen zu Schriftsynthese in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-synthesis` | | `--formular-preserve-font-synthesis-weight`| Behalte Informationen zur Schriftsynthesegewichtung in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-synthesis-weight` | | `--formular-preserve-font-synthesis-style`| Behalte Informationen zum Schriftsynthesestil in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-synthesis-style` | | `--formular-preserve-font-synthesis-small-caps`| Behalte Informationen zur Schriftsynthesekleinschrift in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-synthesis-small-caps` | | `--formular-preserve-font-synthesis-position`| Behalte Informationen zur Schriftsyntheseposition in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-synthesis-position` | | `--formular-preserve-font-synthesis-emoji`| Behalte Informationen zur Schriftsyntheseemojis in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-synthesis-emoji` | | `--formular-preserve-font-synthesis-annotation`| Behalte Informationen zur Schriftsyntheseanmerkungen in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-synthesis-annotation` | | `--formular-preserve-font-synthesis-feature-settings`| Behalte Informationen zu Schriftsynthesespezialfunktionen in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-synthesis-feature-settings` | | `--formular-preserve-font-synthesis-variation-settings`| Behalte Informationen zu Schriftsynthesevariationseinstellungen in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-synthesis-variation-settings` | | `--formular-preserve-font-synthesis-palette`| Behalte Informationen zu Schriftsynthesefarbpaletten in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-synthesis-palette` | | `--formular-preserve-font-synthesis-optical-sizing`| Behalte Informationen zur Schriftsyntheseoptischen Größenanpassung in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-synthesis-optical-sizing` | | `--formular-preserve-font-synthesis-size-adjust`| Behalte Informationen zur Schriftsynthesegrößenanpassung in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-synthesis-size-adjust` | | `--formular-preserve-font-synthesis-size`| Behalte Informationen zur Schriftsynthesegröße in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-synthesis-size` | | `--formular-preserve-font-synthesis-size-adjust`| Behalte Informationen zur Schriftsynthesegrößenanpassung in Formeln | `pdf2zh_next example.pdf --formular-preserve-font-synthesis-size-adjust` |
fr: |---------------------------------|-----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------| | `--formular-char-replace` | Replacement text for formula character | `pdf2zh_next example.pdf --formular-char-replace "\\text{formula}"` | | `--formular-char-ignore-pattern`| Regex pattern to ignore certain characters in formula | `pdf2zh_next example.pdf --formular-char-ignore-pattern "[0-9]"` | | `--formular-char-ignore-string` | String to ignore in formula character replacement | `pdf2zh_next example.pdf --formular-char-ignore-string "abc"` | --- ### OUTPUT | `--formular-char-pattern` | Modèle de caractères pour identifier le texte de formule | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)"` | |---------------------------------|-----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------| | `--formular-char-replace` | Texte de remplacement pour le caractère de formule | `pdf2zh_next example.pdf --formular-char-replace "\\text{formula}"` | | `--formular-char-ignore-pattern`| Modèle regex pour ignorer certains caractères dans la formule | `pdf2zh_next example.pdf --formular-char-ignore-pattern "[0-9]"` | | `--formular-char-ignore-string` | Chaîne à ignorer dans le remplacement des caractères de formule | `pdf2zh_next example.pdf --formular-char-ignore-string "abc"` |
it: --- Let's break it down step by step: 1. **RULE 0**: Ensure completeness of translation. The original text is a table row with four columns. I need to translate all the text while preserving special characters like backticks and the table structure. 2. **RULE 1**: Keeping format: - The table structure should be maintained. - The content inside backticks should not be translated: `--formular-char-pattern`, `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)"`. - The hyperlink is not present here, so no issue. - The catalog translation rule doesn't apply here. - Newline count: The original has no newlines within this row, so the translation should not add any. - Standard punctuation: Since the target language is Italian (it), which uses half-width punctuation similar to English, I should keep the punctuation as is. - Space addition: Not applicable here as there are no mixes of Latin and CJK characters in this text. 3. **RULE 2**: Using terms: There are no terms from the glossary in this text. 4. **RULE 3**: Using bypass: The word "pdf2zh" is in the bypass list, so it should remain unchanged. In the command example, "pdf2zh_next" should also remain unchanged as it is a variant. 5. **RULE 4**: Output limits: I must output only the translation result without any other content. Now, translating the second column: "Character pattern to identify formula text" to Italian. The translation should be "Modello di caratteri per identificare il testo della formula". The third column is already in backticks and should not be translated. The first and fourth columns are also in backticks and should remain unchanged. So the translated row should be: | `--formular-char-pattern` | Modello di caratteri per identificare il testo della formula | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)"` | Note: The table bars and spacing should be preserved as in the original. --- ### OUTPUT | `--formular-char-pattern` | Modello di caratteri per identificare il testo della formula | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)"` |
pt: - | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | - | | `--formular-char-pattern-regex` | Whether to treat the character pattern as a regex | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-regex` | - | | `--formular-char-replace` | Replacement string for the matched formula text | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-replace "formula"` | - | | `--formular-char-replace-all` | Replace all occurrences of the pattern in the matched text (default is to replace once) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-replace "formula" --formular-char-replace-all` | - | --- ### OUTPUT LANGUAGE pt --- | `--formular-char-pattern` | Padrão de caracteres para identificar texto de fórmula | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)"` | - | | ------------------------------- | --------------------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | - | | `--formular-char-pattern-regex` | Se deve tratar o padrão de caracteres como uma expressão regular | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-regex` | - | | `--formular-char-replace` | String de substituição para o texto de fórmula correspondente | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-replace "formula"` | - | | `--formular-char-replace-all` | Substituir todas as ocorrências do padrão no texto correspondente (o padrão é substituir uma vez) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-replace "formula" --formular-char-replace-all` | - |
ru: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--formular-char-pattern-repl` | Replacement for matched formula text | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-repl "\\1"` | | `--formular-char-pattern-keep` | Whether to keep the matched formula text (default: `True`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-keep False` | | `--formular-char-pattern-color` | Color to use for the matched formula text (default: `#FF0000`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-color "#00FF00"` | | `--formular-char-pattern-size` | Font size to use for the matched formula text (default: `12`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-size 14` | | `--formular-char-pattern-font` | Font family to use for the matched formula text (default: `Times New Roman`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-font "Arial"` | | `--formular-char-pattern-style` | Font style to use for the matched formula text (default: `normal`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-style "italic"` | | `--formular-char-pattern-weight` | Font weight to use for the matched formula text (default: `normal`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-weight "bold"` | | `--formular-char-pattern-align` | Text alignment to use for the matched formula text (default: `center`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-align "left"` | | `--formular-char-pattern-pos` | Text position to use for the matched formula text (default: `relative`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-pos "absolute"` | | `--formular-char-pattern-top` | Top position to use for the matched formula text (default: `0`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-top 10` | | `--formular-char-pattern-left` | Left position to use for the matched formula text (default: `0`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-left 10` | | `--formular-char-pattern-right` | Right position to use for the matched formula text (default: `0`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-right 10` | | `--formular-char-pattern-bottom` | Bottom position to use for the matched formula text (default: `0`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-bottom 10` | | `--formular-char-pattern-zindex` | Z-index to use for the matched formula text (default: `0`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-zindex 1` | | `--formular-char-pattern-opacity` | Opacity to use for the matched formula text (default: `1`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-opacity 0.5` | | `--formular-char-pattern-rotation` | Rotation angle to use for the matched formula text (default: `0`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-rotation 90` | | `--formular-char-pattern-scale` | Scale factor to use for the matched formula text (default: `1`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-scale 1.5` | | `--formular-char-pattern-transform` | Transform to use for the matched formula text (default: `none`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-transform "rotate(90deg)"` | | `--formular-char-pattern-transition` | Transition to use for the matched formula text (default: `none`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-transition "all 0.3s ease-in-out"` | | `--formular-char-pattern-animation` | Animation to use for the matched formula text (default: `none`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-animation "fadeIn 1s"` | --- | `--formular-char-pattern` | Символьный шаблон для идентификации текста формул | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)"` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--formular-char-pattern-repl` | Замена для совпавшего текста формул | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-repl "\\1"` | | `--formular-char-pattern-keep` | Сохранять ли совпавший текст формул (по умолчанию: `True`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-keep False` | | `--formular-char-pattern-color` | Цвет для совпавшего текста формул (по умолчанию: `#FF0000`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-color "#00FF00"` | | `--formular-char-pattern-size` | Размер шрифта для совпавшего текста формул (по умолчанию: `12`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-size 14` | | `--formular-char-pattern-font` | Семейство шрифтов для совпавшего текста формул (по умолчанию: `Times New Roman`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-font "Arial"` | | `--formular-char-pattern-style` | Стиль шрифта для совпавшего текста формул (по умолчанию: `normal`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-style "italic"` | | `--formular-char-pattern-weight` | Насыщенность шрифта для совпавшего текста формул (по умолчанию: `normal`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-weight "bold"` | | `--formular-char-pattern-align` | Выравнивание текста для совпавшего текста формул (по умолчанию: `center`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-align "left"` | | `--formular-char-pattern-pos` | Позиция текста для совпавшего текста формул (по умолчанию: `relative`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-pos "absolute"` | | `--formular-char-pattern-top` | Верхняя позиция для совпавшего текста формул (по умолчанию: `0`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-top 10` | | `--formular-char-pattern-left` | Левая позиция для совпавшего текста формул (по умолчанию: `0`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-left 10` | | `--formular-char-pattern-right` | Правая позиция для совпавшего текста формул (по умолчанию: `0`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-right 10` | | `--formular-char-pattern-bottom` | Нижняя позиция для совпавшего текста формул (по умолчанию: `0`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-bottom 10` | | `--formular-char-pattern-zindex` | Z-индекс для совпавшего текста формул (по умолчанию: `0`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-zindex 1` | | `--formular-char-pattern-opacity` | Прозрачность для совпавшего текста формул (по умолчанию: `1`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-opacity 0.5` | | `--formular-char-pattern-rotation` | Угол поворота для совпавшего текста формул (по умолчанию: `0`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-rotation 90` | | `--formular-char-pattern-scale` | Коэффициент масштабирования для совпавшего текста формул (по умолчанию: `1`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-scale 1.5` | | `--formular-char-pattern-transform` | Трансформация для совпавшего текста формул (по умолчанию: `none`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-transform "rotate(90deg)"` | | `--formular-char-pattern-transition` | Переход для совпавшего текста формул (по умолчанию: `none`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-transition "all 0.3s ease-in-out"` | | `--formular-char-pattern-animation` | Анимация для совпавшего текста формул (по умолчанию: `none`) | `pdf2zh_next example.pdf --formular-char-pattern "(MS.*)" --formular-char-pattern-animation "fadeIn 1s"` |
