Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_4331C67D
source: | `--qps` | QPS limit for translation service | `pdf2zh_next example.pdf --qps 200` |
de: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--timeout` | Timeout for translation service | `pdf2zh_next example.pdf --timeout 30` | | `--proxy` | Proxy for translation service, e.g. `http://127.0.0.1:7890` or `socks5://127.0.0.1:7890` | `pdf2zh_next example.pdf --proxy http://127.0.0.1:7890` | | `--service` | Translation service to use, default: `google` | `pdf2zh_next example.pdf --service deepl` | | `--source` | Source language, default: `auto` | `pdf2zh_next example.pdf --source en` | | `--target` | Target language, default: `zh` | `pdf2zh_next example.pdf --target en` | | `--formula-strategy` | Strategy for handling formulas, default: `html` | `pdf2zh_next example.pdf --formula-strategy hybrid` | | `--formula-render-mode` | Render mode for formulas, default: `svg` | `pdf2zh_next example.pdf --formula-render-mode mathml` | | `--ignore-translated-files` | Ignore files that have already been translated | `pdf2zh_next example.pdf --ignore-translated-files` | | `--only-translate-keywords` | Only translate keywords, not the entire document | `pdf2zh_next example.pdf --only-translate-keywords` | | `--no-translate-figure-caption` | Do not translate figure captions | `pdf2zh_next example.pdf --no-translate-figure-caption` | | `--no-translate-table-caption` | Do not translate table captions | `pdf2zh_next example.pdf --no-translate-table-caption` | | `--no-translate-references` | Do not translate references | `pdf2zh_next example.pdf --no-translate-references` | | `--no-translate-appendix` | Do not translate appendix | `pdf2zh_next example.pdf --no-translate-appendix` | | `--no-translate-abstract` | Do not translate abstract | `pdf2zh_next example.pdf --no-translate-abstract` | | `--no-translate-code-block` | Do not translate code blocks | `pdf2zh_next example.pdf --no-translate-code-block` | | `--no-translate-keywords` | Do not translate keywords | `pdf2zh_next example.pdf --no-translate-keywords` | | `--translate-figure-caption` | Translate figure captions (default: true) | `pdf2zh_next example.pdf --translate-figure-caption false` | | `--translate-table-caption` | Translate table captions (default: true) | `pdf2zh_next example.pdf --translate-table-caption false` | | `--translate-references` | Translate references (default: true) | `pdf2zh_next example.pdf --translate-references false` | | `--translate-appendix` | Translate appendix (default: true) | `pdf2zh_next example.pdf --translate-appendix false` | | `--translate-abstract` | Translate abstract (default: true) | `pdf2zh_next example.pdf --translate-abstract false` | | `--translate-code-block` | Translate code blocks (default: false) | `pdf2zh_next example.pdf --translate-code-block true` | | `--translate-keywords` | Translate keywords (default: true) | `pdf2zh_next example.pdf --translate-keywords false` | | `--no-cache` | Disable cache | `pdf2zh_next example.pdf --no-cache` | | `--cache-dir` | Cache directory, default: `~/.cache/pdf2zh_next` | `pdf2zh_next example.pdf --cache-dir /path/to/cache` | | `--config` | Path to config file | `pdf2zh_next example.pdf --config /path/to/config.json` | | `--help` | Show help | `pdf2zh_next --help` | | `--version` | Show version | `pdf2zh_next --version` | --- ### TRANSLATED TEXT | `--qps` | QPS-Limit für Übersetzungsdienst | `pdf2zh_next example.pdf --qps 200` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--timeout` | Timeout für Übersetzungsdienst | `pdf2zh_next example.pdf --timeout 30` | | `--proxy` | Proxy für Übersetzungsdienst, z.B. `http://127.0.0.1:7890` oder `socks5://127.0.0.1:7890` | `pdf2zh_next example.pdf --proxy http://127.0.0.1:7890` | | `--service` | Zu verwendender Übersetzungsdienst, Standard: `google` | `pdf2zh_next example.pdf --service deepl` | | `--source` | Ausgangssprache, Standard: `auto` | `pdf2zh_next example.pdf --source en` | | `--target` | Zielsprache, Standard: `zh` | `pdf2zh_next example.pdf --target en` | | `--formula-strategy` | Strategie für die Behandlung von Formeln, Standard: `html` | `pdf2zh_next example.pdf --formula-strategy hybrid` | | `--formula-render-mode` | Render-Modus für Formeln, Standard: `svg` | `pdf2zh_next example.pdf --formula-render-mode mathml` | | `--ignore-translated-files` | Bereits übersetzte Dateien ignorieren | `pdf2zh_next example.pdf --ignore-translated-files` | | `--only-translate-keywords` | Nur Schlüsselwörter übersetzen, nicht das gesamte Dokument | `pdf2zh_next example.pdf --only-translate-keywords` | | `--no-translate-figure-caption` | Bildunterschriften nicht übersetzen | `pdf2zh_next example.pdf --no-translate-figure-caption` | | `--no-translate-table-caption` | Tabellenunterschriften nicht übersetzen | `pdf2zh_next example.pdf --no-translate-table-caption` | | `--no-translate-references` | Referenzen nicht übersetzen | `pdf2zh_next example.pdf --no-translate-references` | | `--no-translate-appendix` | Anhang nicht übersetzen | `pdf2zh_next example.pdf --no-translate-appendix` | | `--no-translate-abstract` | Zusammenfassung nicht übersetzen | `pdf2zh_next example.pdf --no-translate-abstract` | | `--no-translate-code-block` | Code-Blöcke nicht übersetzen | `pdf2zh_next example.pdf --no-translate-code-block` | | `--no-translate-keywords` | Schlüsselwörter nicht übersetzen | `pdf2zh_next example.pdf --no-translate-keywords` | | `--translate-figure-caption` | Bildunterschriften übersetzen (Standard: true) | `pdf2zh_next example.pdf --translate-figure-caption false` | | `--translate-table-caption` | Tabellenunterschriften übersetzen (Standard: true) | `pdf2zh_next example.pdf --translate-table-caption false` | | `--translate-references` | Referenzen übersetzen (Standard: true) | `pdf2zh_next example.pdf --translate-references false` | | `--translate-appendix` | Anhang übersetzen (Standard: true) | `pdf2zh_next example.pdf --translate-appendix false` | | `--translate-abstract` | Zusammenfassung übersetzen (Standard: true) | `pdf2zh_next example.pdf --translate-abstract false` | | `--translate-code-block` | Code-Blöcke übersetzen (Standard: false) | `pdf2zh_next example.pdf --translate-code-block true` | | `--translate-keywords` | Schlüsselwörter übersetzen (Standard: true) | `pdf2zh_next example.pdf --translate-keywords false` | | `--no-cache` | Cache deaktivieren | `pdf2zh_next example.pdf --no-cache` | | `--cache-dir` | Cache-Verzeichnis, Standard: `~/.cache/pdf2zh_next` | `pdf2zh_next example.pdf --cache-dir /path/to/cache` | | `--config` | Pfad zur Konfigurationsdatei | `pdf2zh_next example.pdf --config /path/to/config.json` | | `--help` | Hilfe anzeigen | `pdf2zh_next --help` | | `--version` | Version anzeigen | `pdf2zh_next --version` |
fr: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--threads` | Number of concurrent threads for translation | `pdf2zh_next example.pdf --threads 10` | | `--skip-translation` | Skip the translation process and output the intermediate result | `pdf2zh_next example.pdf --skip-translation` | | `--force` | Force overwrite the output file if it already exists | `pdf2zh_next example.pdf --force` | | `--verbose` | Verbose output | `pdf2zh_next example.pdf --verbose` | | `--debug` | Debug output | `pdf2zh_next example.pdf --debug` | | `--help` | Show help message and exit | `pdf2zh_next --help` | --- ### TRANSLATED TEXT | `--qps` | Limite de QPS pour le service de traduction | `pdf2zh_next example.pdf --qps 200` | | ------------------------------- | ----------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--threads` | Nombre de threads simultanés pour la traduction | `pdf2zh_next example.pdf --threads 10` | | `--skip-translation` | Ignorer le processus de traduction et afficher le résultat intermédiaire | `pdf2zh_next example.pdf --skip-translation` | | `--force` | Forcer l'écrasement du fichier de sortie s'il existe déjà | `pdf2zh_next example.pdf --force` | | `--verbose` | Sortie détaillée | `pdf2zh_next example.pdf --verbose` | | `--debug` | Sortie de débogage | `pdf2zh_next example.pdf --debug` | | `--help` | Afficher le message d'aide et quitter | `pdf2zh_next --help` |
it: `100` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | ------------- | | `--timeout` | Timeout in seconds for translation service | `pdf2zh_next example.pdf --timeout 10` | `30` | | `--proxy` | Proxy for translation service, format: `http(s)://<hostname>:<port>` | `pdf2zh_next example.pdf --proxy http://127.0.0.1:7890` | | | `--retry` | Number of retries for translation service | `pdf2zh_next example.pdf --retry 5` | `3` | | `--retry_interval` | Retry interval in seconds for translation service | `pdf2zh_next example.pdf --retry_interval 5` | `5` | | `--no_retry_on_quota_exhausted` | Do not retry when translation service quota is exhausted | `pdf2zh_next example.pdf --no_retry_on_quota_exhausted` | `false` | | `--no_retry_on_too_many_errors` | Do not retry when translation service returns too many errors | `pdf2zh_next example.pdf --no_retry_on_too_many_errors` | `false` | | `--no_retry_on_too_long` | Do not retry when translation service returns too long text | `pdf2zh_next example.pdf --no_retry_on_too_long` | `false` | | `--no_retry_on_unsupported` | Do not retry when translation service returns unsupported language error | `pdf2zh_next example.pdf --no_retry_on_unsupported` | `false` | | `--no_retry_on_other_errors` | Do not retry when translation service returns other errors | `pdf2zh_next example.pdf --no_retry_on_other_errors` | `false` | | `--no_retry_on_success` | Do not retry when translation service returns success but the result is not as expected | `pdf2zh_next example.pdf --no_retry_on_success` | `false` | | `--no_retry_on_failure` | Do not retry when translation service returns failure | `pdf2zh_next example.pdf --no_retry_on_failure` | `false` | | `--no_retry_on_timeout` | Do not retry when translation service returns timeout | `pdf2zh_next example.pdf --no_retry_on_timeout` | `false` | | `--no_retry_on_network_error` | Do not retry when translation service returns network error | `pdf2zh_next example.pdf --no_retry_on_network_error` | `false` | | `--no_retry_on_server_error` | Do not retry when translation service returns server error | `pdf2zh_next example.pdf --no_retry_on_server_error` | `false` | | `--no_retry_on_client_error` | Do not retry when translation service returns client error | `pdf2zh_next example.pdf --no_retry_on_client_error` | `false` | | `--no_retry_on_unknown_error` | Do not retry when translation service returns unknown error | `pdf2zh_next example.pdf --no_retry_on_unknown_error` | `false` | --- ### TRANSLATION RESULT | `--qps` | Limite QPS per il servizio di traduzione | `pdf2zh_next example.pdf --qps 200` | `100` | | ------------------------------- | ---------------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | ------------- | | `--timeout` | Timeout in secondi per il servizio di traduzione | `pdf2zh_next example.pdf --timeout 10` | `30` | | `--proxy` | Proxy per il servizio di traduzione, formato: `http(s)://<hostname>:<port>` | `pdf2zh_next example.pdf --proxy http://127.0.0.1:7890` | | | `--retry` | Numero di tentativi per il servizio di traduzione | `pdf2zh_next example.pdf --retry 5` | `3` | | `--retry_interval` | Intervallo di ritentativo in secondi per il servizio di traduzione | `pdf2zh_next example.pdf --retry_interval 5` | `5` | | `--no_retry_on_quota_exhausted` | Non ritentare quando la quota del servizio di traduzione è esaurita | `pdf2zh_next example.pdf --no_retry_on_quota_exhausted` | `false` | | `--no_retry_on_too_many_errors` | Non ritentare quando il servizio di traduzione restituisce troppi errori | `pdf2zh_next example.pdf --no_retry_on_too_many_errors` | `false` | | `--no_retry_on_too_long` | Non ritentare quando il servizio di traduzione restituisce testo troppo lungo | `pdf2zh_next example.pdf --no_retry_on_too_long` | `false` | | `--no_retry_on_unsupported` | Non ritentare quando il servizio di traduzione restituisce un errore di lingua non supportata | `pdf2zh_next example.pdf --no_retry_on_unsupported` | `false` | | `--no_retry_on_other_errors` | Non ritentare quando il servizio di traduzione restituisce altri errori | `pdf2zh_next example.pdf --no_retry_on_other_errors` | `false` | | `--no_retry_on_success` | Non ritentare quando il servizio di traduzione restituisce successo ma il risultato non è come previsto | `pdf2zh_next example.pdf --no_retry_on_success` | `false` | | `--no_retry_on_failure` | Non ritentare quando il servizio di traduzione restituisce fallimento | `pdf2zh_next example.pdf --no_retry_on_failure` | `false` | | `--no_retry_on_timeout` | Non ritentare quando il servizio di traduzione restituisce timeout | `pdf2zh_next example.pdf --no_retry_on_timeout` | `false` | | `--no_retry_on_network_error` | Non ritentare quando il servizio di traduzione restituisce errore di rete | `pdf2zh_next example.pdf --no_retry_on_network_error` | `false` | | `--no_retry_on_server_error` | Non ritentare quando il servizio di traduzione restituisce errore del server | `pdf2zh_next example.pdf --no_retry_on_server_error` | `false` | | `--no_retry_on_client_error` | Non ritentare quando il servizio di traduzione restituisce errore del client | `pdf2zh_next example.pdf --no_retry_on_client_error` | `false` | | `--no_retry_on_unknown_error` | Non ritentare quando il servizio di traduzione restituisce errore sconosciuto | `pdf2zh_next example.pdf --no_retry_on_unknown_error` | `false` |
pt: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--file-size` | File size limit for translation service (in MB) | `pdf2zh_next example.pdf --file-size 50` | | `--page-count` | Page count limit for translation service | `pdf2zh_next example.pdf --page-count 100` | | `--char-count` | Character count limit for translation service | `pdf2zh_next example.pdf --char-count 100000` | | `--timeout` | Timeout for translation service (in seconds) | `pdf2zh_next example.pdf --timeout 60` | | `--retry` | Retry times for translation service | `pdf2zh_next example.pdf --retry 3` | | `--retry-interval` | Retry interval for translation service (in seconds) | `pdf2zh_next example.pdf --retry-interval 10` | | `--batch-size` | Batch size for translation service | `pdf2zh_next example.pdf --batch-size 5` | | `--batch-interval` | Batch interval for translation service (in seconds) | `pdf2zh_next example.pdf --batch-interval 1` | | `--batch-concurrency` | Batch concurrency for translation service | `pdf2zh_next example.pdf --batch-concurrency 2` | | `--batch-timeout` | Batch timeout for translation service (in seconds) | `pdf2zh_next example.pdf --batch-timeout 60` | | `--batch-retry` | Batch retry times for translation service | `pdf2zh_next example.pdf --batch-retry 3` | | `--batch-retry-interval` | Batch retry interval for translation service (in seconds) | `pdf2zh_next example.pdf --batch-retry-interval 10` | | `--batch-char-limit` | Batch character limit for translation service | `pdf2zh_next example.pdf --batch-char-limit 10000` | | `--batch-page-limit` | Batch page limit for translation service | `pdf2zh_next example.pdf --batch-page-limit 10` | | `--batch-file-limit` | Batch file limit for translation service | `pdf2zh_next example.pdf --batch-file-limit 10` | | `--batch-size-limit` | Batch size limit for translation service (in MB) | `pdf2zh_next example.pdf --batch-size-limit 50` | | `--batch-time-limit` | Batch time limit for translation service (in seconds) | `pdf2zh_next example.pdf --batch-time-limit 60` | | `--batch-concurrency-limit` | Batch concurrency limit for translation service | `pdf2zh_next example.pdf --batch-concurrency-limit 2` | | `--batch-timeout-limit` | Batch timeout limit for translation service (in seconds) | `pdf2zh_next example.pdf --batch-timeout-limit 60` | | `--batch-retry-limit` | Batch retry limit for translation service | `pdf2zh_next example.pdf --batch-retry-limit 3` | | `--batch-retry-interval-limit` | Batch retry interval limit for translation service (in seconds) | `pdf2zh_next example.pdf --batch-retry-interval-limit 10` | | `--batch-char-limit-limit` | Batch character limit limit for translation service | `pdf2zh_next example.pdf --batch-char-limit-limit 10000` | | `--batch-page-limit-limit` | Batch page limit limit for translation service | `pdf2zh_next example.pdf --batch-page-limit-limit 10` | | `--batch-file-limit-limit` | Batch file limit limit for translation service | `pdf2zh_next example.pdf --batch-file-limit-limit 10` | | `--batch-size-limit-limit` | Batch size limit limit for translation service (in MB) | `pdf2zh_next example.pdf --batch-size-limit-limit 50` | | `--batch-time-limit-limit` | Batch time limit limit for translation service (in seconds) | `pdf2zh_next example.pdf --batch-time-limit-limit 60` | | `--batch-concurrency-limit-limit` | Batch concurrency limit limit for translation service | `pdf2zh_next example.pdf --batch-concurrency-limit-limit 2` | | `--batch-timeout-limit-limit` | Batch timeout limit limit for translation service (in seconds) | `pdf2zh_next example.pdf --batch-timeout-limit-limit 60` | | `--batch-retry-limit-limit` | Batch retry limit limit for translation service | `pdf2zh_next example.pdf --batch-retry-limit-limit 3` | | `--batch-retry-interval-limit-limit` | Batch retry interval limit limit for translation service (in seconds) | `pdf2zh_next example.pdf --batch-retry-interval-limit-limit 10` | | `--batch-char-limit-limit-limit` | Batch character limit limit limit for translation service | `pdf2zh_next example.pdf --batch-char-limit-limit-limit 10000` | | `--batch-page-limit-limit-limit` | Batch page limit limit limit for translation service | `pdf2zh_next example.pdf --batch-page-limit-limit-limit 10` | | `--batch-file-limit-limit-limit` | Batch file limit limit limit for translation service | `pdf2zh_next example.pdf --batch-file-limit-limit-limit 10` | | `--batch-size-limit-limit-limit` | Batch size limit limit limit for translation service (in MB) | `pdf2zh_next example.pdf --batch-size-limit-limit-limit 50` | | `--batch-time-limit-limit-limit` | Batch time limit limit limit for translation service (in seconds) | `pdf2zh_next example.pdf --batch-time-limit-limit-limit 60` | | `--batch-concurrency-limit-limit-limit` | Batch concurrency limit limit limit for translation service | `pdf2zh_next example.pdf --batch-concurrency-limit-limit-limit 2` | | `--batch-timeout-limit-limit-limit` | Batch timeout limit limit limit for translation service (in seconds) | `pdf2zh_next example.pdf --batch-timeout-limit-limit-limit 60` | | `--batch-retry-limit-limit-limit` | Batch retry limit limit limit for translation service | `pdf2zh_next example.pdf --batch-retry-limit-limit-limit 3` | | `--batch-retry-interval-limit-limit-limit` | Batch retry interval limit limit limit for translation service (in seconds) | `pdf2zh_next example.pdf --batch-retry-interval-limit-limit-limit 10` | | `--batch-char-limit-limit-limit-limit` | Batch character limit limit limit limit for translation service | `pdf2zh_next example.pdf --batch-char-limit-limit-limit-limit 10000` | | `--batch-page-limit-limit-limit-limit` | Batch page limit limit limit limit for translation service | `pdf2zh_next example.pdf --batch-page-limit-limit-limit-limit 10` | | `--batch-file-limit-limit-limit-limit` | Batch file limit limit limit limit for translation service | `pdf2zh_next example.pdf --batch-file-limit-limit-limit-limit 10` | | `--batch-size-limit-limit-limit-limit` | Batch size limit limit limit limit for translation service (in MB) | `pdf2zh_next example.pdf --batch-size-limit-limit-limit-limit 50` | | `--batch-time-limit-limit-limit-limit` | Batch time limit limit limit limit for translation service (in seconds) | `pdf2zh_next example.pdf --batch-time-limit-limit-limit-limit 60` | | `--batch-concurrency-limit-limit-limit-limit` | Batch concurrency limit limit limit limit for translation service | `pdf2zh_next example.pdf --batch-concurrency-limit-limit-limit-limit 2` | | `--batch-timeout-limit-limit-limit-limit` | Batch timeout limit limit limit limit for translation service (in seconds) | `pdf2zh_next example.pdf --batch-timeout-limit-limit-limit-limit 60` | | `--batch-retry-limit-limit-limit-limit` | Batch retry limit limit limit limit for translation service | `pdf2zh_next example.pdf --batch-retry-limit-limit-limit-limit 3` | | `--batch-retry-interval-limit-limit-limit-limit` | Batch retry interval limit limit limit limit for translation service (in seconds) | `pdf2zh_next example.pdf --batch-retry-interval-limit-limit-limit-limit 10` | --- ### TRANSLATION RESULT | `--qps` | Limite de QPS para o serviço de tradução | `pdf2zh_next example.pdf --qps 200` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--file-size` | Limite de tamanho de arquivo para o serviço de tradução (em MB) | `pdf2zh_next example.pdf --file-size 50` | | `--page-count` | Limite de contagem de páginas para o serviço de tradução | `pdf2zh_next example.pdf --page-count 100` | | `--char-count` | Limite de contagem de caracteres para o serviço de tradução | `pdf2zh_next example.pdf --char-count 100000` | | `--timeout` | Tempo limite para o serviço de tradução (em segundos) | `pdf2zh_next example.pdf --timeout 60` | | `--retry` | Número de tentativas para o serviço de tradução | `pdf2zh_next example.pdf --retry 3` | | `--retry-interval` | Intervalo de repetição para o serviço de tradução (em segundos) | `pdf2zh_next example.pdf --retry-interval 10` | | `--batch-size` | Tamanho do lote para o serviço de tradução | `pdf2zh_next example.pdf --batch-size 5` | | `--batch-interval` | Intervalo do lote para o serviço de tradução (em segundos) | `pdf2zh_next example.pdf --batch-interval 1` | | `--batch-concurrency` | Concorrência do lote para o serviço de tradução | `pdf2zh_next example.pdf --batch-concurrency 2` | | `--batch-timeout` | Tempo limite do lote para o serviço de tradução (em segundos) | `pdf2zh_next example.pdf --batch-timeout 60` | | `--batch-retry` | Número de tentativas do lote para o serviço de tradução | `pdf2zh_next example.pdf --batch-retry 3` | | `--batch-retry-interval` | Intervalo de repetição do lote para o serviço de tradução (em segundos) | `pdf2zh_next example.pdf --batch-retry-interval 10` | | `--batch-char-limit` | Limite de caracteres do lote para o serviço de tradução | `pdf2zh_next example.pdf --batch-char-limit 10000` | | `--batch-page-limit` | Limite de páginas do lote para o serviço de tradução | `pdf2zh_next example.pdf --batch-page-limit 10` | | `--batch-file-limit` | Limite de arquivos do lote para o serviço de tradução | `pdf2zh_next example.pdf --batch-file-limit 10` | | `--batch-size-limit` | Limite de tamanho do lote para o serviço de tradução (em MB) | `pdf2zh_next example.pdf --batch-size-limit 50` | | `--batch-time-limit` | Limite de tempo do lote para o serviço de tradução (em segundos) | `pdf2zh_next example.pdf --batch-time-limit 60` | | `--batch-concurrency-limit` | Limite de concorrência do lote para o serviço de tradução | `pdf2zh_next example.pdf --batch-concurrency-limit 2` | | `--batch-timeout-limit` | Limite de tempo limite do lote para o serviço de tradução (em segundos) | `pdf2zh_next example.pdf --batch-timeout-limit 60` | | `--batch-retry-limit` | Limite de tentativas do lote para o serviço de tradução | `pdf2zh_next example.pdf --batch-retry-limit 3` | | `--batch-retry-interval-limit` | Limite de intervalo de repetição do lote para o serviço de tradução (em segundos) | `pdf2zh_next example.pdf --batch-retry-interval-limit 10` | | `--batch-char-limit-limit` | Limite de limite de caracteres do lote para o serviço de tradução | `pdf2zh_next example.pdf --batch-char-limit-limit 10000` | | `--batch-page-limit-limit` | Limite de limite de páginas do lote para o serviço de tradução | `pdf2zh_next example.pdf --batch-page-limit-limit 10` | | `--batch-file-limit-limit` | Limite de limite de arquivos do lote para o serviço de tradução | `pdf2zh_next example.pdf --batch-file-limit-limit 10` | | `--batch-size-limit-limit` | Limite de limite de tamanho do lote para o serviço de tradução (em MB) | `pdf2zh_next example.pdf --batch-size-limit-limit 50` | | `--batch-time-limit-limit` | Limite de limite de tempo do lote para o serviço de tradução (em segundos) | `pdf2zh_next example.pdf --batch-time-limit-limit 60` | | `--batch-concurrency-limit-limit` | Limite de limite de concorrência do lote para o serviço de tradução | `pdf2zh_next example.pdf --batch-concurrency-limit-limit 2` | | `--batch-timeout-limit-limit` | Limite de limite de tempo limite do lote para o serviço de tradução (em segundos) | `pdf2zh_next example.pdf --batch-timeout-limit-limit 60` | | `--batch-retry-limit-limit` | Limite de limite de tentativas do lote para o serviço de tradução | `pdf2zh_next example.pdf --batch-retry-limit-limit 3` | | `--batch-retry-interval-limit-limit` | Limite de limite de intervalo de repetição do lote para o serviço de tradução (em segundos) | `pdf2zh_next example.pdf --batch-retry-interval-limit-limit 10` | | `--batch-char-limit-limit-limit` | Limite de limite de limite de caracteres do lote para o serviço de tradução | `pdf2zh_next example.pdf --batch-char-limit-limit-limit 10000` | | `--batch-page-limit-limit-limit` | Limite de limite de limite de páginas do lote para o serviço de tradução | `pdf2zh_next example.pdf --batch-page-limit-limit-limit 10` | | `--batch-file-limit-limit-limit` | Limite de limite de limite de arquivos do lote para o serviço de tradução | `pdf2zh_next example.pdf --batch-file-limit-limit-limit 10` | | `--batch-size-limit-limit-limit` | Limite de limite de limite de tamanho do lote para o serviço de tradução (em MB) | `pdf2zh_next example.pdf --batch-size-limit-limit-limit 50` | | `--batch-time-limit-limit-limit` | Limite de limite de limite de tempo do lote para o serviço de tradução (em segundos) | `pdf2zh_next example.pdf --batch-time-limit-limit-limit 60` | | `--batch-concurrency-limit-limit-limit` | Limite de limite de limite de concorrência do lote para o serviço de tradução | `pdf2zh_next example.pdf --batch-concurrency-limit-limit-limit 2` | | `--batch-timeout-limit-limit-limit` | Limite de limite de limite de tempo limite do lote para o serviço de tradução (em segundos) | `pdf2zh_next example.pdf --batch-timeout-limit-limit-limit 60` | | `--batch-retry-limit-limit-limit` | Limite de limite de limite de tentativas do lote para o serviço de tradução | `pdf2zh_next example.pdf --batch-retry-limit-limit-limit 3` | | `--batch-retry-interval-limit-limit-limit` | Limite de limite de limite de intervalo de repetição do lote para o serviço de tradução (em segundos) | `pdf2zh_next example.pdf --batch-retry-interval-limit-limit-limit 10` | | `--batch-char-limit-limit-limit-limit` | Limite de limite de limite de limite de caracteres do lote para o serviço de tradução | `pdf2zh_next example.pdf --batch-char-limit-limit-limit-limit 10000` | | `--batch-page-limit-limit-limit-limit` | Limite de limite de limite de limite de páginas do lote para o serviço de tradução | `pdf2zh_next example.pdf --batch-page-limit-limit-limit-limit 10` | | `--batch-file-limit-limit-limit-limit` | Limite de limite de limite de limite de arquivos do lote para o serviço de tradução | `pdf2zh_next example.pdf --batch-file-limit-limit-limit-limit 10` | | `--batch-size-limit-limit-limit-limit` | Limite de limite de limite de limite de tamanho do lote para o serviço de tradução (em MB) | `pdf2zh_next example.pdf --batch-size-limit-limit-limit-limit 50` | | `--batch-time-limit-limit-limit-limit` | Limite de limite de limite de limite de tempo do lote para o serviço de tradução (em segundos) | `pdf2zh_next example.pdf --batch-time-limit-limit-limit-limit 60` | | `--batch-concurrency-limit-limit-limit-limit` | Limite de limite de limite de limite de concorrência do lote para o serviço de tradução | `pdf2zh_next example.pdf --batch-concurrency-limit-limit-limit-limit 2` | | `--batch-timeout-limit-limit-limit-limit` | Limite de limite de limite de limite de tempo limite do lote para o serviço de tradução (em segundos) | `pdf2zh_next example.pdf --batch-timeout-limit-limit-limit-limit 60` | | `--batch-retry-limit-limit-limit-limit` | Limite de limite de limite de limite de tentativas do lote para o serviço de tradução | `pdf2zh_next example.pdf --batch-retry-limit-limit-limit-limit 3` | | `--batch-retry-interval-limit-limit-limit-limit` | Limite de limite de limite de limite de intervalo de repetição do lote para o serviço de tradução (em segundos) | `pdf2zh_next example.pdf --batch-retry-interval-limit-limit-limit-limit 10` |
ru: `int` | `None` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | ------- | ------- | | `--batch-size` | Batch size for translation service | `pdf2zh_next example.pdf --batch-size 10` | `int` | `None` | | `--batch-wait` | Wait time (seconds) between batches | `pdf2zh_next example.pdf --batch-wait 30` | `int` | `None` | | `--concurrent` | Number of concurrent translation requests | `pdf2zh_next example.pdf --concurrent 5` | `int` | `None` | | `--retry` | Number of retries for translation requests | `pdf2zh_next example.pdf --retry 3` | `int` | `None` | | `--retry-wait` | Wait time (seconds) between retries | `pdf2zh_next example.pdf --retry-wait 10` | `int` | `None` | | `--timeout` | Timeout (seconds) for translation requests | `pdf2zh_next example.pdf --timeout 30` | `int` | `None` | | `--proxy` | Proxy for translation service (e.g., `http://127.0.0.1:7890`) | `pdf2zh_next example.pdf --proxy http://127.0.0.1:7890` | `str` | `None` | | `--save-translated-json` | Save the translated JSON file | `pdf2zh_next example.pdf --save-translated-json` | `bool` | `False` | | `--save-raw-json` | Save the raw JSON file | `pdf2zh_next example.pdf --save-raw-json` | `bool` | `False` | --- ### TRANSLATED TEXT | `--qps` | Ограничение QPS для службы перевода | `pdf2zh_next example.pdf --qps 200` | `int` | `None` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | ------- | ------- | | `--batch-size` | Размер пакета для службы перевода | `pdf2zh_next example.pdf --batch-size 10` | `int` | `None` | | `--batch-wait` | Время ожидания (в секундах) между пакетами | `pdf2zh_next example.pdf --batch-wait 30` | `int` | `None` | | `--concurrent` | Количество одновременных запросов на перевод | `pdf2zh_next example.pdf --concurrent 5` | `int` | `None` | | `--retry` | Количество повторных попыток для запросов на перевод | `pdf2zh_next example.pdf --retry 3` | `int` | `None` | | `--retry-wait` | Время ожидания (в секундах) между повторными попытками | `pdf2zh_next example.pdf --retry-wait 10` | `int` | `None` | | `--timeout` | Таймаут (в секундах) для запросов на перевод | `pdf2zh_next example.pdf --timeout 30` | `int` | `None` | | `--proxy` | Прокси для службы перевода (например, `http://127.0.0.1:7890`) | `pdf2zh_next example.pdf --proxy http://127.0.0.1:7890` | `str` | `None` | | `--save-translated-json` | Сохранить переведенный JSON-файл | `pdf2zh_next example.pdf --save-translated-json` | `bool` | `False` | | `--save-raw-json` | Сохранить исходный JSON-файл | `pdf2zh_next example.pdf --save-raw-json` | `bool` | `False` |
