Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_FB4E5C3D
source: ### Minimal Usage Example (Async)
de: {#minimal-usage-example-async} ```python import asyncio from pdf2zh import pdf2zh async def main(): # Initialize the translator translator = pdf2zh() # Translate a PDF file # The output file will be saved as 'output.pdf' await translator.translate("input.pdf") asyncio.run(main()) ``` ### Synchronous Wrapper {#synchronous-wrapper} For convenience, a synchronous wrapper is provided: ```python from pdf2zh import pdf2zh_sync # Initialize the translator translator = pdf2zh_sync() # Translate a PDF file # The output file will be saved as 'output.pdf' translator.translate("input.pdf") ``` ### Custom Output Path {#custom-output-path} ```python import asyncio from pdf2zh import pdf2zh async def main(): translator = pdf2zh() # Specify custom output path await translator.translate("input.pdf", "custom_output.pdf") asyncio.run(main()) ``` ### Translation Options {#translation-options} ```python import asyncio from pdf2zh import pdf2zh async def main(): translator = pdf2zh() # Enable different translation modes await translator.translate( "input.pdf", output_path="output.pdf", translate_formulas=True, # Enable formula translation translate_figures=True, # Enable figure translation translate_tables=True, # Enable table translation batch_size=5, # Process 5 pages at a time language="en" # Output language (default: 'zh' for Chinese) ) asyncio.run(main()) ``` ### Progress Monitoring {#progress-monitoring} ```python import asyncio from pdf2zh import pdf2zh async def main(): translator = pdf2zh() # Track translation progress async for progress in translator.translate( "input.pdf", output_path="output.pdf", return_progress=True # Enable progress tracking ): print(f"Progress: {progress.current}/{progress.total} pages") asyncio.run(main()) ``` ### Error Handling {#error-handling} ```python import asyncio from pdf2zh import pdf2zh async def main(): translator = pdf2zh() try: await translator.translate("input.pdf", "output.pdf") print("Translation completed successfully!") except Exception as e: print(f"Translation failed: {e}") asyncio.run(main()) ``` ### Advanced Configuration {#advanced-configuration} ```python import asyncio from pdf2zh import pdf2zh async def main(): # Custom initialization with API keys translator = pdf2zh( openai_api_key="your_openai_key", # OpenAI API key openai_base_url="https://api.openai.com/v1", # OpenAI base URL azure_api_key="your_azure_key", # Azure API key azure_endpoint="your_azure_endpoint", # Azure endpoint azure_api_version="2024-02-01", # Azure API version model="gpt-4o", # Model to use max_retries=3, # Maximum retry attempts timeout=30, # Timeout in seconds max_concurrency=5 # Maximum concurrent requests ) await translator.translate("input.pdf", "output.pdf") asyncio.run(main()) ``` ### Using Azure OpenAI {#using-azure-openai} ```python import asyncio from pdf2zh import pdf2zh async def main(): # Azure-specific configuration translator = pdf2zh( azure_api_key="your_azure_key", azure_endpoint="https://your-resource.openai.azure.com/", azure_api_version="2024-02-01", model="gpt-4o" # Your deployment name ) await translator.translate("input.pdf", "output.pdf") asyncio.run(main()) ``` ### Custom Translation Service {#custom-translation-service} ```python import asyncio from pdf2zh import pdf2zh from pdf2zh.backend import BaseTranslationBackend class CustomTranslator(BaseTranslationBackend): async def translate(self, text: str, source_lang: str, target_lang: str) -> str: # Implement your custom translation logic return text.upper() # Example: convert to uppercase async def main(): # Use custom translation backend translator = pdf2zh(translation_backend=CustomTranslator()) await translator.translate("input.pdf", "output.pdf") asyncio.run(main()) ``` --- Now, please complete the **TASK** and output the translation result.
fr: {#minimal-usage-example-async} Here is a minimal example of how to use `pdf2zh` asynchronously with default settings: ```python import asyncio from pdf2zh import PDFTranslator async def main(): translator = PDFTranslator() await translator.translate( input_file="input.pdf", output_file="output.pdf" ) if __name__ == "__main__": asyncio.run(main()) ``` This will: - Translate all text in `input.pdf` to Chinese (default target language) - Preserve the original layout and formatting - Save the result to `output.pdf` --- ### ORIGINAL TEXT ### Exemple d'utilisation minimal (Asynchrone) {#exemple-dutilisation-minimal-asynchrone} Voici un exemple minimal d'utilisation de `pdf2zh` de manière asynchrone avec les paramètres par défaut : ```python import asyncio from pdf2zh import PDFTranslator async def main(): translator = PDFTranslator() await translator.translate( input_file="input.pdf", output_file="output.pdf" ) if __name__ == "__main__": asyncio.run(main()) ``` Cela va : - Traduire tout le texte dans `input.pdf` en chinois (langue cible par défaut) - Préserver la mise en page et le formatage d'origine - Sauvegarder le résultat dans `output.pdf`
it: {#minimal-usage-example-async} ```python import asyncio from pdf2zh import pdf2zh_async async def main(): pdf_path = "example.pdf" output_path = "example_translated.pdf" # Initialize the translation engine engine = await pdf2zh_async() # Translate the PDF await engine.translate(pdf_path, output_path) asyncio.run(main()) ``` ### Minimal Usage Example (Sync) {#minimal-usage-example-sync} ```python from pdf2zh import pdf2zh def main(): pdf_path = "example.pdf" output_path = "example_translated.pdf" # Initialize the translation engine engine = pdf2zh() # Translate the PDF engine.translate(pdf_path, output_path) if __name__ == "__main__": main() ``` ### Basic Configuration {#basic-configuration} ```python from pdf2zh import pdf2zh # Initialize with configuration engine = pdf2zh( target_lang="it", # Target language (ISO 639-1 code) translation_service="google", # Translation service enable_glossary=True, # Enable glossary feature enable_ocr=True, # Enable OCR for scanned PDFs output_format="text", # Output format: "text" or "pdf" preserve_layout=True # Preserve original layout in PDF output ) # Translate PDF engine.translate("input.pdf", "output.pdf") ``` ### Advanced Configuration {#advanced-configuration} ```python from pdf2zh import pdf2zh # Advanced configuration with custom settings engine = pdf2zh( target_lang="it", translation_service="google", # OCR settings ocr_engine="tesseract", # "tesseract" or "easyocr" ocr_lang="en", # Source language for OCR # Translation settings chunk_size=500, # Text chunk size for translation max_retries=3, # Maximum retry attempts for translation # Output settings output_format="pdf", preserve_layout=True, font_family="SimSun", # Font for Chinese text in PDF # Cache settings use_cache=True, # Enable translation cache cache_dir=".translation_cache" # Cache directory ) # Translate with progress callback def progress_callback(current, total): print(f"Progress: {current}/{total} pages") engine.translate("input.pdf", "output.pdf", progress_callback=progress_callback) ``` ### Custom Translation Function {#custom-translation-function} ```python from pdf2zh import pdf2zh # Define custom translation function def my_translator(text, source_lang="en", target_lang="it"): # Your custom translation logic here # This could call an API, use a local model, etc. translated_text = text.upper() # Example: just convert to uppercase return translated_text # Initialize with custom translator engine = pdf2zh( target_lang="it", translation_service="custom", custom_translator=my_translator ) engine.translate("input.pdf", "output.pdf") ``` ### Batch Processing {#batch-processing} ```python from pdf2zh import pdf2zh engine = pdf2zh(target_lang="it") # Batch process multiple files files = [ ("doc1.pdf", "doc1_it.pdf"), ("doc2.pdf", "doc2_it.pdf"), ("doc3.pdf", "doc3_it.pdf") ] for input_file, output_file in files: try: engine.translate(input_file, output_file) print(f"Successfully translated {input_file}") except Exception as e: print(f"Error translating {input_file}: {e}") ``` ### Error Handling {#error-handling} ```python from pdf2zh import pdf2zh import logging # Set up logging logging.basicConfig(level=logging.INFO) engine = pdf2zh(target_lang="it") try: engine.translate("input.pdf", "output.pdf") except FileNotFoundError: print("Input file not found") except PermissionError: print("Permission denied for file operations") except Exception as e: print(f"Unexpected error: {e}") ``` ### Using Context Managers {#using-context-managers} ```python from pdf2zh import pdf2zh # Using context manager for automatic resource cleanup with pdf2zh(target_lang="it") as engine: engine.translate("input.pdf", "output.pdf") # Engine resources are automatically released here ``` --- ### OUTPUT LANGUAGE it
pt: {#minimal-usage-example-async} The following code demonstrates the most basic usage of `pdf2zh`: ```python import asyncio from pdf2zh import pdf2zh_async async def main(): # Initialize the client client = pdf2zh_async() # Upload a PDF file and process it result = await client.process("sample.pdf") # Print the translated text print(result) asyncio.run(main()) ``` ### Minimal Usage Example (Sync) {#minimal-usage-example-sync} If you prefer synchronous code, here's the equivalent example: ```python from pdf2zh import pdf2zh_sync # Initialize the client client = pdf2zh_sync() # Upload a PDF file and process it result = client.process("sample.pdf") # Print the translated text print(result) ``` ### Processing Options {#processing-options} The `process` method accepts several parameters to customize the translation: ```python result = await client.process( "document.pdf", target_lang="pt", # Target language (default: "zh") source_lang="en", # Source language (auto-detected if not specified) translation_service="google", # Translation service to use ignore_format=True, # Ignore formatting (text only) ignore_images=True, # Skip image processing ignore_tables=True, # Skip table processing ignore_equations=True, # Skip equation processing ) ``` ### Handling Large Documents {#handling-large-documents} For large PDF documents, you can process them in chunks to avoid memory issues: ```python # Process with chunking enabled result = await client.process( "large_document.pdf", chunk_size=10, # Number of pages per chunk overlap=1, # Overlap pages between chunks ) ``` ### Error Handling {#error-handling} Always wrap your processing in try-catch blocks: ```python try: result = await client.process("document.pdf") print(result) except Exception as e: print(f"Error processing document: {e}") ``` ### Using Different Translation Services {#using-different-translation-services} `pdf2zh` supports multiple translation services. You can specify which one to use: ```python result = await client.process( "document.pdf", translation_service="google", # Options: "google", "deepl", "openai", "azure" # Service-specific API keys are read from environment variables ) ``` See [Translation Services Documentation](translation-services.md) for setup instructions. ### Custom Translation Functions {#custom-translation-functions} You can provide your own translation function for maximum flexibility: ```python async def my_translator(text, source_lang, target_lang): # Your custom translation logic here return translated_text result = await client.process( "document.pdf", custom_translator=my_translator ) ``` ### Progress Tracking {#progress-tracking} Track the progress of document processing: ```python def progress_callback(current, total): print(f"Processed {current}/{total} pages") result = await client.process( "document.pdf", progress_callback=progress_callback ) ``` ### Saving Results {#saving-results} Save the translated document to a file: ```python result = await client.process("document.pdf") # Save as text file with open("translated.txt", "w", encoding="utf-8") as f: f.write(result) # Save as PDF (preserves layout) await client.save_as_pdf(result, "translated.pdf") ``` ### Advanced Configuration {#advanced-configuration} For advanced users, you can configure various aspects of the processing: ```python client = pdf2zh_async( timeout=300, # Request timeout in seconds max_retries=3, # Maximum retry attempts concurrent_requests=5, # Number of concurrent translation requests cache_enabled=True, # Enable caching of translations ) ``` Check the [Advanced Options](advanced-options.md) documentation for more details. --- ### TRANSLATION RESULT ### Exemplo Mínimo de Uso (Assíncrono) {#exemplo-mínimo-de-uso-assíncrono} O código a seguir demonstra o uso mais básico do `pdf2zh`: ```python import asyncio from pdf2zh import pdf2zh_async async def main(): # Inicializa o cliente client = pdf2zh_async() # Faz upload de um arquivo PDF e o processa result = await client.process("sample.pdf") # Imprime o texto traduzido print(result) asyncio.run(main()) ``` ### Exemplo Mínimo de Uso (Síncrono) {#exemplo-mínimo-de-uso-síncrono} Se você prefere código síncrono, aqui está o exemplo equivalente: ```python from pdf2zh import pdf2zh_sync # Inicializa o cliente client = pdf2zh_sync() # Faz upload de um arquivo PDF e o processa result = client.process("sample.pdf") # Imprime o texto traduzido print(result) ``` ### Opções de Processamento {#opções-de-processamento} O método `process` aceita vários parâmetros para personalizar a tradução: ```python result = await client.process( "document.pdf", target_lang="pt", # Idioma de destino (padrão: "zh") source_lang="en", # Idioma de origem (detectado automaticamente se não especificado) translation_service="google", # Serviço de tradução a ser usado ignore_format=True, # Ignorar formatação (apenas texto) ignore_images=True, # Pular processamento de imagens ignore_tables=True, # Pular processamento de tabelas ignore_equations=True, # Pular processamento de equações ) ``` ### Manipulação de Documentos Grandes {#manipulação-de-documentos-grandes} Para documentos PDF grandes, você pode processá-los em partes para evitar problemas de memória: ```python # Processa com divisão em partes habilitada result = await client.process( "large_document.pdf", chunk_size=10, # Número de páginas por parte overlap=1, # Sobreposição de páginas entre partes ) ``` ### Tratamento de Erros {#tratamento-de-erros} Sempre envolva seu processamento em blocos try-catch: ```python try: result = await client.process("document.pdf") print(result) except Exception as e: print(f"Erro ao processar documento: {e}") ``` ### Usando Diferentes Serviços de Tradução {#usando-diferentes-serviços-de-tradução} O `pdf2zh` suporta vários serviços de tradução. Você pode especificar qual usar: ```python result = await client.process( "document.pdf", translation_service="google", # Opções: "google", "deepl", "openai", "azure" # Chaves de API específicas do serviço são lidas das variáveis de ambiente ) ``` Consulte a [Documentação dos Serviços de Tradução](translation-services.md) para instruções de configuração. ### Funções de Tradução Personalizadas {#funções-de-tradução-personalizadas} Você pode fornecer sua própria função de tradução para máxima flexibilidade: ```python async def my_translator(text, source_lang, target_lang): # Sua lógica de tradução personalizada aqui return translated_text result = await client.process( "document.pdf", custom_translator=my_translator ) ``` ### Acompanhamento de Progresso {#acompanhamento-de-progresso} Acompanhe o progresso do processamento do documento: ```python def progress_callback(current, total): print(f"Páginas processadas {current}/{total}") result = await client.process( "document.pdf", progress_callback=progress_callback ) ``` ### Salvando Resultados {#salvando-resultados} Salve o documento traduzido em um arquivo: ```python result = await client.process("document.pdf") # Salva como arquivo de texto with open("translated.txt", "w", encoding="utf-8") as f: f.write(result) # Salva como PDF (preserva layout) await client.save_as_pdf(result, "translated.pdf") ``` ### Configuração Avançada {#configuração-avançada} Para usuários avançados, você pode configurar vários aspectos do processamento: ```python client = pdf2zh_async( timeout=300, # Tempo limite da solicitação em segundos max_retries=3, # Tentativas máximas de repetição concurrent_requests=5, # Número de solicitações de tradução simultâneas cache_enabled=True, # Habilita cache de traduções ) ``` Verifique a documentação de [Opções Avançadas](advanced-options.md) para mais detalhes.
ru: {#minimal-usage-example-async} ```python import asyncio from pdf2zh import pdf2zh async def main(): result = await pdf2zh( "input.pdf", "output.pdf", # You can also use `target_lang_code` to specify the target language target_lang_code="ru", ) print(result) asyncio.run(main()) ``` ### Minimal Usage Example (Sync) {#minimal-usage-example-sync} ```python from pdf2zh import pdf2zh_sync result = pdf2zh_sync( "input.pdf", "output.pdf", target_lang_code="ru", ) print(result) ``` ### Minimal Usage Example (CLI) {#minimal-usage-example-cli} ```bash pdf2zh input.pdf output.pdf --target-lang-code ru ``` --- ### TRANSLATION
