Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_F18B5199
source: - Always handle both error events and exceptions from the generator. - Break the loop on `finish` to avoid unnecessary work. - Ensure the `file` exists and `settings.validate_settings()` passes before calling. - Large documents may be split; use `part_index/total_parts` and `overall_progress` to drive your UI. - Debounce `progress_update` if your UI is sensitive to repeated, identical updates. - `report_interval` (SettingsModel): controls only the emission rate of `progress_update` events. It does not affect `stage_summary`, `progress_start`, `progress_end`, or `finish`. Default is 0.1s and the minimum allowed is 0.05s. As per the progress monitor logic, when `stage_total <= 3`, updates are not throttled by `report_interval`.
de: --- ### TRANSLATION RESULT - Behandeln Sie immer sowohl Fehlerereignisse als auch Ausnahmen vom Generator. - Brechen Sie die Schleife bei `finish` ab, um unnötige Arbeit zu vermeiden. - Stellen Sie sicher, dass die `file` existiert und `settings.validate_settings()` erfolgreich ist, bevor Sie den Aufruf durchführen. - Große Dokumente können aufgeteilt werden; verwenden Sie `part_index/total_parts` und `overall_progress`, um Ihre Benutzeroberfläche zu steuern. - Entprellen Sie `progress_update`, wenn Ihre Benutzeroberfläche empfindlich auf wiederholte, identische Updates reagiert. - `report_interval` (SettingsModel): steuert nur die Emissionsrate von `progress_update`-Ereignissen. Es beeinflusst nicht `stage_summary`, `progress_start`, `progress_end` oder `finish`. Der Standardwert ist 0,1s und das Minimum ist 0,05s. Gemäß der Fortschrittsmonitor-Logik werden bei `stage_total <= 3` Updates nicht durch `report_interval` gedrosselt.
fr: --- ### OUTPUT LANGUAGE fr --- ### OUTPUT - Toujours gérer à la fois les événements d'erreur et les exceptions du générateur. - Interrompre la boucle sur `finish` pour éviter un travail inutile. - S'assurer que le `file` existe et que `settings.validate_settings()` passe avant l'appel. - Les documents volumineux peuvent être divisés ; utiliser `part_index/total_parts` et `overall_progress` pour piloter votre interface utilisateur. - Débouncer `progress_update` si votre interface utilisateur est sensible aux mises à jour répétées et identiques. - `report_interval` (SettingsModel) : contrôle uniquement le taux d'émission des événements `progress_update`. Il n'affecte pas `stage_summary`, `progress_start`, `progress_end` ou `finish`. La valeur par défaut est 0.1s et le minimum autorisé est 0.05s. Selon la logique du moniteur de progression, lorsque `stage_total <= 3`, les mises à jour ne sont pas limitées par `report_interval`.
it: ### Example ```python import asyncio from typing import Optional from pdf2zh import translate_pdf async def handle_translation(): try: # Initialize the translation generator = translate_pdf( file="document.pdf", target_language="es", source_language="en" ) # Process events async for event in generator: if event['type'] == 'progress_start': print(f"Starting translation: {event['data']['message']}") elif event['type'] == 'stage_summary': stage = event['data'] print(f"Stage: {stage['stage']} - {stage['description']}") elif event['type'] == 'progress_update': progress = event['data'] print(f"Progress: {progress['current']}/{progress['total']} " f"({progress['percentage']}%) - Part {progress['part_index']}/{progress['total_parts']}") elif event['type'] == 'progress_end': print(f"Translation completed: {event['data']['message']}") elif event['type'] == 'finish': result = event['data'] print(f"Translation finished. Output file: {result['output_file']}") break except Exception as e: print(f"Translation failed: {e}") # Run the translation asyncio.run(handle_translation()) ``` ### Event Types - `progress_start`: Emitted when translation starts. Contains a welcome message. - `stage_summary`: Emitted at the beginning of each major stage. Describes the stage. - `progress_update`: Emitted periodically during processing. Shows current progress. - `progress_end`: Emitted when translation processing completes. Contains completion message. - `finish`: Emitted when the entire translation is complete. Contains result data. - `error`: Emitted when an error occurs. Contains error information. ### Data Structure Each event contains: - `type`: The event type (string) - `data`: Event-specific data (dictionary) ### Error Handling The generator may raise exceptions for: - Invalid file paths - Unsupported languages - Network errors - Permission errors Always wrap the async for loop in a try-except block. --- ### TRANSLATION RESULT - Gestisci sempre sia gli eventi di errore che le eccezioni dal generatore. - Interrompi il ciclo su `finish` per evitare lavoro non necessario. - Assicurati che il `file` esista e che `settings.validate_settings()` passi prima di chiamare. - I documenti di grandi dimensioni possono essere divisi; utilizza `part_index/total_parts` e `overall_progress` per guidare la tua UI. - Debounce `progress_update` se la tua UI è sensibile ad aggiornamenti ripetuti e identici. - `report_interval` (SettingsModel): controlla solo la frequenza di emissione degli eventi `progress_update`. Non influisce su `stage_summary`, `progress_start`, `progress_end` o `finish`. Il valore predefinito è 0.1s e il minimo consentito è 0.05s. Secondo la logica del monitor di avanzamento, quando `stage_total <= 3`, gli aggiornamenti non vengono limitati da `report_interval`. ### Esempio ```python import asyncio from typing import Optional from pdf2zh import translate_pdf async def handle_translation(): try: # Inizializza la traduzione generator = translate_pdf( file="document.pdf", target_language="es", source_language="en" ) # Elabora gli eventi async for event in generator: if event['type'] == 'progress_start': print(f"Starting translation: {event['data']['message']}") elif event['type'] == 'stage_summary': stage = event['data'] print(f"Stage: {stage['stage']} - {stage['description']}") elif event['type'] == 'progress_update': progress = event['data'] print(f"Progress: {progress['current']}/{progress['total']} " f"({progress['percentage']}%) - Part {progress['part_index']}/{progress['total_parts']}") elif event['type'] == 'progress_end': print(f"Translation completed: {event['data']['message']}") elif event['type'] == 'finish': result = event['data'] print(f"Translation finished. Output file: {result['output_file']}") break except Exception as e: print(f"Translation failed: {e}") # Esegui la traduzione asyncio.run(handle_translation()) ``` ### Tipi di Evento - `progress_start`: Emesso quando inizia la traduzione. Contiene un messaggio di benvenuto. - `stage_summary`: Emesso all'inizio di ogni fase principale. Descrive la fase. - `progress_update`: Emesso periodicamente durante l'elaborazione. Mostra lo stato di avanzamento corrente. - `progress_end`: Emesso quando l'elaborazione della traduzione è completata. Contiene un messaggio di completamento. - `finish`: Emesso quando l'intera traduzione è completa. Contiene i dati del risultato. - `error`: Emesso quando si verifica un errore. Contiene informazioni sull'errore. ### Struttura dei Dati Ogni evento contiene: - `type`: Il tipo di evento (stringa) - `data`: Dati specifici dell'evento (dizionario) ### Gestione degli Errori Il generatore può sollevare eccezioni per: - Percorsi di file non validi - Lingue non supportate - Errori di rete - Errori di permesso Avvolgi sempre il ciclo async for in un blocco try-except.
pt: --- ### OUTPUT - Sempre trate tanto eventos de erro quanto exceções do gerador. - Interrompa o loop em `finish` para evitar trabalho desnecessário. - Certifique-se de que o `file` existe e que `settings.validate_settings()` passa antes de chamar. - Documentos grandes podem ser divididos; use `part_index/total_parts` e `overall_progress` para orientar sua interface do usuário. - Faça debounce de `progress_update` se sua interface do usuário for sensível a atualizações repetidas e idênticas. - `report_interval` (SettingsModel): controla apenas a taxa de emissão de eventos `progress_update`. Não afeta `stage_summary`, `progress_start`, `progress_end` ou `finish`. O padrão é 0,1s e o mínimo permitido é 0,05s. Conforme a lógica do monitor de progresso, quando `stage_total <= 3`, as atualizações não são limitadas por `report_interval`. --- ### ORIGINAL TEXT ### Example Event Shapes This is a list of example event shapes. !!! note The examples below are for illustration purposes only. The actual events may vary. #### Example 1: Simple Event ```json { "event_id": "12345", "event_type": "user_login", "timestamp": "2023-10-05T14:48:00Z", "user_id": "user_67890", "ip_address": "192.168.1.1" } ``` #### Example 2: Event with Nested Data ```json { "event_id": "67890", "event_type": "purchase", "timestamp": "2023-10-05T15:30:00Z", "user": { "user_id": "user_12345", "email": "user@example.com", "name": "John Doe" }, "items": [ { "product_id": "prod_1", "quantity": 2, "price": 19.99 }, { "product_id": "prod_2", "quantity": 1, "price": 9.99 } ], "total_amount": 49.97 } ``` #### Example 3: Event with Array of Strings ```json { "event_id": "abcde", "event_type": "search", "timestamp": "2023-10-05T16:15:00Z", "query": "example query", "filters": ["filter1", "filter2", "filter3"], "results_count": 15 } ``` --- ### OUTPUT ### Exemplo de Formatos de Evento Esta é uma lista de exemplo de formatos de evento. !!! note Os exemplos abaixo são apenas para fins de ilustração. Os eventos reais podem variar. #### Exemplo 1: Evento Simples ```json { "event_id": "12345", "event_type": "user_login", "timestamp": "2023-10-05T14:48:00Z", "user_id": "user_67890", "ip_address": "192.168.1.1" } ``` #### Exemplo 2: Evento com Dados Aninhados ```json { "event_id": "67890", "event_type": "purchase", "timestamp": "2023-10-05T15:30:00Z", "user": { "user_id": "user_12345", "email": "user@example.com", "name": "John Doe" }, "items": [ { "product_id": "prod_1", "quantity": 2, "price": 19.99 }, { "product_id": "prod_2", "quantity": 1, "price": 9.99 } ], "total_amount": 49.97 } ``` #### Exemplo 3: Evento com Array de Strings ```json { "event_id": "abcde", "event_type": "search", "timestamp": "2023-10-05T16:15:00Z", "query": "example query", "filters": ["filter1", "filter2", "filter3"], "results_count": 15 } ```
ru: --- ### TRANSLATION RESULT ### Примечания и рекомендации - **Используйте с осторожностью**: Будьте осторожны при использовании этой функции, особенно если документ содержит конфиденциальную информацию. - **Сначала протестируйте**: Всегда сначала тестируйте функцию на некритичном документе, чтобы убедиться, что она соответствует вашим ожиданиям. - **Резервное копирование документов**: Сохраняйте резервные копии исходных документов перед обработкой. - **Проверяйте результаты**: После обработки просмотрите документ, чтобы убедиться, что перевод точен, а форматирование сохранено. --- - Всегда обрабатывайте как события ошибок, так и исключения из генератора. - Прерывайте цикл при `finish`, чтобы избежать ненужной работы. - Убедитесь, что `file` существует и `settings.validate_settings()` проходит успешно перед вызовом. - Большие документы могут быть разделены; используйте `part_index/total_parts` и `overall_progress` для управления вашим пользовательским интерфейсом. - Дебаунсите `progress_update`, если ваш пользовательский интерфейс чувствителен к повторяющимся, идентичным обновлениям. - `report_interval` (SettingsModel): управляет только частотой генерации событий `progress_update`. Он не влияет на `stage_summary`, `progress_start`, `progress_end` или `finish`. По умолчанию 0.1 с, минимально допустимое значение — 0.05 с. Согласно логике монитора прогресса, когда `stage_total <= 3`, обновления не регулируются `report_interval`.

# chunk_9221A870
source: [**Advanced**](./introduction.md) > **Documentation of Translation Services** _(current)_
de: [**Erweiterte Optionen**](./introduction.md) > **Dokumentation der Übersetzungsdienste** _(aktuell)_
fr: [**Options avancées**](./introduction.md) > **Documentation des services de traduction** _(actuel)_
it: [**Opzioni avanzate**](./introduction.md) > **Documentazione dei servizi di traduzione** _(attuale)_
pt: [**Opções avançadas**](./introduction.md) > **Documentação dos serviços de tradução** _(atual)_
ru: [**Расширенные параметры**](./introduction.md) > **Документация служб перевода** _(текущая)_

# chunk_7775DA81
source: ### Viewing Available Translate Services via Command Line
de: ### Verfügbare Übersetzungsdienste über die Kommandozeile anzeigen
fr: ### Visualisation des services de traduction disponibles via la ligne de commande
it: ### Visualizzazione dei servizi di traduzione disponibili tramite Riga di comando
pt: ### Visualizando Serviços de Tradução Disponíveis via Linha de comando
ru: ### Просмотр доступных служб перевода через Командную строку

# chunk_4919DFD2
source: You can confirm the available translate services and their usage by printing the help message in the command line.
de: Sie können die verfügbaren Übersetzungsdienste und deren Verwendung bestätigen, indem Sie die Hilfemeldung in der Kommandozeile ausgeben.
fr: Vous pouvez confirmer les services de traduction disponibles et leur utilisation en affichant le message d'aide dans la ligne de commande.
it: È possibile verificare i servizi di traduzione disponibili e il loro utilizzo stampando il messaggio di aiuto nella Riga di comando.
pt: Você pode confirmar os serviços de tradução disponíveis e seu uso imprimindo a mensagem de ajuda na linha de comando.
ru: Вы можете подтвердить доступные службы перевода и их использование, распечатав справочное сообщение в командной строке.

# chunk_C2A1A031
source: At the end of the help message, you can view detailed information about the different translation services.
de: For more information, please refer to [Documentation of Translation Services](https://pdf2zh-next.com/advanced/translation_services.html). --- ### TRANSLATION RESULT Am Ende der Hilfenachricht können Sie detaillierte Informationen zu den verschiedenen Übersetzungsdiensten einsehen. Weitere Informationen finden Sie in der [Dokumentation der Übersetzungsdienste](https://pdf2zh-next.com/advanced/translation_services.html).
fr: --- ### OUTPUT À la fin du message d'aide, vous pouvez consulter des informations détaillées sur les différents services de traduction.
it: txt pdf2zh translate [OPTIONS] [FILE]... Translate a PDF file. Options: --target-language TEXT Target language code. [required] --source-language TEXT Source language code. [default: auto] --translation-service TEXT Translation service to use. [default: auto] --translation-service-key TEXT Translation service API key. --translation-service-url TEXT Translation service API URL. --translation-service-model TEXT Translation service model. --translation-engine TEXT Translation engine to use. [default: auto] --translation-engine-key TEXT Translation engine API key. --translation-engine-url TEXT Translation engine API URL. --translation-engine-model TEXT Translation engine model. --ocr-engine TEXT OCR engine to use. [default: auto] --ocr-engine-key TEXT OCR engine API key. --ocr-engine-url TEXT OCR engine API URL. --ocr-engine-model TEXT OCR engine model. --concurrency INTEGER Number of concurrent translation tasks. [default: 4] --retry INTEGER Number of retries for translation tasks. [default: 3] --timeout INTEGER Timeout for translation tasks in seconds. [default: 60] --output-format TEXT Output format. [default: pdf] --output-dir TEXT Output directory. [default: .] --output-filename TEXT Output filename. --output-options TEXT Output options. --config-file TEXT Configuration file. --quiet Suppress output. --verbose Verbose output. --version Show the version and exit. --help Show this message and exit. ``` --- ### it(ISO 639-1 code) Alla fine del messaggio di aiuto, puoi visualizzare informazioni dettagliate sui diversi servizi di traduzione. ```txt pdf2zh translate [OPZIONI] [FILE]... Traduce un file PDF. Opzioni: --target-language TESTO Codice della lingua di destinazione. [obbligatorio] --source-language TESTO Codice della lingua di origine. [predefinito: auto] --translation-service TESTO Servizio di traduzione da utilizzare. [predefinito: auto] --translation-service-key TESTO Chiave API del servizio di traduzione. --translation-service-url TESTO URL API del servizio di traduzione. --translation-service-model TESTO Modello del servizio di traduzione. --translation-engine TESTO Motore di traduzione da utilizzare. [predefinito: auto] --translation-engine-key TESTO Chiave API del motore di traduzione. --translation-engine-url TESTO URL API del motore di traduzione. --translation-engine-model TESTO Modello del motore di traduzione. --ocr-engine TESTO Motore OCR da utilizzare. [predefinito: auto] --ocr-engine-key TESTO Chiave API del motore OCR. --ocr-engine-url TESTO URL API del motore OCR. --ocr-engine-model TESTO Modello del motore OCR. --concurrency INTERO Numero di attività di traduzione concorrenti. [predefinito: 4] --retry INTERO Numero di tentativi per le attività di traduzione. [predefinito: 3] --timeout INTERO Timeout per le attività di traduzione in secondi. [predefinito: 60] --output-format TESTO Formato di output. [predefinito: pdf] --output-dir TESTO Directory di output. [predefinito: .] --output-filename TESTO Nome del file di output. --output-options TESTO Opzioni di output. --config-file TESTO File di configurazione. --quiet Sopprime l'output. --verbose Output dettagliato. --version Mostra la versione ed esce. --help Mostra questo messaggio ed esce.
pt: --- ### OUTPUT LANGUAGE pt --- ### OUTPUT No final da mensagem de ajuda, você pode visualizar informações detalhadas sobre os diferentes serviços de tradução.
ru: --- ### OUTPUT LANGUAGE ru --- ### OUTPUT В конце сообщения справки вы можете просмотреть подробную информацию о различных службах перевода.
