Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_08070A6A
source: You can cancel the task consuming the stream. Cancellation is propagated to the underlying translation process.
de: - ### Cancellation: You can cancel the task consuming the stream. Cancellation is propagated to the underlying translation process. --- ### TRANSLATION RESULT ### Kündigung Sie können die Aufgabe abbrechen, die den Stream konsumiert. Die Kündigung wird an den zugrunde liegenden Übersetzungsprozess weitergegeben.
fr: - You can cancel the task consuming the stream. Cancellation is propagated to the underlying translation process. --- ### TRANSLATION RESULT Vous pouvez annuler la tâche consommant le flux. L'annulation est propagée au processus de traduction sous-jacent.
it: - ## `do_translate_async_stream`: The `do_translate_async_stream` function is an asynchronous generator that performs translation on a stream of text chunks. It is designed to handle continuous input streams, such as those from a file being read in chunks, and yields translated chunks as they become available. ### Function Signature ```python async def do_translate_async_stream( text_chunks: AsyncIterator[str], source_language: str = "en", target_language: str = "zh", translation_services: Optional[List[str]] = None, translation_service: Optional[str] = None, api_key: Optional[str] = None, glossary: Optional[List[Tuple[str, str]]] = None, context: Optional[str] = None, instruction: Optional[str] = None, request_params: Optional[Dict[str, Any]] = None, **kwargs: Any ) -> AsyncIterator[str]: ``` ### Parameters - `text_chunks` (AsyncIterator[str]): An asynchronous iterator that yields chunks of text to be translated. - `source_language` (str, optional): The language code of the source text. Defaults to "en". - `target_language` (str, optional): The language code of the target translation. Defaults to "zh". - `translation_services` (Optional[List[str]], optional): A list of translation service names to use. If not provided, defaults to the services configured in the environment. - `translation_service` (Optional[str], optional): A specific translation service to use. If provided, overrides `translation_services`. - `api_key` (Optional[str], optional): The API key for the translation service. If not provided, uses the key from environment variables. - `glossary` (Optional[List[Tuple[str, str]]], optional): A list of tuples representing custom glossary terms. Each tuple should be (source_term, target_term). - `context` (Optional[str], optional): Additional context to provide to the translation service for better accuracy. - `instruction` (Optional[str], optional): Specific instructions for the translation service. - `request_params` (Optional[Dict[str, Any]], optional): Additional parameters to pass to the translation service API request. - `**kwargs`: Additional keyword arguments that may be passed to the underlying translation functions. ### Returns - `AsyncIterator[str]`: An asynchronous iterator that yields translated chunks of text. ### Example Usage ```python import asyncio from pdf2zh import do_translate_async_stream async def text_chunk_generator(): # Simulate reading chunks from a file or stream chunks = ["First chunk of text.", "Second chunk of text.", "Third chunk."] for chunk in chunks: yield chunk await asyncio.sleep(0.1) # Simulate async delay async def main(): translated_chunks = [] async for translated_chunk in do_translate_async_stream( text_chunk_generator(), source_language="en", target_language="zh" ): translated_chunks.append(translated_chunk) print(f"Translated: {translated_chunk}") full_translation = "".join(translated_chunks) print("Full translation:", full_translation) asyncio.run(main()) ``` ### Notes - This function is useful for processing large texts in a memory-efficient manner, as it processes and yields translations chunk by chunk. - The function handles the concatenation of chunks internally to ensure coherent translations across chunk boundaries. - Error handling is built into the function, and it will raise exceptions if the translation services encounter issues. --- ### TRANSLATION RESULT ## `do_translate_async_stream` La funzione `do_translate_async_stream` è un generatore asincrono che esegue la traduzione su un flusso di blocchi di testo. È progettata per gestire flussi di input continui, come quelli provenienti da un file letto in blocchi, e restituisce i blocchi tradotti man mano che diventano disponibili. ### Firma della funzione ```python async def do_translate_async_stream( text_chunks: AsyncIterator[str], source_language: str = "en", target_language: str = "zh", translation_services: Optional[List[str]] = None, translation_service: Optional[str] = None, api_key: Optional[str] = None, glossary: Optional[List[Tuple[str, str]]] = None, context: Optional[str] = None, instruction: Optional[str] = None, request_params: Optional[Dict[str, Any]] = None, **kwargs: Any ) -> AsyncIterator[str]: ``` ### Parametri - `text_chunks` (AsyncIterator[str]): Un iteratore asincrono che restituisce blocchi di testo da tradurre. - `source_language` (str, opzionale): Il codice lingua del testo sorgente. Predefinito a "en". - `target_language` (str, opzionale): Il codice lingua della traduzione di destinazione. Predefinito a "zh". - `translation_services` (Optional[List[str]], opzionale): Un elenco di nomi di servizi di traduzione da utilizzare. Se non fornito, utilizza i servizi configurati nell'ambiente. - `translation_service` (Optional[str], opzionale): Un servizio di traduzione specifico da utilizzare. Se fornito, sovrascrive `translation_services`. - `api_key` (Optional[str], opzionale): La chiave API per il servizio di traduzione. Se non fornita, utilizza la chiave dalle variabili d'ambiente. - `glossary` (Optional[List[Tuple[str, str]]], opzionale): Un elenco di tuple che rappresentano termini personalizzati del glossario. Ogni tupla dovrebbe essere (termine_sorgente, termine_destinazione). - `context` (Optional[str], opzionale): Contesto aggiuntivo da fornire al servizio di traduzione per una migliore accuratezza. - `instruction` (Optional[str], opzionale): Istruzioni specifiche per il servizio di traduzione. - `request_params` (Optional[Dict[str, Any]], opzionale): Parametri aggiuntivi da passare alla richiesta API del servizio di traduzione. - `**kwargs`: Argomenti chiave aggiuntivi che possono essere passati alle funzioni di traduzione sottostanti. ### Restituisce - `AsyncIterator[str]`: Un iteratore asincrono che restituisce blocchi di testo tradotti. ### Esempio di utilizzo ```python import asyncio from pdf2zh import do_translate_async_stream async def text_chunk_generator(): # Simula la lettura di blocchi da un file o flusso chunks = ["First chunk of text.", "Second chunk of text.", "Third chunk."] for chunk in chunks: yield chunk await asyncio.sleep(0.1) # Simula un ritardo asincrono async def main(): translated_chunks = [] async for translated_chunk in do_translate_async_stream( text_chunk_generator(), source_language="en", target_language="zh" ): translated_chunks.append(translated_chunk) print(f"Translated: {translated_chunk}") full_translation = "".join(translated_chunks) print("Full translation:", full_translation) asyncio.run(main()) ``` ### Note - Questa funzione è utile per elaborare testi di grandi dimensioni in modo efficiente in termini di memoria, poiché elabora e restituisce le traduzioni blocco per blocco. - La funzione gestisce la concatenazione dei blocchi internamente per garantire traduzioni coerenti attraverso i confini dei blocchi. - La gestione degli errori è integrata nella funzione e solleverà eccezioni se i servizi di traduzione incontrano problemi. - ### Notes & Best Practices: - **Translation Quality**: While the service provides high-quality translations, it's important to review critical translations, especially for professional or academic use. - **File Size**: Large files may take longer to process. Consider breaking very large documents into smaller parts. - **Formatting**: Some complex formatting might not be preserved perfectly. Simple, text-based documents translate best. - **Privacy**: Be mindful of sensitive information. While the service is secure, avoid translating highly confidential documents through any online service. - **Supported Languages**: Check the list of supported languages before processing your documents. --- ### LANGUAGE it --- ### BYPASS LIST - pdf2zh - PDFMathTranslate - --- --- ### ORIGINAL TEXT You can cancel the task consuming the stream. Cancellation is propagated to the underlying translation process. --- ### TRANSLATION RESULT Puoi annullare il task che consuma il flusso. L'annullamento viene propagato al processo di traduzione sottostante. - ## `do_translate_async_stream`: The `do_translate_async_stream` function is an asynchronous generator that performs translation on a stream of text chunks. It is designed to handle continuous input streams, such as those from a file being read in chunks, and yields translated chunks as they become available. ### Function Signature ```python async def do_translate_async_stream( text_chunks: AsyncIterator[str], source_language: str = "en", target_language: str = "zh", translation_services: Optional[List[str]] = None, translation_service: Optional[str] = None, api_key: Optional[str] = None, glossary: Optional[List[Tuple[str, str]]] = None, context: Optional[str] = None, instruction: Optional[str] = None, request_params: Optional[Dict[str, Any]] = None, **kwargs: Any ) -> AsyncIterator[str]: ``` ### Parameters - `text_chunks` (AsyncIterator[str]): An asynchronous iterator that yields chunks of text to be translated. - `source_language` (str, optional): The language code of the source text. Defaults to "en". - `target_language` (str, optional): The language code of the target translation. Defaults to "zh". - `translation_services` (Optional[List[str]], optional): A list of translation service names to use. If not provided, defaults to the services configured in the environment. - `translation_service` (Optional[str], optional): A specific translation service to use. If provided, overrides `translation_services`. - `api_key` (Optional[str], optional): The API key for the translation service. If not provided, uses the key from environment variables. - `glossary` (Optional[List[Tuple[str, str]]], optional): A list of tuples representing custom glossary terms. Each tuple should be (source_term, target_term). - `context` (Optional[str], optional): Additional context to provide to the translation service for better accuracy. - `instruction` (Optional[str], optional): Specific instructions for the translation service. - `request_params` (Optional[Dict[str, Any]], optional): Additional parameters to pass to the translation service API request. - `**kwargs`: Additional keyword arguments that may be passed to the underlying translation functions. ### Returns - `AsyncIterator[str]`: An asynchronous iterator that yields translated chunks of text. ### Example Usage ```python import asyncio from pdf2zh import do_translate_async_stream async def text_chunk_generator(): # Simulate reading chunks from a file or stream chunks = ["First chunk of text.", "Second chunk of text.", "Third chunk."] for chunk in chunks: yield chunk await asyncio.sleep(0.1) # Simulate async delay async def main(): translated_chunks = [] async for translated_chunk in do_translate_async_stream( text_chunk_generator(), source_language="en", target_language="zh" ): translated_chunks.append(translated_chunk) print(f"Translated: {translated_chunk}") full_translation = "".join(translated_chunks) print("Full translation:", full_translation) asyncio.run(main()) ``` ### Notes - This function is useful for processing large texts in a memory-efficient manner, as it processes and yields translations chunk by chunk. - The function handles the concatenation of chunks internally to ensure coherent translations across chunk boundaries. - Error handling is built into the function, and it will raise exceptions if the translation services encounter issues. --- ### TRANSLATION RESULT ## `do_translate_async_stream` La funzione `do_translate_async_stream` è un generatore asincrono che esegue la traduzione su un flusso di blocchi di testo. È progettata per gestire flussi di input continui, come quelli provenienti da un file letto in blocchi, e restituisce i blocchi tradotti man mano che diventano disponibili. ### Firma della funzione ```python async def do_translate_async_stream( text_chunks: AsyncIterator[str], source_language: str = "en", target_language: str = "zh", translation_services: Optional[List[str]] = None, translation_service: Optional[str] = None, api_key: Optional[str] = None, glossary: Optional[List[Tuple[str, str]]] = None, context: Optional[str] = None, instruction: Optional[str] = None, request_params: Optional[Dict[str, Any]] = None, **kwargs: Any ) -> AsyncIterator[str]: ``` ### Parametri - `text_chunks` (AsyncIterator[str]): Un iteratore asincrono che restituisce blocchi di testo da tradurre. - `source_language` (str, opzionale): Il codice lingua del testo sorgente. Predefinito a "en". - `target_language` (str, opzionale): Il codice lingua della traduzione di destinazione. Predefinito a "zh". - `translation_services` (Optional[List[str]], opzionale): Un elenco di nomi di servizi di traduzione da utilizzare. Se non fornito, utilizza i servizi configurati nell'ambiente. - `translation_service` (Optional[str], opzionale): Un servizio di traduzione specifico da utilizzare. Se fornito, sovrascrive `translation_services`. - `api_key` (Optional[str], opzionale): La chiave API per il servizio di traduzione. Se non fornita, utilizza la chiave dalle variabili d'ambiente. - `glossary` (Optional[List[Tuple[str, str]]], opzionale): Un elenco di tuple che rappresentano termini personalizzati del glossario. Ogni tupla dovrebbe essere (termine_sorgente, termine_destinazione). - `context` (Optional[str], opzionale): Contesto aggiuntivo da fornire al servizio di traduzione per una migliore accuratezza. - `instruction` (Optional[str], opzionale): Istruzioni specifiche per il servizio di traduzione. - `request_params` (Optional[Dict[str, Any]], opzionale): Parametri aggiuntivi da passare alla richiesta API del servizio di traduzione. - `**kwargs`: Argomenti chiave aggiuntivi che possono essere passati alle funzioni di traduzione sottostanti. ### Restituisce - `AsyncIterator[str]`: Un iteratore asincrono che restituisce blocchi di testo tradotti. ### Esempio di utilizzo ```python import asyncio from pdf2zh import do_translate_async_stream async def text_chunk_generator(): # Simula la lettura di blocchi da un file o flusso chunks = ["First chunk of text.", "Second chunk of text.", "Third chunk."] for chunk in chunks: yield chunk await asyncio.sleep(0.1) # Simula un ritardo asincrono async def main(): translated_chunks = [] async for translated_chunk in do_translate_async_stream( text_chunk_generator(), source_language="en", target_language="zh" ): translated_chunks.append(translated_chunk) print(f"Translated: {translated_chunk}") full_translation = "".join(translated_chunks) print("Full translation:", full_translation) asyncio.run(main()) ``` ### Note - Questa funzione è utile per elaborare testi di grandi dimensioni in modo efficiente in termini di memoria, poiché elabora e restituisce le traduzioni blocco per blocco. - La funzione gestisce la concatenazione dei blocchi internamente per garantire traduzioni coerenti attraverso i confini dei blocchi. - La gestione degli errori è integrata nella funzione e solleverà eccezioni se i servizi di traduzione incontrano problemi. - ### Notes & Best Practices: - **Translation Quality**: While the service provides high-quality translations, it's important to review critical translations, especially for professional or academic use. - **File Size**: Large files may take longer to process. Consider breaking very large documents into smaller parts. - **Formatting**: Some complex formatting might not be preserved perfectly. Simple, text-based documents translate best. - **Privacy**: Be mindful of sensitive information. While the service is secure, avoid translating highly confidential documents through any online service. - **Supported Languages**: Check the list of supported languages before processing your documents. --- ### LANGUAGE it --- ### BYPASS LIST - pdf2zh - PDFMathTranslate - --- --- ### ORIGINAL TEXT You can cancel the task consuming the stream. Cancellation is propagated to the underlying translation process. --- ### TRANSLATION RESULT Puoi annullare il task che consuma il flusso. L'annullamento viene propagato al processo di traduzione sottostante.
pt: - ### Example Event Shapes: Este é uma lista de formatos de evento de exemplo. !!! note Os exemplos abaixo são apenas para fins de ilustração. Os eventos reais podem variar. #### Exemplo 1: Evento Simples ```json { "event_id": "12345", "event_type": "user_login", "timestamp": "2023-10-05T14:48:00Z", "user_id": "user_67890", "ip_address": "192.168.1.1" } ``` #### Exemplo 2: Evento com Dados Aninhados ```json { "event_id": "67890", "event_type": "purchase", "timestamp": "2023-10-05T15:30:00Z", "user": { "user_id": "user_12345", "email": "user@example.com", "name": "John Doe" }, "items": [ { "product_id": "prod_1", "quantity": 2, "price": 19.99 }, { "product_id": "prod_2", "quantity": 1, "price": 9.99 } ], "total_amount": 49.97 } ``` #### Exemplo 3: Evento com Array de Strings ```json { "event_id": "abcde", "event_type": "search", "timestamp": "2023-10-05T16:15:00Z", "query": "exemplo de consulta", "filters": ["filtro1", "filtro2", "filtro3"], "results_count": 15 } ``` --- ### OUTPUT Você pode cancelar a tarefa consumindo o fluxo. O cancelamento é propagado para o processo de tradução subjacente.
ru: python import asyncio from pdf2zh import do_translate_async_stream async def main(): # Create a task for the translation stream task = asyncio.create_task(consume_stream()) # Wait for a while await asyncio.sleep(1) # Cancel the task task.cancel() try: await task except asyncio.CancelledError: print("Translation cancelled") async def consume_stream(): async for progress, translated_text in do_translate_async_stream( file_path="input.pdf", target_lang="zh" ): print(f"Progress: {progress:.2%}") if translated_text: print(translated_text) asyncio.run(main()) ``` --- ### TRANSLATION RESULT Вы можете отменить задачу, потребляющую поток. Отмена передается в базовый процесс перевода. ```python import asyncio from pdf2zh import do_translate_async_stream async def main(): # Создаем задачу для потока перевода task = asyncio.create_task(consume_stream()) # Ждем некоторое время await asyncio.sleep(1) # Отменяем задачу task.cancel() try: await task except asyncio.CancelledError: print("Перевод отменен") async def consume_stream(): async for progress, translated_text in do_translate_async_stream( file_path="input.pdf", target_lang="zh" ): print(f"Прогресс: {progress:.2%}") if translated_text: print(translated_text) asyncio.run(main())
