Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_9D0BEC24
source: | `--help`, `-h` | Show help message and exit | `pdf2zh_next -h` |
de: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--version`, `-v` | Show version and exit | `pdf2zh_next -v` | | `--input`, `-i` | Input PDF file path | `pdf2zh_next -i ./example.pdf` | | `--output`, `-o` | Output PDF file path | `pdf2zh_next -i ./example.pdf -o ./example_zh.pdf` | | `--lang`, `-l` | Target language code, default is `zh`, see [Supported Languages](./SUPPORTED_LANG.md) | `pdf2zh_next -i ./example.pdf -l ja` | | `--service`, `-s` | Translation service, default is `google`, see [Translation Services](./TRANSLATION.md) | `pdf2zh_next -i ./example.pdf -s deepl` | | `--service-url`, `-su` | Custom translation service URL | `pdf2zh_next -i ./example.pdf --service-url http://localhost:8080/translate` | | `--service-key`, `-sk` | Translation service API key (if required) | `pdf2zh_next -i ./example.pdf -s deepl -sk YOUR_DEEPL_API_KEY` | | `--service-region`, `-sr` | Translation service region (if required) | `pdf2zh_next -i ./example.pdf -s azure -sr eastus` | | `--model`, `-m` | Translation model (if required) | `pdf2zh_next -i ./example.pdf -s openai -m gpt-4` | | `--math-mode`, `-mm` | Math translation mode, default is `normal`, see [Math Translation](./MATH_TRANSLATE.md) | `pdf2zh_next -i ./example.pdf -mm hybrid` | | `--math-translator`, `-mt` | Math translator, default is `latex`, see [Math Translation](./MATH_TRANSLATE.md) | `pdf2zh_next -i ./example.pdf -mt google` | | `--font-size`, `-fs` | Font size adjustment, default is `0` | `pdf2zh_next -i ./example.pdf -fs 2` | | `--font-family`, `-ff` | Font family, default is `SimSun, NSimSun, serif` | `pdf2zh_next -i ./example.pdf -ff "Times New Roman, serif"` | | `--font-family-cjk`, `-ffc` | CJK font family, default is `SimSun, NSimSun, serif` | `pdf2zh_next -i ./example.pdf -ffc "SimHei, sans-serif"` | | `--line-spacing`, `-ls` | Line spacing, default is `1.2` | `pdf2zh_next -i ./example.pdf -ls 1.5` | | `--paragraph-spacing`, `-ps` | Paragraph spacing, default is `0.3` | `pdf2zh_next -i ./example.pdf -ps 0.5` | | `--char-spacing`, `-cs` | Character spacing, default is `0` | `pdf2zh_next -i ./example.pdf -cs 0.5` | | `--page-margin`, `-pm` | Page margin, default is `0` | `pdf2zh_next -i ./example.pdf -pm 10` | | `--workers`, `-w` | Number of workers, default is `4` | `pdf2zh_next -i ./example.pdf -w 8` | | `--timeout`, `-t` | Translation timeout in seconds, default is `30` | `pdf2zh_next -i ./example.pdf -t 60` | | `--retry`, `-r` | Number of retries, default is `3` | `pdf2zh_next -i ./example.pdf -r 5` | | `--config`, `-c` | Configuration file path | `pdf2zh_next -c ./config.json` | | `--debug`, `-d` | Enable debug mode | `pdf2zh_next -i ./example.pdf -d` | | `--yes`, `-y` | Skip confirmation prompts | `pdf2zh_next -i ./example.pdf -y` | | `--list-languages`, `-ll` | List supported languages | `pdf2zh_next -ll` | | `--list-services`, `-lsv` | List supported translation services | `pdf2zh_next -lsv` | | `--list-math-modes`, `-lmm` | List math translation modes | `pdf2zh_next -lmm` | | `--list-math-translators`, `-lmt` | List math translators | `pdf2zh_next -lmt` | --- ### OUTPUT | `--help`, `-h` | Zeige Hilfenachricht und beende | `pdf2zh_next -h` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--version`, `-v` | Zeige Version und beende | `pdf2zh_next -v` | | `--input`, `-i` | Eingabe-`PDF`-Dateipfad | `pdf2zh_next -i ./example.pdf` | | `--output`, `-o` | Ausgabe-`PDF`-Dateipfad | `pdf2zh_next -i ./example.pdf -o ./example_zh.pdf` | | `--lang`, `-l` | Zielsprachcode, Standard ist `zh`, siehe [Unterstützte Sprachen](./SUPPORTED_LANG.md) | `pdf2zh_next -i ./example.pdf -l ja` | | `--service`, `-s` | Übersetzungsdienst, Standard ist `google`, siehe [Übersetzungsdienste](./TRANSLATION.md)| `pdf2zh_next -i ./example.pdf -s deepl` | | `--service-url`, `-su` | Benutzerdefinierte Übersetzungsdienst-URL | `pdf2zh_next -i ./example.pdf --service-url http://localhost:8080/translate` | | `--service-key`, `-sk` | API-Schlüssel des Übersetzungsdienstes (falls erforderlich) | `pdf2zh_next -i ./example.pdf -s deepl -sk YOUR_DEEPL_API_KEY` | | `--service-region`, `-sr` | Region des Übersetzungsdienstes (falls erforderlich) | `pdf2zh_next -i ./example.pdf -s azure -sr eastus` | | `--model`, `-m` | Übersetzungsmodell (falls erforderlich) | `pdf2zh_next -i ./example.pdf -s openai -m gpt-4` | | `--math-mode`, `-mm` | Mathematik-Übersetzungsmodus, Standard ist `normal`, siehe [Mathematik-Übersetzung](./MATH_TRANSLATE.md) | `pdf2zh_next -i ./example.pdf -mm hybrid` | | `--math-translator`, `-mt` | Mathematik-Übersetzer, Standard ist `latex`, siehe [Mathematik-Übersetzung](./MATH_TRANSLATE.md) | `pdf2zh_next -i ./example.pdf -mt google` | | `--font-size`, `-fs` | Schriftgrößenanpassung, Standard ist `0` | `pdf2zh_next -i ./example.pdf -fs 2` | | `--font-family`, `-ff` | Schriftfamilie, Standard ist `SimSun, NSimSun, serif` | `pdf2zh_next -i ./example.pdf -ff "Times New Roman, serif"` | | `--font-family-cjk`, `-ffc` | CJK-Schriftfamilie, Standard ist `SimSun, NSimSun, serif` | `pdf2zh_next -i ./example.pdf -ffc "SimHei, sans-serif"` | | `--line-spacing`, `-ls` | Zeilenabstand, Standard ist `1.2` | `pdf2zh_next -i ./example.pdf -ls 1.5` | | `--paragraph-spacing`, `-ps` | Absatzabstand, Standard ist `0.3` | `pdf2zh_next -i ./example.pdf -ps 0.5` | | `--char-spacing`, `-cs` | Zeichenabstand, Standard ist `0` | `pdf2zh_next -i ./example.pdf -cs 0.5` | | `--page-margin`, `-pm` | Seitenrand, Standard ist `0` | `pdf2zh_next -i ./example.pdf -pm 10` | | `--workers`, `-w` | Anzahl der Worker, Standard ist `4` | `pdf2zh_next -i ./example.pdf -w 8` | | `--timeout`, `-t` | Übersetzungs-Timeout in Sekunden, Standard ist `30` | `pdf2zh_next -i ./example.pdf -t 60` | | `--retry`, `-r` | Anzahl der Wiederholungsversuche, Standard ist `3` | `pdf2zh_next -i ./example.pdf -r 5` | | `--config`, `-c` | Konfigurationsdateipfad | `pdf2zh_next -c ./config.json` | | `--debug`, `-d` | Aktiviere Debug-Modus | `pdf2zh_next -i ./example.pdf -d` | | `--yes`, `-y` | Überspringe Bestätigungsaufforderungen | `pdf2zh_next -i ./example.pdf -y` | | `--list-languages`, `-ll` | Zeige unterstützte Sprachen | `pdf2zh_next -ll` | | `--list-services`, `-lsv` | Zeige unterstützte Übersetzungsdienste | `pdf2zh_next -lsv` | | `--list-math-modes`, `-lmm` | Zeige Mathematik-Übersetzungsmodi | `pdf2zh_next -lmm` | | `--list-math-translators`, `-lmt` | Zeige Mathematik-Übersetzer | `pdf2zh_next -lmt` |
fr: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--version`, `-v` | Show version and exit | `pdf2zh_next -v` | | `--input`, `-i` | Specify input file or directory | `pdf2zh_next -i input.pdf`<br>`pdf2zh_next -i ./input_dir` | | `--output`, `-o` | Specify output directory (default: `./output`) | `pdf2zh_next -i input.pdf -o ./output_dir` | | `--target-lang`, `-t` | Specify target language code (default: `zh`) | `pdf2zh_next -i input.pdf -t ja` | | `--source-lang`, `-s` | Specify source language code (default: `auto`) | `pdf2zh_next -i input.pdf -s en` | | `--translator`, `-tr` | Specify translator service (default: `google`) | `pdf2zh_next -i input.pdf -tr deepl` | | `--translator-key`, `-trk` | Specify translator service API key | `pdf2zh_next -i input.pdf -tr deepl -trk YOUR_DEEPL_API_KEY` | | `--translator-url`, `-tru` | Specify translator service API URL (for self-hosted services) | `pdf2zh_next -i input.pdf -tr openai -tru https://api.openai.com/v1` | | `--translator-model`, `-trm` | Specify translator model (for services that support multiple models) | `pdf2zh_next -i input.pdf -tr openai -trm gpt-4` | | `--force`, `-f` | Force overwrite existing output files | `pdf2zh_next -i input.pdf -f` | | `--verbose`, `-vb` | Enable verbose output | `pdf2zh_next -i input.pdf -vb` | | `--config`, `-c` | Specify configuration file path | `pdf2zh_next -c config.json` | | `--list-languages`, `-ll` | List all supported languages | `pdf2zh_next -ll` | | `--list-translators`, `-lt` | List all supported translator services | `pdf2zh_next -lt` | | `--check-update`, `-cu` | Check for updates | `pdf2zh_next -cu` | | `--max-concurrency`, `-mc` | Maximum number of concurrent translation tasks (default: `5`) | `pdf2zh_next -i input.pdf -mc 10` | | `--timeout`, `-to` | Timeout for translation requests in seconds (default: `30`) | `pdf2zh_next -i input.pdf -to 60` | | `--retry`, `-r` | Number of retries for failed translation requests (default: `3`) | `pdf2zh_next -i input.pdf -r 5` | | `--no-cache`, `-nc` | Disable translation cache | `pdf2zh_next -i input.pdf -nc` | | `--cache-dir`, `-cd` | Specify cache directory (default: `./cache`) | `pdf2zh_next -i input.pdf -cd ./my_cache` | | `--log-level`, `-l` | Set log level (`debug`, `info`, `warning`, `error`, `critical`) | `pdf2zh_next -i input.pdf -l debug` | | `--log-file`, `-lf` | Specify log file path | `pdf2zh_next -i input.pdf -lf ./app.log` | | `--dry-run`, `-dr` | Perform a dry run without actual translation | `pdf2zh_next -i input.pdf -dr` | | `--batch-size`, `-bs` | Batch size for processing multiple files (default: `10`) | `pdf2zh_next -i ./input_dir -bs 20` | | `--exclude`, `-e` | Exclude files matching pattern | `pdf2zh_next -i ./input_dir -e "*.tmp"` | | `--include`, `-in` | Include only files matching pattern | `pdf2zh_next -i ./input_dir -in "*.pdf"` | | `--preserve-layout`, `-pl` | Preserve original layout as much as possible | `pdf2zh_next -i input.pdf -pl` | | `--ocr`, `-oc` | Enable OCR for scanned PDFs | `pdf2zh_next -i scanned.pdf -oc` | | `--ocr-lang`, `-ocl` | Specify OCR language (default: `auto`) | `pdf2zh_next -i scanned.pdf -oc -ocl en` | | `--ocr-engine`, `-oce` | Specify OCR engine (`tesseract`, `easyocr`, default: `tesseract`) | `pdf2zh_next -i scanned.pdf -oc -oce easyocr` | | `--format`, `-fmt` | Output format (`pdf`, `markdown`, `text`, `html`, default: `pdf`) | `pdf2zh_next -i input.pdf -fmt markdown` | | `--watermark`, `-wm` | Add watermark to output PDF | `pdf2zh_next -i input.pdf -wm "Translated by pdf2zh"` | | `--quality`, `-q` | Output PDF quality (`low`, `medium`, `high`, default: `medium`) | `pdf2zh_next -i input.pdf -q high` | | `--dpi`, `-d` | Output DPI for images (default: `300`) | `pdf2zh_next -i input.pdf -d 600` | | `--page-range`, `-pr` | Specify page range to translate (e.g., `1-5,8,10-15`) | `pdf2zh_next -i input.pdf -pr 1-5,10` | | `--skip-translated`, `-st` | Skip pages that have already been translated | `pdf2zh_next -i input.pdf -st` | | `--resume`, `-rs` | Resume from last interrupted translation | `pdf2zh_next -i input.pdf -rs` | | `--cleanup`, `-cl` | Cleanup temporary files after processing | `pdf2zh_next -i input.pdf -cl` | | `--no-cleanup`, `-ncl` | Do not cleanup temporary files | `pdf2zh_next -i input.pdf -ncl` | | `--help-translators`, `-ht` | Show help for translator services | `pdf2zh_next -ht` | | `--help-languages`, `-hl` | Show help for language codes | `pdf2zh_next -hl` | | `--help-ocr`, `-ho` | Show help for OCR options | `pdf2zh_next -ho` | --- ### OUTPUT | `--help`, `-h` | Afficher le message d'aide et quitter | `pdf2zh_next -h` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--version`, `-v` | Afficher la version et quitter | `pdf2zh_next -v` | | `--input`, `-i` | Spécifier le fichier ou le répertoire d'entrée | `pdf2zh_next -i input.pdf`<br>`pdf2zh_next -i ./input_dir` | | `--output`, `-o` | Spécifier le répertoire de sortie (par défaut : `./output`) | `pdf2zh_next -i input.pdf -o ./output_dir` | | `--target-lang`, `-t` | Spécifier le code de langue cible (par défaut : `zh`) | `pdf2zh_next -i input.pdf -t ja` | | `--source-lang`, `-s` | Spécifier le code de langue source (par défaut : `auto`) | `pdf2zh_next -i input.pdf -s en` | | `--translator`, `-tr` | Spécifier le service de traduction (par défaut : `google`) | `pdf2zh_next -i input.pdf -tr deepl` | | `--translator-key`, `-trk` | Spécifier la clé API du service de traduction | `pdf2zh_next -i input.pdf -tr deepl -trk YOUR_DEEPL_API_KEY` | | `--translator-url`, `-tru` | Spécifier l'URL de l'API du service de traduction (pour les services auto-hébergés) | `pdf2zh_next -i input.pdf -tr openai -tru https://api.openai.com/v1` | | `--translator-model`, `-trm` | Spécifier le modèle de traduction (pour les services prenant en charge plusieurs modèles) | `pdf2zh_next -i input.pdf -tr openai -trm gpt-4` | | `--force`, `-f` | Forcer l'écrasement des fichiers de sortie existants | `pdf2zh_next -i input.pdf -f` | | `--verbose`, `-vb` | Activer la sortie détaillée | `pdf2zh_next -i input.pdf -vb` | | `--config`, `-c` | Spécifier le chemin du fichier de configuration | `pdf2zh_next -c config.json` | | `--list-languages`, `-ll` | Lister toutes les langues supportées | `pdf2zh_next -ll` | | `--list-translators`, `-lt` | Lister tous les services de traduction supportés | `pdf2zh_next -lt` | | `--check-update`, `-cu` | Vérifier les mises à jour | `pdf2zh_next -cu` | | `--max-concurrency`, `-mc` | Nombre maximum de tâches de traduction simultanées (par défaut : `5`) | `pdf2zh_next -i input.pdf -mc 10` | | `--timeout`, `-to` | Délai d'attente pour les requêtes de traduction en secondes (par défaut : `30`) | `pdf2zh_next -i input.pdf -to 60` | | `--retry`, `-r` | Nombre de tentatives pour les requêtes de traduction échouées (par défaut : `3`) | `pdf2zh_next -i input.pdf -r 5` | | `--no-cache`, `-nc` | Désactiver le cache de traduction | `pdf2zh_next -i input.pdf -nc` | | `--cache-dir`, `-cd` | Spécifier le répertoire de cache (par défaut : `./cache`) | `pdf2zh_next -i input.pdf -cd ./my_cache` | | `--log-level`, `-l` | Définir le niveau de journalisation (`debug`, `info`, `warning`, `error`, `critical`) | `pdf2zh_next -i input.pdf -l debug` | | `--log-file`, `-lf` | Spécifier le chemin du fichier de journal | `pdf2zh_next -i input.pdf -lf ./app.log` | | `--dry-run`, `-dr` | Effectuer une simulation sans traduction réelle | `pdf2zh_next -i input.pdf -dr` | | `--batch-size`, `-bs` | Taille des lots pour le traitement de plusieurs fichiers (par défaut : `10`) | `pdf2zh_next -i ./input_dir -bs 20` | | `--exclude`, `-e` | Exclure les fichiers correspondant au modèle | `pdf2zh_next -i ./input_dir -e "*.tmp"` | | `--include`, `-in` | Inclure uniquement les fichiers correspondant au modèle | `pdf2zh_next -i ./input_dir -in "*.pdf"` | | `--preserve-layout`, `-pl` | Préserver la mise en page originale autant que possible | `pdf2zh_next -i input.pdf -pl` | | `--ocr`, `-oc` | Activer la ROC pour les PDF scannés | `pdf2zh_next -i scanned.pdf -oc` | | `--ocr-lang`, `-ocl` | Spécifier la langue de la ROC (par défaut : `auto`) | `pdf2zh_next -i scanned.pdf -oc -ocl en` | | `--ocr-engine`, `-oce` | Spécifier le moteur de ROC (`tesseract`, `easyocr`, par défaut : `tesseract`) | `pdf2zh_next -i scanned.pdf -oc -oce easyocr` | | `--format`, `-fmt` | Format de sortie (`pdf`, `markdown`, `text`, `html`, par défaut : `pdf`) | `pdf2zh_next -i input.pdf -fmt markdown` | | `--watermark`, `-wm` | Ajouter un filigrane au PDF de sortie | `pdf2zh_next -i input.pdf -wm "Translated by pdf2zh"` | | `--quality`, `-q` | Qualité du PDF de sortie (`low`, `medium`, `high`, par défaut : `medium`) | `pdf2zh_next -i input.pdf -q high` | | `--dpi`, `-d` | DPI de sortie pour les images (par défaut : `300`) | `pdf2zh_next -i input.pdf -d 600` | | `--page-range`, `-pr` | Spécifier la plage de pages à traduire (par exemple, `1-5,8,10-15`) | `pdf2zh_next -i input.pdf -pr 1-5,10` | | `--skip-translated`, `-st` | Ignorer les pages déjà traduites | `pdf2zh_next -i input.pdf -st` | | `--resume`, `-rs` | Reprendre à partir de la dernière traduction interrompue | `pdf2zh_next -i input.pdf -rs` | | `--cleanup`, `-cl` | Nettoyer les fichiers temporaires après le traitement | `pdf2zh_next -i input.pdf -cl` | | `--no-cleanup`, `-ncl` | Ne pas nettoyer les fichiers temporaires | `pdf2zh_next -i input.pdf -ncl` | | `--help-translators`, `-ht` | Afficher l'aide pour les services de traduction | `pdf2zh_next -ht` | | `--help-languages`, `-hl` | Afficher l'aide pour les codes de langue | `pdf2zh_next -hl` | | `--help-ocr`, `-ho` | Afficher l'aide pour les options de ROC | `pdf2zh_next -ho` |
it: | ------------------------------- | ---------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--version`, `-v` | Show version and exit | `pdf2zh_next -v` | | `--input`, `-i` | Input PDF file path | `pdf2zh_next -i input.pdf` | | `--output`, `-o` | Output PDF file path | `pdf2zh_next -i input.pdf -o output.pdf` | | `--language`, `-l` | Target language code, default is `zh` (Chinese) | `pdf2zh_next -i input.pdf -l ja` | | `--model`, `-m` | Translation model, default is `gpt-4o-mini` | `pdf2zh_next -i input.pdf -m gpt-4o-mini` | | `--api-key`, `-k` | OpenAI API key, default is `None` | `pdf2zh_next -i input.pdf -k sk-...` | | `--api-base`, `-b` | OpenAI API base URL, default is `None` | `pdf2zh_next -i input.pdf -b https://api.openai.com/v1` | | `--proxy`, `-p` | Proxy URL, default is `None` | `pdf2zh_next -i input.pdf -p http://127.0.0.1:7890` | | `--max-concurrent`, `-c` | Maximum concurrent requests, default is `10` | `pdf2zh_next -i input.pdf -c 5` | | `--timeout`, `-t` | Request timeout in seconds, default is `60` | `pdf2zh_next -i input.pdf -t 120` | | `--retry`, `-r` | Maximum retry attempts, default is `3` | `pdf2zh_next -i input.pdf -r 5` | | `--no-cache`, `-n` | Disable cache, default is `False` | `pdf2zh_next -i input.pdf -n` | | `--cache-dir`, `-d` | Cache directory, default is `./cache` | `pdf2zh_next -i input.pdf -d ./my_cache` | | `--log-level`, `-g` | Log level, default is `INFO` | `pdf2zh_next -i input.pdf -g DEBUG` | | `--log-file`, `-f` | Log file path, default is `None` | `pdf2zh_next -i input.pdf -f log.txt` | | `--config`, `-C` | Configuration file path, default is `None` | `pdf2zh_next -i input.pdf -C config.json` | | `--force`, `-F` | Force overwrite output file, default is `False` | `pdf2zh_next -i input.pdf -F` | | `--dry-run`, `-D` | Dry run without actual translation, default is `False` | `pdf2zh_next -i input.pdf -D` | | `--list-languages`, `-L` | List supported languages and exit | `pdf2zh_next -L` | | `--list-models`, `-M` | List supported models and exit | `pdf2zh_next -M` | | `--help-translation`, `-H` | Show help message for translation options and exit | `pdf2zh_next -H` | | `--help-advanced`, `-A` | Show help message for advanced options and exit | `pdf2zh_next -A` | --- ### TRANSLATION RESULT | `--help`, `-h` | Mostra il messaggio di aiuto ed esci | `pdf2zh_next -h` | | ------------------------------- | ---------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--version`, `-v` | Mostra la versione ed esci | `pdf2zh_next -v` | | `--input`, `-i` | Percorso del file PDF di input | `pdf2zh_next -i input.pdf` | | `--output`, `-o` | Percorso del file PDF di output | `pdf2zh_next -i input.pdf -o output.pdf` | | `--language`, `-l` | Codice lingua di destinazione, predefinito è `zh` (cinese) | `pdf2zh_next -i input.pdf -l ja` | | `--model`, `-m` | Modello di traduzione, predefinito è `gpt-4o-mini` | `pdf2zh_next -i input.pdf -m gpt-4o-mini` | | `--api-key`, `-k` | Chiave API di OpenAI, predefinito è `None` | `pdf2zh_next -i input.pdf -k sk-...` | | `--api-base`, `-b` | URL base dell'API di OpenAI, predefinito è `None` | `pdf2zh_next -i input.pdf -b https://api.openai.com/v1` | | `--proxy`, `-p` | URL del proxy, predefinito è `None` | `pdf2zh_next -i input.pdf -p http://127.0.0.1:7890` | | `--max-concurrent`, `-c` | Numero massimo di richieste concorrenti, predefinito è `10` | `pdf2zh_next -i input.pdf -c 5` | | `--timeout`, `-t` | Timeout della richiesta in secondi, predefinito è `60` | `pdf2zh_next -i input.pdf -t 120` | | `--retry`, `-r` | Numero massimo di tentativi di ripetizione, predefinito è `3` | `pdf2zh_next -i input.pdf -r 5` | | `--no-cache`, `-n` | Disabilita la cache, predefinito è `False` | `pdf2zh_next -i input.pdf -n` | | `--cache-dir`, `-d` | Directory della cache, predefinito è `./cache` | `pdf2zh_next -i input.pdf -d ./my_cache` | | `--log-level`, `-g` | Livello di log, predefinito è `INFO` | `pdf2zh_next -i input.pdf -g DEBUG` | | `--log-file`, `-f` | Percorso del file di log, predefinito è `None` | `pdf2zh_next -i input.pdf -f log.txt` | | `--config`, `-C` | Percorso del file di configurazione, predefinito è `None` | `pdf2zh_next -i input.pdf -C config.json` | | `--force`, `-F` | Forza la sovrascrittura del file di output, predefinito è `False` | `pdf2zh_next -i input.pdf -F` | | `--dry-run`, `-D` | Esecuzione di prova senza traduzione effettiva, predefinito è `False` | `pdf2zh_next -i input.pdf -D` | | `--list-languages`, `-L` | Elenca le lingue supportate ed esci | `pdf2zh_next -L` | | `--list-models`, `-M` | Elenca i modelli supportati ed esci | `pdf2zh_next -M` | | `--help-translation`, `-H` | Mostra il messaggio di aiuto per le opzioni di traduzione ed esci | `pdf2zh_next -H` | | `--help-advanced`, `-A` | Mostra il messaggio di aiuto per le opzioni avanzate ed esci | `pdf2zh_next -A` |
pt: |---------------------------------|-----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------| | `--version`, `-v` | Show version and exit | `pdf2zh_next --version` | | `--input <file>`, `-i <file>` | Input PDF file (required) | `pdf2zh_next --input example.pdf` | | `--output <file>`, `-o <file>` | Output file (default: input file name with `_translated.pdf` suffix) | `pdf2zh_next --input example.pdf --output example_translated.pdf` | | `--engine <engine>` | Translation engine (default: `google`) | `pdf2zh_next --input example.pdf --engine google` | | `--source <language>` | Source language code (default: `en`) | `pdf2zh_next --input example.pdf --source en` | | `--target <language>` | Target language code (default: `zh-CN`) | `pdf2zh_next --input example.pdf --target zh-CN` | | `--format <format>` | Output format: `pdf` (default) or `docx` | `pdf2zh_next --input example.pdf --format docx` | | `--openai-api-key <key>` | OpenAI API key (required for `openai` engine) | `pdf2zh_next --input example.pdf --engine openai --openai-api-key sk-...` | | `--openai-base-url <url>` | OpenAI API base URL (optional for `openai` engine) | `pdf2zh_next --input example.pdf --engine openai --openai-api-key sk-... --openai-base-url https://api.openai.com/v1/`| | `--openai-model <model>` | OpenAI model (default: `gpt-3.5-turbo`) | `pdf2zh_next --input example.pdf --engine openai --openai-api-key sk-... --openai-model gpt-4` | | `--concurrency <number>` | Number of concurrent translation tasks (default: `4`) | `pdf2zh_next --input example.pdf --concurrency 8` | | `--mathpix-app-id <id>` | Mathpix App ID (required for `mathpix` engine) | `pdf2zh_next --input example.pdf --engine mathpix --mathpix-app-id your_app_id` | | `--mathpix-app-key <key>` | Mathpix App Key (required for `mathpix` engine) | `pdf2zh_next --input example.pdf --engine mathpix --mathpix-app-key your_app_key` | | `--mathpix-ocr <ocr>` | Mathpix OCR preference: `math` (default) or `text` | `pdf2zh_next --input example.pdf --engine mathpix --mathpix-app-id id --mathpix-app-key key --mathpix-ocr text` | | `--retry <number>` | Number of retries for failed translations (default: `3`) | `pdf2zh_next --input example.pdf --retry 5` | | `--timeout <seconds>` | Timeout for each translation request in seconds (default: `30`) | `pdf2zh_next --input example.pdf --timeout 60` | | `--no-cache` | Disable caching of translation results | `pdf2zh_next --input example.pdf --no-cache` | | `--cache-dir <dir>` | Directory to store cache files (default: system cache directory) | `pdf2zh_next --input example.pdf --cache-dir ./cache` | | `--log-level <level>` | Log level: `DEBUG`, `INFO` (default), `WARNING`, `ERROR`, `CRITICAL` | `pdf2zh_next --input example.pdf --log-level DEBUG` | | `--config <file>` | Load configuration from a JSON file | `pdf2zh_next --input example.pdf --config config.json` | --- ### OUTPUT | `--help`, `-h` | Mostrar mensagem de ajuda e sair | `pdf2zh_next -h` | |---------------------------------|-----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------| | `--version`, `-v` | Mostrar versão e sair | `pdf2zh_next --version` | | `--input <file>`, `-i <file>` | Arquivo PDF de entrada (obrigatório) | `pdf2zh_next --input example.pdf` | | `--output <file>`, `-o <file>` | Arquivo de saída (padrão: nome do arquivo de entrada com sufixo `_translated.pdf`) | `pdf2zh_next --input example.pdf --output example_translated.pdf` | | `--engine <engine>` | Motor de tradução (padrão: `google`) | `pdf2zh_next --input example.pdf --engine google` | | `--source <language>` | Código do idioma de origem (padrão: `en`) | `pdf2zh_next --input example.pdf --source en` | | `--target <language>` | Código do idioma de destino (padrão: `zh-CN`) | `pdf2zh_next --input example.pdf --target zh-CN` | | `--format <format>` | Formato de saída: `pdf` (padrão) ou `docx` | `pdf2zh_next --input example.pdf --format docx` | | `--openai-api-key <key>` | Chave da API da OpenAI (obrigatório para o motor `openai`) | `pdf2zh_next --input example.pdf --engine openai --openai-api-key sk-...` | | `--openai-base-url <url>` | URL base da API da OpenAI (opcional para o motor `openai`) | `pdf2zh_next --input example.pdf --engine openai --openai-api-key sk-... --openai-base-url https://api.openai.com/v1/`| | `--openai-model <model>` | Modelo da OpenAI (padrão: `gpt-3.5-turbo`) | `pdf2zh_next --input example.pdf --engine openai --openai-api-key sk-... --openai-model gpt-4` | | `--concurrency <number>` | Número de tarefas de tradução concorrentes (padrão: `4`) | `pdf2zh_next --input example.pdf --concurrency 8` | | `--mathpix-app-id <id>` | ID do aplicativo Mathpix (obrigatório para o motor `mathpix`) | `pdf2zh_next --input example.pdf --engine mathpix --mathpix-app-id your_app_id` | | `--mathpix-app-key <key>` | Chave do aplicativo Mathpix (obrigatório para o motor `mathpix`) | `pdf2zh_next --input example.pdf --engine mathpix --mathpix-app-key your_app_key` | | `--mathpix-ocr <ocr>` | Preferência de OCR do Mathpix: `math` (padrão) ou `text` | `pdf2zh_next --input example.pdf --engine mathpix --mathpix-app-id id --mathpix-app-key key --mathpix-ocr text` | | `--retry <number>` | Número de tentativas para traduções com falha (padrão: `3`) | `pdf2zh_next --input example.pdf --retry 5` | | `--timeout <seconds>` | Tempo limite para cada solicitação de tradução em segundos (padrão: `30`) | `pdf2zh_next --input example.pdf --timeout 60` | | `--no-cache` | Desativar cache dos resultados da tradução | `pdf2zh_next --input example.pdf --no-cache` | | `--cache-dir <dir>` | Diretório para armazenar arquivos de cache (padrão: diretório de cache do sistema) | `pdf2zh_next --input example.pdf --cache-dir ./cache` | | `--log-level <level>` | Nível de log: `DEBUG`, `INFO` (padrão), `WARNING`, `ERROR`, `CRITICAL` | `pdf2zh_next --input example.pdf --log-level DEBUG` | | `--config <file>` | Carregar configuração de um arquivo JSON | `pdf2zh_next --input example.pdf --config config.json` |
ru: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--version`, `-v` | Show version and exit | `pdf2zh_next -v` | | `--config`, `-c` <br> `CONFIG` | Path to the config file. If not provided, the program will look for `config.toml` in the current directory | `pdf2zh_next -c config.toml` <br> `pdf2zh_next --config config.toml` | | `--input`, `-i` <br> `INPUT` | Path to the input PDF file or directory | `pdf2zh_next -i input.pdf` <br> `pdf2zh_next --input input.pdf` | | `--output`, `-o` <br> `OUTPUT` | Path to the output directory | `pdf2zh_next -o output/` <br> `pdf2zh_next --output output/` | | `--engine`, `-e` <br> `ENGINE` | Translation engine to use. Available options: `google`, `deepl`, `openai` | `pdf2zh_next -e google` <br> `pdf2zh_next --engine openai` | | `--target`, `-t` <br> `TARGET` | Target language code. Defaults to `zh` (Chinese) | `pdf2zh_next -t ja` <br> `pdf2zh_next --target ja` | | `--source`, `-s` <br> `SOURCE` | Source language code. Defaults to `en` (English) | `pdf2zh_next -s en` <br> `pdf2zh_next --source en` | | `--key`, `-k` <br> `KEY` | API key for the translation engine. If not provided, the program will look for the key in the config file or environment variables | `pdf2zh_next -k YOUR_API_KEY` <br> `pdf2zh_next --key YOUR_API_KEY` | | `--concurrency`, `-C` <br> `CONCURRENCY` | Number of concurrent translation tasks. Defaults to `4` | `pdf2zh_next -C 8` <br> `pdf2zh_next --concurrency 8` | | `--retry`, `-r` <br> `RETRY` | Number of retries for failed translation tasks. Defaults to `3` | `pdf2zh_next -r 5` <br> `pdf2zh_next --retry 5` | | `--timeout`, `-T` <br> `TIMEOUT` | Timeout in seconds for each translation request. Defaults to `30` | `pdf2zh_next -T 60` <br> `pdf2zh_next --timeout 60` | | `--proxy`, `-p` <br> `PROXY` | Proxy server to use for translation requests. Format: `http://user:pass@host:port` | `pdf2zh_next -p http://user:pass@proxy.example.com:8080` <br> `pdf2zh_next --proxy http://user:pass@proxy.example.com:8080` | | `--verbose`, `-V` | Enable verbose output | `pdf2zh_next -V` <br> `pdf2zh_next --verbose` | --- ### TRANSLATION RESULT | `--help`, `-h` | Показать справочное сообщение и выйти | `pdf2zh_next -h` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--version`, `-v` | Показать версию и выйти | `pdf2zh_next -v` | | `--config`, `-c` <br> `CONFIG` | Путь к файлу конфигурации. Если не указан, программа будет искать `config.toml` в текущей директории | `pdf2zh_next -c config.toml` <br> `pdf2zh_next --config config.toml` | | `--input`, `-i` <br> `INPUT` | Путь к входному PDF-файлу или директории | `pdf2zh_next -i input.pdf` <br> `pdf2zh_next --input input.pdf` | | `--output`, `-o` <br> `OUTPUT` | Путь к выходной директории | `pdf2zh_next -o output/` <br> `pdf2zh_next --output output/` | | `--engine`, `-e` <br> `ENGINE` | Движок перевода для использования. Доступные опции: `google`, `deepl`, `openai` | `pdf2zh_next -e google` <br> `pdf2zh_next --engine openai` | | `--target`, `-t` <br> `TARGET` | Код языка назначения. По умолчанию `zh` (китайский) | `pdf2zh_next -t ja` <br> `pdf2zh_next --target ja` | | `--source`, `-s` <br> `SOURCE` | Код исходного языка. По умолчанию `en` (английский) | `pdf2zh_next -s en` <br> `pdf2zh_next --source en` | | `--key`, `-k` <br> `KEY` | API-ключ для движка перевода. Если не указан, программа будет искать ключ в файле конфигурации или переменных окружения | `pdf2zh_next -k YOUR_API_KEY` <br> `pdf2zh_next --key YOUR_API_KEY` | | `--concurrency`, `-C` <br> `CONCURRENCY` | Количество параллельных задач перевода. По умолчанию `4` | `pdf2zh_next -C 8` <br> `pdf2zh_next --concurrency 8` | | `--retry`, `-r` <br> `RETRY` | Количество повторных попыток для неудачных задач перевода. По умолчанию `3` | `pdf2zh_next -r 5` <br> `pdf2zh_next --retry 5` | | `--timeout`, `-T` <br> `TIMEOUT` | Таймаут в секундах для каждого запроса перевода. По умолчанию `30` | `pdf2zh_next -T 60` <br> `pdf2zh_next --timeout 60` | | `--proxy`, `-p` <br> `PROXY` | Прокси-сервер для использования в запросах перевода. Формат: `http://user:pass@host:port` | `pdf2zh_next -p http://user:pass@proxy.example.com:8080` <br> `pdf2zh_next --proxy http://user:pass@proxy.example.com:8080` | | `--verbose`, `-V` | Включить подробный вывод | `pdf2zh_next -V` <br> `pdf2zh_next --verbose` |
