Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_8D4A4094
source: | `--generate-offline-assets` | Generate offline assets package in the specified directory | `pdf2zh_next example.pdf --generate-offline-assets /path` |
de: `-g` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | ------- | | `--generate-offline-assets-only` | Generate offline assets without translating | `pdf2zh_next example.pdf --generate-offline-assets-only /path` | `-G` | | `--offline-assets` | Use offline assets | `pdf2zh_next example.pdf --offline-assets /path` | `-o` | --- ### TRANSLATION RESULT | `--generate-offline-assets` | Generiere ein Offline-Asset-Paket im angegebenen Verzeichnis | `pdf2zh_next example.pdf --generate-offline-assets /path` | `-g` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | ------- | | `--generate-offline-assets-only` | Generiere Offline-Assets ohne Übersetzung | `pdf2zh_next example.pdf --generate-offline-assets-only /path` | `-G` | | `--offline-assets` | Verwende Offline-Assets | `pdf2zh_next example.pdf --offline-assets /path` | `-o` |
fr: | ------------------------------- | ---------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--offline-assets-dir` | Use offline assets from the specified directory | `pdf2zh_next example.pdf --offline-assets-dir /path` | | `--cache-dir` | Cache directory for storing downloaded models and assets | `pdf2zh_next example.pdf --cache-dir /path` | | `--cache` | Enable caching of downloaded models and assets (enabled by default) | `pdf2zh_next example.pdf --cache` | | `--no-cache` | Disable caching of downloaded models and assets | `pdf2zh_next example.pdf --no-cache` | --- ### TRANSLATION RESULT | `--generate-offline-assets` | Générer un package de ressources hors ligne dans le répertoire spécifié | `pdf2zh_next example.pdf --generate-offline-assets /chemin` | | ------------------------------- | ---------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--offline-assets-dir` | Utiliser les ressources hors ligne depuis le répertoire spécifié | `pdf2zh_next example.pdf --offline-assets-dir /chemin` | | `--cache-dir` | Répertoire de cache pour stocker les modèles et ressources téléchargés | `pdf2zh_next example.pdf --cache-dir /chemin` | | `--cache` | Activer la mise en cache des modèles et ressources téléchargés (activé par défaut) | `pdf2zh_next example.pdf --cache` | | `--no-cache` | Désactiver la mise en cache des modèles et ressources téléchargés | `pdf2zh_next example.pdf --no-cache` |
it: `--generate-offline-assets` | Generate offline assets package in the specified directory | `pdf2zh_next example.pdf --generate-offline-assets /path` | | ------------------------------- | ---------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | ------------------------------- | ---------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--use-offline-assets` | Use offline assets from the specified directory | `pdf2zh_next example.pdf --use-offline-assets /path` | `--use-offline-assets` | Use offline assets from the specified directory | `pdf2zh_next example.pdf --use-offline-assets /path` | | `--offline` | Equivalent to `--generate-offline-assets` and `--use-offline-assets` | `pdf2zh_next example.pdf --offline /path` | `--offline` | Equivalent to `--generate-offline-assets` and `--use-offline-assets` | `pdf2zh_next example.pdf --offline /path` | --- ### TRANSLATION | `--generate-offline-assets` | Genera il pacchetto di risorse offline nella directory specificata | `pdf2zh_next example.pdf --generate-offline-assets /path` | `--generate-offline-assets` | Genera il pacchetto di risorse offline nella directory specificata | `pdf2zh_next example.pdf --generate-offline-assets /path` | | ------------------------------- | ---------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | ------------------------------- | ---------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--use-offline-assets` | Utilizza le risorse offline dalla directory specificata | `pdf2zh_next example.pdf --use-offline-assets /path` | `--use-offline-assets` | Utilizza le risorse offline dalla directory specificata | `pdf2zh_next example.pdf --use-offline-assets /path` | | `--offline` | Equivalente a `--generate-offline-assets` e `--use-offline-assets` | `pdf2zh_next example.pdf --offline /path` | `--offline` | Equivalente a `--generate-offline-assets` e `--use-offline-assets` | `pdf2zh_next example.pdf --offline /path` |
pt: | ------------------------------- | ---------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--offline-assets` | Use offline assets from the specified directory | `pdf2zh_next example.pdf --offline-assets /path` | | `--model-type` | Specify the model type, default is `"openai"` | `pdf2zh_next example.pdf --model-type "openai"` | | `--model-name` | Specify the model name, default is `"gpt-4o"` | `pdf2zh_next example.pdf --model-name "gpt-4o"` | | `--model-endpoint` | Specify the model endpoint, default is `"https://api.openai.com/v1/chat/completions"` | `pdf2zh_next example.pdf --model-endpoint "https://api.openai.com/v1/chat/completions"` | --- ### OUTPUT | `--generate-offline-assets` | Gerar pacote de recursos offline no diretório especificado | `pdf2zh_next example.pdf --generate-offline-assets /path` | | ------------------------------- | ---------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--offline-assets` | Usar recursos offline do diretório especificado | `pdf2zh_next example.pdf --offline-assets /path` | | `--model-type` | Especificar o tipo de modelo, padrão é `"openai"` | `pdf2zh_next example.pdf --model-type "openai"` | | `--model-name` | Especificar o nome do modelo, padrão é `"gpt-4o"` | `pdf2zh_next example.pdf --model-name "gpt-4o"` | | `--model-endpoint` | Especificar o endpoint do modelo, padrão é `"https://api.openai.com/v1/chat/completions"`| `pdf2zh_next example.pdf --model-endpoint "https://api.openai.com/v1/chat/completions"` |
ru: | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--output-dir` | Output directory of the translated PDF files | `pdf2zh_next example.pdf --output-dir /path/to/output` | | `--offline-mode` | Enable offline mode, which requires the offline assets package to be pre-downloaded | `pdf2zh_next example.pdf --offline-mode --offline-assets-dir /path/to/assets` | | `--offline-assets-dir` | Directory of the offline assets package | `pdf2zh_next example.pdf --offline-mode --offline-assets-dir /path/to/assets` | --- ### TRANSLATED TEXT | `--generate-offline-assets` | Создать пакет офлайн-ресурсов в указанной директории | `pdf2zh_next example.pdf --generate-offline-assets /path` | | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--output-dir` | Выходная директория для переведённых PDF-файлов | `pdf2zh_next example.pdf --output-dir /path/to/output` | | `--offline-mode` | Включить офлайн-режим, для которого требуется предварительная загрузка пакета офлайн-ресурсов | `pdf2zh_next example.pdf --offline-mode --offline-assets-dir /path/to/assets` | | `--offline-assets-dir` | Директория пакета офлайн-ресурсов | `pdf2zh_next example.pdf --offline-mode --offline-assets-dir /path/to/assets` |
