Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_80F8D6A6
source: - settings.basic.input_files is ignored by this function; only the given `file` is translated. - If `settings.basic.debug` is True, translation runs in the main process; otherwise it runs in a subprocess. Event schema is identical for both.
de: - For more information about the event schema, see [Event Stream Contract](#event-stream-contract). --- ### TRANSLATION RESULT - `settings.basic.input_files` wird von dieser Funktion ignoriert; nur die angegebene `file` wird übersetzt. - Wenn `settings.basic.debug` True ist, läuft die Übersetzung im Hauptprozess; andernfalls läuft sie in einem Unterprozess. Das Ereignisschema ist für beide identisch. - Weitere Informationen zum Ereignisschema finden Sie unter [Event Stream Contract](#event-stream-contract).
fr: - If `settings.basic.overwrite` is True, the output file will be overwritten if it exists. - If `settings.basic.overwrite` is False, the output file path will be modified to avoid overwriting (e.g., `output_1.pdf`). --- ### TRANSLATION RESULT - settings.basic.input_files est ignoré par cette fonction ; seul le `file` donné est traduit. - Si `settings.basic.debug` est True, la traduction s'exécute dans le processus principal ; sinon, elle s'exécute dans un sous-processus. Le schéma d'événement est identique dans les deux cas. - Si `settings.basic.overwrite` est True, le fichier de sortie sera écrasé s'il existe. - Si `settings.basic.overwrite` est False, le chemin du fichier de sortie sera modifié pour éviter l'écrasement (par exemple, `output_1.pdf`).
it: - If `settings.basic.debug` is True, the function returns the `TranslationResult` object directly; otherwise it returns a `subprocess.CompletedProcess` object. --- ### TRANSLATION RESULT - `settings.basic.input_files` viene ignorato da questa funzione; viene tradotto solo il `file` specificato. - Se `settings.basic.debug` è True, la traduzione viene eseguita nel processo principale; altrimenti viene eseguita in un sottoprocesso. Lo schema degli eventi è identico per entrambi. - Se `settings.basic.debug` è True, la funzione restituisce direttamente l'oggetto `TranslationResult`; altrimenti restituisce un oggetto `subprocess.CompletedProcess`.
pt: - `settings.basic.ignore_images` is ignored by this function; images are always ignored. Use `do_translate_async_stream` if you need image translation. - `settings.basic.ignore_tables` is ignored by this function; tables are always ignored. Use `do_translate_async_stream` if you need table translation. - `settings.basic.ignore_equations` is ignored by this function; equations are always ignored. Use `do_translate_async_stream` if you need equation translation. - `settings.basic.ignore_format` is ignored by this function; formatting is always ignored. Use `do_translate_async_stream` if you need to preserve formatting. - `settings.basic.chunk_size` is ignored by this function; chunking is not supported. Use `do_translate_async_stream` if you need chunking. - `settings.basic.overlap` is ignored by this function; chunking is not supported. Use `do_translate_async_stream` if you need chunking. - `settings.basic.concurrency` is ignored by this function; concurrency is not supported. Use `do_translate_async_stream` if you need concurrency. - `settings.basic.retry` is ignored by this function; retry logic is not supported. Use `do_translate_async_stream` if you need retry logic. - `settings.basic.timeout` is ignored by this function; timeout is not supported. Use `do_translate_async_stream` if you need timeout. - `settings.basic.cache` is ignored by this function; caching is not supported. Use `do_translate_async_stream` if you need caching. - `settings.basic.progress_callback` is ignored by this function; progress callbacks are not supported. Use `do_translate_async_stream` if you need progress callbacks. - `settings.basic.custom_translator` is ignored by this function; custom translators are not supported. Use `do_translate_async_stream` if you need a custom translator. - `settings.basic.translation_service` is ignored by this function; only the given `translation_service` is used. - `settings.basic.api_key` is ignored by this function; only the given `api_key` is used. - `settings.basic.source_lang` is ignored by this function; only the given `source_lang_code` is used. - `settings.basic.target_lang` is ignored by this function; only the given `target_lang_code` is used. - `settings.basic.ignore_lang` is ignored by this function; language detection is not supported. Use `do_translate_async_stream` if you need language detection. - `settings.basic.ignore_lang_conf` is ignored by this function; language detection is not supported. Use `do_translate_async_stream` if you need language detection. - `settings.basic.ignore_lang_conf_threshold` is ignored by this function; language detection is not supported. Use `do_translate_async_stream` if you need language detection. - `settings.basic.ignore_lang_conf_threshold_low` is ignored by this function; language detection is not supported. Use `do_translate_async_stream` if you need language detection. - `settings.basic.ignore_lang_conf_threshold_high` is ignored by this function; language detection is not supported. Use `do_translate_async_stream` if you need language detection. - `settings.basic.ignore_lang_conf_threshold_auto` is ignored by this function; language detection is not supported. Use `do_translate_async_stream` if you need language detection. - `settings.basic.ignore_lang_conf_threshold_auto_low` is ignored by this function; language detection is not supported. Use `do_translate_async_stream` if you need language detection. - `settings.basic.ignore_lang_conf_threshold_auto_high` is ignored by this function; language detection is not supported. Use `do_translate_async_stream` if you need language detection. - `settings.basic.ignore_lang_conf_threshold_auto_auto` is ignored by this function; language detection is not supported. Use `do_translate_async_stream` if you need language detection. - `settings.basic.ignore_lang_conf_threshold_auto_auto_low` is ignored by this function; language detection is not supported. Use `do_translate_async_stream` if you need language detection. - `settings.basic.ignore_lang_conf_threshold_auto_auto_high` is ignored by this function; language detection is not supported. Use `do_translate_async_stream` if you need language detection. - `settings.basic.ignore_lang_conf_threshold_auto_auto_auto` is ignored by this function; language detection is not supported. Use `do_translate_async_stream` if you need language detection. - `settings.basic.ignore_lang_conf_threshold_auto_auto_auto_low` is ignored by this function; language detection is not supported. Use `do_translate_async_stream` if you need language detection. - `settings.basic.ignore_lang_conf_threshold_auto_auto_auto_high` is ignored by this function; language detection is not supported. Use `do_translate_async_stream` if you need language detection. - `settings.basic.ignore_lang_conf_threshold_auto_auto_auto_auto` is ignored by this function; language detection is not supported. Use `do_translate_async_stream` if you need language detection. --- ### OUTPUT - `settings.basic.input_files` é ignorado por esta função; apenas o `file` fornecido é traduzido. - Se `settings.basic.debug` for True, a tradução é executada no processo principal; caso contrário, é executada em um subprocesso. O esquema de eventos é idêntico para ambos. - `settings.basic.ignore_images` é ignorado por esta função; as imagens são sempre ignoradas. Use `do_translate_async_stream` se precisar de tradução de imagens. - `settings.basic.ignore_tables` é ignorado por esta função; as tabelas são sempre ignoradas. Use `do_translate_async_stream` se precisar de tradução de tabelas. - `settings.basic.ignore_equations` é ignorado por esta função; as equações são sempre ignoradas. Use `do_translate_async_stream` se precisar de tradução de equações. - `settings.basic.ignore_format` é ignorado por esta função; a formatação é sempre ignorada. Use `do_translate_async_stream` se precisar preservar a formatação. - `settings.basic.chunk_size` é ignorado por esta função; a divisão em partes não é suportada. Use `do_translate_async_stream` se precisar de divisão em partes. - `settings.basic.overlap` é ignorado por esta função; a divisão em partes não é suportada. Use `do_translate_async_stream` se precisar de divisão em partes. - `settings.basic.concurrency` é ignorado por esta função; a concorrência não é suportada. Use `do_translate_async_stream` se precisar de concorrência. - `settings.basic.retry` é ignorado por esta função; a lógica de repetição não é suportada. Use `do_translate_async_stream` se precisar de lógica de repetição. - `settings.basic.timeout` é ignorado por esta função; o tempo limite não é suportado. Use `do_translate_async_stream` se precisar de tempo limite. - `settings.basic.cache` é ignorado por esta função; o cache não é suportado. Use `do_translate_async_stream` se precisar de cache. - `settings.basic.progress_callback` é ignorado por esta função; callbacks de progresso não são suportados. Use `do_translate_async_stream` se precisar de callbacks de progresso. - `settings.basic.custom_translator` é ignorado por esta função; tradutores personalizados não são suportados. Use `do_translate_async_stream` se precisar de um tradutor personalizado. - `settings.basic.translation_service` é ignorado por esta função; apenas o `translation_service` fornecido é usado. - `settings.basic.api_key` é ignorado por esta função; apenas a `api_key` fornecida é usada. - `settings.basic.source_lang` é ignorado por esta função; apenas o `source_lang_code` fornecido é usado. - `settings.basic.target_lang` é ignorado por esta função; apenas o `target_lang_code` fornecido é usado. - `settings.basic.ignore_lang` é ignorado por esta função; a detecção de idioma não é suportada. Use `do_translate_async_stream` se precisar de detecção de idioma. - `settings.basic.ignore_lang_conf` é ignorado por esta função; a detecção de idioma não é suportada. Use `do_translate_async_stream` se precisar de detecção de idioma. - `settings.basic.ignore_lang_conf_threshold` é ignorado por esta função; a detecção de idioma não é suportada. Use `do_translate_async_stream` se precisar de detecção de idioma. - `settings.basic.ignore_lang_conf_threshold_low` é ignorado por esta função; a detecção de idioma não é suportada. Use `do_translate_async_stream` se precisar de detecção de idioma. - `settings.basic.ignore_lang_conf_threshold_high` é ignorado por esta função; a detecção de idioma não é suportada. Use `do_translate_async_stream` se precisar de detecção de idioma. - `settings.basic.ignore_lang_conf_threshold_auto` é ignorado por esta função; a detecção de idioma não é suportada. Use `do_translate_async_stream` se precisar de detecção de idioma. - `settings.basic.ignore_lang_conf_threshold_auto_low` é ignorado por esta função; a detecção de idioma não é suportada. Use `do_translate_async_stream` se precisar de detecção de idioma. - `settings.basic.ignore_lang_conf_threshold_auto_high` é ignorado por esta função; a detecção de idioma não é suportada. Use `do_translate_async_stream` se precisar de detecção de idioma. - `settings.basic.ignore_lang_conf_threshold_auto_auto` é ignorado por esta função; a detecção de idioma não é suportada. Use `do_translate_async_stream` se precisar de detecção de idioma. - `settings.basic.ignore_lang_conf_threshold_auto_auto_low` é ignorado por esta função; a detecção de idioma não é suportada. Use `do_translate_async_stream` se precisar de detecção de idioma. - `settings.basic.ignore_lang_conf_threshold_auto_auto_high` é ignorado por esta função; a detecção de idioma não é suportada. Use `do_translate_async_stream` se precisar de detecção de idioma. - `settings.basic.ignore_lang_conf_threshold_auto_auto_auto` é ignorado por esta função; a detecção de idioma não é suportada. Use `do_translate_async_stream` se precisar de detecção de idioma. - `settings.basic.ignore_lang_conf_threshold_auto_auto_auto_low` é ignorado por esta função; a detecção de idioma não é suportada. Use `do_translate_async_stream` se precisar de detecção de idioma. - `settings.basic.ignore_lang_conf_threshold_auto_auto_auto_high` é ignorado por esta função; a detecção de idioma não é suportada. Use `do_translate_async_stream` se precisar de detecção de idioma. - `settings.basic.ignore_lang_conf_threshold_auto_auto_auto_auto` é ignorado por esta função; a detecção de idioma não é suportada. Use `do_translate_async_stream` se precisar de detecção de idioma.
ru: - ### Event Schema: This document outlines the event schema used by the application for real-time communication during translation processes. --- ### Event Structure All events follow a common structure: ```json { "type": "string", "data": { // Event-specific data }, "timestamp": "string" } ``` - **`type`**: The type of event. See [Event Types](#event-types) for possible values. - **`data`**: An object containing event-specific data. The structure varies by event type. - **`timestamp`**: The ISO 8601 timestamp when the event was emitted. --- ### Event Types #### `translation_started` Emitted when a translation job starts. **Data:** - `jobId` (string): The unique identifier for the translation job. - `fileName` (string): The name of the file being translated. **Example:** ```json { "type": "translation_started", "data": { "jobId": "123e4567-e89b-12d3-a456-426614174000", "fileName": "document.pdf" }, "timestamp": "2023-01-01T00:00:00.000Z" } ``` #### `translation_progress` Emitted periodically to report translation progress. **Data:** - `jobId` (string): The unique identifier for the translation job. - `progress` (number): The progress percentage (0-100). - `message` (string): Optional progress message. **Example:** ```json { "type": "translation_progress", "data": { "jobId": "123e4567-e89b-12d3-a456-426614174000", "progress": 50, "message": "Processing page 10 of 20" }, "timestamp": "2023-01-01T00:00:01.000Z" } ``` #### `translation_completed` Emitted when a translation job completes successfully. **Data:** - `jobId` (string): The unique identifier for the translation job. - `fileName` (string): The name of the translated file. - `outputPath` (string): The path to the translated file. **Example:** ```json { "type": "translation_completed", "data": { "jobId": "123e4567-e89b-12d3-a456-426614174000", "fileName": "document.pdf", "outputPath": "/path/to/translated/document_zh.pdf" }, "timestamp": "2023-01-01T00:00:02.000Z" } ``` #### `translation_failed` Emitted when a translation job fails. **Data:** - `jobId` (string): The unique identifier for the translation job. - `fileName` (string): The name of the file that failed to translate. - `error` (string): The error message. **Example:** ```json { "type": "translation_failed", "data": { "jobId": "123e4567-e89b-12d3-a456-426614174000", "fileName": "document.pdf", "error": "Failed to extract text from PDF" }, "timestamp": "2023-01-01T00:00:03.000Z" } ``` #### `translation_cancelled` Emitted when a translation job is cancelled by the user. **Data:** - `jobId` (string): The unique identifier for the translation job. - `fileName` (string): The name of the file that was being translated. **Example:** ```json { "type": "translation_cancelled", "data": { "jobId": "123e4567-e89b-12d3-a456-426614174000", "fileName": "document.pdf" }, "timestamp": "2023-01-01T00:00:04.000Z" } ``` --- ### Consuming Events Events are emitted as Server-Sent Events (SSE) from the `/api/events` endpoint. Clients can listen for events using the EventSource API or similar. **Example using JavaScript:** ```javascript const eventSource = new EventSource('/api/events'); eventSource.onmessage = (event) => { const data = JSON.parse(event.data); console.log('Received event:', data); }; eventSource.onerror = (error) => { console.error('EventSource failed:', error); }; ``` --- ### Notes - Events are emitted in real-time as translation jobs progress. - The event stream may contain events from multiple concurrent translation jobs. - Clients should filter events by `jobId` if they are interested in specific jobs. - The event stream connection may be reestablished automatically if disconnected. --- ### TRANSLATION RESULT - ### Примечания и рекомендации: - **Используйте с осторожностью**: Будьте осторожны при использовании этой функции, особенно если документ содержит конфиденциальную информацию. - **Сначала протестируйте**: Всегда сначала тестируйте функцию на некритичном документе, чтобы убедиться, что она соответствует вашим ожиданиям. - **Резервное копирование документов**: Сохраняйте резервные копии ваших оригинальных документов перед обработкой. - **Проверяйте результаты**: После обработки просмотрите документ, чтобы убедиться, что перевод точен, а форматирование сохранено. - `settings.basic.input_files` игнорируется этой функцией; переводится только указанный файл `file`. - Если `settings.basic.debug` имеет значение True, перевод выполняется в основном процессе; в противном случае он выполняется в подпроцессе. Схема событий идентична в обоих случаях. - ### Схема событий: В этом документе описывается схема событий, используемая приложением для обмена данными в реальном времени в процессе перевода. --- ### Структура события Все события следуют общей структуре: ```json { "type": "string", "data": { // Данные, специфичные для события }, "timestamp": "string" } ``` - **`type`**: Тип события. См. [Типы событий](#типы-событий) для возможных значений. - **`data`**: Объект, содержащий данные, специфичные для события. Структура зависит от типа события. - **`timestamp`**: Временная метка ISO 8601, когда событие было отправлено. --- ### Типы событий #### `translation_started` Отправляется, когда начинается задача перевода. **Данные:** - `jobId` (string): Уникальный идентификатор задачи перевода. - `fileName` (string): Имя переводимого файла. **Пример:** ```json { "type": "translation_started", "data": { "jobId": "123e4567-e89b-12d3-a456-426614174000", "fileName": "document.pdf" }, "timestamp": "2023-01-01T00:00:00.000Z" } ``` #### `translation_progress` Периодически отправляется для отчета о ходе перевода. **Данные:** - `jobId` (string): Уникальный идентификатор задачи перевода. - `progress` (number): Процент выполнения (0-100). - `message` (string): Необязательное сообщение о прогрессе. **Пример:** ```json { "type": "translation_progress", "data": { "jobId": "123e4567-e89b-12d3-a456-426614174000", "progress": 50, "message": "Обработка страницы 10 из 20" }, "timestamp": "2023-01-01T00:00:01.000Z" } ``` #### `translation_completed` Отправляется, когда задача перевода успешно завершена. **Данные:** - `jobId` (string): Уникальный идентификатор задачи перевода. - `fileName` (string): Имя переведенного файла. - `outputPath` (string): Путь к переведенному файлу. **Пример:** ```json { "type": "translation_completed", "data": { "jobId": "123e4567-e89b-12d3-a456-426614174000", "fileName": "document.pdf", "outputPath": "/path/to/translated/document_zh.pdf" }, "timestamp": "2023-01-01T00:00:02.000Z" } ``` #### `translation_failed` Отправляется, когда задача перевода завершается с ошибкой. **Данные:** - `jobId` (string): Уникальный идентификатор задачи перевода. - `fileName` (string): Имя файла, который не удалось перевести. - `error` (string): Сообщение об ошибке. **Пример:** ```json { "type": "translation_failed", "data": { "jobId": "123e4567-e89b-12d3-a456-426614174000", "fileName": "document.pdf", "error": "Не удалось извлечь текст из PDF" }, "timestamp": "2023-01-01T00:00:03.000Z" } ``` #### `translation_cancelled` Отправляется, когда задача перевода отменена пользователем. **Данные:** - `jobId` (string): Уникальный идентификатор задачи перевода. - `fileName` (string): Имя файла, который переводился. **Пример:** ```json { "type": "translation_cancelled", "data": { "jobId": "123e4567-e89b-12d3-a456-426614174000", "fileName": "document.pdf" }, "timestamp": "2023-01-01T00:00:04.000Z" } ``` --- ### Получение событий События отправляются как Server-Sent Events (SSE) с конечной точки `/api/events`. Клиенты могут прослушивать события с помощью API EventSource или аналогичного. **Пример использования JavaScript:** ```javascript const eventSource = new EventSource('/api/events'); eventSource.onmessage = (event) => { const data = JSON.parse(event.data); console.log('Получено событие:', data); }; eventSource.onerror = (error) => { console.error('Ошибка EventSource:', error); }; ``` --- ### Примечания - События отправляются в реальном времени по мере выполнения задач перевода. - Поток событий может содержать события из нескольких одновременных задач перевода. - Клиенты должны фильтровать события по `jobId`, если они интересуются конкретными задачами. - Подключение к потоку событий может быть автоматически восстановлено при разрыве.
