Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_35662E12
source: **Tier 2 translation engines** are maintained and supported by the community. When these engines encounter issues, the project maintainers will not provide direct fixes. Instead, they will label the related issues with `help wanted` and welcome pull requests from contributors to help resolve them. All engines that are supported by the program but not explicitly listed under Tier 1 are considered Tier 2 translation engines.
de: --- ### TRANSLATION RESULT **Tier 2 Übersetzungs-Engines** werden von der Gemeinschaft gepflegt und unterstützt. Wenn diese Engines auf Probleme stoßen, werden die Projektbetreuer keine direkten Fehlerbehebungen bereitstellen. Stattdessen werden sie die entsprechenden Probleme mit `help wanted` kennzeichnen und Pull-Requests von Mitwirkenden willkommen heißen, um bei der Lösung zu helfen. Alle Engines, die vom Programm unterstützt werden, aber nicht explizit unter Tier 1 aufgeführt sind, gelten als Tier 2 Übersetzungs-Engines.
fr: - **Google Translate**: Free, supports most languages, but may be unstable. - **DeepL Translate**: High accuracy, supports some languages, free version has usage limits. - **OpenAI Translator**: High accuracy, supports most languages, requires API key. - **Gemini Translator**: High accuracy, supports most languages, requires API key. --- ### OUTPUT **Les moteurs de traduction de niveau 2** sont maintenus et supportés par la communauté. Lorsque ces moteurs rencontrent des problèmes, les mainteneurs du projet ne fourniront pas de correctifs directs. Au lieu de cela, ils étiquetteront les problèmes liés avec `help wanted` et accueilleront les demandes de tirage des contributeurs pour aider à les résoudre. Tous les moteurs qui sont supportés par le programme mais non explicitement listés sous le Niveau 1 sont considérés comme des moteurs de traduction de niveau 2. - **Google Translate** : Gratuit, supporte la plupart des langues, mais peut être instable. - **DeepL Translate** : Haute précision, supporte certaines langues, la version gratuite a des limites d'utilisation. - **OpenAI Translator** : Haute précision, supporte la plupart des langues, nécessite une clé API. - **Gemini Translator** : Haute précision, supporte la plupart des langues, nécessite une clé API.
it: - #### Tier 2 (Community Support): - **DeepL**: [DeepL](https://www.deepl.com/) is a high-quality translation service that supports multiple languages. It offers both free and paid plans. The free plan has a limit of 500,000 characters per month. For more details, refer to the [DeepL documentation](https://www.deepl.com/docs-api). - **Google Translate**: [Google Translate](https://translate.google.com/) is a widely used translation service. It offers a free tier with a limit of 500,000 characters per month. For more details, refer to the [Google Cloud Translation documentation](https://cloud.google.com/translate/docs). --- I motori di traduzione di **Livello 2** sono mantenuti e supportati dalla comunità. Quando questi motori incontrano problemi, i maintainer del progetto non forniranno correzioni dirette. Invece, etichetteranno le issue correlate con `help wanted` e accoglieranno pull request dai contributori per aiutare a risolverle. Tutti i motori supportati dal programma ma non esplicitamente elencati sotto il Livello 1 sono considerati motori di traduzione di Livello 2.
pt: - **Tier 3 translation engines** are not officially supported by the project. They may work, but they are not guaranteed to be stable or reliable. If you encounter issues with these engines, you are welcome to submit a pull request to fix them, but the project maintainers will not provide direct support. All engines that are not explicitly listed under Tier 1 or Tier 2 are considered Tier 3 translation engines. --- ### OUTPUT LANGUAGE pt --- ### OUTPUT **Os motores de tradução de Tier 2** são mantidos e suportados pela comunidade. Quando esses motores encontram problemas, os mantenedores do projeto não fornecerão correções diretas. Em vez disso, eles marcarão os problemas relacionados com `help wanted` e receberão pull requests de contribuidores para ajudar a resolvê-los. Todos os motores que são suportados pelo programa, mas não listados explicitamente sob o Tier 1, são considerados motores de tradução de Tier 2. - **Os motores de tradução de Tier 3** não são oficialmente suportados pelo projeto. Eles podem funcionar, mas não há garantia de que sejam estáveis ou confiáveis. Se você encontrar problemas com esses motores, sinta-se à vontade para enviar um pull request para corrigi-los, mas os mantenedores do projeto não fornecerão suporte direto. Todos os motores que não estão explicitamente listados sob o Tier 1 ou Tier 2 são considerados motores de tradução de Tier 3.
ru: - #### Tier 1 (Official Support): - **Google Translate** - `google` - **Gemini** - `gemini` - **DeepL** - `deepl` - **AWS Translate** - `aws` - **Azure Translate** - `azure` - **OpenAI** - `openai` - **DeepSeek** - `deepseek` - **Ollama** - `ollama` - **Yi** - `yi` - **Mistral** - `mistral` - **Groq** - `groq` - **QianFan** - `qianfan` - **ZhiPu** - `zhipu` - **VolcEngine** - `volcengine` - **Moonshot** - `moonshot` - **Tencent** - `tencent` - **Doubao** - `doubao` - **Aliyun** - `aliyun` - **Hunyuan** - `hunyuan` #### Tier 2 (Community Support) - **Baidu Translate** - `baidu` - **Youdao** - `youdao` - **Sogou** - `sogou` - **Caiyun** - `caiyun` - **Niutrans** - `niutrans` - **M2M100** - `m2m100` - **MarianMT** - `marianmt` - **NLLB** - `nllb` - **SeamlessM4T** - `seamlessm4t` --- ### OUTPUT **Движки перевода уровня 2** поддерживаются и обслуживаются сообществом. Когда эти движки сталкиваются с проблемами, сопровождающие проекта не предоставляют прямые исправления. Вместо этого они помечают связанные проблемы меткой `help wanted` и приветствуют пул-реквесты от участников для их решения. Все движки, которые поддерживаются программой, но не указаны явно под уровнем 1, считаются движками перевода уровня 2. - #### Уровень 1 (Официальная поддержка): - **Google Translate** - `google` - **Gemini** - `gemini` - **DeepL** - `deepl` - **AWS Translate** - `aws` - **Azure Translate** - `azure` - **OpenAI** - `openai` - **DeepSeek** - `deepseek` - **Ollama** - `ollama` - **Yi** - `yi` - **Mistral** - `mistral` - **Groq** - `groq` - **QianFan** - `qianfan` - **ZhiPu** - `zhipu` - **VolcEngine** - `volcengine` - **Moonshot** - `moonshot` - **Tencent** - `tencent` - **Doubao** - `doubao` - **Aliyun** - `aliyun` - **Hunyuan** - `hunyuan` #### Уровень 2 (Поддержка сообщества) - **Baidu Translate** - `baidu` - **Youdao** - `youdao` - **Sogou** - `sogou` - **Caiyun** - `caiyun` - **Niutrans** - `niutrans` - **M2M100** - `m2m100` - **MarianMT** - `marianmt` - **NLLB** - `nllb` - **SeamlessM4T** - `seamlessm4t`
