Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_9004E6A3
source: - **config folder**: Configuration system. - **translator folder**: Translator-related implementations. - **gui.py**: Provides the GUI interface. - **const.py**: Some constants. - **main.py**: Provides the command-line tool. - **high_level.py**: High-level interfaces based on BabelDOC. - **http_api.py**: Provides HTTP API (not started).
de: - **config folder**: Konfigurationssystem. - **translator folder**: Übersetzerbezogene Implementierungen. - **gui.py**: Bietet die GUI-Schnittstelle. - **const.py**: Einige Konstanten. - **main.py**: Bietet das Kommandozeilen-Tool. - **high_level.py**: Hochrangige Schnittstellen basierend auf BabelDOC. - **http_api.py**: Bietet HTTP API (nicht gestartet).
fr: - **config folder** : Système de configuration. - **translator folder** : Implémentations liées au traducteur. - **gui.py** : Fournit l'interface GUI. - **const.py** : Quelques constantes. - **main.py** : Fournit l'outil en ligne de commande. - **high_level.py** : Interfaces de haut niveau basées sur BabelDOC. - **http_api.py** : Fournit l'API HTTP (non démarrée).
it: - **config folder**: Sistema di configurazione. - **translator folder**: Implementazioni relative al traduttore. - **gui.py**: Fornisce l'interfaccia GUI. - **const.py**: Alcune costanti. - **main.py**: Fornisce lo strumento da riga di comando. - **high_level.py**: Interfacce di alto livello basate su BabelDOC. - **http_api.py**: Fornisce API HTTP (non avviato).
pt: - **config folder**: Sistema de configuração. - **translator folder**: Implementações relacionadas ao tradutor. - **gui.py**: Fornece a interface GUI. - **const.py**: Algumas constantes. - **main.py**: Fornece a ferramenta de linha de comando. - **high_level.py**: Interfaces de alto nível baseadas no BabelDOC. - **http_api.py**: Fornece API HTTP (não iniciada).
ru: - **config folder**: Система конфигурации. - **translator folder**: Реализации, связанные с переводчиком. - **gui.py**: Предоставляет графический интерфейс. - **const.py**: Некоторые константы. - **main.py**: Предоставляет инструмент командной строки. - **high_level.py**: Высокоуровневые интерфейсы на основе BabelDOC. - **http_api.py**: Предоставляет HTTP API (не запущено).

# chunk_7B1CB228
source: Ask AI to understand the project: [DeepWiki](https://deepwiki.com/PDFMathTranslate-next/PDFMathTranslate-next)
de: Frage KI, um das Projekt zu verstehen: [DeepWiki](https://deepwiki.com/PDFMathTranslate-next/PDFMathTranslate-next)
fr: Demandez à l'IA de comprendre le projet : [DeepWiki](https://deepwiki.com/PDFMathTranslate-next/PDFMathTranslate-next)
it: - [Home](https://pdf2zh-next.com/) - [Getting Start](https://pdf2zh-next.com/getting-started/) - [Installation](https://pdf2zh-next.com/getting-started/INSTALLATION.html) - [Command Line](https://pdf2zh-next.com/getting-started/USAGE_cli.html) - [Usage](https://pdf2zh-next.com/getting-started/USAGE.html) - [Language Code](https://pdf2zh-next.com/getting-started/LANGUAGE_CODE.html) - [Documentation of Translation Services](https://pdf2zh-next.com/getting-started/TRANSLATION_SERVICE.html) - [Getting Started](https://pdf2zh-next.com/getting-started/) - [Advanced](https://pdf2zh-next.com/advanced/) - [Supported Languages](https://pdf2zh-next.com/advanced/SUPPORTED_LANGUAGES.html) - [Community](https://pdf2zh-next.com/community/) - [FAQ](https://pdf2zh-next.com/community/FAQ.html) - [For Translators](https://pdf2zh-next.com/community/FOR_TRANSLATORS.html) ## PRs that are recommended to discuss with maintainers via Issue before submission: - **New feature or major changes** (e.g., adding a new translation service, changing the core architecture, etc.) - **Changes that may affect user experience** (e.g., modifying the default configuration, changing the UI/UX, etc.) - **Changes that may affect performance** (e.g., modifying the core algorithms, changing the caching strategy, etc.) - **Changes that may affect security** (e.g., modifying the authentication mechanism, changing the data storage method, etc.) - **Changes that may affect compatibility** (e.g., modifying the API, changing the data format, etc.) - **Changes that may affect the project's long-term maintenance** (e.g., modifying the project structure, changing the dependency management method, etc.) --- ### TRANSLATION Chiedi all'AI di comprendere il progetto: [DeepWiki](https://deepwiki.com/PDFMathTranslate-next/PDFMathTranslate-next) - [Home](https://pdf2zh-next.com/) - [Iniziare](https://pdf2zh-next.com/getting-started/) - [Installazione](https://pdf2zh-next.com/getting-started/INSTALLATION.html) - [Riga di comando](https://pdf2zh-next.com/getting-started/USAGE_cli.html) - [Utilizzo](https://pdf2zh-next.com/getting-started/USAGE.html) - [Codice lingua](https://pdf2zh-next.com/getting-started/LANGUAGE_CODE.html) - [Documentazione dei servizi di traduzione](https://pdf2zh-next.com/getting-started/TRANSLATION_SERVICE.html) - [Iniziare](https://pdf2zh-next.com/getting-started/) - [Opzioni avanzate](https://pdf2zh-next.com/advanced/) - [Lingue supportate](https://pdf2zh-next.com/advanced/SUPPORTED_LANGUAGES.html) - [Comunità](https://pdf2zh-next.com/community/) - [Domande frequenti](https://pdf2zh-next.com/community/FAQ.html) - [Guida alla contribuzione per le traduzioni](https://pdf2zh-next.com/community/FOR_TRANSLATORS.html) ## PRs che è consigliato discutere con i maintainer tramite Issue prima della presentazione: - **Nuove funzionalità o modifiche sostanziali** (ad esempio, aggiungere un nuovo servizio di traduzione, modificare l'architettura core, ecc.) - **Modifiche che potrebbero influenzare l'esperienza utente** (ad esempio, modificare la configurazione predefinita, cambiare l'UI/UX, ecc.) - **Modifiche che potrebbero influenzare le prestazioni** (ad esempio, modificare gli algoritmi core, cambiare la strategia di caching, ecc.) - **Modifiche che potrebbero influenzare la sicurezza** (ad esempio, modificare il meccanismo di autenticazione, cambiare il metodo di archiviazione dei dati, ecc.) - **Modifiche che potrebbero influenzare la compatibilità** (ad esempio, modificare l'API, cambiare il formato dei dati, ecc.) - **Modifiche che potrebbero influenzare la manutenzione a lungo termine del progetto** (ad esempio, modificare la struttura del progetto, cambiare il metodo di gestione delle dipendenze, ecc.)
pt: Ask AI to understand the project: [DeepWiki](https://deepwiki.com/PDFMathTranslate-next/PDFMathTranslate-next) Ask AI to understand the project: [DeepWiki](https://deepwiki.com/PDFMathTranslate-next/PDFMathTranslate-next) Ask AI to understand the project: [DeepWiki](https://deepwiki.com/PDFMathTranslate-next/PDFMathTranslate-next) Ask AI to understand the project: [DeepWiki](https://deepwiki.com/PDFMathTranslate-next/PDFMathTranslate-next) Ask AI to understand the project: [DeepWiki](https://deepwiki.com/PDFMathTranslate-next/PDFMathTranslate-next) Ask AI to understand the project: [DeepWiki](https://deepwiki.com/PDFMathTranslate-next/PDFMathTranslate-next) Ask AI to understand the project: [DeepWiki](https://deepwiki.com/PDFMathTranslate-next/PDFMathTranslate-next) Ask AI to understand the project: [DeepWiki](https://deepwiki.com/PDFMathTranslate-next/PDFMathTranslate-next) Ask AI to understand the project: [DeepWiki](https://deepwiki.com/PDFMathTranslate-next/PDFMathTranslate-next) Ask AI to understand the project: [DeepWiki](https://deepwiki.com/PDFMathTranslate-next/PDFMathTranslate-next) Ask AI to understand the project: [DeepWiki](https://deepwiki.com/PDFMathTranslate-next/PDFMathTranslate-next) Ask AI to understand the project: [DeepWiki](https://deepwiki.com/PDFMathTranslate-next/PDFMathTranslate-next) Ask AI to understand the project: [DeepWiki](https://deepwiki.com/PDFMathTranslate-next/PDFMathTranslate-next) Ask AI to understand the project: [DeepWiki](https://deepwiki.com/PDFMathTranslate-next/PDFMathTranslate-next) Ask AI to understand the project: [DeepWiki](https://deepwiki.com/PDFMathTranslate-next/PDFMathTranslate-next) Ask AI to understand the project: [DeepWiki](https://deepwiki.com/PDFMathTranslate-next/PDFMathTranslate-next) Ask AI to understand the project: [DeepWiki](https://deepwiki.com/PDFMathTranslate/極不推荐添加新的依赖，除非是必要的)
ru: Спросите ИИ, чтобы понять проект: [DeepWiki](https://deepwiki.com/PDFMathTranslate-next/PDFMathTranslate-next)

# chunk_0C087ADF
source: ## Contact Us
de: ## Kontaktieren Sie uns
fr: ## Nous contacter
it: ## Contattaci
pt: ## Entre em contato conosco
ru: ## Свяжитесь с нами

# chunk_2FB8F835
source: If you have any questions, please submit feedback via Issue or join our Telegram Group. Thank you for your contribution!
de: Wenn Sie Fragen haben, können Sie Feedback über Issue einreichen oder unserer Telegram-Gruppe beitreten. Vielen Dank für Ihren Beitrag!
fr: Si vous avez des questions, veuillez soumettre vos commentaires via Issue ou rejoindre notre groupe Telegram. Merci pour votre contribution !
it: Se hai domande, invia feedback tramite Issue o unisciti al nostro gruppo Telegram. Grazie per il tuo contributo!
pt: Se você tiver alguma dúvida, envie feedback via Issue ou entre em nosso Grupo no Telegram. Obrigado pela sua contribuição!
ru: Если у вас есть какие-либо вопросы, отправьте отзыв через Issue или присоединяйтесь к нашей группе в Telegram. Спасибо за ваш вклад!

# chunk_C2A414AC
source: > [!TIP] > > [Immersive Translate](https://immersivetranslate.com) sponsors monthly Pro membership codes for active contributors to this project. For details, please see: [BabelDOC/PDFMathTranslate Contributor Reward Rules](https://funstory-ai.github.io/BabelDOC/CONTRIBUTOR_REWARD/)
de: > [!TIP] > > [Immersive Translate](https://immersivetranslate.com) sponsert monatliche Pro-Mitgliedschaftscodes für aktive Mitwirkende an diesem Projekt. Einzelheiten finden Sie unter: [BabelDOC/PDFMathTranslate Beitragsbelohnungsregeln](https://funstory-ai.github.io/BabelDOC/CONTRIBUTOR_REWARD/)
fr: > [!TIP] > > [Immersive Translate](https://immersivetranslate.com) sponsorise des codes d'abonnement Pro mensuels pour les contributeurs actifs de ce projet. Pour plus de détails, veuillez consulter : [Règles de récompense des contributeurs BabelDOC/PDFMathTranslate](https://funstory-ai.github.io/BabelDOC/CONTRIBUTOR_REWARD/)
it: > [!TIP] > > [Immersive Translate](https://immersivetranslate.com) sponsorizza codici mensili di abbonamento Pro per i contributori attivi a questo progetto. Per i dettagli, consultare: [BabelDOC/PDFMathTranslate Regole di ricompensa per i contributori](https://funstory-ai.github.io/BabelDOC/CONTRIBUTOR_REWARD/)
pt: > [!TIP] > > [Immersive Translate](https://immersivetranslate.com) patrocina códigos de assinatura Pro mensais para contribuidores ativos deste projeto. Para mais detalhes, consulte: [Regras de Recompensa para Contribuidores do BabelDOC/PDFMathTranslate](https://funstory-ai.github.io/BabelDOC/CONTRIBUTOR_REWARD/)
ru: > [!TIP] > > [Immersive Translate](https://immersivetranslate.com) спонсирует ежемесячные коды Pro-подписки для активных участников этого проекта. Подробности смотрите здесь: [Правила вознаграждения участников BabelDOC/PDFMathTranslate](https://funstory-ai.github.io/BabelDOC/CONTRIBUTOR_REWARD/)

# chunk_D0E62F41
source: # Suggesting Improvements to the Documentation Translations
de: # Vorschläge zur Verbesserung der Dokumentationsübersetzungen
fr: # Suggestions d'amélioration pour les traductions de la documentation
it: # Suggerimenti per migliorare le traduzioni della documentazione
pt: # Sugerindo Melhorias para as Traduções da Documentação
ru: # Предложения по улучшению переводов документации

# chunk_5E99F395
source: Thank you for your interest in this project! The non‑English documentation is automatically translated by large language models, so mistakes are inevitable. If you notice issues in a language you are familiar with, we warmly welcome your suggestions for improvement. Before you start contributing, please take a moment to read the following guide to help ensure your suggestions can be smoothly accepted.
de: Vielen Dank für Ihr Interesse an diesem Projekt! Die nicht-englische Dokumentation wird automatisch von großen Sprachmodellen übersetzt, daher sind Fehler unvermeidlich. Wenn Ihnen Probleme in einer Sprache auffallen, mit der Sie vertraut sind, heißen wir Ihre Vorschläge zur Verbesserung herzlich willkommen. Bevor Sie mit dem Beitrag beginnen, nehmen Sie sich bitte einen Moment Zeit, um die folgende Anleitung zu lesen, um sicherzustellen, dass Ihre Vorschläge problemlos akzeptiert werden können.
fr: Merci pour votre intérêt pour ce projet ! La documentation non-anglaise est automatiquement traduite par des modèles de langage volumineux, donc des erreurs sont inévitables. Si vous remarquez des problèmes dans une langue que vous maîtrisez, nous vous encourageons vivement à soumettre vos suggestions d'amélioration. Avant de commencer à contribuer, veuillez prendre un moment pour lire le guide suivant afin de vous assurer que vos suggestions puissent être acceptées sans problème.
it: Grazie per il tuo interesse in questo progetto! La documentazione non in inglese è tradotta automaticamente da modelli linguistici di grandi dimensioni, quindi gli errori sono inevitabili. Se noti problemi in una lingua con cui hai familiarità, ti diamo il benvenuto a suggerire miglioramenti. Prima di iniziare a contribuire, ti invitiamo a leggere la seguente guida per aiutare a garantire che i tuoi suggerimenti possano essere accettati senza problemi.
pt: Obrigado pelo seu interesse neste projeto! A documentação não‑inglesa é traduzida automaticamente por modelos de linguagem grandes, portanto, erros são inevitáveis. Se você notar problemas em um idioma com o qual está familiarizado, damos as boas-vindas às suas sugestões de melhoria. Antes de começar a contribuir, reserve um momento para ler o seguinte guia para ajudar a garantir que suas sugestões possam ser aceitas sem problemas.
ru: Спасибо за ваш интерес к этому проекту! Документация на неанглийских языках автоматически переводится с помощью больших языковых моделей, поэтому ошибки неизбежны. Если вы заметили проблемы в языке, с которым знакомы, мы с радостью приветствуем ваши предложения по улучшению. Прежде чем начать вносить свой вклад, пожалуйста, уделите момент, чтобы прочитать следующее руководство, которое поможет убедиться, что ваши предложения могут быть легко приняты.

# chunk_B08C64DE
source: # Submit Suggestions via Weblate
de: # Vorschläge über Weblate einreichen
fr: # Soumettre des suggestions via Weblate
it: # Invia suggerimenti tramite Weblate
pt: # Enviar sugestões via Weblate
ru: # Отправка предложений через Weblate

# chunk_66E75B28
source: We use [Weblate](https://weblate.org/) to manage our documentation translations. You can check the current translation status and submit suggestions on the [project's Weblate page](https://hosted.weblate.org/projects/pdfmathtranslate-next/).
de: Wir verwenden [Weblate](https://weblate.org/) zur Verwaltung unserer Dokumentationsübersetzungen. Sie können den aktuellen Übersetzungsstatus überprüfen und Vorschläge auf der [Weblate-Seite des Projekts](https://hosted.weblate.org/projects/pdfmathtranslate-next/) einreichen.
fr: Nous utilisons [Weblate](https://weblate.org/) pour gérer les traductions de notre documentation. Vous pouvez consulter l'état actuel des traductions et soumettre des suggestions sur la [page Weblate du projet](https://hosted.weblate.org/projects/pdfmathtranslate-next/).
it: Utilizziamo [Weblate](https://weblate.org/) per gestire le traduzioni della nostra documentazione. Puoi verificare lo stato attuale della traduzione e inviare suggerimenti sulla [pagina Weblate del progetto](https://hosted.weblate.org/projects/pdfmathtranslate-next/).
pt: Usamos o [Weblate](https://weblate.org/) para gerenciar as traduções da nossa documentação. Você pode verificar o status atual da tradução e enviar sugestões na [página do projeto no Weblate](https://hosted.weblate.org/projects/pdfmathtranslate-next/).
ru: Мы используем [Weblate](https://weblate.org/) для управления переводами нашей документации. Вы можете проверить текущий статус перевода и отправить предложения на [странице проекта в Weblate](https://hosted.weblate.org/projects/pdfmathtranslate-next/).

# chunk_800CE400
source: ## How to submit a suggestion
de: ## Wie man einen Vorschlag einreicht
fr: ## Comment soumettre une suggestion
it: ## Come inviare un suggerimento
pt: ## Como enviar uma sugestão
ru: ## Как отправить предложение

# chunk_B3B32731
source: It's very simple to propose translation improvements via Weblate, and you don't even need to register an account. Read on for the step-by-step process. Assume you want to improve the first sentence in the "Command-line arguments" section of [Advanced → Advanced](docs/en/advanced/advanced.md):
de: Es ist sehr einfach, Verbesserungsvorschläge für Übersetzungen über Weblate einzureichen, und Sie müssen nicht einmal ein Konto registrieren. Lesen Sie weiter für den schrittweisen Prozess. Angenommen, Sie möchten den ersten Satz im Abschnitt "命令行参数" von [高级选项 → 高级](docs/en/advanced/advanced.md) verbessern:
fr: Il est très simple de proposer des améliorations de traduction via Weblate, et vous n'avez même pas besoin de créer un compte. Lisez la suite pour connaître le processus étape par étape. Supposons que vous souhaitiez améliorer la première phrase de la section "命令行参数" dans [高级选项 → 高级](docs/en/advanced/advanced.md) :
it: È molto semplice proporre miglioramenti alle traduzioni tramite Weblate, e non è nemmeno necessario registrare un account. Continua a leggere per il processo passo dopo passo. Supponi di voler migliorare la prima frase nella sezione "命令行参数" di [高级选项 → 高级](docs/en/advanced/advanced.md):
pt: É muito simples propor melhorias de tradução via Weblate, e você nem precisa registrar uma conta. Continue lendo para ver o processo passo a passo. Suponha que você queira melhorar a primeira frase na seção "命令行参数" de [高级选项 → 高级](docs/en/advanced/advanced.md):
ru: Очень просто предложить улучшения перевода через Weblate, и вам даже не нужно регистрировать аккаунт. Читайте дальше, чтобы узнать пошаговый процесс. Предположим, вы хотите улучшить первое предложение в разделе "命令行参数" документа [高级选项 → 高级](docs/en/advanced/advanced.md):

# chunk_3B565B8D
source: 1. Open the [project's Weblate page](https://hosted.weblate.org/projects/pdfmathtranslate-next/). 2. Click `Search` at the top.
de: 1. Öffnen Sie die [Weblate-Seite des Projekts](https://hosted.weblate.org/projects/pdfmathtranslate-next/). 2. Klicken Sie oben auf `Search`.
fr: 1. Ouvrez la [page Weblate du projet](https://hosted.weblate.org/projects/pdfmathtranslate-next/). 2. Cliquez sur `Search` en haut.
it: 1. Apri la [pagina Weblate del progetto](https://hosted.weblate.org/projects/pdfmathtranslate-next/). 2. Clicca `Search` in alto.
pt: 1. Abra a [página do projeto no Weblate](https://hosted.weblate.org/projects/pdfmathtranslate-next/). 2. Clique em `Search` no topo.
ru: 1. Откройте [страницу проекта в Weblate](https://hosted.weblate.org/projects/pdfmathtranslate-next/). 2. Нажмите `Search` вверху.

# chunk_961D5AD9
source: 3. In "Filter", enter the text segment you want to find. Partial text is fine.
de: 3. Geben Sie im "Filter" den Textabschnitt ein, den Sie suchen möchten. Teilweise Texteingabe ist möglich.
fr: 3. Dans "Filtre", entrez le segment de texte que vous souhaitez trouver. Un texte partiel est acceptable.
it: 3. In "Filtro", inserisci il segmento di testo che desideri trovare. Anche un testo parziale va bene.
pt: 3. Em "Filtro", insira o segmento de texto que deseja encontrar. Texto parcial também é aceito.
ru: 3. В поле "Фильтр" введите сегмент текста, который хотите найти. Достаточно части текста.

# chunk_7F95E46F
source: When you're done, press <kbd>Enter</kbd>.
de: Wenn Sie fertig sind, drücken Sie <kbd>Enter</kbd>.
fr: Lorsque vous avez terminé, appuyez sur <kbd>Entrée</kbd>.
it: Quando hai finito, premi <kbd>Enter</kbd>.
pt: Quando terminar, pressione <kbd>Enter</kbd>.
ru: Когда закончите, нажмите <kbd>Enter</kbd>.

# chunk_49D0E074
source: 4. After pressing <kbd>Enter</kbd>, you'll be taken to the search results page. Click the result you prefer to open the edit view.
de: 4. Nach dem Drücken von <kbd>Enter</kbd> gelangen Sie zur Suchergebnisseite. Klicken Sie auf das gewünschte Ergebnis, um die Bearbeitungsansicht zu öffnen.
fr: 4. Après avoir appuyé sur <kbd>Entrée</kbd>, vous serez redirigé vers la page des résultats de recherche. Cliquez sur le résultat que vous préférez pour ouvrir la vue d'édition.
it: 4. Dopo aver premuto <kbd>Invio</kbd>, verrai portato alla pagina dei risultati di ricerca. Clicca sul risultato che preferisci per aprire la vista di modifica.
pt: 4. Após pressionar <kbd>Enter</kbd>, você será direcionado para a página de resultados da pesquisa. Clique no resultado que preferir para abrir a visualização de edição.
ru: 4. После нажатия <kbd>Enter</kbd> вы перейдёте на страницу результатов поиска. Нажмите на предпочтительный результат, чтобы открыть режим редактирования.

# chunk_89F91031
source: 5. In the edit view, make your changes to the translation. When finished, click <kbd>Suggest</kbd>. That's it—you've successfully completed a contribution.
de: 5. Nehmen Sie im Bearbeitungsmodus Ihre Änderungen an der Übersetzung vor. Klicken Sie nach Abschluss auf <kbd>Vorschlagen</kbd>. Das war's – Sie haben erfolgreich einen Beitrag geleistet.
fr: 5. Dans la vue d'édition, apportez vos modifications à la traduction. Une fois terminé, cliquez sur <kbd>Suggérer</kbd>. C'est tout—vous avez réussi à effectuer une contribution.
it: 5. Nella vista di modifica, apporta le tue modifiche alla traduzione. Una volta terminato, fai clic su <kbd>Suggerisci</kbd>. Tutto qui: hai completato con successo un contributo.
pt: 5. Na visualização de edição, faça suas alterações na tradução. Quando terminar, clique em <kbd>Sugerir</kbd>. Pronto—você concluiu com sucesso uma contribuição.
ru: 5. В режиме редактирования внесите изменения в перевод. По завершении нажмите <kbd>Предложить</kbd>. Вот и всё — вы успешно внесли свой вклад.

# chunk_998E5059
source: We will review your suggestion after it's submitted. Once approved, your changes will appear in the documentation.
de: Wir werden Ihren Vorschlag nach der Einreichung überprüfen. Sobald er genehmigt ist, werden Ihre Änderungen in der Dokumentation erscheinen.
fr: Nous examinerons votre suggestion après sa soumission. Une fois approuvée, vos modifications apparaîtront dans la documentation.
it: Esamineremo il tuo suggerimento dopo che sarà stato inviato. Una volta approvato, le tue modifiche appariranno nella documentazione.
pt: Vamos revisar sua sugestão após ela ser enviada. Uma vez aprovada, suas alterações aparecerão na documentação.
ru: Мы рассмотрим ваше предложение после его отправки. После одобрения ваши изменения появятся в документации.

# chunk_F3B96F2D
source: [**Getting Started**](./getting-started.md) > **Installation** > **Docker** _(current)_
de: [**Erste Schritte**](./getting-started.md) > **Installation** > **Docker** _(aktuell)_
fr: [**Commencer**](./getting-started.md) > **Installation** > **Docker** _(current)_
it: [**Iniziare**](./getting-started.md) > **Installazione** > **Docker** _(current)_
pt: [**Começar**](./getting-started.md) > **Instalação** > **Docker** _(atual)_
ru: [**Начало работы**](./getting-started.md) > **Установка** > **Docker** _(текущая)_

# chunk_3EBE8361
source: ### Install PDFMathTranslate via docker
de: ### Installieren Sie PDFMathTranslate über Docker
fr: ### Installer PDFMathTranslate via docker
it: ### Installa PDFMathTranslate tramite docker
pt: ### Instalar PDFMathTranslate via docker
ru: ### Установка PDFMathTranslate через docker
