Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_012D63A3
source: When this parameter is set to True, the PDF cleaning step will be skipped, which can improve compatibility and avoid some font processing issues. Usage:
de: Wenn dieser Parameter auf True gesetzt wird, wird der Schritt zur PDF-Bereinigung übersprungen, was die Kompatibilität verbessern und einige Probleme bei der Schriftverarbeitung vermeiden kann. Verwendung:
fr: Lorsque ce paramètre est défini sur True, l'étape de nettoyage du PDF sera ignorée, ce qui peut améliorer la compatibilité et éviter certains problèmes de traitement des polices. Utilisation :
it: Quando questo parametro è impostato su True, il passaggio di pulizia del PDF verrà saltato, il che può migliorare la compatibilità ed evitare alcuni problemi di elaborazione dei caratteri. Utilizzo:
pt: Quando este parâmetro é definido como True, a etapa de limpeza do PDF será ignorada, o que pode melhorar a compatibilidade e evitar alguns problemas de processamento de fontes. Uso:
ru: Когда этот параметр установлен в значение True, шаг очистки PDF будет пропущен, что может повысить совместимость и избежать некоторых проблем с обработкой шрифтов. Использование:

# chunk_1078AA87
source: Or using environment variables:
de: Oder Umgebungsvariablen verwenden:
fr: Ou en utilisant des variables d'environnement :
it: Oppure utilizzando le variabili d'ambiente:
pt: Ou usando variáveis de ambiente:
ru: Или использование переменных окружения:

# chunk_E510ADDB
source: > [!TIP] > When `--enhance-compatibility` is enabled, Skip clean is automatically enabled.
de: > [!TIP] > Wenn `--enhance-compatibility` aktiviert ist, wird die Bereinigung automatisch übersprungen.
fr: > [!TIP] > Lorsque `--enhance-compatibility` est activé, Ignorer le nettoyage est automatiquement activé.
it: > [!TIP] > Quando `--enhance-compatibility` è abilitato, Salta pulizia viene automaticamente abilitato.
pt: > [!TIP] > Quando `--enhance-compatibility` está ativado, Pular limpeza é automaticamente ativado.
ru: > [!TIP] > Когда включен параметр `--enhance-compatibility`, автоматически активируется Пропустить очистку.

# chunk_A35603CF
source: #### Translation cache
de: #### Übersetzungscache
fr: #### Cache de traduction
it: #### Cache delle traduzioni
pt: #### Cache de tradução
ru: #### Кэш перевода

# chunk_F8D49E02
source: PDFMathTranslate caches translated texts to increase speed and avoid unnecessary API calls for same contents. You can use `--ignore-cache` option to ignore translation cache and force retranslation.
de: PDFMathTranslate speichert übersetzte Texte zwischen, um die Geschwindigkeit zu erhöhen und unnötige API-Aufrufe für dieselben Inhalte zu vermeiden. Sie können die Option `--ignore-cache` verwenden, um den Übersetzungscache zu ignorieren und eine erneute Übersetzung zu erzwingen.
fr: PDFMathTranslate met en cache les textes traduits pour augmenter la vitesse et éviter les appels API inutiles pour les mêmes contenus. Vous pouvez utiliser l'option `--ignore-cache` pour ignorer le cache de traduction et forcer une nouvelle traduction.
it: PDFMathTranslate memorizza nella cache i testi tradotti per aumentare la velocità ed evitare chiamate API non necessarie per contenuti identici. Puoi utilizzare l'opzione `--ignore-cache` per ignorare la cache delle traduzioni e forzare una nuova traduzione.
pt: O PDFMathTranslate armazena em cache os textos traduzidos para aumentar a velocidade e evitar chamadas desnecessárias à API para conteúdos idênticos. Você pode usar a opção `--ignore-cache` para ignorar o cache de tradução e forçar uma nova tradução.
ru: PDFMathTranslate кэширует переведенные тексты для увеличения скорости и избежания ненужных вызовов API для одинакового содержимого. Вы можете использовать опцию `--ignore-cache`, чтобы игнорировать кэш перевода и принудительно выполнить повторный перевод.

# chunk_05080CDF
source: #### Deployment as a public services
de: #### Bereitstellung als öffentlicher Dienst
fr: #### Déploiement en tant que services publics
it: #### Distribuzione come servizi pubblici
pt: #### Implantação como serviços públicos
ru: #### Развертывание в качестве общедоступных сервисов

# chunk_A72BDF82
source: When deploying a pdf2zh GUI on public services, you should modify the configuration file as described below.
de: Wenn Sie eine pdf2zh-GUI auf öffentlichen Diensten bereitstellen, sollten Sie die Konfigurationsdatei wie unten beschrieben anpassen.
fr: Lors du déploiement d'une interface graphique pdf2zh sur des services publics, vous devez modifier le fichier de configuration comme décrit ci-dessous.
it: Quando si distribuisce un'interfaccia grafica pdf2zh su servizi pubblici, è necessario modificare il file di configurazione come descritto di seguito.
pt: Ao implantar uma GUI pdf2zh em serviços públicos, você deve modificar o arquivo de configuração conforme descrito abaixo.
ru: При развертывании графического интерфейса pdf2zh в общедоступных сервисах вам следует изменить конфигурационный файл, как описано ниже.

# chunk_41166DB8
source: > [!WARNING] > > This project has not been professionally audited for security, and may contain security vulnerabilities. Please evaluate the risks and take necessary security measures before deploying on public networks. > [!TIP] > - When deploying publicly, both disable_gui_sensitive_input and disable_config_auto_save should be enabled. > - Separate different available services with *English commas* <kbd>,</kbd> .
de: > [!WARNING] > > Dieses Projekt wurde nicht professionell auf Sicherheit überprüft und könnte Sicherheitslücken enthalten. Bitte bewerten Sie die Risiken und ergreifen Sie die notwendigen Sicherheitsmaßnahmen, bevor Sie es in öffentlichen Netzwerken bereitstellen. > [!TIP] > - Bei der öffentlichen Bereitstellung sollten sowohl `disable_gui_sensitive_input` als auch `disable_config_auto_save` aktiviert sein. > - Trennen Sie verschiedene verfügbare Dienste mit *englischen Kommas* <kbd>,</kbd> .
fr: > [!WARNING] > > Ce projet n'a pas été audité professionnellement pour la sécurité et peut contenir des vulnérabilités de sécurité. Veuillez évaluer les risques et prendre les mesures de sécurité nécessaires avant de déployer sur des réseaux publics. > [!TIP] > - Lors d'un déploiement public, disable_gui_sensitive_input et disable_config_auto_save doivent tous deux être activés. > - Séparez les différents services disponibles avec des *virgules anglaises* <kbd>,</kbd> .
it: > [!WARNING] > > Questo progetto non è stato sottoposto a un controllo professionale per la sicurezza e potrebbe contenere vulnerabilità. Si prega di valutare i rischi e adottare le necessarie misure di sicurezza prima di distribuire su reti pubbliche. > [!TIP] > - Quando si distribuisce pubblicamente, sia disable_gui_sensitive_input che disable_config_auto_save dovrebbero essere abilitati. > - Separare i diversi servizi disponibili con *virgole inglesi* <kbd>,</kbd> .
pt: > [!WARNING] > > Este projeto não foi auditado profissionalmente quanto à segurança e pode conter vulnerabilidades de segurança. Por favor, avalie os riscos e tome as medidas de segurança necessárias antes de implantar em redes públicas. > [!TIP] > - Ao implantar publicamente, tanto disable_gui_sensitive_input quanto disable_config_auto_save devem ser ativados. > - Separe diferentes serviços disponíveis com *vírgulas em inglês* <kbd>,</kbd> .
ru: > [!WARNING] > > Этот проект не проходил профессиональной проверки на безопасность и может содержать уязвимости. Пожалуйста, оцените риски и примите необходимые меры безопасности перед развертыванием в публичных сетях. > [!TIP] > - При публичном развертывании следует включить как `disable_gui_sensitive_input`, так и `disable_config_auto_save`. > - Разделяйте различные доступные сервисы с помощью *английских запятых* <kbd>,</kbd>.

# chunk_F2D0AEC1
source: A usable configuration is as follows:
de: Eine brauchbare Konfiguration ist wie folgt:
fr: Une configuration utilisable est la suivante :
it: Una configurazione utilizzabile è la seguente:
pt: Uma configuração utilizável é a seguinte:
ru: Вот пример рабочей конфигурации:

# chunk_E255AB78
source: #### Authentication and welcome page
de: #### Authentifizierung und Willkommensseite
fr: #### Authentification et page d'accueil
it: #### Autenticazione e pagina di benvenuto
pt: #### Autenticação e página de boas-vindas
ru: #### Аутентификация и приветственная страница

# chunk_1A5EEA9C
source: When using Authentication and welcome page to specify which user to use Web UI and custom the login page: example auth.txt Each line contains two elements, username, and password, separated by a comma.
de: Bei Verwendung von Authentifizierung und Willkommensseite, um festzulegen, welcher Benutzer die Web UI nutzen und die Login-Seite anpassen kann: Beispiel auth.txt Jede Zeile enthält zwei Elemente, Benutzername und Passwort, getrennt durch ein Komma.
fr: Lors de l'utilisation de l'Authentification et de la page d'accueil pour spécifier quel utilisateur doit utiliser l'interface Web et personnaliser la page de connexion : exemple auth.txt Chaque ligne contient deux éléments, le nom d'utilisateur et le mot de passe, séparés par une virgule.
it: Quando si utilizza Autenticazione e pagina di benvenuto per specificare quale utente può utilizzare Web UI e personalizzare la pagina di accesso: esempio auth.txt Ogni riga contiene due elementi, nome utente e password, separati da una virgola.
pt: Ao usar Autenticação e página de boas-vindas para especificar qual usuário deve usar a Web UI e personalizar a página de login: exemplo auth.txt Cada linha contém dois elementos, nome de usuário e senha, separados por uma vírgula.
ru: При использовании аутентификации и приветственной страницы для указания, какой пользователь может использовать Web UI и настройки страницы входа: пример auth.txt Каждая строка содержит два элемента: имя пользователя и пароль, разделенные запятой.

# chunk_0CEA118C
source: example welcome.html
de: Beispiel welcome.html
fr: exemple welcome.html
it: esempio welcome.html
pt: exemplo welcome.html
ru: пример welcome.html

# chunk_40E12FA3
source: > [!NOTE] > welcome page will work if only authentication file is not blank. > If authentication file is blank, there will be no authentication. :)
de: > [!NOTE] > Die Willkommensseite funktioniert nur, wenn die Authentifizierungsdatei nicht leer ist. > Wenn die Authentifizierungsdatei leer ist, gibt es keine Authentifizierung. :)
fr: > [!NOTE] > La page d'accueil fonctionnera uniquement si le fichier d'authentification n'est pas vide. > Si le fichier d'authentification est vide, il n'y aura pas d'authentification. :)
it: > [!NOTE] > La pagina di benvenuto funzionerà solo se il file di autenticazione non è vuoto. > Se il file di autenticazione è vuoto, non ci sarà alcuna autenticazione. :)
pt: > [!NOTE] > A página de boas-vindas funcionará apenas se o arquivo de autenticação não estiver vazio. > Se o arquivo de autenticação estiver vazio, não haverá autenticação. :)
ru: > [!NOTE] > Приветственная страница будет работать, только если файл аутентификации не пуст. > Если файл аутентификации пуст, аутентификация не будет выполняться. :)

# chunk_4A9C44BF
source: #### Glossary Support
de: #### Glossar-Unterstützung
fr: #### Prise en charge du glossaire
it: #### Supporto del glossario
pt: #### Suporte ao Glossário
ru: #### Поддержка глоссария

# chunk_65580DD5
source: PDFMathTranslate supports the glossary table. The glossary tables file should be `csv` file. There are three columns in file. Here is a demo glossary file:
de: PDFMathTranslate unterstützt die Glossartabelle. Die Glossartabellendatei sollte eine `csv`-Datei sein. Die Datei enthält drei Spalten. Hier ist eine Demo-Glossardatei:
fr: PDFMathTranslate prend en charge la table de glossaire. Le fichier de tables de glossaire doit être un fichier `csv`. Il y a trois colonnes dans le fichier. Voici un exemple de fichier de glossaire :
it: PDFMathTranslate supporta la tabella del glossario. Il file delle tabelle del glossario dovrebbe essere un file `csv`. Ci sono tre colonne nel file. Ecco un file di glossario demo:
pt: PDFMathTranslate suporta a tabela de glossário. O arquivo da tabela de glossário deve ser um arquivo `csv`. Há três colunas no arquivo. Aqui está um arquivo de glossário de demonstração:
ru: PDFMathTranslate поддерживает таблицу глоссария. Файл таблицы глоссария должен быть в формате `csv`. В файле три столбца. Вот демонстрационный файл глоссария:

# chunk_2403CA4A
source: | source | target | tgt_lng | |--------|---------|---------| | AutoML | 自动 ML | zh-CN | | a,a | a | zh-CN | | " | " | zh-CN |
de: | source | target | tgt_lng | |--------|---------|---------| | AutoML | Automatisches ML | de | | a,a | a | de | | " | " | de |
fr: | source | target | tgt_lng | |--------|---------|---------| | AutoML | ML automatique | fr | | a,a | a | fr | | " | " | fr |
pt: | origem | destino | tgt_lng | |--------|---------|---------|---------| | AutoML | ML Automático | pt | | a,a | a | pt | | " | " | pt |
ru: | source | target | tgt_lng | |--------|---------|---------| | AutoML | Автоматизированный ML | ru | | a,a | a | ru | | " | " | ru |

# chunk_598725B0
source: For CLI user: You can use multiple files for glossary. And different files should be split by `,`.
de: Für CLI-Benutzer: Sie können mehrere Dateien für das Glossar verwenden. Und verschiedene Dateien sollten durch `,` getrennt werden.
fr: Pour les utilisateurs de la ligne de commande : Vous pouvez utiliser plusieurs fichiers pour le glossaire. Et les différents fichiers doivent être séparés par `,`.
it: Per gli utenti CLI: È possibile utilizzare più file per il glossario. E i diversi file dovrebbero essere separati da `,`.
pt: Para usuários da CLI: Você pode usar vários arquivos para o glossário. E arquivos diferentes devem ser separados por `,`.
ru: Для пользователей CLI: Вы можете использовать несколько файлов для глоссария. Разные файлы должны быть разделены `,`.

# chunk_B3174CBC
source: For WebUI user: You can upload your own glossary file now. After you uploaded the file, you can check them by click their name and the content shows below. [⬆️ Back to top](#toc)
de: Für WebUI-Benutzer: Sie können jetzt Ihre eigene Glossardatei hochladen. Nachdem Sie die Datei hochgeladen haben, können Sie sie überprüfen, indem Sie auf ihren Namen klicken und der Inhalt wird unten angezeigt. [⬆️ Zurück zum Anfang](#toc)
fr: Pour les utilisateurs de WebUI : Vous pouvez maintenant télécharger votre propre fichier de glossaire. Après avoir téléchargé le fichier, vous pouvez le consulter en cliquant sur son nom et le contenu s'affichera ci-dessous. [⬆️ Retour en haut](#toc)
it: Per gli utenti di WebUI: Ora puoi caricare il tuo file del glossario. Dopo aver caricato il file, puoi verificarlo cliccando sul suo nome e il contenuto verrà visualizzato di seguito. [⬆️ Torna all'inizio](#toc)
pt: Para usuários do WebUI: Agora você pode enviar seu próprio arquivo de glossário. Após enviar o arquivo, você pode verificar o conteúdo clicando no nome dele, que será exibido abaixo. [⬆️ Voltar ao topo](#toc)
ru: Для пользователей WebUI: Теперь вы можете загрузить свой собственный файл глоссария. После загрузки файла вы можете проверить его, нажав на его имя, и содержимое отобразится ниже. [⬆️ Наверх](#toc)

# chunk_0D45C98F
source: ### Advanced
de: ### Erweiterte Optionen
fr: ### Options avancées
it: ### Opzioni avanzate
pt: ### Opções avançadas
ru: ### Расширенные параметры

# chunk_F16EF37C
source: This section is intended for advanced users of this software. Here you can find:
de: Dieser Abschnitt richtet sich an fortgeschrittene Benutzer dieser Software. Hier finden Sie:
fr: Cette section est destinée aux utilisateurs avancés de ce logiciel. Ici, vous pouvez trouver :
it: Questa sezione è destinata agli utenti avanzati di questo software. Qui puoi trovare:
pt: Esta seção é destinada a usuários avançados deste software. Aqui você pode encontrar:
ru: Этот раздел предназначен для опытных пользователей данного программного обеспечения. Здесь вы можете найти:

# chunk_5FC80BEA
source: 1. [**Advanced Usage**](./advanced.md)
de: 1. [**Erweiterte Optionen**](./advanced.md)
fr: 1. [**Options avancées**](./advanced.md)
it: 1. [**Opzioni avanzate**](./advanced.md)
pt: 1. [**Opções avançadas**](./advanced.md)
ru: 1. [**Расширенные параметры**](./advanced.md)

# chunk_7B3D7A76
source: <br> In this section, you can explore specify source/target languages, switch translation services, and more.
de: <br> In diesem Abschnitt können Sie spezifische Quell-/Zielsprachen erkunden, Übersetzungsdienste wechseln und mehr.
fr: <br> Dans cette section, vous pouvez explorer les langues source/cible spécifiques, changer de services de traduction, et plus encore.
it: <br> In questa sezione, puoi esplorare i linguaggi di origine/destinazione specifici, cambiare i servizi di traduzione e altro ancora.
pt: <br> Nesta seção, você pode explorar idiomas de origem/destino específicos, alternar serviços de tradução e muito mais.
ru: <br> В этом разделе вы можете указать исходный/целевой языки, переключить службы перевода и многое другое.

# chunk_7A0A4B36
source: 2. [**Language Code**](./Language-Codes.md)
de: 2. [**Sprachcode**](./Language-Codes.md)
fr: 2. [**Code de langue**](./Language-Codes.md)
it: 2. [**Codice lingua**](./Language-Codes.md)
pt: 2. [**Código do idioma**](./Language-Codes.md)
ru: 2. [**Код языка**](./Language-Codes.md)

# chunk_298EB9AE
source: <br> If you are unsure about which codes to use for translating your source/target languages, you can find them here.
de: <br> Wenn Sie unsicher sind, welche Codes Sie für die Übersetzung Ihrer Quell-/Zielsprachen verwenden sollen, können Sie diese hier finden.
fr: <br> Si vous n'êtes pas sûr des codes à utiliser pour traduire vos langues source/cible, vous pouvez les trouver ici.
it: <br> Se non sei sicuro su quali codici utilizzare per tradurre le tue lingue di origine/destinazione, puoi trovarli qui.
pt: <br> Se você não tem certeza sobre quais códigos usar para traduzir seus idiomas de origem/destino, você pode encontrá-los aqui.
ru: <br> Если вы не уверены, какие коды использовать для перевода исходного/целевого языка, вы можете найти их здесь.

# chunk_A956AA16
source: 3. [**Documentation of Translation Services**](./Documentation-of-Translation-Services.md)
de: 3. [**Dokumentation der Übersetzungsdienste**](./Documentation-of-Translation-Services.md)
fr: 3. [**Documentation des services de traduction**](./Documentation-of-Translation-Services.md)
it: 3. [**Documentazione dei servizi di traduzione**](./Documentation-of-Translation-Services.md)
pt: 3. [**Documentação dos serviços de tradução**](./Documentation-of-Translation-Services.md)
ru: 3. [**Документация служб перевода**](./Documentation-of-Translation-Services.md)

# chunk_49F0D79D
source: <br> If you need to review the documentation provided by the translation services you are using, please refer to this page.
de: <br> Wenn Sie die Dokumentation der von Ihnen verwendeten Übersetzungsdienste überprüfen müssen, lesen Sie bitte diese Seite.
fr: <br> Si vous avez besoin de consulter la documentation fournie par les services de traduction que vous utilisez, veuillez vous référer à cette page.
it: <br> Se hai bisogno di rivedere la documentazione fornita dai servizi di traduzione che stai utilizzando, fai riferimento a questa pagina.
pt: <br> Se você precisar revisar a documentação fornecida pelos serviços de tradução que está usando, consulte esta página.
ru: <br> Если вам нужно ознакомиться с документацией, предоставляемой используемыми службами перевода, обратитесь к этой странице.

# chunk_53390D48
source: # Contributing to the Project
de: # Beitrag zum Projekt
fr: # Contribuer au projet
it: # Contribuire al progetto
pt: # Contribuindo para o projeto
ru: # Вклад в проект

# chunk_A71D833E
source: > [!CAUTION] > > The current project maintainers are researching automated documentation internationalization. Therefore, any PRs related to documentation internationalization/translation will NOT be accepted! > > Please do NOT submit PRs related to documentation internationalization/translation!
de: > [!CAUTION] > > Die aktuellen Projektbetreuer erforschen die automatisierte Internationalisierung der Dokumentation. Daher werden keine PRs im Zusammenhang mit der Internationalisierung/Übersetzung der Dokumentation akzeptiert! > > Bitte reichen Sie KEINE PRs im Zusammenhang mit der Internationalisierung/Übersetzung der Dokumentation ein!
fr: > [!CAUTION] > > Les mainteneurs actuels du projet recherchent une internationalisation automatisée de la documentation. Par conséquent, toute PR liée à l'internationalisation/traduction de la documentation ne sera PAS acceptée ! > > Veuillez ne PAS soumettre de PR liées à l'internationalisation/traduction de la documentation !
it: > [!CAUTION] > > Gli attuali responsabili del progetto stanno ricercando l'internazionalizzazione automatizzata della documentazione. Pertanto, qualsiasi PR relativa all'internazionalizzazione/traduzione della documentazione NON sarà accettata! > > Si prega di NON inviare PR relative all'internazionalizzazione/traduzione della documentazione!
pt: > [!CAUTION] > > Os mantenedores atuais do projeto estão pesquisando a internacionalização automatizada de documentação. Portanto, qualquer PR relacionado à internacionalização/tradução de documentação NÃO será aceito! > > Por favor, NÃO envie PRs relacionados à internacionalização/tradução de documentação!
ru: > [!CAUTION] > > Текущие сопровождающие проекта исследуют автоматизацию интернационализации документации. Поэтому любые PR, связанные с интернационализацией/переводом документации, НЕ будут приниматься! > > Пожалуйста, НЕ отправляйте PR, связанные с интернационализацией/переводом документации!

# chunk_D57757D9
source: Thank you for your interest in this project! Before you start contributing, please take some time to read the following guidelines to ensure your contribution can be smoothly accepted.
de: Vielen Dank für Ihr Interesse an diesem Projekt! Bevor Sie mit Ihrem Beitrag beginnen, nehmen Sie sich bitte etwas Zeit, um die folgenden Richtlinien zu lesen, damit Ihr Beitrag problemlos akzeptiert werden kann.
fr: Merci pour votre intérêt pour ce projet ! Avant de commencer à contribuer, veuillez prendre le temps de lire les directives suivantes pour vous assurer que votre contribution puisse être acceptée sans problème.
it: Grazie per il tuo interesse in questo progetto! Prima di iniziare a contribuire, ti preghiamo di dedicare un po' di tempo a leggere le seguenti linee guida per assicurarti che il tuo contributo possa essere accettato senza problemi.
pt: Obrigado pelo seu interesse neste projeto! Antes de começar a contribuir, reserve um tempo para ler as seguintes diretrizes para garantir que sua contribuição possa ser aceita sem problemas.
ru: Спасибо за ваш интерес к этому проекту! Прежде чем начать вносить свой вклад, пожалуйста, уделите немного времени, чтобы прочитать следующие рекомендации, чтобы ваш вклад мог быть легко принят.

# chunk_FB836CBD
source: ## Types of Contributions Not Accepted
de: ## Nicht akzeptierte Beitragsarten
fr: ## Types de contributions non acceptées
it: ## Tipi di Contributi Non Accettati
pt: ## Tipos de Contribuições Não Aceitas
ru: ## Типы вкладов, которые не принимаются
