Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_80C69F3E
source: | `--save-auto-extracted-glossary`| save automatically extracted glossary | `pdf2zh_next example.pdf --save-auto-extracted-glossary` |
de: | :------------------------------- | :-------------------------------------------------------------------------------------- | :--------------------------------------------------------------------------------------------------------------------- | | `--glossary` | use glossary | `pdf2zh_next example.pdf --glossary glossary.json` | | `--glossary-url` | use glossary from URL | `pdf2zh_next example.pdf --glossary-url https://example.com/glossary.json` | | `--glossary-merge-mode` | glossary merge mode, options: `merge`, `overwrite`, default: `merge` | `pdf2zh_next example.pdf --glossary-merge-mode overwrite` | | `--glossary-min-freq` | minimum frequency for automatically extracted glossary, default: `2` | `pdf2zh_next example.pdf --glossary-min-freq 5` | | `--glossary-min-prob` | minimum probability for automatically extracted glossary, default: `0.5` | `pdf2zh_next example.pdf --glossary-min-prob 0.7` | | `--glossary-min-score` | minimum score for automatically extracted glossary, default: `0.5` | `pdf2zh_next example.pdf --glossary-min-score 0.7` | --- ### TRANSLATION RESULT | `--save-auto-extracted-glossary` | Automatisch extrahiertes Glossar speichern | `pdf2zh_next example.pdf --save-auto-extracted-glossary` | | :------------------------------- | :-------------------------------------------------------------------------------------- | :--------------------------------------------------------------------------------------------------------------------- | | `--glossary` | Glossar verwenden | `pdf2zh_next example.pdf --glossary glossary.json` | | `--glossary-url` | Glossar von URL verwenden | `pdf2zh_next example.pdf --glossary-url https://example.com/glossary.json` | | `--glossary-merge-mode` | Glossar-Zusammenführungsmodus, Optionen: `merge`, `overwrite`, Standard: `merge` | `pdf2zh_next example.pdf --glossary-merge-mode overwrite` | | `--glossary-min-freq` | Mindesthäufigkeit für automatisch extrahiertes Glossar, Standard: `2` | `pdf2zh_next example.pdf --glossary-min-freq 5` | | `--glossary-min-prob` | Mindestwahrscheinlichkeit für automatisch extrahiertes Glossar, Standard: `0.5` | `pdf2zh_next example.pdf --glossary-min-prob 0.7` | | `--glossary-min-score` | Mindestpunktzahl für automatisch extrahiertes Glossar, Standard: `0.5` | `pdf2zh_next example.pdf --glossary-min-score 0.7` |
fr: |---------------------------------|----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------| | `--save-manual-glossary` | save manually added glossary | `pdf2zh_next example.pdf --save-manual-glossary` | | `--save-all-glossary` | save all glossary (auto extracted and manually added) | `pdf2zh_next example.pdf --save-all-glossary` | | `--glossary` | path to the glossary file (default: `glossary.json`, `glossary.yaml`, `glossary.yml`) | `pdf2zh_next example.pdf --glossary custom_glossary.json` | | `--glossary-format` | format of the glossary file (default: `auto`) | `pdf2zh_next example.pdf --glossary-format json` | | `--glossary-save-format` | format to save the glossary file (default: `auto`) | `pdf2zh_next example.pdf --glossary-save-format yaml` | | `--glossary-save-path` | path to save the glossary file (default: `glossary.json`) | `pdf2zh_next example.pdf --glossary-save-path custom_glossary.json` | | `--glossary-save-auto` | automatically save the glossary after translation (default: `false`) | `pdf2zh_next example.pdf --glossary-save-auto` | | `--glossary-save-manual` | save the manually added glossary after translation (default: `false`) | `pdf2zh_next example.pdf --glossary-save-manual` | | `--glossary-save-all` | save all glossary after translation (default: `false`) | `pdf2zh_next example.pdf --glossary-save-all` | | `--glossary-auto-extract` | automatically extract glossary from the document (default: `true`) | `pdf2zh_next example.pdf --glossary-auto-extract false` | | `--glossary-manual-add` | manually add glossary entries (default: `true`) | `pdf2zh_next example.pdf --glossary-manual-add false` | | `--glossary-use` | use glossary during translation (default: `true`) | `pdf2zh_next example.pdf --glossary-use false` | | `--glossary-update` | update glossary during translation (default: `true`) | `pdf2zh_next example.pdf --glossary-update false` | | `--glossary-ignore-case` | ignore case when matching glossary entries (default: `false`) | `pdf2zh_next example.pdf --glossary-ignore-case` | | `--glossary-ignore-punctuation` | ignore punctuation when matching glossary entries (default: `false`) | `pdf2zh_next example.pdf --glossary-ignore-punctuation` | | `--glossary-ignore-whitespace` | ignore whitespace when matching glossary entries (default: `false`) | `pdf2zh_next example.pdf --glossary-ignore-whitespace` | | `--glossary-ignore-digits` | ignore digits when matching glossary entries (default: `false`) | `pdf2zh_next example.pdf --glossary-ignore-digits` | | `--glossary-ignore-symbols` | ignore symbols when matching glossary entries (default: `false`) | `pdf2zh_next example.pdf --glossary-ignore-symbols` | | `--glossary-ignore-accents` | ignore accents when matching glossary entries (default: `false`) | `pdf2zh_next example.pdf --glossary-ignore-accents` | | `--glossary-ignore-articles` | ignore articles when matching glossary entries (default: `false`) | `pdf2zh_next example.pdf --glossary-ignore-articles` | | `--glossary-ignore-prepositions` | ignore prepositions when matching glossary entries (default: `false`) | `pdf2zh_next example.pdf --glossary-ignore-prepositions` | | `--glossary-ignore-conjunctions` | ignore conjunctions when matching glossary entries (default: `false`) | `pdf2zh_next example.pdf --glossary-ignore-conjunctions` | | `--glossary-ignore-pronouns` | ignore pronouns when matching glossary entries (default: `false`) | `pdf2zh_next example.pdf --glossary-ignore-pronouns` | | `--glossary-ignore-verbs` | ignore verbs when matching glossary entries (default: `false`) | `pdf2zh_next example.pdf --glossary-ignore-verbs` | | `--glossary-ignore-nouns` | ignore nouns when matching glossary entries (default: `false`) | `pdf2zh_next example.pdf --glossary-ignore-nouns` | | `--glossary-ignore-adjectives` | ignore adjectives when matching glossary entries (default: `false`) | `pdf2zh_next example.pdf --glossary-ignore-adjectives` | | `--glossary-ignore-adverbs` | ignore adverbs when matching glossary entries (default: `false`) | `pdf2zh_next example.pdf --glossary-ignore-adverbs` | | `--glossary-ignore-other` | ignore other words when matching glossary entries (default: `false`) | `pdf2zh_next example.pdf --glossary-ignore-other` | | `--glossary-ignore-custom` | ignore custom words when matching glossary entries (default: `false`) | `pdf2zh_next example.pdf --glossary-ignore-custom` | | `--glossary-ignore-list` | path to a file containing words to ignore (default: `None`) | `pdf2zh_next example.pdf --glossary-ignore-list ignore_words.txt` | --- ### TRANSLATION RESULT | `--save-auto-extracted-glossary` | enregistrer le glossaire extrait automatiquement | `pdf2zh_next example.pdf --save-auto-extracted-glossary` | |---------------------------------|----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------| | `--save-manual-glossary` | enregistrer le glossaire ajouté manuellement | `pdf2zh_next example.pdf --save-manual-glossary` | | `--save-all-glossary` | enregistrer tous les glossaires (extraits automatiquement et ajoutés manuellement) | `pdf2zh_next example.pdf --save-all-glossary` | | `--glossary` | chemin vers le fichier de glossaire (par défaut : `glossary.json`, `glossary.yaml`, `glossary.yml`) | `pdf2zh_next example.pdf --glossary custom_glossary.json` | | `--glossary-format` | format du fichier de glossaire (par défaut : `auto`) | `pdf2zh_next example.pdf --glossary-format json` | | `--glossary-save-format` | format pour enregistrer le fichier de glossaire (par défaut : `auto`) | `pdf2zh_next example.pdf --glossary-save-format yaml` | | `--glossary-save-path` | chemin pour enregistrer le fichier de glossaire (par défaut : `glossary.json`) | `pdf2zh_next example.pdf --glossary-save-path custom_glossary.json` | | `--glossary-save-auto` | enregistrer automatiquement le glossaire après la traduction (par défaut : `false`) | `pdf2zh_next example.pdf --glossary-save-auto` | | `--glossary-save-manual` | enregistrer le glossaire ajouté manuellement après la traduction (par défaut : `false`) | `pdf2zh_next example.pdf --glossary-save-manual` | | `--glossary-save-all` | enregistrer tous les glossaires après la traduction (par défaut : `false`) | `pdf2zh_next example.pdf --glossary-save-all` | | `--glossary-auto-extract` | extraire automatiquement le glossaire du document (par défaut : `true`) | `pdf2zh_next example.pdf --glossary-auto-extract false` | | `--glossary-manual-add` | ajouter manuellement des entrées de glossaire (par défaut : `true`) | `pdf2zh_next example.pdf --glossary-manual-add false` | | `--glossary-use` | utiliser le glossaire pendant la traduction (par défaut : `true`) | `pdf2zh_next example.pdf --glossary-use false` | | `--glossary-update` | mettre à jour le glossaire pendant la traduction (par défaut : `true`) | `pdf2zh_next example.pdf --glossary-update false` | | `--glossary-ignore-case` | ignorer la casse lors de la correspondance des entrées du glossaire (par défaut : `false`) | `pdf2zh_next example.pdf --glossary-ignore-case` | | `--glossary-ignore-punctuation` | ignorer la ponctuation lors de la correspondance des entrées du glossaire (par défaut : `false`) | `pdf2zh_next example.pdf --glossary-ignore-punctuation` | | `--glossary-ignore-whitespace` | ignorer les espaces blancs lors de la correspondance des entrées du glossaire (par défaut : `false`) | `pdf2zh_next example.pdf --glossary-ignore-whitespace` | | `--glossary-ignore-digits` | ignorer les chiffres lors de la correspondance des entrées du glossaire (par défaut : `false`) | `pdf2zh_next example.pdf --glossary-ignore-digits` | | `--glossary-ignore-symbols` | ignorer les symboles lors de la correspondance des entrées du glossaire (par défaut : `false`) | `pdf2zh_next example.pdf --glossary-ignore-symbols` | | `--glossary-ignore-accents` | ignorer les accents lors de la correspondance des entrées du glossaire (par défaut : `false`) | `pdf2zh_next example.pdf --glossary-ignore-accents` | | `--glossary-ignore-articles` | ignorer les articles lors de la correspondance des entrées du glossaire (par défaut : `false`) | `pdf2zh_next example.pdf --glossary-ignore-articles` | | `--glossary-ignore-prepositions` | ignorer les prépositions lors de la correspondance des entrées du glossaire (par défaut : `false`) | `pdf2zh_next example.pdf --glossary-ignore-prepositions` | | `--glossary-ignore-conjunctions` | ignorer les conjonctions lors de la correspondance des entrées du glossaire (par défaut : `false`) | `pdf2zh_next example.pdf --glossary-ignore-conjunctions` | | `--glossary-ignore-pronouns` | ignorer les pronoms lors de la correspondance des entrées du glossaire (par défaut : `false`) | `pdf2zh_next example.pdf --glossary-ignore-pronouns` | | `--glossary-ignore-verbs` | ignorer les verbes lors de la correspondance des entrées du glossaire (par défaut : `false`) | `pdf2zh_next example.pdf --glossary-ignore-verbs` | | `--glossary-ignore-nouns` | ignorer les noms lors de la correspondance des entrées du glossaire (par défaut : `false`) | `pdf2zh_next example.pdf --glossary-ignore-nouns` | | `--glossary-ignore-adjectives` | ignorer les adjectifs lors de la correspondance des entrées du glossaire (par défaut : `false`) | `pdf2zh_next example.pdf --glossary-ignore-adjectives` | | `--glossary-ignore-adverbs` | ignorer les adverbes lors de la correspondance des entrées du glossaire (par défaut : `false`) | `pdf2zh_next example.pdf --glossary-ignore-adverbs` | | `--glossary-ignore-other` | ignorer les autres mots lors de la correspondance des entrées du glossaire (par défaut : `false`) | `pdf2zh_next example.pdf --glossary-ignore-other` | | `--glossary-ignore-custom` | ignorer les mots personnalisés lors de la correspondance des entrées du glossaire (par défaut : `false`) | `pdf2zh_next example.pdf --glossary-ignore-custom` | | `--glossary-ignore-list` | chemin vers un fichier contenant des mots à ignorer (par défaut : `None`) | `pdf2zh_next example.pdf --glossary-ignore-list ignore_words.txt` |
it: `-s` | | `--save-auto-extracted-glossary-path` | path to save the automatically extracted glossary | `pdf2zh_next example.pdf --save-auto-extracted-glossary-path ./glossary.json` | | | `--use-auto-extracted-glossary` | use automatically extracted glossary | `pdf2zh_next example.pdf --use-auto-extracted-glossary` | `-u` | | `--use-auto-extracted-glossary-path` | path to the automatically extracted glossary | `pdf2zh_next example.pdf --use-auto-extracted-glossary-path ./glossary.json` | | | `--save-manual-glossary` | save manual glossary | `pdf2zh_next example.pdf --save-manual-glossary` | | | `--save-manual-glossary-path` | path to save the manual glossary | `pdf2zh_next example.pdf --save-manual-glossary-path ./glossary.json` | | | `--use-manual-glossary` | use manual glossary | `pdf2zh_next example.pdf --use-manual-glossary` | | | `--use-manual-glossary-path` | path to the manual glossary | `pdf2zh_next example.pdf --use-manual-glossary-path ./glossary.json` | | | `--glossary-merge` | merge the glossary | `pdf2zh_next example.pdf --glossary-merge` | | | `--glossary-merge-path` | path to save the merged glossary | `pdf2zh_next example.pdf --glossary-merge-path ./glossary.json` | | | `--glossary-merge-strategy` | strategy for merging glossaries: `union`, `intersection`, `difference` | `pdf2zh_next example.pdf --glossary-merge-strategy union` | | | `--glossary-merge-keep-original` | keep the original glossary entries when merging | `pdf2zh_next example.pdf --glossary-merge-keep-original` | | | `--glossary-merge-keep-translation` | keep the translation glossary entries when merging | `pdf2zh_next example.pdf --glossary-merge-keep-translation` | | --- ### TRANSLATION RESULT | `--save-auto-extracted-glossary`| salva il glossario estratto automaticamente | `pdf2zh_next example.pdf --save-auto-extracted-glossary` | `-s` | | `--save-auto-extracted-glossary-path` | percorso per salvare il glossario estratto automaticamente | `pdf2zh_next example.pdf --save-auto-extracted-glossary-path ./glossary.json` | | | `--use-auto-extracted-glossary` | utilizza il glossario estratto automaticamente | `pdf2zh_next example.pdf --use-auto-extracted-glossary` | `-u` | | `--use-auto-extracted-glossary-path` | percorso del glossario estratto automaticamente | `pdf2zh_next example.pdf --use-auto-extracted-glossary-path ./glossary.json` | | | `--save-manual-glossary` | salva il glossario manuale | `pdf2zh_next example.pdf --save-manual-glossary` | | | `--save-manual-glossary-path` | percorso per salvare il glossario manuale | `pdf2zh_next example.pdf --save-manual-glossary-path ./glossary.json` | | | `--use-manual-glossary` | utilizza il glossario manuale | `pdf2zh_next example.pdf --use-manual-glossary` | | | `--use-manual-glossary-path` | percorso del glossario manuale | `pdf2zh_next example.pdf --use-manual-glossary-path ./glossary.json` | | | `--glossary-merge` | unisce il glossario | `pdf2zh_next example.pdf --glossary-merge` | | | `--glossary-merge-path` | percorso per salvare il glossario unito | `pdf2zh_next example.pdf --glossary-merge-path ./glossary.json` | | | `--glossary-merge-strategy` | strategia per unire i glossari: `union`, `intersection`, `difference` | `pdf2zh_next example.pdf --glossary-merge-strategy union` | | | `--glossary-merge-keep-original` | mantiene le voci del glossario originali durante l'unione | `pdf2zh_next example.pdf --glossary-merge-keep-original` | | | `--glossary-merge-keep-translation` | mantiene le voci del glossario di traduzione durante l'unione | `pdf2zh_next example.pdf --glossary-merge-keep-translation` | |
pt: | ------------------------------- | -------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--use-glossary` | use glossary to translate | `pdf2zh_next example.pdf --use-glossary` | | `--use-glossary-only` | use glossary only to translate, and skip other translation services | `pdf2zh_next example.pdf --use-glossary-only` | | `--save-glossary` | save glossary used in translation | `pdf2zh_next example.pdf --save-glossary` | --- ### TRANSLATED TEXT | `--save-auto-extracted-glossary`| salvar glossário extraído automaticamente | `pdf2zh_next example.pdf --save-auto-extracted-glossary` | | ------------------------------- | -------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--use-glossary` | usar glossário para traduzir | `pdf2zh_next example.pdf --use-glossary` | | `--use-glossary-only` | usar apenas o glossário para traduzir, e pular outros serviços de tradução | `pdf2zh_next example.pdf --use-glossary-only` | | `--save-glossary` | salvar glossário usado na tradução | `pdf2zh_next example.pdf --save-glossary` |
ru: |---------------------------------|----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------| | `--glossary` | use custom glossary | `pdf2zh_next example.pdf --glossary my-glossary.txt` | | `--save-glossary` | save the merged glossary to a file | `pdf2zh_next example.pdf --save-glossary output-glossary.txt` | | `--save-glossary-to-origin-dir` | save the merged glossary to the same directory as the original file, with a suffix | `pdf2zh_next example.pdf --save-glossary-to-origin-dir` | | `--save-translated-glossary` | save the translated glossary to a file (after translation) | `pdf2zh_next example.pdf --save-translated-glossary output-translated-glossary.txt` | | `--save-translated-glossary-to-origin-dir` | save the translated glossary to the same directory as the original file, with a suffix | `pdf2zh_next example.pdf --save-translated-glossary-to-origin-dir` | --- ### OUTPUT | `--save-auto-extracted-glossary`| сохранить автоматически извлечённый глоссарий | `pdf2zh_next example.pdf --save-auto-extracted-glossary` | |---------------------------------|----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------| | `--glossary` | использовать пользовательский глоссарий | `pdf2zh_next example.pdf --glossary my-glossary.txt` | | `--save-glossary` | сохранить объединённый глоссарий в файл | `pdf2zh_next example.pdf --save-glossary output-glossary.txt` | | `--save-glossary-to-origin-dir` | сохранить объединённый глоссарий в ту же директорию, что и исходный файл, с суффиксом | `pdf2zh_next example.pdf --save-glossary-to-origin-dir` | | `--save-translated-glossary` | сохранить переведённый глоссарий в файл (после перевода) | `pdf2zh_next example.pdf --save-translated-glossary output-translated-glossary.txt` | | `--save-translated-glossary-to-origin-dir` | сохранить переведённый глоссарий в ту же директорию, что и исходный файл, с суффиксом | `pdf2zh_next example.pdf --save-translated-glossary-to-origin-dir` |
