Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_FEFD024F
source: | `--enabled-services` | Enabled translation services | `pdf2zh_next --gui --enabled-services "Bing,OpenAI"` |
de: Enable Bing and OpenAI translation services only. | | ------------------------------- | -------------------------------------- | ---------------------------------------------------- | --------------------------------------------------------------------- | | `--disabled-services` | Disabled translation services | `pdf2zh_next --gui --disabled-services "Google"` | Disable Google translation service. | | `--language` | Language code of the target language | `pdf2zh_next --gui --language "de"` | Set the target language to German. | | `--translate-format` | Translate content format | `pdf2zh_next --gui --translate-format "text"` | Translate only the text content. | | `--translate-tags` | Translate specific tags | `pdf2zh_next --gui --translate-tags "p,span,div"` | Translate content within `<p>`, `<span>`, and `<div>` tags. | | `--exclude-tags` | Exclude specific tags | `pdf2zh_next --gui --exclude-tags "code,pre"` | Exclude content within `<code>` and `<pre>` tags from translation. | | `--translator-args` | Additional arguments for the translator | `pdf2zh_next --gui --translator-args '{"api_key": "your_api_key"}'` | Pass additional arguments (e.g., API key) to the translator. | | `--concurrency-limit` | Maximum number of concurrent requests | `pdf2zh_next --gui --concurrency-limit 10` | Set the maximum number of concurrent translation requests to 10. | | `--request-timeout` | Timeout for each translation request | `pdf2zh_next --gui --request-timeout 30` | Set the timeout for each translation request to 30 seconds. | | `--request-interval` | Interval between translation requests | `pdf2zh_next --gui --request-interval 1` | Set the interval between translation requests to 1 second. | | `--max-characters` | Maximum characters per request | `pdf2zh_next --gui --max-characters 5000` | Limit each translation request to 5000 characters. | | `--glossary` | Glossary file for translation | `pdf2zh_next --gui --glossary "glossary.txt"` | Use a glossary file to ensure consistent translation of specific terms. | | `--html` | Output format as HTML | `pdf2zh_next --gui --html` | Output the translated content in HTML format. | | `--markdown` | Output format as Markdown | `pdf2zh_next --gui --markdown` | Output the translated content in Markdown format. | | `--output` | Output file path | `pdf2zh_next --gui --output "output.pdf"` | Specify the output file path. | | `--config` | Configuration file path | `pdf2zh_next --gui --config "config.json"` | Use a configuration file to set multiple options. | | `--help` | Show help message | `pdf2zh_next --gui --help` | Display the help message for the GUI command. | --- ### OUTPUT | `--enabled-services` | Aktivierte Übersetzungsdienste | `pdf2zh_next --gui --enabled-services "Bing,OpenAI"` | Aktivieren Sie nur die Bing- und OpenAI-Übersetzungsdienste. | | ------------------------------- | -------------------------------------- | ---------------------------------------------------- | --------------------------------------------------------------------- | | `--disabled-services` | Deaktivierte Übersetzungsdienste | `pdf2zh_next --gui --disabled-services "Google"` | Deaktivieren Sie den Google-Übersetzungsdienst. | | `--language` | Sprachcode der Zielsprache | `pdf2zh_next --gui --language "de"` | Setzen Sie die Zielsprache auf Deutsch. | | `--translate-format` | Zu übersetzendes Inhaltsformat | `pdf2zh_next --gui --translate-format "text"` | Übersetzen Sie nur den Textinhalt. | | `--translate-tags` | Bestimmte Tags übersetzen | `pdf2zh_next --gui --translate-tags "p,span,div"` | Übersetzen Sie Inhalte innerhalb von `<p>`, `<span>` und `<div>` Tags. | | `--exclude-tags` | Bestimmte Tags ausschließen | `pdf2zh_next --gui --exclude-tags "code,pre"` | Schließen Sie Inhalte innerhalb von `<code>` und `<pre>` Tags von der Übersetzung aus. | | `--translator-args` | Zusätzliche Argumente für den Übersetzer | `pdf2zh_next --gui --translator-args '{"api_key": "your_api_key"}'` | Übergeben Sie zusätzliche Argumente (z. B. API-Schlüssel) an den Übersetzer. | | `--concurrency-limit` | Maximale Anzahl gleichzeitiger Anfragen | `pdf2zh_next --gui --concurrency-limit 10` | Setzen Sie die maximale Anzahl gleichzeitiger Übersetzungsanfragen auf 10. | | `--request-timeout` | Timeout für jede Übersetzungsanfrage | `pdf2zh_next --gui --request-timeout 30` | Setzen Sie das Timeout für jede Übersetzungsanfrage auf 30 Sekunden. | | `--request-interval` | Intervall zwischen Übersetzungsanfragen | `pdf2zh_next --gui --request-interval 1` | Setzen Sie das Intervall zwischen Übersetzungsanfragen auf 1 Sekunde. | | `--max-characters` | Maximale Zeichen pro Anfrage | `pdf2zh_next --gui --max-characters 5000` | Begrenzen Sie jede Übersetzungsanfrage auf 5000 Zeichen. | | `--glossary` | Glossardatei für die Übersetzung | `pdf2zh_next --gui --glossary "glossary.txt"` | Verwenden Sie eine Glossardatei, um eine konsistente Übersetzung bestimmter Begriffe sicherzustellen. | | `--html` | Ausgabeformat als HTML | `pdf2zh_next --gui --html` | Geben Sie den übersetzten Inhalt im HTML-Format aus. | | `--markdown` | Ausgabeformat als Markdown | `pdf2zh_next --gui --markdown` | Geben Sie den übersetzten Inhalt im Markdown-Format aus. | | `--output` | Ausgabedateipfad | `pdf2zh_next --gui --output "output.pdf"` | Geben Sie den Ausgabedateipfad an. | | `--config` | Konfigurationsdateipfad | `pdf2zh_next --gui --config "config.json"` | Verwenden Sie eine Konfigurationsdatei, um mehrere Optionen festzulegen. | | `--help` | Hilfenachricht anzeigen | `pdf2zh_next --gui --help` | Zeigen Sie die Hilfenachricht für den GUI-Befehl an. |
fr: Enable Bing and OpenAI translation services, and open the WebUI. | | ------------------------------- | ------------------------------------- | ---------------------------------------------------- | --------------------------------------------------------------- | --- ### OUTPUT | `--enabled-services` | Services de traduction activés | `pdf2zh_next --gui --enabled-services "Bing,OpenAI"` | Activez les services de traduction Bing et OpenAI, et ouvrez le WebUI. | | ------------------------------- | ------------------------------------- | ---------------------------------------------------- | --------------------------------------------------------------- |
it: Enable Bing and OpenAI translation services (default: all) | | ------------------------------- | -------------------------------------- | ---------------------------------------------------- | --------------------------------------------------------- | | `--disabled-services` | Disabled translation services | `pdf2zh_next --gui --disabled-services "Google,YiYan"` | Disable Google and YiYan translation services | --- ### LANGUAGE CODE it
pt: Enable Bing and OpenAI translation services only. | | ------------------------------- | -------------------------------------- | ---------------------------------------------------- | ------------------------------------------------- | | `--disabled-services` | Disabled translation services | `pdf2zh_next --gui --disabled-services "Google"` | Disable Google translation service only. | | `--service-priority` | Service priority | `pdf2zh_next --gui --service-priority "OpenAI:Bing"` | Set OpenAI as the first priority, then Bing. | | `--service-timeout` | Service timeout | `pdf2zh_next --gui --service-timeout 30` | Set service timeout to 30 seconds. | | `--service-retry` | Service retry count | `pdf2zh_next --gui --service-retry 3` | Retry up to 3 times if translation fails. | | `--service-fallback` | Service fallback | `pdf2zh_next --gui --service-fallback` | Enable service fallback. | | `--service-fallback-timeout` | Service fallback timeout | `pdf2zh_next --gui --service-fallback-timeout 10` | Set service fallback timeout to 10 seconds. | | `--service-fallback-retry` | Service fallback retry count | `pdf2zh_next --gui --service-fallback-retry 2` | Retry up to 2 times if fallback fails. | | `--service-fallback-priority` | Service fallback priority | `pdf2zh_next --gui --service-fallback-priority "Bing:OpenAI"` | Set Bing as the first fallback priority, then OpenAI. | | `--service-fallback-enabled` | Service fallback enabled | `pdf2zh_next --gui --service-fallback-enabled` | Enable service fallback. | | `--service-fallback-disabled` | Service fallback disabled | `pdf2zh_next --gui --service-fallback-disabled` | Disable service fallback. | | `--service-fallback-timeout` | Service fallback timeout | `pdf2zh_next --gui --service-fallback-timeout 10` | Set service fallback timeout to 10 seconds. | | `--service-fallback-retry` | Service fallback retry count | `pdf2zh_next --gui --service-fallback-retry 2` | Retry up to 2 times if fallback fails. | | `--service-fallback-priority` | Service fallback priority | `pdf2zh_next --gui --service-fallback-priority "Bing:OpenAI"` | Set Bing as the first fallback priority, then OpenAI. | | `--service-fallback-enabled` | Service fallback enabled | `pdf2zh_next --gui --service-fallback-enabled` | Enable service fallback. | | `--service-fallback-disabled` | Service fallback disabled | `pdf2zh_next --gui --service-fallback-disabled` | Disable service fallback. | --- ### TRANSLATION RESULT | `--enabled-services` | Serviços de tradução habilitados | `pdf2zh_next --gui --enabled-services "Bing,OpenAI"` | Habilita apenas os serviços de tradução Bing e OpenAI. | | ------------------------------- | -------------------------------------- | ---------------------------------------------------- | ------------------------------------------------------- | | `--disabled-services` | Serviços de tradução desabilitados | `pdf2zh_next --gui --disabled-services "Google"` | Desabilita apenas o serviço de tradução Google. | | `--service-priority` | Prioridade do serviço | `pdf2zh_next --gui --service-priority "OpenAI:Bing"` | Define OpenAI como a primeira prioridade, depois Bing. | | `--service-timeout` | Tempo limite do serviço | `pdf2zh_next --gui --service-timeout 30` | Define o tempo limite do serviço para 30 segundos. | | `--service-retry` | Contagem de tentativas do serviço | `pdf2zh_next --gui --service-retry 3` | Tenta até 3 vezes se a tradução falhar. | | `--service-fallback` | Fallback do serviço | `pdf2zh_next --gui --service-fallback` | Habilita o fallback do serviço. | | `--service-fallback-timeout` | Tempo limite do fallback do serviço | `pdf2zh_next --gui --service-fallback-timeout 10` | Define o tempo limite do fallback do serviço para 10 segundos. | | `--service-fallback-retry` | Contagem de tentativas do fallback do serviço | `pdf2zh_next --gui --service-fallback-retry 2` | Tenta até 2 vezes se o fallback falhar. | | `--service-fallback-priority` | Prioridade do fallback do serviço | `pdf2zh_next --gui --service-fallback-priority "Bing:OpenAI"` | Define Bing como a primeira prioridade de fallback, depois OpenAI. | | `--service-fallback-enabled` | Fallback do serviço habilitado | `pdf2zh_next --gui --service-fallback-enabled` | Habilita o fallback do serviço. | | `--service-fallback-disabled` | Fallback do serviço desabilitado | `pdf2zh_next --gui --service-fallback-disabled` | Desabilita o fallback do serviço. | | `--service-fallback-timeout` | Tempo limite do fallback do serviço | `pdf2zh_next --gui --service-fallback-timeout 10` | Define o tempo limite do fallback do serviço para 10 segundos. | | `--service-fallback-retry` | Contagem de tentativas do fallback do serviço | `pdf2zh_next --gui --service-fallback-retry 2` | Tenta até 2 vezes se o fallback falhar. | | `--service-fallback-priority` | Prioridade do fallback do serviço | `pdf2zh_next --gui --service-fallback-priority "Bing:OpenAI"` | Define Bing como a primeira prioridade de fallback, depois OpenAI. | | `--service-fallback-enabled` | Fallback do serviço habilitado | `pdf2zh_next --gui --service-fallback-enabled` | Habilita o fallback do serviço. | | `--service-fallback-disabled` | Fallback do serviço desabilitado | `pdf2zh_next --gui --service-fallback-disabled` | Desabilita o fallback do serviço. |
ru: `Bing,OpenAI` | | ------------------------------- | -------------------------------------- | ---------------------------------------------------- | ------------- | | `--disabled-services` | Disabled translation services | `pdf2zh_next --gui --disabled-services "Bing"` | `Bing` | | `--service-order` | Service order | `pdf2zh_next --gui --service-order "Bing,OpenAI"` | `Bing,OpenAI` | | `--custom-service-config` | Custom service config | `pdf2zh_next --gui --custom-service-config "{}"` | `{}` | | `--custom-service-config-file` | Custom service config file | `pdf2zh_next --gui --custom-service-config-file ""` | `""` | | `--custom-service-config-files` | Custom service config files | `pdf2zh_next --gui --custom-service-config-files ""` | `""` | --- ### TRANSLATION RESULT | `--enabled-services` | Включенные службы перевода | `pdf2zh_next --gui --enabled-services "Bing,OpenAI"` | `Bing,OpenAI` | | ------------------------------- | -------------------------------------- | ---------------------------------------------------- | ------------- | | `--disabled-services` | Отключенные службы перевода | `pdf2zh_next --gui --disabled-services "Bing"` | `Bing` | | `--service-order` | Порядок служб | `pdf2zh_next --gui --service-order "Bing,OpenAI"` | `Bing,OpenAI` | | `--custom-service-config` | Пользовательская конфигурация службы | `pdf2zh_next --gui --custom-service-config "{}"` | `{}` | | `--custom-service-config-file` | Файл пользовательской конфигурации службы | `pdf2zh_next --gui --custom-service-config-file ""` | `""` | | `--custom-service-config-files` | Файлы пользовательской конфигурации службы | `pdf2zh_next --gui --custom-service-config-files ""` | `""` |

# chunk_82368AEC
source: | `--disable-gui-sensitive-input` | Disable GUI sensitive input | `pdf2zh_next --gui --disable-gui-sensitive-input` |
de: | `--disable-gui-sensitive-input` | Deaktiviert die GUI-Eingabeempfindlichkeit | `pdf2zh_next --gui --disable-gui-sensitive-input` |
fr: This is a workaround when there is a conflict with the input method. | --- ### OUTPUT | `--disable-gui-sensitive-input` | Désactiver l'entrée sensible de l'interface graphique | `pdf2zh_next --gui --disable-gui-sensitive-input` | Ceci est une solution de contournement en cas de conflit avec la méthode de saisie. |
it: | :------------------------------ | :------------------------------------- | :------------------------------------------------ | | `--disable-gui-auto-translate` | Disable GUI auto translate | `pdf2zh_next --gui --disable-gui-auto-translate` | | `--disable-gui-auto-scroll` | Disable GUI auto scroll | `pdf2zh_next --gui --disable-gui-auto-scroll` | | `--disable-gui-ask-before-exit` | Disable GUI ask before exit | `pdf2zh_next --gui --disable-gui-ask-before-exit` | | `--disable-gui-ask-before-save` | Disable GUI ask before save | `pdf2zh_next --gui --disable-gui-ask-before-save` | | `--disable-gui-ask-before-load` | Disable GUI ask before load | `pdf2zh_next --gui --disable-gui-ask-before-load` | --- ### TRANSLATION RESULT | `--disable-gui-sensitive-input` | Disabilita input sensibile GUI | `pdf2zh_next --gui --disable-gui-sensitive-input` | | :------------------------------ | :---------------------------------------- | :------------------------------------------------ | | `--disable-gui-auto-translate` | Disabilita traduzione automatica GUI | `pdf2zh_next --gui --disable-gui-auto-translate` | | `--disable-gui-auto-scroll` | Disabilita scorrimento automatico GUI | `pdf2zh_next --gui --disable-gui-auto-scroll` | | `--disable-gui-ask-before-exit` | Disabilita richiesta prima di uscire GUI | `pdf2zh_next --gui --disable-gui-ask-before-exit` | | `--disable-gui-ask-before-save` | Disabilita richiesta prima di salvare GUI | `pdf2zh_next --gui --disable-gui-ask-before-save` | | `--disable-gui-ask-before-load` | Disabilita richiesta prima di caricare GUI | `pdf2zh_next --gui --disable-gui-ask-before-load` |
pt: Disable sensitive input in GUI mode, suitable for screenshots. | |---------------------------------|----------------------------------------|---------------------------------------------------|----------------------------------------------------------------| | `--disable-gui-close-warning` | Disable GUI close warning | `pdf2zh_next --gui --disable-gui-close-warning` | Disable the close warning in GUI mode. | | `--disable-gui-auto-update` | Disable GUI auto update | `pdf2zh_next --gui --disable-gui-auto-update` | Disable automatic updates in GUI mode. | | `--disable-gui-auto-check-update` | Disable GUI auto check update | `pdf2zh_next --gui --disable-gui-auto-check-update` | Disable automatic update checks in GUI mode. | --- ### OUTPUT | `--disable-gui-sensitive-input` | Desativar entrada sensível da GUI | `pdf2zh_next --gui --disable-gui-sensitive-input` | Desativa a entrada sensível no modo GUI, adequado para capturas de tela. | |---------------------------------|----------------------------------------|---------------------------------------------------|----------------------------------------------------------------| | `--disable-gui-close-warning` | Desativar aviso de fechamento da GUI | `pdf2zh_next --gui --disable-gui-close-warning` | Desativa o aviso de fechamento no modo GUI. | | `--disable-gui-auto-update` | Desativar atualização automática da GUI | `pdf2zh_next --gui --disable-gui-auto-update` | Desativa as atualizações automáticas no modo GUI. | | `--disable-gui-auto-check-update` | Desativar verificação automática de atualização da GUI | `pdf2zh_next --gui --disable-gui-auto-check-update` | Desativa as verificações automáticas de atualização no modo GUI. |
ru: | `--disable-gui-sensitive-input` | Отключить чувствительный ввод GUI | `pdf2zh_next --gui --disable-gui-sensitive-input` |

# chunk_EDCAC052
source: | `--disable-config-auto-save` | Disable automatic configuration saving | `pdf2zh_next --gui --disable-config-auto-save` |
de: |---------------------------------|----------------------------------------|-------------------------------------------------| | `--config-file <path>` | Use a custom configuration file | `pdf2zh_next --gui --config-file ./config.json` | | `--debug` | Enable debug mode | `pdf2zh_next --gui --debug` | | `--disable-gpu` | Disable GPU acceleration | `pdf2zh_next --gui --disable-gpu` | | `--disable-web-security` | Disable web security (for development) | `pdf2zh_next --gui --disable-web-security` | --- ### TRANSLATION RESULT | `--disable-config-auto-save` | Automatisches Speichern der Konfiguration deaktivieren | `pdf2zh_next --gui --disable-config-auto-save` | |---------------------------------|--------------------------------------------------------|-------------------------------------------------| | `--config-file <path>` | Benutzerdefinierte Konfigurationsdatei verwenden | `pdf2zh_next --gui --config-file ./config.json` | | `--debug` | Debug-Modus aktivieren | `pdf2zh_next --gui --debug` | | `--disable-gpu` | GPU-Beschleunigung deaktivieren | `pdf2zh_next --gui --disable-gpu` | | `--disable-web-security` | Web-Sicherheit deaktivieren (für Entwicklung) | `pdf2zh_next --gui --disable-web-security` |
fr: --- ### OUTPUT | `--disable-config-auto-save` | Désactiver la sauvegarde automatique de la configuration | `pdf2zh_next --gui --disable-config-auto-save` |
it: | --- | --- | --- | --- ### TRANSLATED TEXT | `--disable-config-auto-save` | Disabilita il salvataggio automatico della configurazione | `pdf2zh_next --gui --disable-config-auto-save` | | --- | --- | --- |
pt: |---------------------------------|----------------------------------------|-------------------------------------------------| | `--disable-config` | Disable configuration file loading | `pdf2zh_next --gui --disable-config` | --- ### OUTPUT | `--disable-config-auto-save` | Desativar salvamento automático de configuração | `pdf2zh_next --gui --disable-config-auto-save` | |---------------------------------|-------------------------------------------------|-------------------------------------------------| | `--disable-config` | Desativar carregamento do arquivo de configuração | `pdf2zh_next --gui --disable-config` |
ru: |---------------------------------|----------------------------------------|-------------------------------------------------| | `--disable-auto-start-server` | Disable auto start server | `pdf2zh_next --gui --disable-auto-start-server` | --- ### OUTPUT | `--disable-config-auto-save` | Отключить автоматическое сохранение конфигурации | `pdf2zh_next --gui --disable-config-auto-save` | |---------------------------------|--------------------------------------------------|-------------------------------------------------| | `--disable-auto-start-server` | Отключить автоматический запуск сервера | `pdf2zh_next --gui --disable-auto-start-server` |
