Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_CEDB686F
source: | `--lang-out` | Target language code | `pdf2zh_next example.pdf --lang-out zh-CN` |
de: | :------------------------------ | :-------------------------------------------------------------------------------------- | :-------------------------------------------------------------------------------------------------------------------- | | `--model` | Model to use for translation, see [Supported Models](#supported-models) | `pdf2zh_next example.pdf --model gpt-4o` | | `--service` | Translation service to use, see [Translation Services](#translation-services) | `pdf2zh_next example.pdf --service azure` | | `--api-key` | API key for the translation service | `pdf2zh_next example.pdf --service azure --api-key your_api_key_here` | | `--endpoint` | Endpoint for the translation service (if applicable) | `pdf2zh_next example.pdf --service azure --endpoint https://your-custom-endpoint.cognitiveservices.azure.com/` | | `--region` | Region for the translation service (if applicable) | `pdf2zh_next example.pdf --service azure --region eastus` | | `--proxy` | Proxy server to use for requests | `pdf2zh_next example.pdf --proxy http://your-proxy-server:port` | | `--concurrency` | Number of concurrent requests to the translation service | `pdf2zh_next example.pdf --concurrency 5` | | `--timeout` | Timeout in seconds for each translation request | `pdf2zh_next example.pdf --timeout 30` | | `--max-retries` | Maximum number of retries for failed requests | `pdf2zh_next example.pdf --max-retries 3` | | `--retry-delay` | Delay in seconds between retries | `pdf2zh_next example.pdf --retry-delay 1` | | `--ignore-size-limit` | Ignore size limit warnings and proceed with translation | `pdf2zh_next example.pdf --ignore-size-limit` | | `--output` | Output file path | `pdf2zh_next example.pdf --output ./translated_example.pdf` | | `--log-level` | Log level (debug, info, warning, error) | `pdf2zh_next example.pdf --log-level debug` | | `--help` | Show help message and exit | `pdf2zh_next --help` | --- ### TRANSLATION | `--lang-out` | Zielsprachencode | `pdf2zh_next example.pdf --lang-out zh-CN` | | :------------------------------ | :---------------------------------------------------------------------------------- | :-------------------------------------------------------------------------------------------------------------------- | | `--model` | Zu verwendendes Modell für die Übersetzung, siehe [Unterstützte Modelle](#unterstützte-modelle) | `pdf2zh_next example.pdf --model gpt-4o` | | `--service` | Zu verwendender Übersetzungsdienst, siehe [Übersetzungsdienste](#übersetzungsdienste) | `pdf2zh_next example.pdf --service azure` | | `--api-key` | API-Schlüssel für den Übersetzungsdienst | `pdf2zh_next example.pdf --service azure --api-key your_api_key_here` | | `--endpoint` | Endpunkt für den Übersetzungsdienst (falls zutreffend) | `pdf2zh_next example.pdf --service azure --endpoint https://your-custom-endpoint.cognitiveservices.azure.com/` | | `--region` | Region für den Übersetzungsdienst (falls zutreffend) | `pdf2zh_next example.pdf --service azure --region eastus` | | `--proxy` | Proxy-Server für Anfragen | `pdf2zh_next example.pdf --proxy http://your-proxy-server:port` | | `--concurrency` | Anzahl der gleichzeitigen Anfragen an den Übersetzungsdienst | `pdf2zh_next example.pdf --concurrency 5` | | `--timeout` | Timeout in Sekunden für jede Übersetzungsanfrage | `pdf2zh_next example.pdf --timeout 30` | | `--max-retries` | Maximale Anzahl der Wiederholungsversuche für fehlgeschlagene Anfragen | `pdf2zh_next example.pdf --max-retries 3` | | `--retry-delay` | Verzögerung in Sekunden zwischen Wiederholungsversuchen | `pdf2zh_next example.pdf --retry-delay 1` | | `--ignore-size-limit` | Größenbeschränkungswarnungen ignorieren und mit der Übersetzung fortfahren | `pdf2zh_next example.pdf --ignore-size-limit` | | `--output` | Ausgabedateipfad | `pdf2zh_next example.pdf --output ./translated_example.pdf` | | `--log-level` | Protokollierungsstufe (debug, info, warning, error) | `pdf2zh_next example.pdf --log-level debug` | | `--help` | Hilfenachricht anzeigen und beenden | `pdf2zh_next --help` |
fr: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--save-translated-pdf` | Save the translated PDF | `pdf2zh_next example.pdf --save-translated-pdf` | | `--save-translated-text` | Save the translated text | `pdf2zh_next example.pdf --save-translated-text` | | `--save-raw-text` | Save the raw text (without translation) | `pdf2zh_next example.pdf --save-raw-text` | | `--save-raw-json` | Save the raw JSON (without translation) | `pdf2zh_next example.pdf --save-raw-json` | | `--save-markdown` | Save the markdown text (without translation) | `pdf2zh_next example.pdf --save-markdown` | | `--save-html` | Save the HTML text (without translation) | `pdf2zh_next example.pdf --save-html` | | `--save-translated-html` | Save the translated HTML text | `pdf2zh_next example.pdf --save-translated-html` | | `--save-translated-markdown` | Save the translated markdown text | `pdf2zh_next example.pdf --save-translated-markdown` | | `--save-json` | Save the JSON text (without translation) | `pdf2zh_next example.pdf --save-json` | | `--save-translated-json` | Save the translated JSON text | `pdf2zh_next example.pdf --save-translated-json` | | `--save-pdf-json` | Save the PDF JSON (without translation) | `pdf2zh_next example.pdf --save-pdf-json` | | `--save-translated-pdf-json` | Save the translated PDF JSON | `pdf2zh_next example.pdf --save-translated-pdf-json` | | `--save-pdf-text` | Save the PDF text (without translation) | `pdf2zh_next example.pdf --save-pdf-text` | | `--save-translated-pdf-text` | Save the translated PDF text | `pdf2zh_next example.pdf --save-translated-pdf-text` | | `--save-pdf-html` | Save the PDF HTML (without translation) | `pdf2zh_next example.pdf --save-pdf-html` | | `--save-translated-pdf-html` | Save the translated PDF HTML | `pdf2zh_next example.pdf --save-translated-pdf-html` | | `--save-pdf-markdown` | Save the PDF markdown (without translation) | `pdf2zh_next example.pdf --save-pdf-markdown` | | `--save-translated-pdf-markdown`| Save the translated PDF markdown | `pdf2zh_next example.pdf --save-translated-pdf-markdown` | | `--save-pdf-json-raw` | Save the PDF JSON raw (without translation) | `pdf2zh_next example.pdf --save-pdf-json-raw` | | `--save-translated-pdf-json-raw`| Save the translated PDF JSON raw | `pdf2zh_next example.pdf --save-translated-pdf-json-raw` | | `--save-pdf-text-raw` | Save the PDF text raw (without translation) | `pdf2zh_next example.pdf --save-pdf-text-raw` | | `--save-translated-pdf-text-raw`| Save the translated PDF text raw | `pdf2zh_next example.pdf --save-translated-pdf-text-raw` | | `--save-pdf-html-raw` | Save the PDF HTML raw (without translation) | `pdf2zh_next example.pdf --save-pdf-html-raw` | | `--save-translated-pdf-html-raw`| Save the translated PDF HTML raw | `pdf2zh_next example.pdf --save-translated-pdf-html-raw` | | `--save-pdf-markdown-raw` | Save the PDF markdown raw (without translation) | `pdf2zh_next example.pdf --save-pdf-markdown-raw` | | `--save-translated-pdf-markdown-raw`| Save the translated PDF markdown raw | `pdf2zh_next example.pdf --save-translated-pdf-markdown-raw` | | `--save-pdf-json-raw-translated`| Save the PDF JSON raw translated | `pdf2zh_next example.pdf --save-pdf-json-raw-translated` | | `--save-pdf-text-raw-translated`| Save the PDF text raw translated | `pdf2zh_next example.pdf --save-pdf-text-raw-translated` | | `--save-pdf-html-raw-translated`| Save the PDF HTML raw translated | `pdf2zh_next example.pdf --save-pdf-html-raw-translated` | | `--save-pdf-markdown-raw-translated`| Save the PDF markdown raw translated | `pdf2zh_next example.pdf --save-pdf-markdown-raw-translated` | | `--save-pdf-json-translated` | Save the PDF JSON translated | `pdf2zh_next example.pdf --save-pdf-json-translated` | | `--save-pdf-text-translated` | Save the PDF text translated | `pdf2zh_next example.pdf --save-pdf-text-translated` | | `--save-pdf-html-translated` | Save the PDF HTML translated | `pdf2zh_next example.pdf --save-pdf-html-translated` | | `--save-pdf-markdown-translated`| Save the PDF markdown translated | `pdf2zh_next example.pdf --save-pdf-markdown-translated` | | `--save-pdf-json-raw-translated`| Save the PDF JSON raw translated | `pdf2zh_next example.pdf --save-pdf-json-raw-translated` | | `--save-pdf-text-raw-translated`| Save the PDF text raw translated | `pdf2zh_next example.pdf --save-pdf-text-raw-translated` | | `--save-pdf-html-raw-translated`| Save the PDF HTML raw translated | `pdf2zh_next example.pdf --save-pdf-html-raw-translated` | | `--save-pdf-markdown-raw-translated`| Save the PDF markdown raw translated | `pdf2zh_next example.pdf --save-pdf-markdown-raw-translated` | --- ### TRANSLATION RESULT | `--lang-out` | Code de langue cible | `pdf2zh_next example.pdf --lang-out zh-CN` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--save-translated-pdf` | Enregistrer le PDF traduit | `pdf2zh_next example.pdf --save-translated-pdf` | | `--save-translated-text` | Enregistrer le texte traduit | `pdf2zh_next example.pdf --save-translated-text` | | `--save-raw-text` | Enregistrer le texte brut (sans traduction) | `pdf2zh_next example.pdf --save-raw-text` | | `--save-raw-json` | Enregistrer le JSON brut (sans traduction) | `pdf2zh_next example.pdf --save-raw-json` | | `--save-markdown` | Enregistrer le texte markdown (sans traduction) | `pdf2zh_next example.pdf --save-markdown` | | `--save-html` | Enregistrer le texte HTML (sans traduction) | `pdf2zh_next example.pdf --save-html` | | `--save-translated-html` | Enregistrer le texte HTML traduit | `pdf2zh_next example.pdf --save-translated-html` | | `--save-translated-markdown` | Enregistrer le texte markdown traduit | `pdf2zh_next example.pdf --save-translated-markdown` | | `--save-json` | Enregistrer le texte JSON (sans traduction) | `pdf2zh_next example.pdf --save-json` | | `--save-translated-json` | Enregistrer le texte JSON traduit | `pdf2zh_next example.pdf --save-translated-json` | | `--save-pdf-json` | Enregistrer le JSON PDF (sans traduction) | `pdf2zh_next example.pdf --save-pdf-json` | | `--save-translated-pdf-json` | Enregistrer le JSON PDF traduit | `pdf2zh_next example.pdf --save-translated-pdf-json` | | `--save-pdf-text` | Enregistrer le texte PDF (sans traduction) | `pdf2zh_next example.pdf --save-pdf-text` | | `--save-translated-pdf-text` | Enregistrer le texte PDF traduit | `pdf2zh_next example.pdf --save-translated-pdf-text` | | `--save-pdf-html` | Enregistrer le HTML PDF (sans traduction) | `pdf2zh_next example.pdf --save-pdf-html` | | `--save-translated-pdf-html` | Enregistrer le HTML PDF traduit | `pdf2zh_next example.pdf --save-translated-pdf-html` | | `--save-pdf-markdown` | Enregistrer le markdown PDF (sans traduction) | `pdf2zh_next example.pdf --save-pdf-markdown` | | `--save-translated-pdf-markdown`| Enregistrer le markdown PDF traduit | `pdf2zh_next example.pdf --save-translated-pdf-markdown` | | `--save-pdf-json-raw` | Enregistrer le JSON brut PDF (sans traduction) | `pdf2zh_next example.pdf --save-pdf-json-raw` | | `--save-translated-pdf-json-raw`| Enregistrer le JSON brut PDF traduit | `pdf2zh_next example.pdf --save-translated-pdf-json-raw` | | `--save-pdf-text-raw` | Enregistrer le texte brut PDF (sans traduction) | `pdf2zh_next example.pdf --save-pdf-text-raw` | | `--save-translated-pdf-text-raw`| Enregistrer le texte brut PDF traduit | `pdf2zh_next example.pdf --save-translated-pdf-text-raw` | | `--save-pdf-html-raw` | Enregistrer le HTML brut PDF (sans traduction) | `pdf2zh_next example.pdf --save-pdf-html-raw` | | `--save-translated-pdf-html-raw`| Enregistrer le HTML brut PDF traduit | `pdf2zh_next example.pdf --save-translated-pdf-html-raw` | | `--save-pdf-markdown-raw` | Enregistrer le markdown brut PDF (sans traduction) | `pdf2zh_next example.pdf --save-pdf-markdown-raw` | | `--save-translated-pdf-markdown-raw`| Enregistrer le markdown brut PDF traduit | `pdf2zh_next example.pdf --save-translated-pdf-markdown-raw` | | `--save-pdf-json-raw-translated`| Enregistrer le JSON brut PDF traduit | `pdf2zh_next example.pdf --save-pdf-json-raw-translated` | | `--save-pdf-text-raw-translated`| Enregistrer le texte brut PDF traduit | `pdf2zh_next example.pdf --save-pdf-text-raw-translated` | | `--save-pdf-html-raw-translated`| Enregistrer le HTML brut PDF traduit | `pdf2zh_next example.pdf --save-pdf-html-raw-translated` | | `--save-pdf-markdown-raw-translated`| Enregistrer le markdown brut PDF traduit | `pdf2zh_next example.pdf --save-pdf-markdown-raw-translated` | | `--save-pdf-json-translated` | Enregistrer le JSON PDF traduit | `pdf2zh_next example.pdf --save-pdf-json-translated` | | `--save-pdf-text-translated` | Enregistrer le texte PDF traduit | `pdf2zh_next example.pdf --save-pdf-text-translated` | | `--save-pdf-html-translated` | Enregistrer le HTML PDF traduit | `pdf2zh_next example.pdf --save-pdf-html-translated` | | `--save-pdf-markdown-translated`| Enregistrer le markdown PDF traduit | `pdf2zh_next example.pdf --save-pdf-markdown-translated` | | `--save-pdf-json-raw-translated`| Enregistrer le JSON brut PDF traduit | `pdf2zh_next example.pdf --save-pdf-json-raw-translated` | | `--save-pdf-text-raw-translated`| Enregistrer le texte brut PDF traduit | `pdf2zh_next example.pdf --save-pdf-text-raw-translated` | | `--save-pdf-html-raw-translated`| Enregistrer le HTML brut PDF traduit | `pdf2zh_next example.pdf --save-pdf-html-raw-translated` | | `--save-pdf-markdown-raw-translated`| Enregistrer le markdown brut PDF traduit | `pdf2zh_next example.pdf --save-pdf-markdown-raw-translated` |
it: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--ocr` | Enable OCR for document processing | `pdf2zh_next example.pdf --ocr` | | `--ocr-lang` | Language for OCR, defaults to `en` | `pdf2zh_next example.pdf --ocr --ocr-lang ja` | | `--max-workers` | Maximum number of worker processes for OCR, defaults to `4` | `pdf2zh_next example.pdf --ocr --max-workers 8` | | `--max-sub-workers` | Maximum number of sub-worker processes for OCR, defaults to `2` | `pdf2zh_next example.pdf --ocr --max-sub-workers 4` | | `--ocr-timeout` | Timeout for OCR in seconds, defaults to `600` | `pdf2zh_next example.pdf --ocr --ocr-timeout 1200` | | `--ocr-max-retries` | Maximum retries for OCR, defaults to `3` | `pdf2zh_next example.pdf --ocr --ocr-max-retries 5` | | `--model` | Model for translation, defaults to `gpt-3.5-turbo` | `pdf2zh_next example.pdf --model gpt-4` | | `--api-key` | API key for translation service | `pdf2zh_next example.pdf --api-key YOUR_API_KEY` | | `--api-base` | API base URL for translation service, defaults to OpenAI's official API | `pdf2zh_next example.pdf --api-base https://api.openai.com/v1` | | `--prompt` | Custom prompt for translation | `pdf2zh_next example.pdf --prompt "Please translate the following text into {lang_out}."` | | `--batch-size` | Batch size for translation, defaults to `1000` | `pdf2zh_next example.pdf --batch-size 500` | | `--max-workers-translation` | Maximum number of worker processes for translation, defaults to `4` | `pdf2zh_next example.pdf --max-workers-translation 8` | | `--timeout` | Timeout for translation in seconds, defaults to `60` | `pdf2zh_next example.pdf --timeout 120` | | `--max-retries` | Maximum retries for translation, defaults to `3` | `pdf2zh_next example.pdf --max-retries 5` | | `--output` | Output file path | `pdf2zh_next example.pdf --output ./output.pdf` | | `--output-type` | Output type, can be `pdf` or `text`, defaults to `pdf` | `pdf2zh_next example.pdf --output-type text` | | `--pages` | Page range to process, e.g., `1-3,5,7-9` | `pdf2zh_next example.pdf --pages 1-3,5,7-9` | | `--ignore-size` | Ignore text smaller than this size (in pt), defaults to `6` | `pdf2zh_next example.pdf --ignore-size 8` | | `--ignore-fonts` | Ignore text with these fonts, comma-separated | `pdf2zh_next example.pdf --ignore-fonts "Font1,Font2"` | | `--ignore-text` | Ignore text matching these patterns, comma-separated | `pdf2zh_next example.pdf --ignore-text "pattern1,pattern2"` | | `--ignore-area` | Ignore areas within these coordinates, format: `x0,y0,x1,y1`, comma-separated | `pdf2zh_next example.pdf --ignore-area "0,0,100,100,200,200,300,300"` | | `--resize` | Resize text to fit original bounding box, defaults to `true` | `pdf2zh_next example.pdf --resize false` | | `--font-size` | Font size for translated text, use original size if not set | `pdf2zh_next example.pdf --font-size 12` | | `--font` | Font for translated text, use original font if not set | `pdf2zh_next example.pdf --font "Noto Sans SC"` | | `--line-spacing` | Line spacing for translated text, use original spacing if not set | `pdf2zh_next example.pdf --line-spacing 1.5` | | `--color` | Color for translated text, use original color if not set | `pdf2zh_next example.pdf --color "#FF0000"` | | `--highlight` | Highlight color for translated text, no highlight if not set | `pdf2zh_next example.pdf --highlight "#FFFF00"` | | `--highlight-opacity` | Opacity for highlight, defaults to `0.5` | `pdf2zh_next example.pdf --highlight-opacity 0.3` | | `--border` | Border color for translated text, no border if not set | `pdf2zh_next example.pdf --border "#0000FF"` | | `--border-width` | Border width for translated text, defaults to `1` | `pdf2zh_next example.pdf --border-width 2` | | `--border-opacity` | Opacity for border, defaults to `1` | `pdf2zh_next example.pdf --border-opacity 0.5` | | `--background` | Background color for translated text, no background if not set | `pdf2zh_next example.pdf --background "#00FF00"` | | `--background-opacity` | Opacity for background, defaults to `1` | `pdf2zh_next example.pdf --background-opacity 0.5` | | `--debug` | Enable debug mode | `pdf2zh_next example.pdf --debug` | | `--version` | Show version information | `pdf2zh_next --version` | | `--help` | Show help message | `pdf2zh_next --help` | --- ### TRANSLATION RESULT | `--lang-out` | Codice lingua di destinazione | `pdf2zh_next example.pdf --lang-out zh-CN` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--ocr` | Abilita OCR per l'elaborazione del documento | `pdf2zh_next example.pdf --ocr` | | `--ocr-lang` | Lingua per OCR, predefinita a `en` | `pdf2zh_next example.pdf --ocr --ocr-lang ja` | | `--max-workers` | Numero massimo di processi worker per OCR, predefinito a `4` | `pdf2zh_next example.pdf --ocr --max-workers 8` | | `--max-sub-workers` | Numero massimo di processi sub-worker per OCR, predefinito a `2` | `pdf2zh_next example.pdf --ocr --max-sub-workers 4` | | `--ocr-timeout` | Timeout per OCR in secondi, predefinito a `600` | `pdf2zh_next example.pdf --ocr --ocr-timeout 1200` | | `--ocr-max-retries` | Tentativi massimi per OCR, predefiniti a `3` | `pdf2zh_next example.pdf --ocr --ocr-max-retries 5` | | `--model` | Modello per la traduzione, predefinito a `gpt-3.5-turbo` | `pdf2zh_next example.pdf --model gpt-4` | | `--api-key` | Chiave API per il servizio di traduzione | `pdf2zh_next example.pdf --api-key YOUR_API_KEY` | | `--api-base` | URL base API per il servizio di traduzione, predefinito all'API ufficiale di OpenAI | `pdf2zh_next example.pdf --api-base https://api.openai.com/v1` | | `--prompt` | Prompt personalizzato per la traduzione | `pdf2zh_next example.pdf --prompt "Please translate the following text into {lang_out}."` | | `--batch-size` | Dimensione del batch per la traduzione, predefinita a `1000` | `pdf2zh_next example.pdf --batch-size 500` | | `--max-workers-translation` | Numero massimo di processi worker per la traduzione, predefinito a `4` | `pdf2zh_next example.pdf --max-workers-translation 8` | | `--timeout` | Timeout per la traduzione in secondi, predefinito a `60` | `pdf2zh_next example.pdf --timeout 120` | | `--max-retries` | Tentativi massimi per la traduzione, predefiniti a `3` | `pdf2zh_next example.pdf --max-retries 5` | | `--output` | Percorso del file di output | `pdf2zh_next example.pdf --output ./output.pdf` | | `--output-type` | Tipo di output, può essere `pdf` o `text`, predefinito a `pdf` | `pdf2zh_next example.pdf --output-type text` | | `--pages` | Intervallo di pagine da elaborare, ad es. `1-3,5,7-9` | `pdf2zh_next example.pdf --pages 1-3,5,7-9` | | `--ignore-size` | Ignora il testo più piccolo di questa dimensione (in pt), predefinito a `6` | `pdf2zh_next example.pdf --ignore-size 8` | | `--ignore-fonts` | Ignora il testo con questi font, separati da virgola | `pdf2zh_next example.pdf --ignore-fonts "Font1,Font2"` | | `--ignore-text` | Ignora il testo che corrisponde a questi pattern, separati da virgola | `pdf2zh_next example.pdf --ignore-text "pattern1,pattern2"` | | `--ignore-area` | Ignora le aree all'interno di queste coordinate, formato: `x0,y0,x1,y1`, separati da virgola | `pdf2zh_next example.pdf --ignore-area "0,0,100,100,200,200,300,300"` | | `--resize` | Ridimensiona il testo per adattarlo al riquadro originale, predefinito a `true` | `pdf2zh_next example.pdf --resize false` | | `--font-size` | Dimensione del font per il testo tradotto, utilizza la dimensione originale se non impostata | `pdf2zh_next example.pdf --font-size 12` | | `--font` | Font per il testo tradotto, utilizza il font originale se non impostato | `pdf2zh_next example.pdf --font "Noto Sans SC"` | | `--line-spacing` | Interlinea per il testo tradotto, utilizza l'interlinea originale se non impostata | `pdf2zh_next example.pdf --line-spacing 1.5` | | `--color` | Colore per il testo tradotto, utilizza il colore originale se non impostato | `pdf2zh_next example.pdf --color "#FF0000"` | | `--highlight` | Colore di evidenziazione per il testo tradotto, nessuna evidenziazione se non impostato | `pdf2zh_next example.pdf --highlight "#FFFF00"` | | `--highlight-opacity` | Opacità per l'evidenziazione, predefinita a `0.5` | `pdf2zh_next example.pdf --highlight-opacity 0.3` | | `--border` | Colore del bordo per il testo tradotto, nessun bordo se non impostato | `pdf2zh_next example.pdf --border "#0000FF"` | | `--border-width` | Larghezza del bordo per il testo tradotto, predefinita a `1` | `pdf2zh_next example.pdf --border-width 2` | | `--border-opacity` | Opacità per il bordo, predefinita a `1` | `pdf2zh_next example.pdf --border-opacity 0.5` | | `--background` | Colore di sfondo per il testo tradotto, nessuno sfondo se non impostato | `pdf2zh_next example.pdf --background "#00FF00"` | | `--background-opacity` | Opacità per lo sfondo, predefinita a `1` | `pdf2zh_next example.pdf --background-opacity 0.5` | | `--debug` | Abilita la modalità di debug | `pdf2zh_next example.pdf --debug` | | `--version` | Mostra le informazioni sulla versione | `pdf2zh_next --version` | | `--help` | Mostra il messaggio di aiuto | `pdf2zh_next --help` |
pt: | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--lang-in` | Source language code | `pdf2zh_next example.pdf --lang-in en` | | `--translator` | Translation service name | `pdf2zh_next example.pdf --translator google` | | `--api-key` | API key for the translation service | `pdf2zh_next example.pdf --translator openai --api-key YOUR_API_KEY` | | `--model` | Model name for the translation service | `pdf2zh_next example.pdf --translator openai --model gpt-4` | | `--proxy` | Proxy server address | `pdf2zh_next example.pdf --proxy http://127.0.0.1:7890` | | `--concurrent` | Number of concurrent translation requests | `pdf2zh_next example.pdf --concurrent 10` | | `--retry` | Number of retries for failed translation requests | `pdf2zh_next example.pdf --retry 3` | | `--timeout` | Timeout for each translation request (seconds) | `pdf2zh_next example.pdf --timeout 30` | | `--output` | Output file path | `pdf2zh_next example.pdf --output ./translated.pdf` | | `--force` | Overwrite existing output file without confirmation | `pdf2zh_next example.pdf --output ./translated.pdf --force` | | `--no-backup` | Skip backup of the original file | `pdf2zh_next example.pdf --no-backup` | | `--ignore-size` | Ignore file size warning | `pdf2zh_next example.pdf --ignore-size` | | `--ignore-errors` | Continue translation even if some pages fail | `pdf2zh_next example.pdf --ignore-errors` | | `--ignore-glossary` | Ignore glossary file | `pdf2zh_next example.pdf --ignore-glossary` | | `--glossary` | Path to glossary file | `pdf2zh_next example.pdf --glossary ./glossary.txt` | | `--save-config` | Save current configuration to a file | `pdf2zh_next example.pdf --save-config ./config.json` | | `--load-config` | Load configuration from a file | `pdf2zh_next example.pdf --load-config ./config.json` | | `--list-translators` | List available translation services | `pdf2zh_next --list-translators` | | `--list-languages` | List supported languages for a translation service | `pdf2zh_next --list-languages --translator google` | | `--version` | Show version information | `pdf2zh_next --version` | | `--help` | Show help message | `pdf2zh_next --help` | --- ### TRANSLATION RESULT | `--lang-out` | Código do idioma de destino | `pdf2zh_next example.pdf --lang-out zh-CN` | | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--lang-in` | Código do idioma de origem | `pdf2zh_next example.pdf --lang-in en` | | `--translator` | Nome do serviço de tradução | `pdf2zh_next example.pdf --translator google` | | `--api-key` | Chave de API para o serviço de tradução | `pdf2zh_next example.pdf --translator openai --api-key YOUR_API_KEY` | | `--model` | Nome do modelo para o serviço de tradução | `pdf2zh_next example.pdf --translator openai --model gpt-4` | | `--proxy` | Endereço do servidor proxy | `pdf2zh_next example.pdf --proxy http://127.0.0.1:7890` | | `--concurrent` | Número de solicitações de tradução simultâneas | `pdf2zh_next example.pdf --concurrent 10` | | `--retry` | Número de tentativas para solicitações de tradução com falha | `pdf2zh_next example.pdf --retry 3` | | `--timeout` | Tempo limite para cada solicitação de tradução (segundos) | `pdf2zh_next example.pdf --timeout 30` | | `--output` | Caminho do arquivo de saída | `pdf2zh_next example.pdf --output ./translated.pdf` | | `--force` | Sobrescrever arquivo de saída existente sem confirmação | `pdf2zh_next example.pdf --output ./translated.pdf --force` | | `--no-backup` | Ignorar backup do arquivo original | `pdf2zh_next example.pdf --no-backup` | | `--ignore-size` | Ignorar aviso de tamanho do arquivo | `pdf2zh_next example.pdf --ignore-size` | | `--ignore-errors` | Continuar a tradução mesmo que algumas páginas falhem | `pdf2zh_next example.pdf --ignore-errors` | | `--ignore-glossary` | Ignorar arquivo de glossário | `pdf2zh_next example.pdf --ignore-glossary` | | `--glossary` | Caminho para o arquivo de glossário | `pdf2zh_next example.pdf --glossary ./glossary.txt` | | `--save-config` | Salvar configuração atual em um arquivo | `pdf2zh_next example.pdf --save-config ./config.json` | | `--load-config` | Carregar configuração de um arquivo | `pdf2zh_next example.pdf --load-config ./config.json` | | `--list-translators` | Listar serviços de tradução disponíveis | `pdf2zh_next --list-translators` | | `--list-languages` | Listar idiomas suportados para um serviço de tradução | `pdf2zh_next --list-languages --translator google` | | `--version` | Mostrar informações de versão | `pdf2zh_next --version` | | `--help` | Mostrar mensagem de ajuda | `pdf2zh_next --help` |
ru: [Language Code](https://pdf2zh-next.com/getting-started/LANGUAGE_CODE.html) | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | -------------------------------------------------------------------------- | | `--lang-in` | Source language code | `pdf2zh_next example.pdf --lang-in en` | [Language Code](https://pdf2zh-next.com/getting-started/LANGUAGE_CODE.html) | | `--translator` | Translation service | `pdf2zh_next example.pdf --translator google` | [Translator](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-key` | API Key for the translation service | `pdf2zh_next example.pdf --translator deepl --translator-key YOUR_DEEPL_KEY` | [Translator](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-url` | Custom endpoint for the translation service | `pdf2zh_next example.pdf --translator azure --translator-url "https://api.cognitive.microsofttranslator.com/"` | [Translator](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-region` | Region for the translation service | `pdf2zh_next example.pdf --translator azure --translator-region "global"` | [Translator](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-model` | Model for the translation service | `pdf2zh_next example.pdf --translator openai --translator-model "gpt-4o"` | [Translator](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-version` | Version for the translation service | `pdf2zh_next example.pdf --translator azure --translator-version "3.0"` | [Translator](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-extra-params` | Extra parameters for the translation service (JSON format) | `pdf2zh_next example.pdf --translator google --translator-extra-params '{"glossary": "projects/..."}'` | [Translator](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-extra-headers` | Extra headers for the translation service (JSON format) | `pdf2zh_next example.pdf --translator azure --translator-extra-headers '{"Ocp-Apim-Subscription-Key": "YOUR_KEY"}'` | [Translator](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-path` | Path for the translation service | `pdf2zh_next example.pdf --translator azure --translator-path "/translate"` | [Translator](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-retry` | Number of retries for the translation service | `pdf2zh_next example.pdf --translator google --translator-retry 5` | [Translator](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-timeout` | Timeout for the translation service (seconds) | `pdf2zh_next example.pdf --translator google --translator-timeout 30` | [Translator](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-concurrency-limit`| Concurrency limit for the translation service | `pdf2zh_next example.pdf --translator google --translator-concurrency-limit 10` | [Translator](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-request-interval` | Request interval for the translation service (milliseconds) | `pdf2zh_next example.pdf --translator google --translator-request-interval 1000` | [Translator](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-request-timeout` | Request timeout for the translation service (milliseconds) | `pdf2zh_next example.pdf --translator google --translator-request-timeout 5000` | [Translator](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-request-retry` | Request retry for the translation service | `pdf2zh_next example.pdf --translator google --translator-request-retry 3` | [Translator](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-request-retry-interval` | Request retry interval for the translation service (milliseconds) | `pdf2zh_next example.pdf --translator google --translator-request-retry-interval 1000` | [Translator](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-request-retry-timeout` | Request retry timeout for the translation service (milliseconds) | `pdf2zh_next example.pdf --translator google --translator-request-retry-timeout 5000` | [Translator](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-request-retry-max`| Request retry max for the translation service | `pdf2zh_next example.pdf --translator google --translator-request-retry-max 5` | [Translator](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-request-retry-backoff-factor` | Request retry backoff factor for the translation service | `pdf2zh_next example.pdf --translator google --translator-request-retry-backoff-factor 2` | [Translator](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-request-retry-backoff-max` | Request retry backoff max for the translation service (milliseconds) | `pdf2zh_next example.pdf --translator google --translator-request-retry-backoff-max 10000` | [Translator](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-request-retry-backoff-jitter` | Request retry backoff jitter for the translation service | `pdf2zh_next example.pdf --translator google --translator-request-retry-backoff-jitter 0.1` | [Translator](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-request-retry-backoff-jitter-max` | Request retry backoff jitter max for the translation service (milliseconds) | `pdf2zh_next example.pdf --translator google --translator-request-retry-backoff-jitter-max 1000` | [Translator](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | --- ### TRANSLATION RESULT | `--lang-out` | Код языка назначения | `pdf2zh_next example.pdf --lang-out zh-CN` | [Код языка](https://pdf2zh-next.com/getting-started/LANGUAGE_CODE.html) | | ------------------------------- | ---------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | -------------------------------------------------------------------------- | | `--lang-in` | Код исходного языка | `pdf2zh_next example.pdf --lang-in en` | [Код языка](https://pdf2zh-next.com/getting-started/LANGUAGE_CODE.html) | | `--translator` | Сервис перевода | `pdf2zh_next example.pdf --translator google` | [Переводчик](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-key` | API-ключ для сервиса перевода | `pdf2zh_next example.pdf --translator deepl --translator-key YOUR_DEEPL_KEY` | [Переводчик](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-url` | Пользовательская конечная точка для сервиса перевода | `pdf2zh_next example.pdf --translator azure --translator-url "https://api.cognitive.microsofttranslator.com/"` | [Переводчик](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-region` | Регион для сервиса перевода | `pdf2zh_next example.pdf --translator azure --translator-region "global"` | [Переводчик](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-model` | Модель для сервиса перевода | `pdf2zh_next example.pdf --translator openai --translator-model "gpt-4o"` | [Переводчик](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-version` | Версия для сервиса перевода | `pdf2zh_next example.pdf --translator azure --translator-version "3.0"` | [Переводчик](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-extra-params` | Дополнительные параметры для сервиса перевода (формат JSON) | `pdf2zh_next example.pdf --translator google --translator-extra-params '{"glossary": "projects/..."}'` | [Переводчик](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-extra-headers` | Дополнительные заголовки для сервиса перевода (формат JSON) | `pdf2zh_next example.pdf --translator azure --translator-extra-headers '{"Ocp-Apim-Subscription-Key": "YOUR_KEY"}'` | [Переводчик](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-path` | Путь для сервиса перевода | `pdf 极 2zh_next example.pdf --translator azure --translator-path "/translate"` | [Переводчик](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-retry` | Количество повторных попыток для сервиса перевода | `pdf2zh_next example.pdf --transl 极 ator google --translator-retry 5` | [Переводчик](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-timeout` | Таймаут для сервиса перевода (секунды) | `pdf2zh_next example.pdf --translator google --translator-timeout 30` | [Переводчик](https://pdf2zh 极-next.com/getting-started/TRANSLATOR.html) | | `--translator-concurrency-limit`| Лимит параллелизма для сервиса перевода | `pdf2zh_next example.pdf --translator google --translator-concurrency-limit 10` | [Переводчик](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-request-interval` | Интервал запросов для сервиса перевода (миллисекунды) | `pdf2zh_next example.pdf --translator google --translator-request-interval 1000` | [Переводчик](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-request-timeout` | Таймаут запроса для сервиса перевода (миллисекунды) | `pdf2zh_next example.pdf --translator google --translator-request-timeout 500 极 0` | [Переводчик](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-request-retry` | Повторная попытка запроса для сервиса перевода | `pdf2zh_next example.pdf --translator google --translator-request-retry 3` | [Переводчик](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-request-retry-interval` | Интервал повторных попыток запроса для сервиса перевода (миллисекунды) | `pdf2zh_next example.pdf --translator google --translator-request-retry-interval 1000` | [Переводчик](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-request-retry-timeout` | Таймаут повторных попыток запроса для сервиса перевода (миллисекунды) | `pdf2zh_next example.pdf --translator google --translator-request-retry-timeout 5000` | [Переводчик](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-request-retry-max`| Максимальное количество повторных попыток запроса для сервиса перевода | `pdf2zh_next example.pdf --translator google --translator-request-retry-max 5` | [Переводчик](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-request-retry-backoff-factor` | Фактор экспоненциального отката повторных попыток запроса для сервиса перевода | `pdf2zh_next example.pdf --translator google --translator-request-retry-backoff-factor 2` | [Переводчик](https://pdf2zh-next.com/getting-started/极 TRANSLATOR.html) | | `--translator-request-retry-backoff-max` | Максимальное значение экспоненциального отката повторных попыток запроса для сервиса перевода (миллисекунды) | `pdf2zh_next example.pdf --translator google --translator-request-retry-backoff-max 10000` | [Переводчик](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-request-retry-backoff-jitter` | Джиттер экспоненциального отката повторных попыток запроса для сервиса перевода | `pdf2zh_next example.pdf --translator google --translator-request-retry-backoff-jitter 0.1` | [Переводчик](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) | | `--translator-request-retry-backoff-jitter-max` | Максимальный джиттер экспоненциального отката повторных попыток запроса для сервиса перевода (миллисекунды) | `pdf2zh_next example.pdf --translator google --translator-request-retry-backoff-jitter-max 1000` | [Переводчик](https://pdf2zh-next.com/getting-started/TRANSLATOR.html) |
