Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_0CAD1479
source: 1. [**Windows EXE**](./INSTALLATION_winexe.md) <small>Recommand for Windows</small> 2. [**Docker**](./INSTALLATION_docker.md) <small>Recommand for Linux</small> 3. [**uv** (a Python package manager)](./INSTALLATION_uv.md) <small>Recommand for macOS</small>
de: 1. [**Windows EXE**](./INSTALLATION_winexe.md) <small>Empfohlen für Windows</small> 2. [**Docker**](./INSTALLATION_docker.md) <small>Empfohlen für Linux</small> 3. [**uv** (ein Python-Paketmanager)](./INSTALLATION_uv.md) <small>Empfohlen für macOS</small>
fr: 1. [**Windows EXE**](./INSTALLATION_winexe.md) <small>Recommandé pour Windows</small> 2. [**Docker**](./INSTALLATION_docker.md) <small>Recommandé pour Linux</small> 3. [**uv** (un gestionnaire de paquets Python)](./INSTALLATION_uv.md) <small>Recommandé pour macOS</small>
it: 1. [**Windows EXE**](./INSTALLATION_winexe.md) <small>Consigliato per Windows</small> 2. [**Docker**](./INSTALLATION_docker.md) <small>Consigliato per Linux</small> 3. [**uv** (un gestore di pacchetti Python)](./INSTALLATION_uv.md) <small>Consigliato per macOS</small>
pt: 1. [**Windows EXE**](./INSTALLATION_winexe.md) <small>Recomendado para Windows</small> 2. [**Docker**](./INSTALLATION_docker.md) <small>Recomendado para Linux</small> 3. [**uv** (um gerenciador de pacotes Python)](./INSTALLATION_uv.md) <small>Recomendado para macOS</small>
ru: 1. [**Windows EXE**](./INSTALLATION_winexe.md) <small>Рекомендуется для Windows</small> 2. [**Docker**](./INSTALLATION_docker.md) <small>Рекомендуется для Linux</small> 3. [**uv** (менеджер пакетов Python)](./INSTALLATION_uv.md) <small>Рекомендуется для macOS</small>

# chunk_3E32AB82
source: 1. [Using **WebUI**](./USAGE_webui.md) 2. [Using **Zotero Plugin**](https://github.com/guaguastandup/zotero-pdf2zh) (Third party program) 3. [Using **Commandline**](./USAGE_commandline.md)
de: 1. [Verwendung von **WebUI**](./USAGE_webui.md) 2. [Verwendung von **Zotero Plugin**](https://github.com/guaguastandup/zotero-pdf2zh) (Drittanbieterprogramm) 3. [Verwendung von **Kommandozeile**](./USAGE_commandline.md)
fr: 1. [Utilisation de **WebUI**](./USAGE_webui.md) 2. [Utilisation du **Plugin Zotero**](https://github.com/guaguastandup/zotero-pdf2zh) (Programme tiers) 3. [Utilisation de la **Ligne de commande**](./USAGE_commandline.md)
it: 1. [Utilizzo di **WebUI**](./USAGE_webui.md) 2. [Utilizzo di **Zotero Plugin**](https://github.com/guaguastandup/zotero-pdf2zh) (Programma di terze parti) 3. [Utilizzo di **Commandline**](./USAGE_commandline.md)
pt: 1. [Usando **WebUI**](./USAGE_webui.md) 2. [Usando **Plugin do Zotero**](https://github.com/guaguastandup/zotero-pdf2zh) (Programa de terceiros) 3. [Usando **Linha de comando**](./USAGE_commandline.md)
ru: 1. [Использование **WebUI**](./USAGE_webui.md) 2. [Использование **Zotero Plugin**](https://github.com/guaguastandup/zotero-pdf2zh) (Сторонняя программа) 3. [Использование **Commandline**](./USAGE_commandline.md)

# chunk_C7A7730D
source: > [!NOTE] > Please [click here](https://funstory-ai.github.io/BabelDOC/supported_languages/) to navigate to the *BabelDOC Supported Language* page. The information there also applies to pdf2zh.
de: > [!NOTE] > Bitte [klicken Sie hier](https://funstory-ai.github.io/BabelDOC/supported_languages/), um zur Seite *BabelDOC Unterstützte Sprachen* zu navigieren. Die dortigen Informationen gelten auch für pdf2zh.
fr: > [!NOTE] > Veuillez [cliquer ici](https://funstory-ai.github.io/BabelDOC/supported_languages/) pour accéder à la page *Langues supportées par BabelDOC*. Les informations présentes s'appliquent également à pdf2zh.
it: > [!NOTE] > Si prega di [cliccare qui](https://funstory-ai.github.io/BabelDOC/supported_languages/) per navigare alla pagina *BabelDOC Supported Language*. Le informazioni presenti si applicano anche a pdf2zh.
pt: > [!NOTE] > Por favor, [clique aqui](https://funstory-ai.github.io/BabelDOC/supported_languages/) para navegar até a página *BabelDOC Supported Language*. As informações lá também se aplicam ao pdf2zh.
ru: > [!NOTE] > Пожалуйста, [нажмите здесь](https://funstory-ai.github.io/BabelDOC/supported_languages/), чтобы перейти на страницу *Поддерживаемые языки BabelDOC*. Информация там также применима к pdf2zh.

# chunk_A2EBE043
source: <a href="https://deepwiki.com/PDFMathTranslate-next/PDFMathTranslate-next"><img src="https://deepwiki.com/badge.svg" alt="Ask DeepWiki"></a> </p>
ru: <a href="https://deepwiki.com/PDFMathTranslate-next/PDFMathTranslate-next"><img src="https://deepwiki.com/badge.svg" alt="Спроси DeepWiki"></a> </p>

# chunk_D8283F5F
source: | 切罗基语 | Cherokee | `chr` |
de: | Cherokee | Cherokee | `chr` |
fr: | Cherokee | Cherokee | `chr` |
it: | Cherokee | Cherokee | `chr` |
ru: | Чероки | Cherokee | `chr` |

# chunk_08CB79D0
source: | 斯瓦希里语 | Swahili | `sw` |
de: | Swahili | Swahili | `sw` |
fr: | Swahili | `sw` |
ru: | Суахили | Swahili | `sw` |
