Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_DE6EE671
source: | `--output` | Output directory for files | `pdf2zh_next example.pdf --output /outputpath` |
de: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--output-filename` | Output filename | `pdf2zh_next example.pdf --output-filename example_zh.pdf` | | `--output-type` | Output file type, `pdf` or `docx` | `pdf2zh_next example.pdf --output-type docx` | | `--output-language` | Output language, see [Supported Languages](#supported-languages) | `pdf2zh_next example.pdf --output-language ja` | | `--output-translation-provider` | Output translation provider, see [Translation Services](#translation-services) | `pdf2zh_next example.pdf --output-translation-provider google` | | `--output-translation-key` | Output translation provider key, see [Translation Services](#translation-services) | `pdf2zh_next example.pdf --output-translation-provider azure --output-translation-key <your-azure-translator-key>` | | `--output-translation-region` | Output translation provider region, see [Translation Services](#translation-services) | `pdf2zh_next example.pdf --output-translation-provider azure --output-translation-region <your-azure-translator-region>` | | `--output-translation-url` | Output translation provider url, see [Translation Services](#translation-services) | `pdf2zh_next example.pdf --output-translation-provider azure --output-translation-url <your-azure-translator-url>` | --- ### TRANSLATED TEXT | `--output` | Ausgabeverzeichnis für Dateien | `pdf2zh_next example.pdf --output /outputpath` | | ------------------------------- | ------------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--output-filename` | Ausgabedateiname | `pdf2zh_next example.pdf --output-filename example_zh.pdf` | | `--output-type` | Ausgabedateityp, `pdf` oder `docx` | `pdf2zh_next example.pdf --output-type docx` | | `--output-language` | Ausgabesprache, siehe [Unterstützte Sprachen](#unterstützte-sprachen) | `pdf2zh_next example.pdf --output-language ja` | | `--output-translation-provider` | Ausgabe-Übersetzungsanbieter, siehe [Übersetzungsdienste](#übersetzungsdienste) | `pdf2zh_next example.pdf --output-translation-provider google` | | `--output-translation-key` | Schlüssel des Ausgabe-Übersetzungsanbieters, siehe [Übersetzungsdienste](#übersetzungsdienste) | `pdf2zh_next example.pdf --output-translation-provider azure --output-translation-key <your-azure-translator-key>` | | `--output-translation-region` | Region des Ausgabe-Übersetzungsanbieters, siehe [Übersetzungsdienste](#übersetzungsdienste) | `pdf2zh_next example.pdf --output-translation-provider azure --output-translation-region <your-azure-translator-region>` | | `--output-translation-url` | URL des Ausgabe-Übersetzungsanbieters, siehe [Übersetzungsdienste](#übersetzungsdienste) | `pdf2zh_next example.pdf --output-translation-provider azure --output-translation-url <your-azure-translator-url>` |
fr: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--target-lang` | Target language code (default: `zh-CN`) | `pdf2zh_next example.pdf --target-lang en-US` | | `--source-lang` | Source language code (default: `auto`) | `pdf2zh_next example.pdf --source-lang en-US` | | `--translator` | Translator service (default: `google`) | `pdf2zh_next example.pdf --translator deepl` | | `--translator-api-key` | API key for the translator service | `pdf2zh_next example.pdf --translator deepl --translator-api-key your_deepl_api_key` | | `--translator-api-url` | API URL for the translator service | `pdf2zh_next example.pdf --translator deepl --translator-api-url https://api-free.deepl.com/v2/translate` | | `--translator-api-region` | API region for the translator service | `pdf2zh_next example.pdf --translator azure --translator-api-region eastus` | | `--translator-api-model` | API model for the translator service | `pdf2zh_next example.pdf --translator openai --translator-api-model gpt-4o` | | `--translator-api-timeout` | Timeout in seconds for the translator service (default: 60) | `pdf2zh_next example.pdf --translator-api-timeout 120` | | `--translator-concurrency-limit`| Concurrency limit for the translator service (default: 10) | `pdf2zh_next example.pdf --translator-concurrency-limit 5` | | `--translator-request-limit` | Request limit for the translator service (default: 50) | `pdf2zh_next example.pdf --translator-request-limit 100` | | `--translator-request-interval` | Request interval in milliseconds for the translator service (default: 1000) | `pdf2zh_next example.pdf --translator-request-interval 2000` | | `--translator-retry-attempts` | Retry attempts for the translator service (default: 3) | `pdf2zh_next example.pdf --translator-retry-attempts 5` | | `--translator-retry-delay` | Retry delay in milliseconds for the translator service (default: 1000) | `pdf2zh_next example.pdf --translator-retry-delay 2000` | | `--translator-save-json` | Whether to save the translator's response JSON (default: `false`) | `pdf2zh_next example.pdf --translator-save-json true` | | `--translator-save-json-path` | Path to save the translator's response JSON (default: same as output directory) | `pdf2zh_next example.pdf --translator-save-json true --translator-save-json-path /jsonpath` | | `--translator-proxy` | Proxy for the translator service | `pdf2zh_next example.pdf --translator-proxy http://127.0.0.1:7890` | | `--translator-proxy-auth` | Proxy authentication for the translator service | `pdf2zh_next example.pdf --translator-proxy http://127.0.0.1:7890 --translator-proxy-auth username:password` | | `--translator-proxy-timeout` | Proxy timeout in seconds for the translator service (default: 60) | `pdf2zh_next example.pdf --translator-proxy-timeout 120` | | `--translator-proxy-retry` | Proxy retry attempts for the translator service (default: 3) | `pdf2zh_next example.pdf --translator-proxy-retry 5` | | `--translator-proxy-retry-delay`| Proxy retry delay in milliseconds for the translator service (default: 1000) | `pdf2zh_next example.pdf --translator-proxy-retry-delay 2000` | | `--translator-proxy-save-json` | Whether to save the proxy's response JSON (default: `false`) | `pdf2zh_next example.pdf --translator-proxy-save-json true` | | `--translator-proxy-save-json-path` | Path to save the proxy's response JSON (default: same as output directory) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-path /jsonpath` | | `--translator-proxy-save-json-format` | Format to save the proxy's response JSON (default: `json`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-format json` | | `--translator-proxy-save-json-indent` | Indent for the proxy's response JSON (default: 2) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-indent 4` | | `--translator-proxy-save-json-encoding` | Encoding for the proxy's response JSON (default: `utf-8`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-encoding utf-8` | | `--translator-proxy-save-json-ensure-ascii` | Whether to ensure ASCII for the proxy's response JSON (default: `false`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-ensure-ascii true` | | `--translator-proxy-save-json-sort-keys` | Whether to sort keys for the proxy's response JSON (default: `false`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-sort-keys true` | | `--translator-proxy-save-json-allow-nan` | Whether to allow NaN for the proxy's response JSON (default: `false`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-allow-nan true` | | `--translator-proxy-save-json-skipkeys` | Whether to skip keys for the proxy's response JSON (default: `false`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-skipkeys true` | | `--translator-proxy-save-json-default` | Default value for the proxy's response JSON (default: `None`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-default null` | | `--translator-proxy-save-json-check-circular` | Whether to check circular references for the proxy's response JSON (default: `true`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-check-circular false` | | `--translator-proxy-save-json-separators` | Separators for the proxy's response JSON (default: `(',', ': ')`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-separators (',', ': ')` | | `--translator-proxy-save-json-indent` | Indent for the proxy's response JSON (default: 2) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-indent 4` | | `--translator-proxy-save-json-encoding` | Encoding for the proxy's response JSON (default: `utf-8`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-encoding utf-8` | | `--translator-proxy-save-json-ensure-ascii` | Whether to ensure ASCII for the proxy's response JSON (default: `false`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-ensure-ascii true` | | `--translator-proxy-save-json-sort-keys` | Whether to sort keys for the proxy's response JSON (default: `false`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-sort-keys true` | | `--translator-proxy-save-json-allow-nan` | Whether to allow NaN for the proxy's response JSON (default: `false`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-allow-nan true` | | `--translator-proxy-save-json-skipkeys` | Whether to skip keys for the proxy's response JSON (default: `false`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-skipkeys true` | | `--translator-proxy-save-json-default` | Default value for the proxy's response JSON (default: `None`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-default null` | | `--translator-proxy-save-json-check-circular` | Whether to check circular references for the proxy's response JSON (default: `true`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-check-circular false` | | `--translator-proxy 极-save-json-separators` | Separators for the proxy's response JSON (default: `(',', ': ')`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-separators (',', ': ')` | --- ### OUTPUT | `--output` | Répertoire de sortie pour les fichiers | `pdf2zh_next example.pdf --output /outputpath` | | ------------------------------- | --------------------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--target-lang` | Code de langue cible (par défaut : `zh-CN`) | `pdf2zh_next example.pdf --target-lang en-US` | | `--source-lang` | Code de langue source (par défaut : `auto`) | `pdf2zh_next example.pdf --source-lang en-US` | | `--translator` | Service de traduction (par défaut : `google`) | `pdf2zh_next example.pdf --translator deepl` | | `--translator-api-key` | Clé API pour le service de traduction | `pdf2zh_next example.pdf --translator deepl --translator-api-key your_deepl_api_key` | | `--translator-api-url` | URL de l'API pour le service de traduction | `pdf2zh_next example.pdf --translator deepl --translator-api-url https://api-free.deepl.com/v2/translate` | | `--translator-api-region` | Région de l'API pour le service de traduction | `pdf2zh_next example.pdf --translator azure --translator-api-region eastus` | | `--translator-api-model` | Modèle de l'API pour le service de traduction | `pdf2zh_next example.pdf --translator openai --translator-api-model gpt-4o` | | `--translator-api-timeout` | Délai d'attente en secondes pour le service de traduction (par défaut : 60) | `pdf 极 zh_next example.pdf --translator-api-timeout 120` | | `--translator-concurrency-limit`| Limite de concurrence pour le service de traduction (par défaut : 10) | `pdf2zh_next example.pdf --translator-concurrency-limit 5` | | `--translator-request-limit` | Limite de requêtes pour le service de traduction (par défaut : 50) | `pdf2zh_next example.pdf --translator-request 极 limit 100` | | `--translator-request-interval` | Intervalle de requête en millisecondes pour le service de traduction (par défaut : 1000) | `pdf2zh_next example.pdf --translator-request-interval 2000` | | `--translator-retry-attempts` | Tentatives de réessai pour le service de traduction (par défaut : 3) | `pdf2zh_next example.pdf --translator-retry-attempts 5` | | `--translator-retry-del 极` | Délai de réessai en millisecondes pour le service de traduction (par défaut : 1000) | `pdf2zh_next example.pdf --translator-retry-delay 2000` | | `--translator-save-json` | Indique s'il faut enregistrer le JSON de réponse du traducteur (par défaut : `false`) | `pdf2zh_next example.pdf --translator-save-json true` | | `--translator-save-json-path` | Chemin pour enregistrer le JSON de réponse du traducteur (par défaut : même que le répertoire de sortie) | `pdf2zh_next example.pdf --translator-save-json true --translator-save-json-path /jsonpath` | | `--translator-proxy` | Proxy pour le service de traduction | `pdf2zh_next example.pdf --translator-proxy http://127.0.0.1:7890` | | `--translator-proxy-auth` | Authentification du proxy pour le service de traduction | `pdf2zh_next example.pdf --translator-proxy http://127.0.0.1:7890 --translator-proxy-auth username:password` | | `--translator-proxy-timeout` | Délai d'attente du proxy en secondes pour le service de traduction (par défaut : 60) | `pdf2zh_next example.pdf --translator-proxy-timeout 120` | | `--translator-proxy-retry` | Tentatives de réessai du proxy pour le service de traduction (par défault : 3) | `pdf2zh_next example.pdf --translator-proxy-retry 5` | | `--translator-proxy-retry-delay`| Délai de réessai du proxy en millisecondes pour le service de traduction (par défaut : 1000) | `pdf2zh_next example.pdf --translator-proxy-retry-delay 2000` | | `--translator-proxy-save-json` | Indique s'il faut enregistrer le JSON de réponse du proxy (par défaut : `false`) | `pdf2zh_next example.pdf --translator-proxy-save-json true` | | `--translator-proxy-save-json-path` | Chemin pour enregistrer le JSON de réponse du proxy (par défaut : même que le répertoire de sortie) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy 极 save-json-path /jsonpath` | | `--translator-proxy-save-json-format` | Format pour enregistrer le JSON de réponse du proxy (par défaut : `json`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-format json` | | `--translator-proxy-save-json-indent` | Indentation pour le JSON de réponse du proxy (par défaut : 2) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-indent 4` | | `--translator-proxy-save-json-encoding` | Encodage pour le JSON de réponse du proxy (par défaut : `utf-8`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-encoding utf-8` | | `--translator-proxy-save-json-ensure-ascii` | Indique s'il faut garantir l'ASCII pour le JSON de réponse du proxy (par défaut : `false`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-ensure-ascii true` | | `--translator-proxy-save-json-sort-keys` | Indique s'il faut trier les clés pour le JSON de réponse du proxy (par défaut : `false`) | `pdf2zh_next example.pdf --translator-proxy-save-极 json true --translator-proxy-save-json-sort-keys true` | | `--translator-proxy-save-json-allow-nan` | Indique s'il faut autoriser NaN pour le JSON de réponse du proxy (par défaut : `false`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-allow-nan true` | | `--translator-proxy-save-json-skipkeys` | Indique s'il faut ignorer les clés pour le JSON de réponse du proxy (par défaut : `false`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-skipkeys true` | | `--translator-proxy-save-json-default` | Valeur par défaut pour le JSON de réponse du proxy (par défaut : `None`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-default null` | | `--translator-proxy-save-json-check-circular` | Indique s'il faut vérifier les références circulaires pour le JSON de réponse du proxy (par défaut : `true`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-check-circular false` | | `--translator-proxy-save-json-separators` | Séparateurs pour le JSON de réponse du proxy (par défaut : `(',', ': ')`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-separators (',', ': ')` | | `--translator-proxy-save-json-indent` | Indentation pour le JSON de réponse du proxy (par défaut : 2) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-indent 4` | | `--translator-proxy-save-json-encoding` | Encodage pour le JSON de réponse du proxy (par défaut : `utf-8`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-encoding utf-8 极` | | `--translator-proxy-save-json-ensure-ascii` | Indique s'il faut garantir l'ASCII pour le JSON de réponse du proxy (par défaut : `false`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-ensure-ascii true` | | `--translator-proxy-save-json-s 极 ort-keys` | Indique s'il faut trier les clés pour le JSON de réponse du proxy (par défaut : `false`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-sort-keys true` | | `--translator-proxy-save-json-allow-nan` | Indique s'il faut autoriser NaN pour le JSON de réponse du proxy (par défaut : `false`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-pro 极 xy-save-json-allow-nan 极 true` | | `--translator-proxy-save-json-skipkeys` | Indique s'il faut ignorer les clés pour le JSON de réponse du proxy (par défaut : `false`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-skipkeys true` | | `--translator-proxy-save-json-default` | Valeur par défaut pour le JSON de réponse du proxy (par défaut : `None`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-default null` | | `--translator-proxy-save-json-check-circular` | Indique s'il faut vérifier les références circulaires pour le JSON de réponse du proxy (par défaut : `true`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-check-circular false` | | `--translator-proxy-save-json-separators` | Séparateurs pour le JSON de réponse du proxy (par défaut : `(',', ': ')`) | `pdf2zh_next example.pdf --translator-proxy-save-json true --translator-proxy-save-json-separators (',', ': ')` |
it: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--output-name` | Output file name, only valid when input is a single file | `pdf2zh_next example.pdf --output-name output.pdf` | | `--output-type` | Output file format, supports `pdf`, `docx`, `txt`, `markdown`, `latex`, `html` and `zip` | `pdf2zh_next example.pdf --output-type docx` | | `--target-lang` | Target language code, defaults to `zh` | `pdf2zh_next example.pdf --target-lang en` | | `--source-lang` | Source language code | `pdf2zh_next example.pdf --source-lang en` | | `--translator` | Translation service, see [Documentation of Translation Services](TRANSLATOR.md) | `pdf2zh_next example.pdf --translator google` | | `--translator-key` | API key for translation service | `pdf2zh_next example.pdf --translator-key <your-api-key>` | | `--translator-url` | Custom URL for translation service | `pdf2zh_next example.pdf --translator-url <your-custom-url>` | | `--translator-model` | Model for translation service, only valid for `openai` and `azure` | `pdf2zh_next example.pdf --translator-model gpt-4` | | `--translator-temperature` | Temperature for translation service, only valid for `openai` and `azure` | `pdf2zh_next example.pdf --translator-temperature 0.1` | | `--translator-prompts` | Custom prompts for translation service, only valid for `openai` and `azure` | `pdf2zh_next example.pdf --translator-prompts <your-custom-prompts>` | | `--translator-retries` | Retry times for translation service, defaults to `3` | `pdf2zh_next example.pdf --translator-retries 5` | | `--translator-timeout` | Timeout for translation service, defaults to `10` | `pdf2zh_next example.pdf --translator-timeout 20` | | `--translator-proxy` | Proxy for translation service | `pdf2zh_next example.pdf --translator-proxy http://127.0.0.1:7890` | | `--translator-ignore-tag` | Ignore tags for translation service, defaults to `math,code` | `pdf2zh_next example.pdf --translator-ignore-tag math,code,table` | | `--translator-ignore-text` | Ignore text for translation service, regex pattern | `pdf2zh_next example.pdf --translator-ignore-text '\\d+'` | | `--translator-include-tag` | Include tags for translation service, overrides `--translator-ignore-tag` | `pdf2zh_next example.pdf --translator-include-tag table` | | `--translator-include-text` | Include text for translation service, regex pattern, overrides `--translator-ignore-text` | `pdf2zh_next example.pdf --translator-include-text 'important'` | | `--concurrency-limit` | Concurrency limit for translation service, defaults to `5` | `pdf2zh_next example.pdf --concurrency-limit 10` | | `--math-mode` | Math mode, supports `preserve`, `translate`, `remove`, defaults to `preserve` | `pdf2zh_next example.pdf --math-mode translate` | | `--table-mode` | Table mode, supports `preserve`, `translate`, `remove`, defaults to `preserve` | `pdf2zh_next example.pdf --table-mode translate` | | `--code-mode` | Code mode, supports `preserve`, `translate`, `remove`, defaults to `preserve` | `pdf2zh_next example.pdf --code-mode remove` | | `--image-mode` | Image mode, supports `preserve`, `remove`, defaults to `preserve` | `pdf2zh_next example.pdf --image-mode remove` | | `--font` | Font for output file, only valid for `pdf` output | `pdf2zh_next example.pdf --font "Noto Sans SC"` | | `-v`, `--version` | Show version number and exit | `pdf2zh_next --version` | | `-h`, `--help` | Show help message and exit | `pdf2zh_next --help` | --- ### TRANSLATION RESULT | `--output` | Directory di output per i file | `pdf2zh_next example.pdf --output /percorso_output` | | ------------------------------- | ---------------------------------------------------------------------------------------------- | -------------------------------------------------------------------------------------------------------------------------- | | `--output-name` | Nome del file di output, valido solo quando l'input è un singolo file | `pdf2zh_next example.pdf --output-name output.pdf` | | `--output-type` | Formato del file di output, supporta `pdf`, `docx`, `txt`, `markdown`, `latex`, `html` e `zip` | `pdf2zh_next example.pdf --output-type docx` | | `--target-lang` | Codice lingua di destinazione, predefinito `zh` | `pdf2zh_next example.pdf --target-lang en` | | `--source-lang` | Codice lingua di origine | `pdf2zh_next example.pdf --source-lang en` | | `--translator` | Servizio di traduzione, vedi [Documentazione dei servizi di traduzione](TRANSLATOR.md) | `pdf2zh_next example.pdf --translator google` | | `--translator-key` | Chiave API per il servizio di traduzione | `pdf2zh_next example.pdf --translator-key <tua-chiave-api>` | | `--translator-url` | URL personalizzato per il servizio di traduzione | `pdf2zh_next example.pdf --translator-url <tua-url-personalizzata>` | | `--translator-model` | Modello per il servizio di traduzione, valido solo per `openai` e `azure` | `pdf2zh_next example.pdf --translator-model gpt-4` | | `--translator-temperature` | Temperatura per il servizio di traduzione, valido solo per `openai` e `azure` | `pdf2zh_next example.pdf --translator-temperature 0.1` | | `--translator-prompts` | Prompt personalizzati per il servizio di traduzione, valido solo per `openai` e `azure` | `pdf2zh_next example.pdf --translator-prompts <tua-prompt-personalizzati>` | | `--translator-retries` | Numero di tentativi per il servizio di traduzione, predefinito `3` | `pdf2zh_next example.pdf --translator-retries 5` | | `--translator-timeout` | Timeout per il servizio di traduzione, predefinito `10` | `pdf2zh_next example.pdf --translator-timeout 20` | | `--translator-proxy` | Proxy per il servizio di traduzione | `pdf2zh_next example.pdf --translator-proxy http://127.0.0.1:7890` | | `--translator-ignore-tag` | Tag da ignorare per il servizio di traduzione, predefinito `math,code` | `pdf2zh_next example.pdf --translator-ignore-tag math,code,table` | | `--translator-ignore-text` | Testo da ignorare per il servizio di traduzione, pattern regex | `pdf2zh_next example.pdf --translator-ignore-text '\\d+'` | | `--translator-include-tag` | Tag da includere per il servizio di traduzione, sovrascrive `--translator-ignore-tag` | `pdf2zh_next example.pdf --translator-include-tag table` | | `--translator-include-text` | Testo da includere per il servizio di traduzione, pattern regex, sovrascrive `--translator-ignore-text` | `pdf2zh_next example.pdf --translator-include-text 'important'` | | `--concurrency-limit` | Limite di concorrenza per il servizio di traduzione, predefinito `5` | `pdf2zh_next example.pdf --concurrency-limit 10` | | `--math-mode` | Modalità matematica, supporta `preserve`, `translate`, `remove`, predefinito `preserve` | `pdf2zh_next example.pdf --math-mode translate` | | `--table-mode` | Modalità tabella, supporta `preserve`, `translate`, `remove`, predefinito `preserve` | `pdf2zh_next example.pdf --table-mode translate` | | `--code-mode` | Modalità codice, supporta `preserve`, `translate`, `remove`, predefinito `preserve` | `pdf2zh_next example.pdf --code-mode remove` | | `--image-mode` | Modalità immagine, supporta `preserve`, `remove`, predefinito `preserve` | `pdf2zh_next example.pdf --image-mode remove` | | `--font` | Font per il file di output, valido solo per output `pdf` | `pdf2zh_next example.pdf --font "Noto Sans SC"` | | `-v`, `--version` | Mostra il numero di versione ed esci | `pdf2zh_next --version` | | `-h`, `--help` | Mostra il messaggio di aiuto ed esci | `pdf2zh_next --help` |
pt: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--output-name` | Output filename for single file output | `pdf2zh_next example.pdf --output-name example_translated.pdf` | | `--output-format` | Output format, `pdf` or `html` | `pdf2zh_next example.pdf --output-format html` | | `--output-pdf-ocr` | Enable OCR for output PDF, which improves text selection but may reduce image quality | `pdf2zh_next example.pdf --output-pdf-ocr` | | `--output-html-embed-image` | Embed images in the output HTML file instead of saving them as separate files | `pdf2zh_next example.pdf --output-format html --output-html-embed-image` | | `--output-html-save-image` | Save images as separate files in the output directory when generating HTML | `pdf2zh_next example.pdf --output-format html --output-html-save-image` | | `--output-html-pretty` | Enable pretty formatting for the output HTML file | `pdf2zh_next example.pdf --output-format html --output-html-pretty` | | `--output-html-pretty-indent` | Set the indentation for pretty formatting in the output HTML file | `pdf2zh_next example.pdf --output-format html --output-html-pretty --output-html-pretty-indent 2` | | `--output-html-pretty-max-width` | Set the maximum line width for pretty formatting in the output HTML file | `pdf2zh_next example.pdf --output-format html --output-html-pretty --output-html-pretty-max-width 80` | | `--output-pdf-ocr-dpi` | Set the DPI for OCR in the output PDF. Higher values improve text quality but increase processing time and file size. | `pdf2zh_next example.pdf --output-pdf-ocr --output-pdf-ocr-dpi 300` | --- ### OUTPUT | `--output` | Diretório de saída para os arquivos | `pdf2zh_next example.pdf --output /outputpath` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--output-name` | Nome do arquivo de saída para saída de arquivo único | `pdf2zh_next example.pdf --output-name example_translated.pdf` | | `--output-format` | Formato de saída, `pdf` ou `html` | `pdf2zh_next example.pdf --output-format html` | | `--output-pdf-ocr` | Ativar OCR para o PDF de saída, o que melhora a seleção de texto, mas pode reduzir a qualidade da imagem | `pdf2zh_next example.pdf --output-pdf-ocr` | | `--output-html-embed-image` | Incorporar imagens no arquivo HTML de saída em vez de salvá-las como arquivos separados | `pdf2zh_next example.pdf --output-format html --output-html-embed-image` | | `--output-html-save-image` | Salvar imagens como arquivos separados no diretório de saída ao gerar HTML | `pdf2zh_next example.pdf --output-format html --output-html-save-image` | | `--output-html-pretty` | Ativar formatação bonita para o arquivo HTML de saída | `pdf2zh_next example.pdf --output-format html --output-html-pretty` | | `--output-html-pretty-indent` | Definir a indentação para formatação bonita no arquivo HTML de saída | `pdf2zh_next example.pdf --output-format html --output-html-pretty --output-html-pretty-indent 2` | | `--output-html-pretty-max-width` | Definir a largura máxima da linha para formatação bonita no arquivo HTML de saída | `pdf2zh_next example.pdf --output-format html --output-html-pretty --output-html-pretty-max-width 80` | | `--output-pdf-ocr-dpi` | Definir o DPI para OCR no PDF de saída. Valores mais altos melhoram a qualidade do texto, mas aumentam o tempo de processamento e o tamanho do arquivo. | `pdf2zh_next example.pdf --output-pdf-ocr --output-pdf-ocr-dpi 300` |
ru: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--lang` | Language code of the output file, default is `zh`, [supported languages](#supported-languages) | `pdf2zh_next example.pdf --lang ru` | | `--translator` | Translation service to use, default is `google`, [supported translators](#supported-translators) | `pdf2zh_next example.pdf --translator deepl` | | `--translator-key` | API Key for the translation service | `pdf2zh_next example.pdf --translator deepl --translator-key your-deepl-key` | | `--translator-url` | API URL for the translation service (for self-hosted services) | `pdf2zh_next example.pdf --translator deepl --translator-url https://api-free.deepl.com` | | `--translator-model` | Model for the translation service (for OpenAI) | `pdf2zh_next example.pdf --translator openai --translator-model gpt-3.5-turbo` | | `--translator-context` | Whether to use context for translation, default is `true` | `pdf2zh_next example.pdf --translator-context false` | | `--translator-timeout` | Timeout for the translation service in seconds, default is `10` | `pdf2zh_next example.pdf --translator-timeout 20` | | `--translator-retries` | Number of retries for the translation service, default is `3` | `pdf2zh_next example.pdf --translator-retries 5` | | `--translator-batch-size` | Batch size for the translation service, default is `50` | `pdf2zh_next example.pdf --translator-batch-size 100` | | `--translator-batch-delay` | Delay between batches in seconds, default is `1` | `pdf2zh_next example.pdf --translator-batch-delay 2` | | `--translator-batch-concurrency`| Number of concurrent batches, default is `1` | `pdf2zh_next example.pdf --translator-batch-concurrency 3` | | `--translator-batch-timeout` | Timeout for each batch in seconds, default is `30` | `pdf2zh_next example.pdf --translator-batch-timeout 60` | | `--translator-batch-retries` | Number of retries for each batch, default is `3` | `pdf2zh_next example.pdf --translator-batch-retries 5` | | `--translator-batch-delay-retry`| Delay between retries in seconds, default is `1` | `pdf2zh_next example.pdf --translator-batch-delay-retry 2` | | `--translator-batch-concurrency-retry`| Number of concurrent retries, default is `1` | `pdf2zh_next example.pdf --translator-batch-concurrency-retry 3` | | `--translator-batch-timeout-retry`| Timeout for each retry in seconds, default is `30` | `pdf2zh_next example.pdf --translator-batch-timeout-retry 60` | | `--translator-batch-retries-retry`| Number of retries for each retry, default is `3` | `pdf2zh_next example.pdf --translator-batch-retries-retry 5` | | `--translator-batch-delay-retry-retry`| Delay between retries for retries in seconds, default is `1` | `pdf2zh_next example.pdf --translator-batch-delay-retry-retry 2` | | `--translator-batch-concurrency-retry-retry`| Number of concurrent retries for retries, default is `1` | `pdf2zh_next example.pdf --translator-batch-concurrency-retry-retry 3` | | `--translator-batch-timeout-retry-retry`| Timeout for each retry for retries in seconds, default is `30` | `pdf2zh_next example.pdf --translator-batch-timeout-retry-retry 60` | | `--translator-batch-retries-retry-retry`| Number of retries for each retry for retries, default is `3` | `pdf2zh_next example.pdf --translator-batch-retries-retry-retry 5` | | `--translator-batch-delay-retry-retry-retry`| Delay between retries for retries for retries in seconds, default is `1` | `pdf2zh_next example.pdf --translator-batch-delay-retry-retry-retry 2` | | `--translator-batch-concurrency-retry-retry-retry`| Number of concurrent retries for retries for retries, default is `1` | `pdf2zh_next example.pdf --translator-batch-concurrency-retry-retry-retry 3` | | `--translator-batch-timeout-retry-retry-retry`| Timeout for each retry for retries for retries in seconds, default is `30` | `pdf2zh_next example.pdf --translator-batch-timeout-retry-retry-retry 60` | | `--translator-batch-retries-retry-retry-retry`| Number of retries for each retry for retries for retries, default is `3` | `pdf2zh_next example.pdf --translator-batch-retries-retry-retry-retry 5` | | `--translator-batch-delay-retry-retry-retry-retry`| Delay between retries for retries for retries for retries in seconds, default is `1`| `pdf2zh_next example.pdf --translator-batch-delay-retry-retry-retry-retry 2` | | `--translator-batch-concurrency-retry-retry-retry-retry`| Number of concurrent retries for retries for retries for retries, default is `1`| `pdf2zh_next example.pdf --translator-batch-concurrency-retry-retry-retry-retry 3` | | `--translator-batch-timeout-retry-retry-retry-retry`| Timeout for each retry for retries for retries for retries in seconds, default is `30`| `pdf2zh_next example.pdf --translator-batch-timeout-retry-retry-retry-retry 60` | | `--translator-batch-retries-retry-retry-retry-retry`| Number of retries for each retry for retries for retries for retries, default is `3`| `pdf2zh_next example.pdf --translator-batch-retries-retry-retry-retry-retry 5` | | `--translator-batch-delay-retry-retry-retry-retry-retry`| Delay between retries for retries for retries for retries for retries in seconds, default is `1`| `pdf2zh_next example.pdf --translator-batch-delay-retry-retry-retry-retry-retry 2` | | `--translator-batch-concurrency-retry-retry-retry-retry-retry`| Number of concurrent retries for retries for retries for retries for retries, default is `1`| `pdf2zh_next example.pdf --translator-batch-concurrency-retry-retry-retry-retry-retry 3` | | `--translator-batch-timeout-retry-retry-retry-retry-retry`| Timeout for each retry for retries for retries for retries for retries in seconds, default is `30`| `pdf2zh_next example.pdf --translator-batch-timeout-retry-retry-retry-retry-retry 60` | | `--translator-batch-retries-retry-retry-retry-retry-retry`| Number of retries for each retry for retries for retries for retries for retries, default is `3`| `pdf2zh_next example.pdf --translator-batch-retries-retry-retry-retry-retry-retry 5` | | `--translator-batch-delay-retry-retry-retry-retry-retry-retry`| Delay between retries for retries for retries for retries for retries for retries in seconds, default is `1`| `pdf2zh_next example.pdf --translator-batch-delay-retry-retry-retry-retry-retry-retry 2` | | `--translator-batch-concurrency-retry-retry-retry-retry-retry-retry`| Number of concurrent retries for retries for retries for retries for retries for retries, default is `1`| `pdf2zh_next example.pdf --translator-batch-concurrency-retry-retry-retry-retry-retry-retry 3` | | `--translator-batch-timeout-retry-retry-retry-retry-retry-retry`| Timeout for each retry for retries for retries for retries for retries for retries in seconds, default is `30`| `pdf2zh_next example.pdf --translator-batch-timeout-retry-retry-retry-retry-retry-retry 60` | | `--translator-batch-retries-retry-retry-retry-retry-retry-retry`| Number of retries for each retry for retries for retries for retries for retries for retries, default is `3`| `pdf2zh_next example.pdf --translator-batch-retries-retry-retry-retry-retry-retry-retry 5` | | `--translator-batch-delay-ret 极-retry-retry-retry-retry-retry-retry`| Delay between retries for retries for retries for retries for retries for retries for retries in seconds, default is `1`| `pdf2zh_next example.pdf --translator-batch-delay-retry-retry-retry-retry-retry-retry-retry 2` | | `--translator-batch-concurrency-retry-retry-retry-retry-retry-retry-retry`| Number of concurrent retries for retries for retries for retries for retries for retries for retries, default is `1`| `pdf2zh_next example.pdf --translator 极-batch-concurrency-retry-retry-retry-retry-retry-retry-retry 3` | | `--translator-batch-timeout-retry-retry-retry-retry-retry-retry-retry`| Timeout for each retry for retries for retries for retries for retries for retries for retries in seconds, default is `30`| `pdf2zh_next example.pdf --translator-batch-timeout-retry-retry-retry-retry-retry-retry-retry 60` | | `--translator-batch-retries-retry-retry-retry 极-retry-retry-retry`| Number of retries for each retry for retries for retries for retries for retries for retries for retries, default is `极`| `pdf2zh_next example.pdf --translator-batch-retries-retry-retry-retry-retry-retry-retry-retry 5` | --- ### TRANSLATION RESULT | `--output` | Выходной каталог для файлов | `pdf2zh_next example.pdf --output /outputpath` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--lang` | Код языка выходного файла, по умолчанию `zh`, [поддерживаемые языки](#supported-languages) | `pdf2zh_next example.pdf --lang ru` | | `--translator` | Служба перевода для использования, по умолчанию `google`, [поддерживаемые переводчики](#supported-translators) | `pdf2zh_next example.pdf --translator deepl` | | `--translator-key` | API Key для службы перевода | `pdf 极 2zh_next example.pdf --translator deepl --translator-key your-deepl-key` | | `--translator-url` | API URL для службы перевода (для самодостаточных служб) | `pdf2zh_next example.pdf --translator deepl --translator-url https://api-free.deepl.com` | | `--translator-model` | Модель для службы перевода (для OpenAI) | `pdf2zh_next example.pdf --translator openai --translator-model gpt-3.5-turbo` | | `--translator-context` | Использовать ли контекст для перевода, по умолчанию `true` | `pdf2zh_next example.pdf --translator-context false` | | `--translator-timeout` | Таймаут для службы перевода в секундах, по умолчанию `10` | `pdf2zh_next example.pdf --translator-timeout 20` | | `--translator-retries` | Количество повторных попыток для службы перевода, по умолчанию `3` | `pdf2zh_next example.pdf --translator-retries 5` | | `--translator-batch-size` | Размер пакета для службы перевода, по умолчанию `50` | `pdf2zh_next example.pdf --translator-batch-size 100` | | `--translator-batch-delay` | Задержка между пакетами в секундах, по умолчанию `1` | `pdf2zh_next example.pdf --translator-batch-del 极 ay 2` | | `--translator-batch-concurrency`| Количество параллельных пакетов, по умолчанию `1` | `pdf2zh_next example.pdf --translator-batch-concurrency 3` | | `--translator-batch-timeout` | Таймаут для каждого пакета в секундах, по умолчанию `30` | `pdf2zh_next example.pdf --translator-batch-timeout 60` | | `--translator-batch-retries` | Количество повторных попыток для каждого пакета, по умолчанию `3` | `pdf2zh_next example.pdf --translator-batch-retries 5` | | `--translator-batch-delay-retry`| Задержка между повторными попытками в секундах, по умолчанию `1` | `pdf2zh_next example.pdf --translator-batch-delay-retry 2` | | `--translator-batch-concurrency-retry`| Количество параллельных повторных попыток, по умолчанию `1` | `pdf2zh_next example.pdf --translator-batch-concurrency-retry 3` | | `--translator-batch-timeout-retry`| Таймаут для каждой повторной попытки в секундах, по умолчанию `30` | `pdf2zh_next example.pdf --translator-batch-timeout-retry 极 60` | | `--translator-batch-retries-retry`| Количество повторных попыток для каждой повторной попытки, по умолчанию `3` | `pdf2zh_next example.pdf --translator-batch-retries-retry 5` | | `--translator-batch-delay-retry-retry`| Задержка между повторными попытками для повторных попыток в секундах, по умолчанию `1` | `pdf2zh_next example.pdf --translator-batch-delay-retry-retry 2` | | `--translator-batch-concurrency-retry-retry`| Количество параллельных повторных попыток для повторных попыток, по умолчанию `1` | `pdf2zh_next example.pdf --translator-batch-concurrency-retry-retry 3` | | `--translator-batch-timeout-retry-retry`| Таймаут для каждой повторной попытки для повторных попыток в секундах, по умолчанию `30` | `pdf2zh_next example.pdf --translator-batch-timeout-retry-retry 60` | | `--translator 极-batch-retries-retry-retry`| Количество повторных попыток для каждой повторной попытки для повторных попыток, по умолчанию `3` | `pdf2zh_next example.pdf --translator-batch-retries-retry-retry 5` | | `--translator-batch-delay-retry-retry-retry`| Задержка между повторными попытками для повторных попыток для повторных попыток в секундах, по умолчанию `1` | `pdf2zh_next example.pdf --translator-batch-delay-retry-retry-retry 2` | | `--translator-batch-concurrency-retry-retry-retry`| Количество параллельных повторных попыток для повторных попыток для повторных попыток, по умолчанию `1` | `pdf2zh_next example.pdf --translator-batch-concurrency-retry-retry-retry 3` | | `--translator-batch-timeout-retry-retry-retry`| Таймаут для каждой повторной попытки для повторных попыток для повторных попыток в секундах, по умолчанию `30` | `pdf2zh_next example.pdf --translator-batch-timeout-retry-retry-retry 60` | | `--translator-batch-retries-retry-retry-retry`| Количество повторных попыток для каждой повторной попытки для повторных попыток для повторных попыток, по умолчанию `3` | `pdf2zh_next example.pdf --translator-batch-retries-retry-retry-retry 5` | | `--translator-batch-delay-retry-retry-retry-retry`| Задержка между повторными попытками для повторных попыток для повторных попыток для повторных попыток в секундах, по умолчанию `1`| `pdf2zh_next example.pdf --translator-batch-delay-retry-retry-retry-retry 2` | | `--translator-batch-concurrency-retry-retry 极-retry-retry`| Количество параллельных повторных попыток для повторных попыток для повторных попыток для повторных попыток, по умолчанию `1`| `pdf2zh_next example.pdf --translator-batch-concurrency-retry-retry-retry-retry 3` | | `--translator-batch-timeout-retry-retry-retry-retry`| Таймаут для каждой повторной попытки для повторных попыток для повторных попыток для повторных попыток в секундах, по умолчанию `30`| `pdf2zh_next example.pdf --translator-batch-timeout-retry-retry-retry-retry 60` | | `--translator-batch-retries-retry-retry-retry-retry`| Количество повторных попыток для каждой повторной попытки для повторных попыток для повторных попыток для повторных попыток, по умолчанию `3`| `pdf2zh_next example.pdf --translator-batch-retries-retry-retry-retry-retry 5` | | `--translator-batch-delay-retry-retry-retry-retry-retry`| Задержка между повторными попытками для повторных попыток для повторных попыток для повторных попыток для повторных попыток в секундах, по умолчанию `极 1`| `pdf2zh_next example.pdf --translator-batch-delay-retry-ret 极 ry-retry-retry-retry 2` | | `--translator-batch-concurrency-retry-retry-retry-retry-retry`| Количество параллельных повторных попыток для повторных попыток для повторных попыток для повторных попыток для повторных попыток, по умолчанию `1`| `pdf2zh_next example.pdf --translator-batch-concurrency-retry-retry-retry-retry-retry 3` | | `--translator-batch-timeout-retry-retry-retry-retry-retry`| Таймаут для каждой повторной попытки для повторных попыток для повторных попыток для повторных попыток для повторных попыток в секундах, по умолчанию `30`| `pdf2zh_next example.pdf --translator-batch-timeout-retry-retry-retry-retry-retry 60` | | `--translator-batch-retries-retry-retry-retry-retry-retry`| Количество повторных попыток для каждой повторной попытки для повторных попыток для повторных попыток для повторных попыток для повторных попыток, по умолчанию `3`| `pdf2zh_next example.pdf --translator-batch-retries-retry-retry-retry-retry-retry 5` | | `--translator-batch-delay-retry-retry-retry-retry-retry-retry`| Задержка между повторными попытками для повторных попыток для повторных попыток для повторных попыток для повторных попыток для повторных попыток в секундах, по умолчанию `1`| `pdf2zh_next example.pdf --translator-batch-delay-retry-retry-retry-retry-retry-retry 2` | | `--translator-batch-concurrency-retry-retry-retry-ret 极 ry-retry-retry`| Количество параллельных повторных попыток для повторных попыток для повторных попыток для повторных попыток для повторных попыток для повторных попыток, по умолчанию `1`| `pdf2zh_next example.pdf --translator-batch-concurrency-retry-retry-retry-retry-retry-retry 3` | | `--translator-batch-timeout-retry-retry-retry-retry-retry-retry`| Таймаут для каждой повторной попытки для повторных попыток для повторных попыток для повторных поп极ыток для повторных попыток для повторных попыток в секундах, по умолчанию `30`| `pdf2zh_next example.pdf --translator-batch-timeout-retry-retry-retry-retry-retry-retry 60` | | `--translator-batch-retries-retry-retry-retry-retry-retry-retry`| Количество повторных попыток для каждой повторной попытки для повторных попыток для повторных попыток для повторных попыток для повторных попыток для повторных попыток, по умолчанию `3`| `pdf2zh_next example.pdf --translator-batch-retries-retry-retry-retry-retry 极-retry-retry 5` | | `--translator-batch-delay-retry-retry-retry-retry-retry-retry-retry`| Задержка между повторными попытками для повторных попыток для повторных попыток для повторных попыток для повторных попыток для повторных попыток для повторных попыток в секундах, по умолчанию `1`| `pdf2zh_next example.pdf --translator-batch-delay-retry-retry-retry-retry-retry-retry-retry 2` | | `--translator-batch-concurrency-retry-retry-retry-retry-retry-retry-retry`| Количество параллельных повторных попыток для повторных попыток для повторных попыток для повторных попыток для повторных попыток для повторных попыток для повторных попыток, по умолчанию `1`| `pdf2zh_next example.pdf --translator-batch-concurrency-retry-retry-retry-retry-retry-retry-retry 3` | | `--translator-batch-timeout-retry-retry-retry-retry-retry-retry-retry`| Таймаут для каждой повторной попытки для повторных попыток для повторных попыток для повторных попыток для повторных попыток для повторных попыток для повторных попыток в секундах, по умолчанию `30`| `pdf2zh_next example.pdf --translator-batch-timeout-retry-retry-retry-retry-retry-retry-retry 60` | | `--translator-batch-retries-retry-retry-retry-retry-retry-retry-retry`| Количество повторных попыток для каждой повторной попытки для повторных попыток для повторных попыток для повторных попыток для повторных попыток для повторных попыток для повторных попыток, по умолчанию `3`| `pdf2zh_next example.pdf --translator-batch-retries-retry-retry-retry-retry-retry-retry-retry 5` |
