Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_6F13A489
source: Stage summary event (example):
de: json { "type": "stage_summary", "data": { "stage": "translation", "status": "completed", "progress": { "current": 100, "total": 100 }, "metrics": { "pagesTranslated": 10, "charactersTranslated": 5000, "timeElapsed": "00:05:30" } } } ``` Stage summary event (example): ```json { "type": "stage_summary", "data": { "stage": "extraction", "status": "failed", "progress": { "current": 5, "total": 10 }, "error": { "message": "Failed to extract text from page 6", "code": "EXTRACTION_ERROR" } } } ``` --- ### TRANSLATION RESULT Stage summary event (example): ```json { "type": "stage_summary", "data": { "stage": "translation", "status": "completed", "progress": { "current": 100, "total": 100 }, "metrics": { "pagesTranslated": 10, "charactersTranslated": 5000, "timeElapsed": "00:05:30" } } } ``` Stage summary event (example): ```json { "type": "stage_summary", "data": { "stage": "extraction", "status": "failed", "progress": { "current": 5, "total": 10 }, "error": { "message": "Failed to extract text from page 6", "code": "EXTRACTION_ERROR" } } }
fr: This is an example of a stage summary event. ```json { "event": "stage_summary", "data": { "stage": "translation", "status": "completed", "summary": { "total_pages": 100, "translated_pages": 100, "failed_pages": 0, "start_time": "2023-10-05T14:48:00.000Z", "end_time": "2023-10-05T15:30:00.000Z", "duration_seconds": 2520, "average_time_per_page": 25.2 } } } ``` This event is emitted when a stage (e.g., translation, OCR, etc.) is completed. It provides a summary of the stage's execution. --- ### TRANSLATION RESULT Événement de résumé d'étape (exemple) : Ceci est un exemple d'événement de résumé d'étape. ```json { "event": "stage_summary", "data": { "stage": "translation", "status": "completed", "summary": { "total_pages": 100, "translated_pages": 100, "failed_pages": 0, "start_time": "2023-10-05T14:48:00.000Z", "end_time": "2023-10-05T15:30:00.000Z", "duration_seconds": 2520, "average_time_per_page": 25.2 } } } ``` Cet événement est émis lorsqu'une étape (par exemple, traduction, OCR, etc.) est terminée. Il fournit un résumé de l'exécution de l'étape. - ### Quick Start: This guide will help you get started with pdf2zh quickly. #### Installation You can install pdf2zh using pip: ```bash pip install pdf2zh ``` #### Basic Usage 1. **Using Command Line**: ```bash pdf2zh input.pdf ``` This will translate `input.pdf` to Chinese and save the result as `input_zh.pdf`. 2. **Using WebUI**: Start the WebUI server: ```bash pdf2zh --web ``` Then open your browser and go to `http://localhost:7860`. 3. **Using Python API**: ```python from pdf2zh import PDFTranslator translator = PDFTranslator() translator.translate("input.pdf", "output.pdf") ``` For more detailed information, please refer to the [Usage](https://pdf2zh-next.com/getting-started/USAGE.html) documentation. --- ### TRANSLATION RESULT ### Commencer rapidement Ce guide vous aidera à démarrer rapidement avec pdf2zh. #### Installation Vous pouvez installer pdf2zh en utilisant pip : ```bash pip install pdf2zh ``` #### Utilisation de base 1. **Utilisation de la ligne de commande** : ```bash pdf2zh input.pdf ``` Cela traduira `input.pdf` en chinois et sauvegardera le résultat sous `input_zh.pdf`. 2. **Utilisation de l'interface WebUI** : Démarrez le serveur WebUI : ```bash pdf2zh --web ``` Puis ouvrez votre navigateur et allez à `http://localhost:7860`. 3. **Utilisation de l'API Python** : ```python from pdf2zh import PDFTranslator translator = PDFTranslator() translator.translate("input.pdf", "output.pdf") ``` Pour des informations plus détaillées, veuillez consulter la documentation [Utilisation](https://pdf2zh-next.com/getting-started/USAGE.html). --- ### BYPASS LIST - pdf2zh - WebUI - Python API - --- --- ### ORIGINAL TEXT ### Using the WebUI: {#using-the-webui} The WebUI provides a graphical interface for translating PDF documents. It is especially useful for users who are not familiar with the command line. #### Starting the WebUI To start the WebUI, run the following command: ```bash pdf2zh --web ``` This will start a local server. By default, the WebUI is accessible at `http://localhost:7860`. #### Using the WebUI 1. Open your browser and go to `http://localhost:7860`. 2. Upload the PDF file you want to translate. 3. Select the source and target languages. 4. Click the "Translate" button to start the translation. 5. Once the translation is complete, you can download the translated PDF. #### WebUI Options The WebUI provides several options for customizing the translation: - **Source Language**: The language of the original PDF document. - **Target Language**: The language to translate to. - **Translation Service**: The translation service to use. - **Output Format**: The format of the output file (PDF, LaTeX, or Word). - **Bilingual Output**: Whether to include the original text alongside the translation. For more information on the available options, please refer to the [WebUI Documentation](https://pdf2zh-next.com/getting-started/USAGE_webui.html). --- ### OUTPUT LANGUAGE fr --- ### OUTPUT ### Utilisation de l'interface WebUI {#utilisation-de-linterface-webui} L'interface WebUI fournit une interface graphique pour traduire des documents PDF. Elle est particulièrement utile pour les utilisateurs qui ne sont pas familiers avec la ligne de commande. #### Démarrage de l'interface WebUI Pour démarrer l'interface WebUI, exécutez la commande suivante : ```bash pdf2zh --web ``` Cela démarrera un serveur local. Par défaut, l'interface WebUI est accessible à l'adresse `http://localhost:7860`. #### Utilisation de l'interface WebUI 1. Ouvrez votre navigateur et allez à `http://localhost:7860`. 2. Téléchargez le fichier PDF que vous souhaitez traduire. 3. Sélectionnez les langues source et cible. 4. Cliquez sur le bouton "Traduire" pour démarrer la traduction. 5. Une fois la traduction terminée, vous pouvez télécharger le PDF traduit. #### Options de l'interface WebUI L'interface WebUI propose plusieurs options pour personnaliser la traduction : - **Langue source** : La langue du document PDF original. - **Langue cible** : La langue vers laquelle traduire. - **Service de traduction** : Le service de traduction à utiliser. - **Format de sortie** : Le format du fichier de sortie (PDF, LaTeX ou Word). - **Sortie bilingue** : Indique s'il faut inclure le texte original à côté de la traduction. Pour plus d'informations sur les options disponibles, veuillez consulter la [Documentation WebUI](https://pdf2zh-next.com/getting-started/USAGE_webui.html).
it: A stage summary event is a special type of event that represents a summary or overview of a stage in the timeline. It typically spans a period of time and provides a high-level description of what occurred during that stage. ```yaml events: - type: "stage_summary" title: "Project Initiation Phase" startDate: "2023-01-01" endDate: "2023-03-31" description: "This phase involved initial planning, requirement gathering, and team formation for the new project." color: "#6c5ce7" icon: "clipboard-list" priority: 1 ``` ### Properties - `type` (string): Must be "stage_summary" for stage summary events. - `title` (string): The title of the stage summary. - `startDate` (string): The start date of the stage in ISO format (YYYY-MM-DD). - `endDate` (string): The end date of the stage in ISO format (YYYY-MM-DD). - `description` (string): A description of what occurred during this stage. - `color` (string, optional): The color for this event in hex format. Defaults to a system color if not specified. - `icon` (string, optional): The icon to use for this event. See the [icon list](ICONS.md) for available icons. - `priority` (number, optional): The priority level of this event. Higher numbers indicate higher priority. Defaults to 0. ### Display Behavior Stage summary events are typically displayed as: - A colored bar spanning the stage duration on the timeline - With the title and optional icon visible - Often used as parent events that contain other detailed events within their time range ### Example Use Cases 1. **Project Phases**: Representing initiation, planning, execution, and closure phases of a project. 2. **Development Sprints**: Summarizing what was accomplished during a specific sprint or iteration. 3. **Historical Periods**: Representing historical eras or periods in a historical timeline. 4. **Product Lifecycles**: Showing different stages in a product's lifecycle (development, launch, growth, maturity). ### Related Event Types - [Milestone events](#milestone-events): For specific point-in-time achievements within a stage. - [Task events](#task-events): For individual tasks that occur within a stage. - [Meeting events](#meeting-events): For meetings that occurred during the stage. --- ### TRANSLATION RESULT Evento di riepilogo della fase (esempio): Un evento di riepilogo della fase è un tipo speciale di evento che rappresenta un riepilogo o una panoramica di una fase nella timeline. Tipicamente copre un periodo di tempo e fornisce una descrizione di alto livello di ciò che è accaduto durante quella fase. ```yaml events: - type: "stage_summary" title: "Fase di Inizializzazione del Progetto" startDate: "2023-01-01" endDate: "2023-03-31" description: "Questa fase ha coinvolto la pianificazione iniziale, la raccolta dei requisiti e la formazione del team per il nuovo progetto." color: "#6c5ce7" icon: "clipboard-list" priority: 1 ``` ### Proprietà - `type` (stringa): Deve essere "stage_summary" per gli eventi di riepilogo della fase. - `title` (stringa): Il titolo del riepilogo della fase. - `startDate` (stringa): La data di inizio della fase in formato ISO (YYYY-MM-DD). - `endDate` (stringa): La data di fine della fase in formato ISO (YYYY-MM-DD). - `description` (stringa): Una descrizione di ciò che è accaduto durante questa fase. - `color` (stringa, opzionale): Il colore per questo evento in formato esadecimale. Predefinito a un colore di sistema se non specificato. - `icon` (stringa, opzionale): L'icona da utilizzare per questo evento. Vedi l'[elenco delle icone](ICONS.md) per le icone disponibili. - `priority` (numero, opzionale): Il livello di priorità di questo evento. Numeri più alti indicano priorità più alta. Predefinito a 0. ### Comportamento di visualizzazione Gli eventi di riepilogo della fase sono tipicamente visualizzati come: - Una barra colorata che copre la durata della fase sulla timeline - Con il titolo e l'icona opzionale visibili - Spesso utilizzati come eventi padre che contengono altri eventi dettagliati all'interno del loro intervallo di tempo ### Casi d'uso di esempio 1. **Fasi del progetto**: Rappresentazione delle fasi di inizializzazione, pianificazione, esecuzione e chiusura di un progetto. 2. **Sprint di sviluppo**: Riepilogo di ciò che è stato realizzato durante uno sprint o iterazione specifica. 3. **Periodi storici**: Rappresentazione di epoche o periodi storici in una timeline storica. 4. **Cicli di vita del prodotto**: Mostra le diverse fasi del ciclo di vita di un prodotto (sviluppo, lancio, crescita, maturità). ### Tipi di evento correlati - [Eventi milestone](#milestone-events): Per realizzazioni specifiche in un punto nel tempo all'interno di una fase. - [Eventi task](#task-events): Per singoli compiti che si verificano all'interno di una fase. - [Eventi meeting](#meeting-events): Per riunioni che si sono verificate durante la fase. - ### Notes & Best Practices: - **Translation Quality**: While the service provides high-quality translations, it's important to review critical translations, especially for professional or academic use. - **File Size**: Large files may take longer to process. Consider breaking very large documents into smaller parts. - **Formatting**: Some complex formatting might not be preserved perfectly. Simple, text-based documents translate best. - **Privacy**: Be mindful of sensitive information. While the service is secure, avoid translating highly confidential documents through any online service. - **Supported Languages**: Check the list of supported languages before processing your documents. --- ### TRANSLATION RESULT ### Note & Best Practices - **Qualità della traduzione**: Sebbene il servizio fornisca traduzioni di alta qualità, è importante rivedere le traduzioni critiche, specialmente per uso professionale o accademico. - **Dimensione del file**: I file di grandi dimensioni potrebbero richiedere più tempo per essere elaborati. Considera di suddividere documenti molto grandi in parti più piccole. - **Formattazione**: Alcune formattazioni complesse potrebbero non essere preservate perfettamente. I documenti semplici basati su testo si traducono al meglio. - **Privacy**: Sii consapevole delle informazioni sensibili. Sebbene il servizio sia sicuro, evita di tradurre documenti altamente confidenziali attraverso qualsiasi servizio online. - **Lingue supportate**: Controlla l'elenco delle lingue supportate prima di elaborare i tuoi documenti. - ### Notes & Best Practices: - **Translation Quality**: While the service provides high-quality translations, it's important to review critical translations, especially for professional or academic use. - **File Size**: Large files may take longer to process. Consider breaking very large documents into smaller parts. - **Formatting**: Some complex formatting might not be preserved perfectly. Simple, text-based documents translate best. - **Privacy**: Be mindful of sensitive information. While the service is secure, avoid translating highly confidential documents through any online service. - **Supported Languages**: Check the list of supported languages before processing your documents. --- ### TRANSLATION RESULT ### Note & Best Practices - **Qualità della traduzione**: Sebbene il servizio fornisca traduzioni di alta qualità, è importante rivedere le traduzioni critiche, specialmente per uso professionale o accademico. - **Dimensione del file**: I file di grandi dimensioni potrebbero richiedere più tempo per essere elaborati. Considera di suddividere documenti molto grandi in parti più piccole. - **Formattazione**: Alcune formattazioni complesse potrebbero non essere preservate perfettamente. I documenti semplici basati su testo si traducono al meglio. - **Privacy**: Sii consapevole delle informazioni sensibili. Sebbene il servizio sia sicuro, evita di tradurre documenti altamente confidenziali attraverso qualsiasi servizio online. - **Lingue supportate**: Controlla l'elenco delle lingue supportate prima di elaborare i tuoi documenti. - ### Notes & Best Practices: - **Translation Quality**: While the service provides high-quality translations, it's important to review critical translations, especially for professional or academic use. - **File Size**: Large files may take longer to process. Consider breaking very large documents into smaller parts. - **Formatting**: Some complex formatting might not be preserved perfectly. Simple, text-based documents translate best. - **Privacy**: Be mindful of sensitive information. While the service is secure, avoid translating highly confidential documents through any online service. - **Supported Languages**: Check the list of supported languages before processing your documents. --- ### TRANSLATION RESULT ### Note & Best Practices - **Qualità della traduzione**: Sebbene il servizio fornisca traduzioni di alta qualità, è importante rivedere le traduzioni critiche, specialmente per uso professionale o accademico. - **Dimensione del file**: I file di grandi dimensioni potrebbero richiedere più tempo per essere elaborati. Considera di suddividere documenti molto grandi in parti più piccule. - **Formattazione**: Alcune formattazioni complesse potrebbero non essere preservate perfettamente. I documenti semplici basati su testo si traducono al meglio. - **Privacy**: Sii consapevole delle informazioni sensibili. Sebbene il servizio sia sicuro, evita di tradurre documenti altamente confidenziali attraverso qualsiasi servizio online. - **Lingue supportate**: Controlla l'elenco delle lingue supportate prima di elaborare i tuoi documenti. - ### Notes & Best Practices: - **Translation Quality**: While the service provides high-quality translations, it's important to review critical translations, especially for professional or academic use. - **File Size**: Large files may take longer to process. Consider breaking very large documents into smaller parts. - **Formatting**: Some complex formatting might not be preserved perfectly. Simple, text-based documents translate best. - **Privacy**: Be mindful of sensitive information. While the service is secure, avoid translating highly confidential documents through any online service. - **Supported Languages**: Check the list of supported languages before processing your documents. --- ### TRANSLATION RESULT ### Note & Best Practices - **Qualità della traduzione**: Sebbene il servizio fornisca traduzioni di alta qualità, è importante rivedere le traduzioni critiche, specialmente per uso professionale or accademico. - **Dimensione del file**: I file di grandi dimensioni potrebbero richiedere più tempo per essere elaborati. Considera di suddividere documenti molto grandi in parti più piccule. - **Formattazione**: Alcune formattazioni complesse potrebbero non essere preservate perfettamente. I documenti semplici basati su testo si traducono al meglio. - **Privacy**: Sii consapevole delle informazioni sensibili. Sebbene il servizio sia sicuro, evita di tradurre documenti altamente confidenziali attraverso qualsiasi servizio online. - **Lingue supportate**: Controlla l'elenco delle lingue supportate prima di elaborare i tuoi documenti. - ### Notes & Best Practices: - **Translation Quality**: While the service provides high-quality translations, it's important to review critical translations, especially for professional or academic use. - **File Size**: Large files may take longer to process. Consider breaking very large documents into smaller parts. - **Formatting**: Some complex formatting might not be preserved perfectly. Simple, text-based documents translate best. - **Privacy**: Be mindful of sensitive information. While the service is secure, avoid translating highly confidential documents through any online service. - **Supported Languages**: Check the list of supported languages before processing your documents. --- ### TRANSLATION RESULT ### Note & Best Practices - **Qualità della traduzione**: Sebbene il servizio fornisca traduzioni di alta qualità, è importante rivedere le traduzioni critiche, specialmente per uso professionale o accademico. - **Dimensione del file**: I file di grandi dimensioni potrebbero richiedere più tempo per essere elaborati. Considera di suddividere documenti molto grandi in parti più piccule. - **Formattazione**: Alcune formattazioni complesse potrebbero non essere preservate perfettamente. I documenti semplici basati su testo si traducono al meglio. - **Privacy**: Sii consapevole delle informazioni sensibili. Sebbene il servizio sia sicuro, evita di tradurre documenti altamente confidenziali attraverso qualsiasi servizio online. - **Lingue supportate**: Controlla l'elenco delle lingue supportate prima di elaborare i tuoi documenti. - ### Notes & Best Practices: - **Translation Quality**: While the service provides high-quality translations, it's important to review critical translations, especially for professional or academic use. - **File Size**: Large files may take longer to process. Consider breaking very large documents into smaller parts. - **Formatting**: Some complex formatting might not be preserved perfectly. Simple, text-based documents translate best. - **Privacy**: Be mindful of sensitive information. While the service is secure, avoid translating highly confidential documents through any online service. - **Supported Languages**: Check the list of supported languages before processing your documents. --- ### TRANSLATION RESULT ### Note & Best Practices - **Qualità della traduzione**: Sebbene il servizio fornisca traduzioni di alta qualità, è importante rivedere le traduzioni critiche, specialmente per uso professionale o accademico. - **Dimensione del file**: I file di grandi dimensioni potrebbero richiedere più tempo per essere elaborati. Considera di suddividere documenti molto grandi in parti più piccule. - **Formattazione**: Alcune formattazioni complesse potrebbero non essere preservate perfettamente. I documenti semplici basati su testo si traducono al meglio. - **Privacy**: Sii consapevole delle informazioni sensibles. Sebbene il servizio sia sicuro, evita di tradurre documenti altamente confidenziali attraverso qualsiasi servizio online. - **Lingue supportate**: Controlla l'elenco delle lingue supportate prima di elaborare i tuoi documenti. - ### Notes & Best Practices: - **Translation Quality**: While the service provides high-quality translations, it's important to review critical translations, especially for professional or academic use. - **File Size**: Large files may take longer to process. Consider breaking very large documents into smaller parts. - **Formatting**: Some complex formatting might not be preserved perfectly. Simple, text-based documents translate best. - **Privacy**: Be mindful of sensitive information. While the service is secure, avoid translating highly confidential documents through any online service. - **Supported Languages**: Check the list of supported languages before processing your documents. --- ### TRANSLATION RESULT ### Note & Best Practices - **Qualità della traduzione**: Sebbene il servizio fornisca traduzioni di alta qualità, è importante rivedere le traduzioni critiche, specialmente per uso professionale o accademico. - **Dimensione del file**: I file di grandi dimensioni potrebbero richiedere più tempo per essere elaborati. Considera di suddividere documenti molto grandi in parti più piccule. - **Formattazione**: Alcune formattazioni complesse potrebbero non essere preservate perfettamente. I documenti semplici basati su testo si traducono al meglio. - **Privacy**: Sii consapevole delle informazioni sensibili. Sebbene il servizio sia sicuro, evita di tradurre documenti altamente confidenziali attraverso qualsiasi servizio online. - **Lingue supportate**: Controlla l'elenco delle lingue supportate prima di elaborare i tuoi documenti.
pt: json { "type": "stage_summary", "stage": "translation", "status": "completed", "progress": 100, "details": { "total_pages": 10, "translated_pages": 10, "elapsed_time": "00:05:30" } } ``` Page processing event (example): ```json { "type": "page_processing", "page_number": 5, "status": "completed", "details": { "translated_text": "This is the translated content of page 5...", "source_text": "This is the original content of page 5...", "elapsed_time": "00:00:45" } } ``` Error event (example): ```json { "type": "error", "stage": "translation", "error_code": "translation_failed", "error_message": "Failed to translate page 5 due to network error.", "details": { "page_number": 5, "suggestion": "Please check your internet connection and try again." } } ``` --- ### OUTPUT LANGUAGE pt --- ### OUTPUT Evento de resumo de estágio (exemplo): ```json { "type": "stage_summary", "stage": "translation", "status": "completed", "progress": 100, "details": { "total_pages": 10, "translated_pages": 10, "elapsed_time": "00:05:30" } } ``` Evento de processamento de página (exemplo): ```json { "type": "page_processing", "page_number": 5, "status": "completed", "details": { "translated_text": "Este é o conteúdo traduzido da página 5...", "source_text": "Este é o conteúdo original da página 5...", "elapsed_time": "00:00:45" } } ``` Evento de erro (exemplo): ```json { "type": "error", "stage": "translation", "error_code": "translation_failed", "error_message": "Falha ao traduzir a página 5 devido a erro de rede.", "details": { "page_number": 5, "suggestion": "Por favor, verifique sua conexão com a internet e tente novamente." } }
ru: This event is emitted when a processing stage (e.g., OCR, translation) completes for a document. It provides a summary of the stage's execution. Event type: `stage_summary` Example event data: ```json { "type": "stage_summary", "data": { "jobId": "550e8400-e29b-41d4-a716-446655440000", "stage": "ocr", "status": "completed", "duration": 1250, "pagesProcessed": 10, "metrics": { "charactersRecognized": 4520, "confidence": 0.92 }, "warnings": [ "Low confidence on page 3", "Page 7 required manual review" ] }, "timestamp": "2023-10-05T14:30:00.000Z" } ``` Field descriptions: - **jobId**: Unique identifier for the document processing job - **stage**: Name of the processing stage (e.g., "ocr", "translation", "formatting") - **status**: Stage completion status ("completed", "failed", "skipped") - **duration**: Stage execution time in milliseconds - **pagesProcessed**: Number of pages processed in this stage - **metrics**: Stage-specific performance metrics - **warnings**: Array of warning messages generated during stage execution --- ### TRANSLATION RESULT ### Сводное событие этапа (пример) Это событие генерируется при завершении этапа обработки (например, OCR, перевод) для документа. Оно предоставляет сводку выполнения этапа. Тип события: `stage_summary` Пример данных события: ```json { "type": "stage_summary", "data": { "jobId": "550e8400-e29b-41d4-a716-446655440000", "stage": "ocr", "status": "completed", "duration": 1250, "pagesProcessed": 10, "metrics": { "charactersRecognized": 4520, "confidence": 0.92 }, "warnings": [ "Low confidence on page 3", "Page 7 required manual review" ] }, "timestamp": "2023-10-05T14:30:00.000Z" } ``` Описание полей: - **jobId**: Уникальный идентификатор задания обработки документа - **stage**: Название этапа обработки (например, "ocr", "translation", "formatting") - **status**: Статус завершения этапа ("completed", "failed", "skipped") - **duration**: Время выполнения этапа в миллисекундах - **pagesProcessed**: Количество страниц, обработанных на этом этапе - **metrics**: Этап-специфичные метрики производительности - **warnings**: Массив предупреждающих сообщений, сгенерированных во время выполнения этапа - ### Cancellation: If you cancel your subscription, you will still have access to the features of the plan you paid for until the end of your billing period. We do not provide refunds for subscription cancellations. --- ### OUTPUT LANGUAGE ru --- ### BYPASS LIST - pdf2zh - PDFMathTranslate - --- --- ### ORIGINAL TEXT Stage summary event (example): This event is emitted when a processing stage (e.g., OCR, translation) completes for a document. It provides a summary of the stage's execution. Event type: `stage_summary` Example event data: ```json { "type": "stage_summary", "data": { "jobId": "550e8400-e29b-41d4-a716-446655440000", "stage": "ocr", "status": "completed", "duration": 1250, "pagesProcessed": 10, "metrics": { "charactersRecognized": 4520, "confidence": 0.92 }, "warnings": [ "Low confidence on page 3", "Page 7 required manual review" ] }, "timestamp": "2023-10-05T14:30:00.000Z" } ``` Field descriptions: - **jobId**: Unique identifier for the document processing job - **stage**: Name of the processing stage (e.g., "ocr", "translation", "formatting") - **status**: Stage completion status ("completed", "failed", "skipped") - **duration**: Stage execution time in milliseconds - **pagesProcessed**: Number of pages processed in this stage - **metrics**: Stage-specific performance metrics - **warnings**: Array of warning messages generated during stage execution --- ### TRANSLATION RESULT ### Сводное событие этапа (пример) Это событие генерируется при завершении этапа обработки (например, OCR, перевод) для документа. Оно предоставляет сводку выполнения этапа. Тип события: `stage_summary` Пример данных события: ```json { "type": "stage_summary", "data": { "jobId": "550e8400-e29b-41d4-a716-446655440000", "stage": "ocr", "status": "completed", "duration": 1250, "pagesProcessed": 10, "metrics": { "charactersRecognized": 4520, "confidence": 0.92 }, "warnings": [ "Low confidence on page 3", "Page 7 required manual review" ] }, "timestamp": "2023-10-05T14:30:00.000Z" } ``` Описание полей: - **jobId**: Уникальный идентификатор задания обработки документа - **stage**: Название этапа обработки (например, "ocr", "translation", "formatting") - **status**: Статус завершения этапа ("completed", "failed", "skipped") - **duration**: Время выполнения этапа в миллисекундах - **pagesProcessed**: Количество страниц, обработанных на этом этапе - **metrics**: Этап-специфичные метрики производительности - **warnings**: Массив предупреждающих сообщений, сгенерированных во время выполнения этапа
