Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_A3203F6A
source: | `--enhance-compatibility` | Enable all compatibility enhancement options | `pdf2zh_next example.pdf --enhance-compatibility` |
de: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--enhance-compatibility-ocr` | Enable OCR compatibility enhancement | `pdf2zh_next example.pdf --enhance-compatibility-ocr` | | `--enhance-compatibility-math` | Enable LaTeX math compatibility enhancement | `pdf2zh_next example.pdf --enhance-compatibility-math` | | `--enhance-compatibility-table` | Enable table compatibility enhancement | `pdf2zh_next example.pdf --enhance-compatibility-table` | | `--enhance-compatibility-image` | Enable image compatibility enhancement | `pdf2zh_next example.pdf --enhance-compatibility-image` | | `--enhance-compatibility-font` | Enable font compatibility enhancement | `pdf2zh_next example.pdf --enhance-compatibility-font` | | `--enhance-compatibility-color` | Enable color compatibility enhancement | `pdf2zh_next example.pdf --enhance-compatibility-color` | | `--enhance-compatibility-link` | Enable hyperlink compatibility enhancement | `pdf2zh_next example.pdf --enhance-compatibility-link` | | `--enhance-compatibility-list` | Enable list compatibility enhancement | `pdf2zh_next example.pdf --enhance-compatibility-list` | | `--enhance-compatibility-other` | Enable other compatibility enhancement options | `pdf2zh_next example.pdf --enhance-compatibility-other` | | `--enhance-compatibility-none` | Disable all compatibility enhancement options | `pdf2zh_next example.pdf --enhance-compatibility-none` | | `--enhance-compatibility-all` | Enable all compatibility enhancement options (same as `--enhance-compatibility`) | `pdf2zh_next example.pdf --enhance-compatibility-all` | --- ### TRANSLATION RESULT | `--enhance-compatibility` | Aktiviert alle Kompatibilitätsverbesserungsoptionen | `pdf2zh_next example.pdf --enhance-compatibility` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--enhance-compatibility-ocr` | Aktiviert OCR-Kompatibilitätsverbesserung | `pdf2zh_next example.pdf --enhance-compatibility-ocr` | | `--enhance-compatibility-math` | Aktiviert LaTeX-Mathematik-Kompatibilitätsverbesserung | `pdf2zh_next example.pdf --enhance-compatibility-math` | | `--enhance-compatibility-table` | Aktiviert Tabellen-Kompatibilitätsverbesserung | `pdf2zh_next example.pdf --enhance-compatibility-table` | | `--enhance-compatibility-image` | Aktiviert Bild-Kompatibilitätsverbesserung | `pdf2zh_next example.pdf --enhance-compatibility-image` | | `--enhance-compatibility-font` | Aktiviert Schriftart-Kompatibilitätsverbesserung | `pdf2zh_next example.pdf --enhance-compatibility-font` | | `--enhance-compatibility-color` | Aktiviert Farb-Kompatibilitätsverbesserung | `pdf2zh_next example.pdf --enhance-compatibility-color` | | `--enhance-compatibility-link` | Aktiviert Hyperlink-Kompatibilitätsverbesserung | `pdf2zh_next example.pdf --enhance-compatibility-link` | | `--enhance-compatibility-list` | Aktiviert Listen-Kompatibilitätsverbesserung | `pdf2zh_next example.pdf --enhance-compatibility-list` | | `--enhance-compatibility-other` | Aktiviert andere Kompatibilitätsverbesserungsoptionen | `pdf2zh_next example.pdf --enhance-compatibility-other` | | `--enhance-compatibility-none` | Deaktiviert alle Kompatibilitätsverbesserungsoptionen | `pdf2zh_next example.pdf --enhance-compatibility-none` | | `--enhance-compatibility-all` | Aktiviert alle Kompatibilitätsverbesserungsoptionen (gleich wie `--enhance-compatibility`) | `pdf2zh_next example.pdf --enhance-compatibility-all` |
fr: | :------------------------------ | :-------------------------------------------------------------------------------------- | :-------------------------------------------------------------------------------------------------------------------- | | `--no-enhance-compatibility` | Disable all compatibility enhancement options | `pdf2zh_next example.pdf --no-enhance-compatibility` | | `--enhance-text-compatibility` | Enable text compatibility enhancement | `pdf2zh_next example.pdf --enhance-text-compatibility` | | `--no-enhance-text-compatibility` | Disable text compatibility enhancement | `pdf2zh_next example.pdf --no-enhance-text-compatibility` | | `--enhance-table-compatibility` | Enable table compatibility enhancement | `pdf2zh_next example.pdf --enhance-table-compatibility` | | `--no-enhance-table-compatibility` | Disable table compatibility enhancement | `pdf2zh_next example.pdf --no-enhance-table-compatibility` | | `--enhance-equation-compatibility` | Enable equation compatibility enhancement | `pdf2zh_next example.pdf --enhance-equation-compatibility` | | `--no-enhance-equation-compatibility` | Disable equation compatibility enhancement | `pdf2zh_next example.pdf --no-enhance-equation-compatibility` | --- ### TRANSLATION RESULT | `--enhance-compatibility` | Activer toutes les options d'amélioration de la compatibilité | `pdf2zh_next example.pdf --enhance-compatibility` | | :------------------------------ | :------------------------------------------------------------------------------------------------------- | :-------------------------------------------------------------------------------------------------------------------- | | `--no-enhance-compatibility` | Désactiver toutes les options d'amélioration de la compatibilité | `pdf2zh_next example.pdf --no-enhance-compatibility` | | `--enhance-text-compatibility` | Activer l'amélioration de la compatibilité du texte | `pdf2zh_next example.pdf --enhance-text-compatibility` | | `--no-enhance-text-compatibility` | Désactiver l'amélioration de la compatibilité du texte | `pdf2zh_next example.pdf --no-enhance-text-compatibility` | | `--enhance-table-compatibility` | Activer l'amélioration de la compatibilité des tableaux | `pdf2zh_next example.pdf --enhance-table-compatibility` | | `--no-enhance-table-compatibility` | Désactiver l'amélioration de la compatibilité des tableaux | `pdf2zh_next example.pdf --no-enhance-table-compatibility` | | `--enhance-equation-compatibility` | Activer l'amélioration de la compatibilité des équations | `pdf2zh_next example.pdf --enhance-equation-compatibility` | | `--no-enhance-equation-compatibility` | Désactiver l'amélioration de la compatibilité des équations | `pdf2zh_next example.pdf --no-enhance-equation-compatibility` |
it: [Advanced](ADVANCED.md) | | `--disable-compatibility` | Disable all compatibility enhancement options | `pdf2zh_next example.pdf --disable-compatibility` | [Advanced](ADVANCED.md) | | `--enable-<option>` | Enable a specific compatibility enhancement option | `pdf2zh_next example.pdf --enable-keep-original-font` | [Advanced](ADVANCED.md) | | `--disable-<option>` | Disable a specific compatibility enhancement option | `pdf2zh_next example.pdf --disable-keep-original-font` | [Advanced](ADVANCED.md) | --- ### OUTPUT LANGUAGE it
pt: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--enhance-compatibility-after` | Enable all compatibility enhancement options after translation | `pdf2zh_next example.pdf --enhance-compatibility-after` | | `--enhance-compatibility-both` | Enable all compatibility enhancement options before and after translation | `pdf2zh_next example.pdf --enhance-compatibility-both` | | `--enhance-compatibility-none` | Disable all compatibility enhancement options | `pdf2zh_next example.pdf --enhance-compatibility-none` | --- ### TRANSLATED TEXT | `--enhance-compatibility` | Ativar todas as opções de melhoria de compatibilidade | `pdf2zh_next example.pdf --enhance-compatibility` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--enhance-compatibility-after` | Ativar todas as opções de melhoria de compatibilidade após a tradução | `pdf2zh_next example.pdf --enhance-compatibility-after` | | `--enhance-compatibility-both` | Ativar todas as opções de melhoria de compatibilidade antes e após a tradução | `pdf2zh_next example.pdf --enhance-compatibility-both` | | `--enhance-compatibility-none` | Desativar todas as opções de melhoria de compatibilidade | `pdf2zh_next example.pdf --enhance-compatibility-none` |
ru: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--enhance-compatibility-ocr` | Enable OCR compatibility enhancement | `pdf2zh_next example.pdf --enhance-compatibility-ocr` | | `--enhance-compatibility-layout`| Enable layout compatibility enhancement | `pdf2zh_next example.pdf --enhance-compatibility-layout` | | `--enhance-compatibility-font` | Enable font compatibility enhancement | `pdf2zh_next example.pdf --enhance-compatibility-font` | | `--enhance-compatibility-math` | Enable math compatibility enhancement | `pdf2zh_next example.pdf --enhance-compatibility-math` | | `--enhance-compatibility-table` | Enable table compatibility enhancement | `pdf2zh_next example.pdf --enhance-compatibility-table` | --- ### OUTPUT | `--enhance-compatibility` | Включить все опции повышения совместимости | `pdf2zh_next example.pdf --enhance-compatibility` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--enhance-compatibility-ocr` | Включить повышение совместимости OCR | `pdf2zh_next example.pdf --enhance-compatibility-ocr` | | `--enhance-compatibility-layout`| Включить повышение совместимости макета | `pdf2zh_next example.pdf --enhance-compatibility-layout` | | `--enhance-compatibility-font` | Включить повышение совместимости шрифтов | `pdf2zh_next example.pdf --enhance-compatibility-font` | | `--enhance-compatibility-math` | Включить повышение совместимости математики | `pdf2zh_next example.pdf --enhance-compatibility-math` | | `--enhance-compatibility-table` | Включить повышение совместимости таблиц | `pdf2zh_next example.pdf --enhance-compatibility-table` |

# chunk_DF7A3C7D
source: | `--use-alternating-pages-dual` | Use alternating pages mode for dual PDF | `pdf2zh_next example.pdf --use-alternating-pages-dual` |
de: | :------------------------------ | :-------------------------------------------------------------------------------------- | :-------------------------------------------------------------------------------------------------------------------- | | `--use-alternating-pages-split` | Use alternating pages mode for split PDF | `pdf2zh_next example.pdf --use-alternating-pages-split` | | `--use-paragraphs` | Use paragraph mode (default) | `pdf2zh_next example.pdf --use-paragraphs` | | `--use-tables` | Use table mode | `pdf2zh_next example.pdf --use-tables` | | `--use-tables-only` | Use table mode only | `pdf2zh_next example.pdf --use-tables-only` | | `--use-lines` | Use line mode | `pdf2zh_next example.pdf --use-lines` | | `--use-lines-only` | Use line mode only | `pdf2zh_next example.pdf --use-lines-only` | | `-d`, `--dictionary` | Path to custom dictionary file | `pdf2zh_next example.pdf -d ./dictionary.txt` | | `-c`, `--config` | Path to config file | `pdf2zh_next example.pdf -c ./config.json` | | `-s`, `--source-lang` | Source language code (default: "auto") | `pdf2zh_next example.pdf -s en` | | `-t`, `--target-lang` | Target language code (default: "zh") | `pdf2zh_next example.pdf -t ja` | | `-f`, `--format` | Output format, one of: "pdf", "docx", "txt", "markdown", "json" (default: "pdf") | `pdf2zh_next example.pdf -f docx` | | `-p`, `--provider` | Translation provider, one of: "google", "openai", "azure", "deepl", "youdao", "baidu" | `pdf2zh_next example.pdf -p openai` | | `-k`, `--api-key` | API key for translation provider | `pdf2zh_next example.pdf -p openai -k YOUR_OPENAI_API_KEY` | | `-o`, `--output` | Output file path | `pdf2zh_next example.pdf -o ./output.pdf` | | `--threads` | Number of threads to use (default: 4) | `pdf2zh_next example.pdf --threads 8` | | `--timeout` | Timeout for each translation request in seconds (default: 30) | `pdf2zh_next example.pdf --timeout 60` | | `--retry` | Number of retries for failed translations (default: 3) | `pdf2zh_next example.pdf --retry 5` | | `--batch-size` | Number of paragraphs to translate in each batch (default: 10) | `pdf2zh_next example.pdf --batch-size 20` | | `--dry-run` | Perform a dry run without actual translation | `pdf2zh_next example.pdf --dry-run` | | `--verbose` | Enable verbose output | `pdf2zh_next example.pdf --verbose` | | `--version` | Show version information | `pdf2zh_next --version` | | `-h`, `--help` | Show help message | `pdf2zh_next -h` | --- ### OUTPUT | `--use-alternating-pages-dual` | Verwende den Wechselseitenmodus für doppelseitige PDFs | `pdf2zh_next example.pdf --use-alternating-pages-dual` | | :------------------------------ | :------------------------------------------------------------------------------------------------------ | :-------------------------------------------------------------------------------------------------------------------- | | `--use-alternating-pages-split` | Verwende den Wechselseitenmodus für geteilte PDFs | `pdf2zh_next example.pdf --use-alternating-pages-split` | | `--use-paragraphs` | Verwende den Absatzmodus (Standard) | `pdf2zh_next example.pdf --use-paragraphs` | | `--use-tables` | Verwende den Tabellenmodus | `pdf2zh_next example.pdf --use-tables` | | `--use-tables-only` | Verwende nur den Tabellenmodus | `pdf2zh_next example.pdf --use-tables-only` | | `--use-lines` | Verwende den Zeilenmodus | `pdf2zh_next example.pdf --use-lines` | | `--use-lines-only` | Verwende nur den Zeilenmodus | `pdf2zh_next example.pdf --use-lines-only` | | `-d`, `--dictionary` | Pfad zur benutzerdefinierten Wörterbuchdatei | `pdf2zh_next example.pdf -d ./dictionary.txt` | | `-c`, `--config` | Pfad zur Konfigurationsdatei | `pdf2zh_next example.pdf -c ./config.json` | | `-s`, `--source-lang` | Quellsprachcode (Standard: "auto") | `pdf2zh_next example.pdf -s en` | | `-t`, `--target-lang` | Zielsprachcode (Standard: "zh") | `pdf2zh_next example.pdf -t ja` | | `-f`, `--format` | Ausgabeformat, eines von: "pdf", "docx", "txt", "markdown", "json" (Standard: "pdf") | `pdf2zh_next example.pdf -f docx` | | `-p`, `--provider` | Übersetzungsanbieter, einer von: "google", "openai", "azure", "deepl", "youdao", "baidu" | `pdf2zh_next example.pdf -p openai` | | `-k`, `--api-key` | API-Schlüssel für den Übersetzungsanbieter | `pdf2zh_next example.pdf -p openai -k YOUR_OPENAI_API_KEY` | | `-o`, `--output` | Ausgabedateipfad | `pdf2zh_next example.pdf -o ./output.pdf` | | `--threads` | Anzahl der zu verwendenden Threads (Standard: 4) | `pdf2zh_next example.pdf --threads 8` | | `--timeout` | Timeout für jede Übersetzungsanfrage in Sekunden (Standard: 30) | `pdf2zh_next example.pdf --timeout 60` | | `--retry` | Anzahl der Wiederholungsversuche für fehlgeschlagene Übersetzungen (Standard: 3) | `pdf2zh_next example.pdf --retry 5` | | `--batch-size` | Anzahl der Absätze, die in jedem Batch übersetzt werden sollen (Standard: 10) | `pdf2zh_next example.pdf --batch-size 20` | | `--dry-run` | Führe einen Probelauf ohne tatsächliche Übersetzung durch | `pdf2zh_next example.pdf --dry-run` | | `--verbose` | Aktiviere ausführliche Ausgabe | `pdf2zh_next example.pdf --verbose` | | `--version` | Zeige Versionsinformationen | `pdf2zh_next --version` | | `-h`, `--help` | Zeige Hilfenachricht | `pdf2zh_next -h` |
fr: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--use-alternating-pages-single` | Use alternating pages mode for single PDF | `pdf2zh_next example.pdf --use-alternating-pages-single` | --- ### TRANSLATION RESULT | `--use-alternating-pages-dual` | Utiliser le mode pages alternées pour PDF double | `pdf2zh_next example.pdf --use-alternating-pages-dual` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--use-alternating-pages-single` | Utiliser le mode pages alternées pour PDF simple | `pdf2zh_next example.pdf --use-alternating-pages-single` |
it: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--use-alternating-pages-single`| Use alternating pages mode for single PDF | `pdf2zh_next example.pdf --use-alternating-pages-single` | | `--use-layout-analyzer` | Use layout analyzer to separate text blocks | `pdf2zh_next example.pdf --use-layout-analyzer` | | `--use-layout-analyzer-single` | Use layout analyzer to separate text blocks for single PDF | `pdf2zh_next example.pdf --use-layout-analyzer-single` | | `--use-layout-analyzer-dual` | Use layout analyzer to separate text blocks for dual PDF | `pdf2zh_next example.pdf --use-layout-analyzer-dual` | | `--use-layout-analyzer-mixed` | Use layout analyzer to separate text blocks for mixed PDF | `pdf2zh_next example.pdf --use-layout-analyzer-mixed` | --- ### TRANSLATION LANGUAGE it
pt: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--use-alternating-pages-single` | Use alternating pages mode for single PDF | `pdf2zh_next example.pdf --use-alternating-pages-single` | | `--use-alternating-pages` | Use alternating pages mode | `pdf2zh_next example.pdf --use-alternating-pages` | | `--use-vertical-text` | Use vertical text mode | `pdf2zh_next example.pdf --use-vertical-text` | | `--use-vertical-text-dual` | Use vertical text mode for dual PDF | `pdf2zh_next example.pdf --use-vertical-text-dual` | | `--use-vertical-text-single` | Use vertical text mode for single PDF | `pdf2zh_next example.pdf --use-vertical-text-single` | --- ### TRANSLATED TEXT | `--use-alternating-pages-dual` | Usar modo de páginas alternadas para PDF duplo | `pdf2zh_next example.pdf --use-alternating-pages-dual` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--use-alternating-pages-single` | Usar modo de páginas alternadas para PDF único | `pdf2zh_next example.pdf --use-alternating-pages-single` | | `--use-alternating-pages` | Usar modo de páginas alternadas | `pdf2zh_next example.pdf --use-alternating-pages` | | `--use-vertical-text` | Usar modo de texto vertical | `pdf2zh_next example.pdf --use-vertical-text` | | `--use-vertical-text-dual` | Usar modo de texto vertical para PDF duplo | `pdf2zh_next example.pdf --use-vertical-text-dual` | | `--use-vertical-text-single` | Usar modo de texto vertical para PDF único | `pdf2zh_next example.pdf --use-vertical-text-single` |
ru: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--use-alternating-pages-single` | Use alternating pages mode for single PDF | `pdf2zh_next example.pdf --use-alternating-pages-single` | | `--use-vertical-writing` | Use vertical writing mode (for Japanese, Traditional Chinese, and other vertical texts) | `pdf2zh_next example.pdf --use-vertical-writing` | | `--use-continuous-writing` | Use continuous writing mode (for Japanese, Traditional Chinese, and other vertical texts) | `pdf2zh_next example.pdf --use-continuous-writing` | --- ### TRANSLATION RESULT | `--use-alternating-pages-dual` | Использовать режим чередования страниц для двойного PDF | `pdf2zh_next example.pdf --use-alternating-pages-dual` | | ------------------------------- | ------------------------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--use-alternating-pages-single` | Использовать режим чередования страниц для одиночного PDF | `pdf2zh_next example.pdf --use-alternating-pages-single` | | `--use-vertical-writing` | Использовать режим вертикального письма (для японского, традиционного китайского и других вертикальных текстов) | `pdf2zh_next example.pdf --use-vertical-writing` | | `--use-continuous-writing` | Использовать режим непрерывного письма (для японского, традиционного китайского и других вертикальных текстов) | `pdf2zh_next example.pdf --use-continuous-writing` |
