Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_EE138D1A
source: | `--skip-clean` | Skip PDF cleaning step | `pdf2zh_next example.pdf --skip-clean` |
de: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--skip-translation` | Skip the translation step | `pdf2zh_next example.pdf --skip-translation` | | `--skip-ocr` | Skip the OCR step (if the document contains images, OCR will still be performed) | `pdf2zh_next example.pdf --skip-ocr` | | `--skip-clean-format` | Skip PDF cleaning and formatting step | `pdf2zh_next example.pdf --skip-clean-format` | | `--skip-extract` | Skip the text extraction step (requires the input to be an already extracted JSON file) | `pdf2zh_next example.json --skip-extract` | | `--skip-reconstruction` | Skip the reconstruction step (requires the input to be an already translated JSON file) | `pdf2zh_next example.json --skip-reconstruction` | | `--skip-save` | Skip the saving step (only output to stdout) | `pdf2zh_next example.pdf --skip-save` | | `--translate-to <language>` | Set the translation target language (default: zh) | `pdf2zh_next example.pdf --translate-to en` | | `--translate-service <service>` | Set the translation service (default: google) | `pdf2zh_next example.pdf --translate-service google` | | `--translate-options <options>` | Set the translation options (JSON string) | `pdf2zh_next example.pdf --translate-options '{"timeout": 10, "retries": 3}'` | | `--translate-key <key>` | Set the translation API key (if required) | `pdf2zh_next example.pdf --translate-key <your-api-key>` | | `--ocr-language <language>` | Set the OCR language (default: eng) | `pdf2zh_next example.pdf --ocr-language eng+chi_sim` | | `--ocr-options <options>` | Set the OCR options (JSON string) | `pdf2zh_next example.pdf --ocr-options '{"tesseract_path": "/usr/bin/tesseract", "tessdata_dir": "/usr/share/tesseract-ocr/4.00/tessdata"}'` | | `--output-dir <dir>` | Set the output directory (default: current directory) | `pdf2zh_next example.pdf --output-dir ./output` | | `--output-name <name>` | Set the output filename (without extension) | `pdf2zh_next example.pdf --output-name translated` | | `--output-format <format>` | Set the output format (pdf, json, txt, all; default: pdf) | `pdf2zh_next example.pdf --output-format all` | | `--output-options <options>` | Set the output options (JSON string) | `pdf2zh_next example.pdf --output-options '{"pdf": {"compress": true}, "json": {"indent": 2}}'` | | `--log-level <level>` | Set the log level (debug, info, warning, error, critical; default: info) | `pdf2zh_next example.pdf --log-level debug` | | `--log-file <file>` | Set the log file (default: stdout) | `pdf2zh_next example.pdf --log-file ./log.txt` | | `--config <file>` | Set the config file (JSON or YAML) | `pdf2zh_next example.pdf --config ./config.json` | | `--version` | Show the version | `pdf2zh_next --version` | | `--help` | Show the help message | `pdf2zh_next --help` | --- ### TRANSLATION | `--skip-clean` | Überspringe den PDF-Bereinigungsschritt | `pdf2zh_next example.pdf --skip-clean` | | ------------------------------- | ------------------------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--skip-translation` | Überspringe den Übersetzungsschritt | `pdf2zh_next example.pdf --skip-translation` | | `--skip-ocr` | Überspringe den OCR-Schritt (wenn das Dokument Bilder enthält, wird OCR trotzdem durchgeführt) | `pdf2zh_next example.pdf --skip-ocr` | | `--skip-clean-format` | Überspringe den PDF-Bereinigungs- und Formatierungsschritt | `pdf2zh_next example.pdf --skip-clean-format` | | `--skip-extract` | Überspringe den Textextraktionsschritt (erfordert, dass die Eingabe eine bereits extrahierte JSON-Datei ist) | `pdf2zh_next example.json --skip-extract` | | `--skip-reconstruction` | Überspringe den Rekonstruktionsschritt (erfordert, dass die Eingabe eine bereits übersetzte JSON-Datei ist) | `pdf2zh_next example.json --skip-reconstruction` | | `--skip-save` | Überspringe den Speicherschritt (gibt nur an stdout aus) | `pdf2zh_next example.pdf --skip-save` | | `--translate-to <language>` | Setze die Zielsprache für die Übersetzung (Standard: zh) | `pdf2zh_next example.pdf --translate-to en` | | `--translate-service <service>` | Setze den Übersetzungsdienst (Standard: google) | `pdf2zh_next example.pdf --translate-service google` | | `--translate-options <options>` | Setze die Übersetzungsoptionen (JSON-String) | `pdf2zh_next example.pdf --translate-options '{"timeout": 10, "retries": 3}'` | | `--translate-key <key>` | Setze den Übersetzungs-API-Schlüssel (falls erforderlich) | `pdf2zh_next example.pdf --translate-key <your-api-key>` | | `--ocr-language <language>` | Setze die OCR-Sprache (Standard: eng) | `pdf2zh_next example.pdf --ocr-language eng+chi_sim` | | `--ocr-options <options>` | Setze die OCR-Optionen (JSON-String) | `pdf2zh_next example.pdf --ocr-options '{"tesseract_path": "/usr/bin/tesseract", "tessdata_dir": "/usr/share/tesseract-ocr/4.00/tessdata"}'` | | `--output-dir <dir>` | Setze das Ausgabeverzeichnis (Standard: aktuelles Verzeichnis) | `pdf2zh_next example.pdf --output-dir ./output` | | `--output-name <name>` | Setze den Ausgabedateinamen (ohne Erweiterung) | `pdf2zh_next example.pdf --output-name translated` | | `--output-format <format>` | Setze das Ausgabeformat (pdf, json, txt, all; Standard: pdf) | `pdf2zh_next example.pdf --output-format all` | | `--output-options <options>` | Setze die Ausgabeoptionen (JSON-String) | `pdf2zh_next example.pdf --output-options '{"pdf": {"compress": true}, "json": {"indent": 2}}'` | | `--log-level <level>` | Setze den Log-Level (debug, info, warning, error, critical; Standard: info) | `pdf2zh_next example.pdf --log-level debug` | | `--log-file <file>` | Setze die Log-Datei (Standard: stdout) | `pdf2zh_next example.pdf --log-file ./log.txt` | | `--config <file>` | Setze die Konfigurationsdatei (JSON oder YAML) | `pdf2zh_next example.pdf --config ./config.json` | | `--version` | Zeige die Version | `pdf2zh_next --version` | | `--help` | Zeige die Hilfenachricht | `pdf2zh_next --help` |
fr: | :------------------------------ | :-------------------------------------------------------------------------------------- | :-------------------------------------------------------------------------------------------------------------------- | | `--skip-translate` | Skip translation step | `pdf2zh_next example.pdf --skip-translate` | | `--skip-format` | Skip formatting step | `pdf2zh_next example.pdf --skip-format` | | `--skip-math` | Skip math translation step | `pdf2zh_next example.pdf --skip-math` | | `--skip-docx` | Skip DOCX generation step | `pdf2zh_next example.pdf --skip-docx` | | `--skip-pdf` | Skip PDF generation step | `pdf2zh_next example.pdf --skip-pdf` | | `--skip-zip` | Skip ZIP generation step | `pdf2zh_next example.pdf --skip-zip` | | `--skip-embeddings` | Skip embeddings generation step | `pdf2zh_next example.pdf --skip-embeddings` | | `--skip-html` | Skip HTML generation step | `pdf2zh_next example.pdf --skip-html` | | `--skip-epub` | Skip EPUB generation step | `pdf2zh_next example.pdf --skip-epub` | | `--skip-txt` | Skip TXT generation step | `pdf2zh_next example.pdf --skip-txt` | | `--skip-json` | Skip JSON generation step | `pdf2zh_next example.pdf --skip-json` | | `--skip-markdown` | Skip Markdown generation step | `pdf2zh_next example.pdf --skip-markdown` | | `--skip-pptx` | Skip PPTX generation step | `pdf2zh_next example.pdf --skip-pptx` | | `--skip-preview` | Skip preview generation step | `pdf2zh_next example.pdf --skip-preview` | | `--skip-all` | Skip all generation steps except PDF generation (equivalent to `--skip-translate ...`) | `pdf2zh_next example.pdf --skip-all` | | `--skip-all-except-pdf` | Skip all generation steps except PDF generation (equivalent to `--skip-translate ...`) | `pdf2zh_next example.pdf --skip-all-except-pdf` | | `--skip-all-except-docx` | Skip all generation steps except DOCX generation (equivalent to `--skip-translate ...`) | `pdf2zh_next example.pdf --skip-all-except-docx` | | `--skip-all-except-html` | Skip all generation steps except HTML generation (equivalent to `--skip-translate ...`) | `pdf2zh_next example.pdf --skip-all-except-html` | | `--skip-all-except-epub` | Skip all generation steps except EPUB generation (equivalent to `--skip-translate ...`) | `pdf2zh_next example.pdf --skip-all-except-epub` | | `--skip-all-except-txt` | Skip all generation steps except TXT generation (equivalent to `--skip-translate ...`) | `pdf2zh_next example.pdf --skip-all-except-txt` | | `--skip-all-except-json` | Skip all generation steps except JSON generation (equivalent to `--skip-translate ...`) | `pdf2zh_next example.pdf --skip-all-except-json` | | `--skip-all-except-markdown` | Skip all generation steps except Markdown generation (equivalent to `--skip-translate ...`) | `pdf2zh_next example.pdf --skip-all-except-markdown` | | `--skip-all-except-pptx` | Skip all generation steps except PPTX generation (equivalent to `--skip-translate ...`) | `pdf2zh_next example.pdf --skip-all-except-pptx` | | `--skip-all-except-preview` | Skip all generation steps except preview generation (equivalent to `--skip-translate ...`) | `pdf2zh_next example.pdf --skip-all-except-preview` | --- ### TRANSLATION RESULT | `--skip-clean` | Ignorer l'étape de nettoyage du PDF | `pdf2zh_next example.pdf --skip-clean` | | :------------------------------ | :------------------------------------------------------------------------------------------ | :-------------------------------------------------------------------------------------------------------------------- | | `--skip-translate` | Ignorer l'étape de traduction | `pdf2zh_next example.pdf --skip-translate` | | `--skip-format` | Ignorer l'étape de formatage | `pdf2zh_next example.pdf --skip-format` | | `--skip-math` | Ignorer l'étape de traduction des mathématiques | `pdf2zh_next example.pdf --skip-math` | | `--skip-docx` | Ignorer l'étape de génération du DOCX | `pdf2zh_next example.pdf --skip-docx` | | `--skip-pdf` | Ignorer l'étape de génération du PDF | `pdf2zh_next example.pdf --skip-pdf` | | `--skip-zip` | Ignorer l'étape de génération du ZIP | `pdf2zh_next example.pdf --skip-zip` | | `--skip-embeddings` | Ignorer l'étape de génération des embeddings | `pdf2zh_next example.pdf --skip-embeddings` | | `--skip-html` | Ignorer l'étape de génération du HTML | `pdf2zh_next example.pdf --skip-html` | | `--skip-epub` | Ignorer l'étape de génération de l'EPUB | `pdf2zh_next example.pdf --skip-epub` | | `--skip-txt` | Ignorer l'étape de génération du TXT | `pdf2zh_next example.pdf --skip-txt` | | `--skip-json` | Ignorer l'étape de génération du JSON | `pdf2zh_next example.pdf --skip-json` | | `--skip-markdown` | Ignorer l'étape de génération du Markdown | `pdf2zh_next example.pdf --skip-markdown` | | `--skip-pptx` | Ignorer l'étape de génération du PPTX | `pdf2zh_next example.pdf --skip-pptx` | | `--skip-preview` | Ignorer l'étape de génération de l'aperçu | `pdf2zh_next example.pdf --skip-preview` | | `--skip-all` | Ignorer toutes les étapes de génération sauf la génération de PDF (équivalent à `--skip-translate ...`) | `pdf2zh_next example.pdf --skip-all` | | `--skip-all-except-pdf` | Ignorer toutes les étapes de génération sauf la génération de PDF (équivalent à `--skip-translate ...`) | `pdf2zh_next example.pdf --skip-all-except-pdf` | | `--skip-all-except-docx` | Ignorer toutes les étapes de génération sauf la génération de DOCX (équivalent à `--skip-translate ...`) | `pdf2zh_next example.pdf --skip-all-except-docx` | | `--skip-all-except-html` | Ignorer toutes les étapes de génération sauf la génération de HTML (équivalent à `--skip-translate ...`) | `pdf2zh_next example.pdf --skip-all-except-html` | | `--skip-all-except-epub` | Ignorer toutes les étapes de génération sauf la génération de EPUB (équivalent à `--skip-translate ...`) | `pdf2zh_next example.pdf --skip-all-except-epub` | | `--skip-all-except-txt` | Ignorer toutes les étapes de génération sauf la génération de TXT (équivalent à `--skip-translate ...`) | `pdf2zh_next example.pdf --skip-all-except-txt` | | `--skip-all-except-json` | Ignorer toutes les étapes de génération sauf la génération de JSON (équivalent à `--skip-translate ...`) | `pdf2zh_next example.pdf --skip-all-except-json` | | `--skip-all-except-markdown` | Ignorer toutes les étapes de génération sauf la génération de Markdown (équivalent à `--skip-translate ...`) | `pdf2zh_next example.pdf --skip-all-except-markdown` | | `--skip-all-except-pptx` | Ignorer toutes les étapes de génération sauf la génération de PPTX (équivalent à `--skip-translate ...`) | `pdf2zh_next example.pdf --skip-all-except-pptx` | | `--skip-all-except-preview` | Ignorer toutes les étapes de génération sauf la génération de l'aperçu (équivalent à `--skip-translate ...`) | `pdf2zh_next example.pdf --skip-all-except-preview` |
it: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--clean-param` | Parameters for cleaning step | `pdf2zh_next example.pdf --clean-param='{"remove_white_margin":true}'` | | `--skip-translate` | Skip translation step | `pdf2zh_next example.pdf --skip-translate` | | `--translate-param` | Parameters for translation step | `pdf2zh_next example.pdf --translate-param='{"translator":"google","source_lang":"EN","target_lang":"ZH"}'` | | `--skip-reconstruct` | Skip reconstruction step | `pdf2zh_next example.pdf --skip-reconstruct` | | `--reconstruct-param` | Parameters for reconstruction step | `pdf2zh_next example.pdf --reconstruct-param='{"font_file":"/path/to/font.ttf","font_size":12,"line_spacing":1.2}'` | | `--skip-ocr` | Skip OCR step | `pdf2zh_next example.pdf --skip-ocr` | | `--ocr-param` | Parameters for OCR step | `pdf2zh_next example.pdf --ocr-param='{"ocr_engine":"tesseract","lang":"eng"}'` | | `--skip-all` | Skip all steps (equivalent to `--skip-clean --skip-translate --skip-reconstruct --skip-ocr`) | `pdf2zh_next example.pdf --skip-all` | | `--force` | Force overwrite existing files | `pdf2zh_next example.pdf --force` | --- ### TRANSLATION RESULT | `--skip-clean` | Salta il passaggio di pulizia del PDF | `pdf2zh_next example.pdf --skip-clean` | | ------------------------------- | ------------------------------------------------------------------------------------------------------ | --------------------------------------------------------------------------------------------------------------------- | | `--clean-param` | Parametri per il passaggio di pulizia | `pdf2zh_next example.pdf --clean-param='{"remove_white_margin":true}'` | | `--skip-translate` | Salta il passaggio di traduzione | `pdf2zh_next example.pdf --skip-translate` | | `--translate-param` | Parametri per il passaggio di traduzione | `pdf2zh_next example.pdf --translate-param='{"translator":"google","source_lang":"EN","target_lang":"ZH"}'` | | `--skip-reconstruct` | Salta il passaggio di ricostruzione | `pdf2zh_next example.pdf --skip-reconstruct` | | `--reconstruct-param` | Parametri per il passaggio di ricostruzione | `pdf2zh_next example.pdf --reconstruct-param='{"font_file":"/path/to/font.ttf","font_size":12,"line_spacing":1.2}'` | | `--skip-ocr` | Salta il passaggio OCR | `pdf2zh_next example.pdf --skip-ocr` | | `--ocr-param` | Parametri per il passaggio OCR | `pdf2zh_next example.pdf --ocr-param='{"ocr_engine":"tesseract","lang":"eng"}'` | | `--skip-all` | Salta tutti i passaggi (equivalente a `--skip-clean --skip-translate --skip-reconstruct --skip-ocr`) | `pdf2zh_next example.pdf --skip-all` | | `--force` | Forza la sovrascrittura di file esistenti | `pdf2zh_next example.pdf --force` |
pt: |---------------------------------|-----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------| | `--skip-layout` | Skip layout analysis step | `pdf2zh_next example.pdf --skip-layout` | | `--skip-translate` | Skip translation step | `pdf2zh_next example.pdf --skip-translate` | | `--skip-ocr` | Skip OCR step (only for scanned PDFs) | `pdf2zh_next example.pdf --skip-ocr` | | `--skip-export` | Skip export step | `pdf2zh_next example.pdf --skip-export` | | `--skip-split` | Skip splitting step | `pdf2zh_next example.pdf --skip-split` | | `--skip-merge` | Skip merging step | `pdf2zh_next example.pdf --skip-merge` | | `--skip-all` | Skip all steps except the one you specify | `pdf2zh_next example.pdf --skip-all --only-export` | | `--only-clean` | Only perform PDF cleaning step | `pdf2zh_next example.pdf --only-clean` | | `--only-layout` | Only perform layout analysis step | `pdf2zh_next example.pdf --only-layout` | | `--only-translate` | Only perform translation step | `pdf2zh_next example.pdf --only-translate` | | `--only-ocr` | Only perform OCR step (only for scanned PDFs) | `pdf2zh_next example.pdf --only-ocr` | | `--only-export` | Only perform export step | `pdf2zh_next example.pdf --only-export` | | `--only-split` | Only perform splitting step | `pdf2zh_next example.pdf --only-split` | | `--only-merge` | Only perform merging step | `pdf2zh_next example.pdf --only-merge` | --- ### TRANSLATED TEXT | `--skip-clean` | Pular etapa de limpeza do PDF | `pdf2zh_next example.pdf --skip-clean` | |---------------------------------|-----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------| | `--skip-layout` | Pular etapa de análise de layout | `pdf2zh_next example.pdf --skip-layout` | | `--skip-translate` | Pular etapa de tradução | `pdf2zh_next example.pdf --skip-translate` | | `--skip-ocr` | Pular etapa de OCR (apenas para PDFs digitalizados) | `pdf2zh_next example.pdf --skip-ocr` | | `--skip-export` | Pular etapa de exportação | `pdf2zh_next example.pdf --skip-export` | | `--skip-split` | Pular etapa de divisão | `pdf2zh_next example.pdf --skip-split` | | `--skip-merge` | Pular etapa de mesclagem | `pdf2zh_next example.pdf --skip-merge` | | `--skip-all` | Pular todas as etapas, exceto a que você especificar | `pdf2zh_next example.pdf --skip-all --only-export` | | `--only-clean` | Apenas executar a etapa de limpeza do PDF | `pdf2zh_next example.pdf --only-clean` | | `--only-layout` | Apenas executar a etapa de análise de layout | `pdf2zh_next example.pdf --only-layout` | | `--only-translate` | Apenas executar a etapa de tradução | `pdf2zh_next example.pdf --only-translate` | | `--only-ocr` | Apenas executar a etapa de OCR (apenas para PDFs digitalizados) | `pdf2zh_next example.pdf --only-ocr` | | `--only-export` | Apenas executar a etapa de exportação | `pdf2zh_next example.pdf --only-export` | | `--only-split` | Apenas executar a etapa de divisão | `pdf2zh_next example.pdf --only-split` | | `--only-merge` | Apenas executar a etapa de mesclagem | `pdf2zh_next example.pdf --only-merge` |
ru: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--skip-translate` | Skip translation step | `pdf2zh_next example.pdf --skip-translate` | | `--skip-latex` | Skip LaTeX compilation step | `pdf2zh_next example.pdf --skip-latex` | | `--skip-pdf` | Skip PDF generation step | `pdf2zh_next example.pdf --skip-pdf` | | `--skip-all` | Skip all steps except for the first step | `pdf2zh_next example.pdf --skip-all` | | `--clean-only` | Only perform PDF cleaning step | `pdf2zh_next example.pdf --clean-only` | | `--translate-only` | Only perform translation step | `pdf2zh_next example.pdf --translate-only` | | `--latex-only` | Only perform LaTeX compilation step | `pdf2zh_next example.pdf --latex-only` | | `--pdf-only` | Only perform PDF generation step | `pdf2zh_next example.pdf --pdf-only` | | `--no-cache` | Disable cache | `pdf2zh_next example.pdf --no-cache` | | `--cache-dir <dir>` | Specify cache directory | `pdf2zh_next example.pdf --cache-dir ./my_cache` | | `--clean-cache` | Clean cache before processing | `pdf2zh_next example.pdf --clean-cache` | | `--clean-cache-after` | Clean cache after processing | `pdf2zh_next example.pdf --clean-cache-after` | | `--clean-cache-both` | Clean cache before and after processing | `pdf2zh_next example.pdf --clean-cache-both` | | `--force` | Force overwrite existing files | `pdf2zh_next example.pdf --force` | | `--yes` | Automatically answer yes to all prompts | `pdf2zh_next example.pdf --yes` | | `--no` | Automatically answer no to all prompts | `pdf2zh_next example.pdf --no` | | `--verbose` | Enable verbose output | `pdf2zh_next example.pdf --verbose` | | `--quiet` | Disable all output | `pdf2zh_next example.pdf --quiet` | | `--version` | Show version information | `pdf2zh_next --version` | | `--help` | Show help information | `pdf2zh_next --help` | --- ### OUTPUT | `--skip-clean` | Пропустить шаг очистки PDF | `pdf2zh_next example.pdf --skip-clean` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--skip-translate` | Пропустить шаг перевода | `pdf2zh_next example.pdf --skip-translate` | | `--skip-latex` | Пропустить шаг компиляции LaTeX | `pdf2zh_next example.pdf --skip-latex` | | `--skip-pdf` | Пропустить шаг генерации PDF | `pdf2zh_next example.pdf --skip-pdf` | | `--skip-all` | Пропустить все шаги, кроме первого | `pdf2zh_next example.pdf --skip-all` | | `--clean-only` | Выполнить только шаг очистки PDF | `pdf2zh_next example.pdf --clean-only` | | `--translate-only` | Выполнить только шаг перевода | `pdf2zh_next example.pdf --translate-only` | | `--latex-only` | Выполнить только шаг компиляции LaTeX | `pdf2zh_next example.pdf --latex-only` | | `--pdf-only` | Выполнить только шаг генерации PDF | `pdf2zh_next example.pdf --pdf-only` | | `--no-cache` | Отключить кэширование | `pdf2zh_next example.pdf --no-cache` | | `--cache-dir <dir>` | Указать директорию кэша | `pdf2zh_next example.pdf --cache-dir ./my_cache` | | `--clean-cache` | Очистить кэш перед обработкой | `pdf2zh_next example.pdf --clean-cache` | | `--clean-cache-after` | Очистить кэш после обработки | `pdf2zh_next example.pdf --clean-cache-after` | | `--clean-cache-both` | Очистить кэш до и после обработки | `pdf2zh_next example.pdf --clean-cache-both` | | `--force` | Принудительно перезаписать существующие файлы | `pdf2zh_next example.pdf --force` | | `--yes` | Автоматически отвечать «да» на все запросы | `pdf2zh_next example.pdf --yes` | | `--no` | Автоматически отвечать «нет» на все запросы | `pdf2zh_next example.pdf --no` | | `--verbose` | Включить подробный вывод | `pdf2zh_next example.pdf --verbose` | | `--quiet` | Отключить весь вывод | `pdf2zh_next example.pdf --quiet` | | `--version` | Показать информацию о версии | `pdf2zh_next --version` | | `--help` | Показать справочную информацию | `pdf2zh_next --help` |
