Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_694D0450
source: | `--lang-in` | Source language code | `pdf2zh_next example.pdf --lang-in en` |
de: `auto` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | ------------- | | `--lang-out` | Target language code | `pdf2zh_next example.pdf --lang-out zh` | `zh` | | `--translator` | Translation service, see [Documentation of Translation Services](./TRANSLATORS.md) | `pdf2zh_next example.pdf --translator google` | `google` | | `--translator-key` | The API key for the translation service, if required | `pdf2zh_next example.pdf --translator deepl --translator-key YOUR_DEEPL_API_KEY` | | | `--translator-url` | The custom endpoint for the translation service, if required | `pdf2zh_next example.pdf --translator azure --translator-url YOUR_AZURE_ENDPOINT` | | | `--translator-region` | The region for the translation service, if required | `pdf2zh_next example.pdf --translator azure --translator-region YOUR_AZURE_REGION` | | | `--translator-model` | The model for the translation service, if required | `pdf2zh_next example.pdf --translator openai --translator-model gpt-4o` | | | `--translator-extra-params` | Extra parameters for the translation service, if required | `pdf2zh_next example.pdf --translator openai --translator-extra-params '{"temperature": 0.1}'` | | | `--translator-timeout` | Timeout for the translation service, in seconds | `pdf2zh_next example.pdf --translator google --translator-timeout 30` | `10` | | `--translator-max-retries` | Maximum retries for the translation service | `pdf2zh_next example.pdf --translator google --translator-max-retries 3` | `3` | | `--translator-retry-delay` | Delay between retries for the translation service, in seconds | `pdf2zh_next example.pdf --translator google --translator-retry-delay 1` | `1` | | `--translator-concurrent-limit` | Maximum number of concurrent requests to the translation service | `pdf2zh_next example.pdf --translator google --translator-concurrent-limit 10` | `5` | | `--translator-request-interval` | Minimum interval between requests to the translation service, in seconds | `pdf2zh_next example.pdf --translator google --translator-request-interval 0.1` | `0.1` | | `--translator-batch-size` | Batch size for the translation service | `pdf2zh_next example.pdf --translator google --translator-batch-size 10` | `50` | | `--translator-batch-delay` | Delay between batches for the translation service, in seconds | `pdf2zh_next example.pdf --translator google --translator-batch-delay 1` | `1` | --- ### OUTPUT | `--lang-in` | Quellsprachencode | `pdf2zh_next example.pdf --lang-in en` | `auto` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | ------------- | | `--lang-out` | Zielsprachencode | `pdf2zh_next example.pdf --lang-out zh` | `zh` | | `--translator` | Übersetzungsdienst, siehe [Dokumentation der Übersetzungsdienste](./TRANSLATORS.md) | `pdf2zh_next example.pdf --translator google` | `google` | | `--translator-key` | Der API-Schlüssel für den Übersetzungsdienst, falls erforderlich | `pdf2zh_next example.pdf --translator deepl --translator-key YOUR_DEEPL_API_KEY` | | | `--translator-url` | Der benutzerdefinierte Endpunkt für den Übersetzungsdienst, falls erforderlich | `pdf2zh_next example.pdf --translator azure --translator-url YOUR_AZURE_ENDPOINT` | | | `--translator-region` | Die Region für den Übersetzungsdienst, falls erforderlich | `pdf2zh_next example.pdf --translator azure --translator-region YOUR_AZURE_REGION` | | | `--translator-model` | Das Modell für den Übersetzungsdienst, falls erforderlich | `pdf2zh_next example.pdf --translator openai --translator-model gpt-4o` | | | `--translator-extra-params` | Zusätzliche Parameter für den Übersetzungsdienst, falls erforderlich | `pdf2zh_next example.pdf --translator openai --translator-extra-params '{"temperature": 0.1}'` | | | `--translator-timeout` | Timeout für den Übersetzungsdienst, in Sekunden | `pdf2zh_next example.pdf --translator google --translator-timeout 30` | `10` | | `--translator-max-retries` | Maximale Wiederholungsversuche für den Übersetzungsdienst | `pdf2zh_next example.pdf --translator google --translator-max-retries 3` | `3` | | `--translator-retry-delay` | Verzögerung zwischen Wiederholungsversuchen für den Übersetzungsdienst, in Sekunden | `pdf2zh_next example.pdf --translator google --translator-retry-delay 1` | `1` | | `--translator-concurrent-limit` | Maximale Anzahl gleichzeitiger Anfragen an den Übersetzungsdienst | `pdf2zh_next example.pdf --translator google --translator-concurrent-limit 10` | `5` | | `--translator-request-interval` | Mindestintervall zwischen Anfragen an den Übersetzungsdienst, in Sekunden | `pdf2zh_next example.pdf --translator google --translator-request-interval 0.1` | `0.1` | | `--translator-batch-size` | Batch-Größe für den Übersetzungsdienst | `pdf2zh_next example.pdf --translator google --translator-batch-size 10` | `50` | | `--translator-batch-delay` | Verzögerung zwischen Batches für den Übersetzungsdienst, in Sekunden | `pdf2zh_next example.pdf --translator google --translator-batch-delay 1` | `1` |
fr: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--lang-out` | Target language code | `pdf2zh_next example.pdf --lang-out fr` | | `--output`<br/>`-o` | Output file path | `pdf2zh_next example.pdf -o example_fr.pdf` | | `--engine` | Translation engine to use | `pdf2zh_next example.pdf --engine google` | | `--api-key` | API key for translation engine | `pdf2zh_next example.pdf --engine openai --api-key sk-xxx` | | `--model` | Model name for OpenAI or Azure | `pdf2zh_next example.pdf --engine openai --model gpt-4` | | `--api-base` | API base URL for Azure or other OpenAI-compatible APIs | `pdf2zh_next example.pdf --engine azure --api-base https://xxx.openai.azure.com/` | | `--api-version` | API version for Azure | `pdf2zh_next example.pdf --engine azure --api-version 2024-02-01` | | `--concurrency` | Number of concurrent translation requests | `pdf2zh_next example.pdf --concurrency 5` | | `--timeout` | Timeout for each translation request in seconds | `pdf2zh_next example.pdf --timeout 30` | | `--retry` | Number of retries for failed requests | `pdf2zh_next example.pdf --retry 3` | | `--no-cache` | Disable cache | `pdf2zh_next example.pdf --no-cache` | | `--cache-dir` | Directory to store cache files | `pdf2zh_next example.pdf --cache-dir ./cache` | | `--log-level` | Log level (debug, info, warn, error) | `pdf2zh_next example.pdf --log-level debug` | | `--help`<br/>`-h` | Show help | `pdf2zh_next -h` | | `--version`<br/>`-v` | Show version | `pdf2zh_next -v` | | `--list-engines` | List all available translation engines | `pdf2zh_next --list-engines` | | `--list-languages` | List all supported languages | `pdf2zh_next --list-languages` | | `--check-update` | Check for updates | `pdf2zh_next --check-update` | --- ### TRANSLATION RESULT | `--lang-in` | Code de langue source | `pdf2zh_next example.pdf --lang-in en` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--lang-out` | Code de langue cible | `pdf2zh_next example.pdf --lang-out fr` | | `--output`<br/>`-o` | Chemin du fichier de sortie | `pdf2zh_next example.pdf -o example_fr.pdf` | | `--engine` | Moteur de traduction à utiliser | `pdf2zh_next example.pdf --engine google` | | `--api-key` | Clé API pour le moteur de traduction | `pdf2zh_next example.pdf --engine openai --api-key sk-xxx` | | `--model` | Nom du modèle pour OpenAI ou Azure | `pdf2zh_next example.pdf --engine openai --model gpt-4` | | `--api-base` | URL de base de l'API pour Azure ou autres API compatibles OpenAI | `pdf2zh_next example.pdf --engine azure --api-base https://xxx.openai.azure.com/` | | `--api-version` | Version de l'API pour Azure | `pdf2zh_next example.pdf --engine azure --api-version 2024-02-01` | | `--concurrency` | Nombre de requêtes de traduction simultanées | `pdf2zh_next example.pdf --concurrency 5` | | `--timeout` | Délai d'attente pour chaque requête de traduction en secondes | `pdf2zh_next example.pdf --timeout 30` | | `--retry` | Nombre de tentatives pour les requêtes échouées | `pdf2zh_next example.pdf --retry 3` | | `--no-cache` | Désactiver le cache | `pdf2zh_next example.pdf --no-cache` | | `--cache-dir` | Répertoire pour stocker les fichiers de cache | `pdf2zh_next example.pdf --cache-dir ./cache` | | `--log-level` | Niveau de journalisation (debug, info, warn, error) | `pdf2zh_next example.pdf --log-level debug` | | `--help`<br/>`-h` | Afficher l'aide | `pdf2zh_next -h` | | `--version`<br/>`-v` | Afficher la version | `pdf2zh_next -v` | | `--list-engines` | Lister tous les moteurs de traduction disponibles | `pdf2zh_next --list-engines` | | `--list-languages` | Lister toutes les langues supportées | `pdf2zh_next --list-languages` | | `--check-update` | Vérifier les mises à jour | `pdf2zh_next --check-update` |
it: [Supported Languages](https://pdf2zh-next.com/getting-started/SUPPORTED_LANGUAGES.html) | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------- | | `--lang-out` | Target language code | `pdf2zh_next example.pdf --lang-out zh-CN` | [Supported Languages](https://pdf2zh-next.com/getting-started/SUPPORTED_LANGUAGES.html) | | `--translator` | Translator service | `pdf2zh_next example.pdf --translator google` | [Documentation of Translation Services](https://pdf2zh-next.com/getting-started/TRANSLATION_SERVICES.html) | | `--translator-key` | API key for the translator service | `pdf2zh_next example.pdf --translator google --translator-key YOUR_API_KEY` | [Documentation of Translation Services](https://pdf2zh-next.com/getting-started/TRANSLATION_SERVICES.html) | | `--translator-url` | Custom endpoint URL for the translator service | `pdf2zh_next example.pdf --translator custom --translator-url YOUR_CUSTOM_ENDPOINT` | [Documentation of Translation Services](https://pdf2zh-next.com/getting-started/TRANSLATION_SERVICES.html) | | `--translator-model` | Model for the translator service | `pdf2zh_next example.pdf --translator openai --translator-model gpt-4` | [Documentation of Translation Services](https://pdf2zh-next.com/getting-started/TRANSLATION_SERVICES.html) | | `--translator-temperature` | Temperature for the translator service | `pdf2zh_next example.pdf --translator openai --translator-temperature 0.7` | [Documentation of Translation Services](https://pdf2zh-next.com/getting-started/TRANSLATION_SERVICES.html) | | `--translator-max-tokens` | Maximum tokens for the translator service | `pdf2zh_next example.pdf --translator openai --translator-max-tokens 1000` | [Documentation of Translation Services](https://pdf2zh-next.com/getting-started/TRANSLATION_SERVICES.html) | | `--translator-timeout` | Timeout for the translator service | `pdf2zh_next example.pdf --translator google --translator-timeout 30` | [Documentation of Translation Services](https://pdf2zh-next.com/getting-started/TRANSLATION_SERVICES.html) | | `--translator-retries` | Number of retries for the translator service | `pdf2zh_next example.pdf --translator google --translator-retries 3` | [Documentation of Translation Services](https://pdf2zh-next.com/getting-started/TRANSLATION_SERVICES.html) | | `--translator-retry-delay` | Delay between retries for the translator service | `pdf2zh_next example.pdf --translator google --translator-retry-delay 1` | [Documentation of Translation Services](https://pdf2zh-next.com/getting-started/TRANSLATION_SERVICES.html) | | `--translator-concurrency` | Number of concurrent requests for the translator service | `pdf2zh_next example.pdf --translator google --translator-concurrency 10` | [Documentation of Translation Services](https://pdf2zh-next.com/getting-started/TRANSLATION_SERVICES.html) | | `--translator-concurrency-delay`| Delay between concurrent requests for the translator service | `pdf2zh_next example.pdf --translator google --translator-concurrency-delay 0.1` | [Documentation of Translation Services](https://pdf2zh-next.com/getting-started/TRANSLATION_SERVICES.html) | | `--translator-proxy` | Proxy for the translator service | `pdf2zh_next example.pdf --translator google --translator-proxy http://localhost:8080` | [Documentation of Translation Services](https://pdf2zh-next.com/getting-started/TRANSLATION_SERVICES.html) | | `--translator-proxy-auth` | Proxy authentication for the translator service | `pdf2zh_next example.pdf --translator google --translator-proxy http://localhost:8080 --translator-proxy-auth user:pass` | [Documentation of Translation Services](https://pdf2zh-next.com/getting-started/TRANSLATION_SERVICES.html) | | `--translator-proxy-timeout` | Proxy timeout for the translator service | `pdf2zh_next example.pdf --translator google --translator-proxy http://localhost:8080 --translator-proxy-timeout 30` | [Documentation of Translation Services](https://pdf2zh-next.com/getting-started/TRANSLATION_SERVICES.html) | | `--translator-proxy-retries` | Number of retries for the proxy | `pdf2zh_next example.pdf --translator google --translator-proxy http://localhost:8080 --translator-proxy-retries 3` | [Documentation of Translation Services](https://pdf2zh-next.com/getting-started/TRANSLATION_SERVICES.html) | | `--translator-proxy-retry-delay`| Delay between retries for the proxy | `pdf2zh_next example.pdf --translator google --translator-proxy http://localhost:8080 --translator-proxy-retry-delay 1`| [Documentation of Translation Services](https://pdf2zh-next.com/getting-started/TRANSLATION_SERVICES.html) | | `--translator-proxy-concurrency`| Number of concurrent requests for the proxy | `pdf2zh_next example.pdf --translator google --translator-proxy http://localhost:8080 --translator-proxy-concurrency 10` | [Documentation of Translation Services](https://pdf2zh-next.com/getting-started/TRANSLATION_SERVICES.html) | | `--translator-proxy-concurrency-delay`| Delay between concurrent requests for the proxy | `pdf2zh_next example.pdf --translator google --translator-proxy http://localhost:8080 --translator-proxy-concurrency-delay 0.1` | [Documentation of Translation Services](https://pdf2zh-next.com/getting-started/TRANSLATION_SERVICES.html) | | `--translator-proxy-auth` | Proxy authentication for the translator service | `pdf2zh_next example.pdf --translator google --translator-proxy http://localhost:8080 --translator-proxy-auth user:pass` | [Documentation of Translation Services](https://pdf2zh-next.com/getting-started/TRANSLATION_SERVICES.html) | | `--translator-proxy-timeout` | Proxy timeout for the translator service | `pdf2zh_next example.pdf --translator google --translator-proxy http://localhost:8080 --translator-proxy-timeout 30` | [Documentation of Translation Services](https://pdf2zh-next.com/getting-started/TRANSLATION_SERVICES.html) | | `--translator-proxy-retries` | Number of retries for the proxy | `pdf2zh_next example.pdf --translator google --translator-proxy http://localhost:8080 --translator-proxy-retries 3` | [Documentation of Translation Services](https://pdf2zh-next.com/getting-started/TRANSLATION_SERVICES.html) | | `--translator-proxy-retry-delay`| Delay between retries for the proxy | `pdf2zh_next example.pdf --translator google --translator-proxy http://localhost:8080 --translator-proxy-retry-delay 1`| [Documentation of Translation Services](https://pdf2zh-next.com/getting-started/TRANSLATION_SERVICES.html) | | `--translator-proxy-concurrency`| Number of concurrent requests for the proxy | `pdf2zh_next example.pdf --translator google --translator-proxy http://localhost:8080 --translator-proxy-concurrency 10` | [Documentation of Translation Services](https://pdf2zh-next.com/getting-started/TRANSLATION_SERVICES.html) | | `--translator-proxy-concurrency-delay`| Delay between concurrent requests for the proxy | `pdf2zh_next example.pdf --translator google --translator-proxy http://localhost:8080 --translator-proxy-concurrency-delay 0.1` | [Documentation of Translation Services](https://pdf2zh-next.com/getting-started/TRANSLATION_SERVICES.html) | | `--translator-proxy-auth` | Proxy authentication for the translator service | `pdf2zh_next example.pdf --translator google --translator-proxy http://localhost:8080 --translator-proxy-auth user:pass` | [Documentation of Translation Services](https://pdf2zh-next.com/getting-started/TRANSLATION_SERVICES.html) | | `--translator-proxy-timeout` | Proxy timeout for the translator service | `pdf2zh_next example.pdf --translator google --translator-proxy http://localhost:8080 --translator-proxy-timeout 极速` | [Documentation of Translation Services](https://pdf2zh-next.com/getting-started/TRANSLATION_SERVICES.html) | --- ### LANGUAGE CODE it
pt: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--lang-out` | Target language code | `pdf2zh_next example.pdf --lang-out zh` | | `--translator` | Translation service to use | `pdf2zh_next example.pdf --translator google` | | `--translator-config` | Path to translator configuration file | `pdf2zh_next example.pdf --translator-config config.json` | | `--translator-key` | API key for the translation service | `pdf2zh_next example.pdf --translator-key YOUR_API_KEY` | | `--translator-endpoint` | Endpoint for the translation service | `pdf2zh_next example.pdf --translator-endpoint https://api.cognitive.microsofttranslator.com` | | `--translator-region` | Region for the translation service | `pdf2zh_next example.pdf --translator-region eastus` | | `--translator-project-id` | Project ID for the translation service | `pdf2zh_next example.pdf --translator-project-id YOUR_PROJECT_ID` | | `--translator-model` | Model for the translation service | `pdf2zh_next example.pdf --translator-model gpt-3.5-turbo` | --- ### TRANSLATION RESULT | `--lang-in` | Código do idioma de origem | `pdf2zh_next example.pdf --lang-in en` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--lang-out` | Código do idioma de destino | `pdf2zh_next example.pdf --lang-out zh` | | `--translator` | Serviço de tradução a ser usado | `pdf2zh_next example.pdf --translator google` | | `--translator-config` | Caminho para o arquivo de configuração do tradutor | `pdf2zh_next example.pdf --translator-config config.json` | | `--translator-key` | Chave da API para o serviço de tradução | `pdf2zh_next example.pdf --translator-key YOUR_API_KEY` | | `--translator-endpoint` | Endpoint para o serviço de tradução | `pdf2zh_next example.pdf --translator-endpoint https://api.cognitive.microsofttranslator.com` | | `--translator-region` | Região para o serviço de tradução | `pdf2zh_next example.pdf --translator-region eastus` | | `--translator-project-id` | ID do projeto para o serviço de tradução | `pdf2zh_next example.pdf --translator-project-id YOUR_PROJECT_ID` | | `--translator-model` | Modelo para o serviço de tradução | `pdf2zh_next example.pdf --translator-model gpt-3.5-turbo` |
ru: | :------------------------------ | :-------------------------------------------------------------------------------------- | :-------------------------------------------------------------------------------------------------------------------- | | `--lang-out` | Target language code | `pdf2zh_next example.pdf --lang-out zh` | | `-o`, `--output` | Output file name | `pdf2zh_next example.pdf -o example_translated.pdf` | | `-d`, `--debug` | Enable debug mode, which will output more detailed information during the process | `pdf2zh_next example.pdf -d` | | `-y`, `--yes` | Skip confirmation prompts and automatically confirm all | `pdf2zh_next example.pdf -y` | | `-f`, `--force` | Force overwrite existing output files | `pdf2zh_next example.pdf -f` | | `--ocr` | Enable OCR mode, which will perform OCR on the PDF before translation | `pdf2zh_next example.pdf --ocr` | | `--ocr-option` | Additional options for OCR, passed to the OCR engine. | `pdf2zh_next example.pdf --ocr-option '{"languages": ["en", "zh"]}'` | | `--translator` | Specify the translation service to use | `pdf2zh_next example.pdf --translator google` | | `--translator-option` | Additional options for the translation service, passed to the translation engine. | `pdf2zh_next example.pdf --translator-option '{"api_key": "your_api_key"}'` | | `--concurrency-limit` | Maximum number of concurrent translation requests | `pdf2zh_next example.pdf --concurrency-limit 10` | | `--request-interval` | Time interval (in seconds) between translation requests | `pdf2zh_next example.pdf --request-interval 1` | | `--batch-size` | Number of texts to be sent for translation in each request | `pdf2zh_next example.pdf --batch-size 5` | | `--cache` | Enable caching of translation results to avoid repeated translations of the same text | `pdf2zh_next example.pdf --cache` | | `--cache-db` | Specify the cache database file path | `pdf2zh_next example.pdf --cache-db ./cache.db` | | `--no-cache` | Disable caching | `pdf2zh_next example.pdf --no-cache` | | `--dry-run` | Perform a dry run without actually translating the PDF | `pdf2zh_next example.pdf --dry-run` | | `--version` | Show version information | `pdf2zh_next --version` | | `-h`, `--help` | Show help message | `pdf2zh_next -h` | --- ### TRANSLATION RESULT | `--lang-in` | Код языка исходного текста | `pdf2zh_next example.pdf --lang-in en` | | :------------------------------ | :-------------------------------------------------------------------------------------- | :-------------------------------------------------------------------------------------------------------------------- | | `--lang-out` | Код языка перевода | `pdf2zh_next example.pdf --lang-out zh` | | `-o`, `--output` | Имя выходного файла | `pdf2zh_next example.pdf -o example_translated.pdf` | | `-d`, `--debug` | Включить режим отладки, который выводит более подробную информацию в процессе | `pdf2zh_next example.pdf -d` | | `-y`, `--yes` | Пропустить запросы подтверждения и автоматически подтверждать все | `pdf2zh_next example.pdf -y` | | `-f`, `--force` | Принудительно перезаписывать существующие выходные файлы | `pdf2zh_next example.pdf -f` | | `--ocr` | Включить режим OCR, который выполнит OCR на PDF перед переводом | `pdf2zh_next example.pdf --ocr` | | `--ocr-option` | Дополнительные опции для OCR, передаваемые в движок OCR. | `pdf2zh_next example.pdf --ocr-option '{"languages": ["en", "zh"]}'` | | `--translator` | Указать службу перевода для использования | `pdf2zh_next example.pdf --translator google` | | `--translator-option` | Дополнительные опции для службы перевода, передаваемые в движок перевода. | `pdf2zh_next example.pdf --translator-option '{"api_key": "your_api_key"}'` | | `--concurrency-limit` | Максимальное количество одновременных запросов на перевод | `pdf2zh_next example.pdf --concurrency-limit 10` | | `--request-interval` | Временной интервал (в секундах) между запросами на перевод | `pdf2zh_next example.pdf --request-interval 1` | | `--batch-size` | Количество текстов, отправляемых на перевод в каждом запросе | `pdf2zh_next example.pdf --batch-size 5` | | `--cache` | Включить кэширование результатов перевода, чтобы избежать повторного перевода одного текста | `pdf2zh_next example.pdf --cache` | | `--cache-db` | Указать путь к файлу базы данных кэша | `pdf2zh_next example.pdf --cache-db ./cache.db` | | `--no-cache` | Отключить кэширование | `pdf2zh_next example.pdf --no-cache` | | `--dry-run` | Выполнить пробный запуск без фактического перевода PDF | `pdf2zh_next example.pdf --dry-run` | | `--version` | Показать информацию о версии | `pdf2zh_next --version` | | `-h`, `--help` | Показать справочное сообщение | `pdf2zh_next -h` |
