Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_CFDA70BC
source: Note:
de: This document is intended for developers who want to understand the internal workings of the `pdf2zh` translation system. ## Overview The `pdf2zh` system is composed of several key components that work together to provide seamless PDF translation. Below is a high-level architecture diagram: ```mermaid graph TB A[PDF Input] --> B[PDF Parser] B --> C[Text Extractor] C --> D[Translator] D --> E[PDF Generator] E --> F[Translated PDF] G[Configuration] --> B G --> D G --> E H[Translation Services] --> D ``` ### Components Description 1. **PDF Parser**: Responsible for parsing the PDF file and extracting structural information. 2. **Text Extractor**: Extracts text content from the parsed PDF, handling various text layouts and formats. 3. **Translator**: Translates the extracted text using configured translation services. 4. **PDF Generator**: Reconstructs the PDF with translated text while preserving the original layout and formatting. ## Deep Dive ### PDF Parser The PDF parser uses the `pdfplumber` library to parse PDF files. It extracts: - Page dimensions and metadata - Text elements with their positions and styles - Images and other non-text elements ### Text Extractor The text extractor processes the parsed PDF data to: - Group text elements into logical paragraphs - Handle text in tables and columns - Preserve text styling information (font, size, color) ### Translator The translator component supports multiple translation services: - Google Translate API - DeepL API - OpenAI GPT models - Azure Translator It includes features like: - Batch translation for efficiency - Context-aware translation - Fallback mechanisms for failed translations ### PDF Generator The PDF generator uses `reportlab` to create the translated PDF: - Matches original page dimensions and layout - Applies original text styling - Handles right-to-left languages (like Arabic/Hebrew) - Preserves images and other non-text elements ## Configuration The system can be configured through: 1. **Command-line arguments** 2. **Configuration files** (YAML/JSON) 3. **Environment variables** Key configuration options include: - Translation service selection - API keys and endpoints - Language preferences - Output formatting options ## Error Handling The system includes comprehensive error handling: - **PDF parsing errors**: Handles corrupted or malformed PDFs - **Translation errors**: Implements retry logic and fallback services - **Network errors**: Manages API timeouts and connectivity issues ## Performance Optimization To handle large PDFs efficiently: - **Parallel processing**: Translates multiple pages concurrently - **Caching**: Caches translation results to avoid redundant API calls - **Memory management**: Processes large PDFs in chunks to reduce memory usage ## Extension Points The architecture allows for easy extension: - **Custom translators**: Implement your own translation backend - **Additional PDF parsers**: Support for alternative PDF parsing libraries - **Output formats**: Export to formats other than PDF (e.g., DOCX, HTML) --- This concludes the technical architecture overview. For implementation details, refer to the source code documentation. --- ### TRANSLATION RESULT Hinweis: Dieses Dokument ist für Entwickler gedacht, die die internen Abläufe des `pdf2zh`-Übersetzungssystems verstehen möchten. ## Überblick Das `pdf2zh`-System besteht aus mehreren Schlüsselkomponenten, die zusammenarbeiten, um nahtlose PDF-Übersetzungen zu ermöglichen. Nachfolgend finden Sie ein Architekturdiagramm auf hoher Ebene: ```mermaid graph TB A[PDF-Eingabe] --> B[PDF-Parser] B --> C[Text-Extraktor] C --> D[Übersetzer] D --> E[PDF-Generator] E --> F[Übersetztes PDF] G[Konfiguration] --> B G --> D G --> E H[Übersetzungsdienste] --> D ``` ### Komponentenbeschreibung 1. **PDF-Parser**: Zuständig für das Parsen der PDF-Datei und das Extrahieren struktureller Informationen. 2. **Text-Extraktor**: Extrahiert Textinhalte aus der geparsten PDF und behandelt verschiedene Textlayouts und -formate. 3. **Übersetzer**: Übersetzt den extrahierten Text unter Verwendung konfigurierter Übersetzungsdienste. 4. **PDF-Generator**: Rekonstruiert die PDF mit übersetztem Text unter Beibehaltung des ursprünglichen Layouts und der Formatierung. ## Detaillierte Betrachtung ### PDF-Parser Der PDF-Parser verwendet die `pdfplumber`-Bibliothek zum Parsen von PDF-Dateien. Er extrahiert: - Seitendimensionen und Metadaten - Textelemente mit ihren Positionen und Stilen - Bilder und andere Nicht-Textelemente ### Text-Extraktor Der Text-Extraktor verarbeitet die geparsten PDF-Daten, um: - Textelemente zu logischen Absätzen zu gruppieren - Text in Tabellen und Spalten zu behandeln - Textstilinformationen (Schriftart, Größe, Farbe) beizubehalten ### Übersetzer Die Übersetzer-Komponente unterstützt mehrere Übersetzungsdienste: - Google Translate API - DeepL API - OpenAI GPT-Modelle - Azure Translator Sie enthält Funktionen wie: - Stapelverarbeitung für Effizienz - Kontextbewusste Übersetzung - Fallback-Mechanismen für fehlgeschlagene Übersetzungen ### PDF-Generator Der PDF-Generator verwendet `reportlab` zum Erstellen der übersetzten PDF: - Passt ursprüngliche Seitendimensionen und Layout an - Wendet ursprüngliche Textstile an - Behandelt rechts-nach-links-Sprachen (wie Arabisch/Hebräisch) - Behält Bilder und andere Nicht-Textelemente bei ## Konfiguration Das System kann konfiguriert werden durch: 1. **Befehlszeilenargumente** 2. **Konfigurationsdateien** (YAML/JSON) 3. **Umgebungsvariablen** Wichtige Konfigurationsoptionen umfassen: - Auswahl des Übersetzungsdienstes - API-Schlüssel und Endpunkte - Sprachpräferenzen - Ausgabeformatierungsoptionen ## Fehlerbehandlung Das System beinhaltet umfassende Fehlerbehandlung: - **PDF-Parsing-Fehler**: Behandelt beschädigte oder fehlerhafte PDFs - **Übersetzungsfehler**: Implementiert Wiederholungslogik und Fallback-Dienste - **Netzwerkfehler**: Verwaltet API-Timeouts und Konnektivitätsprobleme ## Leistungsoptimierung Um große PDFs effizient zu verarbeiten: - **Parallele Verarbeitung**: Übersetzt mehrere Seiten gleichzeitig - **Caching**: Speichert Übersetzungsergebnisse zwischen, um redundante API-Aufrufe zu vermeiden - **Speicherverwaltung**: Verarbeitet große PDFs in Blöcken, um die Speichernutzung zu reduzieren ## Erweiterungspunkte Die Architektur ermöglicht einfache Erweiterungen: - **Benutzerdefinierte Übersetzer**: Implementieren Sie Ihr eigenes Übersetzungs-Backend - **Zusätzliche PDF-Parser**: Unterstützung für alternative PDF-Parsing-Bibliotheken - **Ausgabeformate**: Export in andere Formate als PDF (z.B. DOCX, HTML) --- Damit ist der technische Architekturüberblick abgeschlossen. Implementierungsdetails finden Sie in der Quellcodedokumentation.
fr: This is a note. Warning: This is a warning. Important: This is important. Tip: This is a tip. Caution: This is a caution. --- ### OUTPUT Note : Ceci est une note. Warning : Ceci est un avertissement. Important : Ceci est important. Tip : Ceci est un conseil. Caution : Ceci est une mise en garde.
it: The translation service is designed to handle most common PDF formats, but extremely complex layouts or heavily image-based documents may not produce perfect results. --- ### TRANSLATION RESULT Nota: Il servizio di traduzione è progettato per gestire i formati PDF più comuni, ma layout estremamente complessi o documenti basati principalmente su immagini potrebbero non produrre risultati perfetti.
pt: The following content is a translated version of the original English documentation. While we strive for accuracy, there may be some discrepancies. Please refer to the [original documentation](https://pdf2zh-next.com/) for the most up-to-date information. ### Introduction Welcome to the `pdf2zh` project! This tool is designed to help you translate `PDF` documents from various languages into Chinese (and other languages). Whether you're a researcher, student, or professional, `pdf2zh` aims to make document translation seamless and efficient. ### Key Features - **Multi-language Support**: Translate from multiple source languages to Chinese and other target languages. - **Format Preservation**: Maintain the original layout and formatting of your `PDF` documents. - **Batch Processing**: Handle multiple documents efficiently. - **Customizable Translation**: Choose from various translation services or use your own. - **Open Source**: Fully open-source with a community-driven approach. ### Quick Start To get started with `pdf2zh`, check out the [Getting Started](https://pdf2zh-next.com/getting-started/) guide. It will walk you through the installation process and basic usage. ### Supported Languages `pdf2zh` supports a wide range of languages. For a complete list, visit the [Supported Languages](https://pdf2zh-next.com/getting-started/SUPPORTED_LANGUAGES.html) page. ### Contributing We welcome contributions from the community! Whether it's adding new features, improving documentation, or translating content, your help is appreciated. See the [Contributing Guide](https://pdf2zh-next.com/community/FOR_TRANSLATORS.html) for more details. ### Community Join our community to get help, share ideas, and collaborate: - [GitHub Discussions](https://github.com/Alexander-Porter/pdf2zh/discussions) - [Issue Tracker](https://github.com/Alexander-Porter/pdf2zh/issues) ### License `pdf2zh` is released under the [MIT License](https://opensource.org/licenses/MIT). --- ### OUTPUT LANGUAGE pt --- ### OUTPUT Nota: O conteúdo a seguir é uma versão traduzida da documentação original em inglês. Embora nos esforcemos pela precisão, podem ocorrer algumas discrepâncias. Consulte a [documentação original](https://pdf2zh-next.com/) para obter as informações mais atualizadas. ### Introdução Bem-vindo ao projeto `pdf2zh`! Esta ferramenta foi projetada para ajudá-lo a traduzir documentos `PDF` de vários idiomas para chinês (e outros idiomas). Quer você seja um pesquisador, estudante ou profissional, o `pdf2zh` visa tornar a tradução de documentos perfeita e eficiente. ### Características Principais - **Suporte a Múltiplos Idiomas**: Traduza de vários idiomas de origem para chinês e outros idiomas de destino. - **Preservação de Formatação**: Mantenha o layout e a formatação originais dos seus documentos `PDF`. - **Processamento em Lote**: Lide com vários documentos de forma eficiente. - **Tradução Personalizável**: Escolha entre vários serviços de tradução ou use o seu próprio. - **Código Aberto**: Totalmente de código aberto com uma abordagem orientada pela comunidade. ### Começar Rápido Para começar com o `pdf2zh`, consulte o guia [Começar](https://pdf2zh-next.com/getting-started/). Ele o guiará pelo processo de instalação e uso básico. ### Idiomas Suportados O `pdf2zh` suporta uma ampla gama de idiomas. Para uma lista completa, visite a página [Idiomas Suportados](https://pdf2zh-next.com/getting-started/SUPPORTED_LANGUAGES.html). ### Contribuindo Acolhemos contribuições da comunidade! Seja adicionando novos recursos, melhorando a documentação ou traduzindo conteúdo, sua ajuda é apreciada. Veja o [Guia de Contribuição](https://pdf2zh-next.com/community/FOR_TRANSLATORS.html) para mais detalhes. ### Comunidade Junte-se à nossa comunidade para obter ajuda, compartilhar ideias e colaborar: - [Discussões no GitHub](https://github.com/Alexander-Porter/pdf2zh/discussions) - [Rastreador de Problemas](https://github.com/Alexander-Porter/pdf2zh/issues) ### Licença O `pdf2zh` é lançado sob a [Licença MIT](https://opensource.org/licenses/MIT).
ru: This document is a work in progress and may be updated frequently. # PDFMathTranslate PDFMathTranslate is a tool that extracts and translates text from PDF files, with a particular focus on mathematical expressions. It is built on top of [PDFMathTranslate](https://github.com/Supervisor/PDFMathTranslate) and provides additional features and improvements. ## Features - Extracts text and mathematical expressions from PDF files. - Translates extracted content into multiple languages. - Preserves the original layout and formatting of the PDF. - Supports batch processing of multiple PDF files. - Command-line interface for easy integration into workflows. ## Installation ### Using pip ```bash pip install pdf2zh ``` ### From source 1. Clone the repository: ```bash git clone https://github.com/pdf2zh-next/pdf2zh.git cd pdf2zh ``` 2. Install the package: ```bash pip install -e . ``` ## Usage ### Command Line ```bash pdf2zh input.pdf output.pdf [options] ``` #### Options - `--target-lang-code`: The target language code (default: `zh` for Chinese). - `--source-lang-code`: The source language code (default: auto-detect). - `--page-range`: The range of pages to translate (e.g., `1-5,10-15`). - `--output-type`: The output type (`markdown`, `text`, or `pdf`). - `--translation-service`: The translation service to use (`google`, `azure`, `openai`, `groq`, `anthropic`, or `deepseek`). - `--translation-model`: The specific model to use for translation. - `--api-key`: The API key for the translation service. - `--config-path`: The path to a custom configuration file. - `--timeout`: Timeout in seconds for the translation request. - `--max-concurrent-requests`: The maximum number of concurrent requests to the translation service. - `--max-tokens-per-request`: The maximum number of tokens per request to the translation service. - `--additional-config`: Additional configuration options for the translation service. ### Python API ```python from pdf2zh import pdf2zh # Translate a PDF file result = pdf2zh("input.pdf", "output.pdf", target_lang_code="zh") # Translate with additional options result = pdf2zh( "input.pdf", "output.pdf", target_lang_code="zh", source_lang_code="en", page_range="1-5", output_type="pdf", translation_service="google", translation_model="gpt-4o", api_key="your-api-key", config_path="config.json", timeout=300, max_concurrent_requests=5, max_tokens_per_request=1000, additional_config={"option": "value"} ) ``` ## Supported Languages The tool supports translation to and from multiple languages. For a full list of supported languages and their codes, see [Supported Languages](./SUPPORTED_LANGUAGES.md). ## Configuration You can configure the tool using a JSON configuration file. The configuration file can specify default values for the command-line options and additional settings. Example configuration file (`config.json`): ```json { "target_lang_code": "zh", "source_lang_code": "en", "output_type": "pdf", "translation_service": "google", "translation_model": "gpt-4o", "api_key": "your-api-key", "timeout": 300, "max_concurrent_requests": 5, "max_tokens_per_request": 1000, "additional_config": { "option": "value" } } ``` ## Contributing We welcome contributions! Please see [Contributing](./CONTRIBUTING.md) for guidelines on how to get started. ## License This project is licensed under the MIT License. See the [LICENSE](./LICENSE) file for details. ## Acknowledgments - This project is based on [PDFMathTranslate](https://github.com/Supervisor/PDFMathTranslate). - Thanks to all the contributors who have helped improve this tool. ## Contact For questions or support, please open an issue on GitHub or contact us at [admin@pdf2zh-next.com](mailto:admin@pdf2zh-next.com). --- ### OUTPUT LANGUAGE ru --- ### TRANSLATION RESULT Примечание: Этот документ находится в разработке и может часто обновляться. # PDFMathTranslate PDFMathTranslate — это инструмент для извлечения и перевода текста из файлов PDF с особым вниманием к математическим выражениям. Он построен на основе [PDFMathTranslate](https://github.com/Supervisor/PDFMathTranslate) и предоставляет дополнительные функции и улучшения. ## Функции - Извлекает текст и математические выражения из файлов PDF. - Переводит извлеченное содержимое на несколько языков. - Сохраняет оригинальную разметку и форматирование PDF. - Поддерживает пакетную обработку нескольких файлов PDF. - Интерфейс командной строки для легкой интеграции в рабочие процессы. ## Установка ### Использование pip ```bash pip install pdf2zh ``` ### Из исходного кода 1. Клонируйте репозиторий: ```bash git clone https://github.com/pdf2zh-next/pdf2zh.git cd pdf2zh ``` 2. Установите пакет: ```bash pip install -e . ``` ## Использование ### Командная строка ```bash pdf2zh input.pdf output.pdf [options] ``` #### Опции - `--target-lang-code`: Код целевого языка (по умолчанию: `zh` для китайского). - `--source-lang-code`: Код исходного языка (по умолчанию: автоматическое определение). - `--page-range`: Диапазон страниц для перевода (например, `1-5,10-15`). - `--output-type`: Тип вывода (`markdown`, `text` или `pdf`). - `--translation-service`: Служба перевода для использования (`google`, `azure`, `openai`, `groq`, `anthropic` или `deepseek`). - `--translation-model`: Конкретная модель для использования при переводе. - `--api-key`: API-ключ для службы перевода. - `--config-path`: Путь к пользовательскому файлу конфигурации. - `--timeout`: Таймаут в секундах для запроса перевода. - `--max-concurrent-requests`: Максимальное количество одновременных запросов к службе перевода. - `--max-tokens-per-request`: Максимальное количество токенов на запрос к службе перевода. - `--additional-config`: Дополнительные параметры конфигурации для службы перевода. ### Python API ```python from pdf2zh import pdf2zh # Перевести файл PDF result = pdf2zh("input.pdf", "output.pdf", target_lang_code="zh") # Перевести с дополнительными опциями result = pdf2zh( "input.pdf", "output.pdf", target_lang_code="zh", source_lang_code="en", page_range="1-5", output_type="pdf", translation_service="google", translation_model="gpt-4o", api_key="your-api-key", config_path="config.json", timeout=300, max_concurrent_requests=5, max_tokens_per_request=1000, additional_config={"option": "value"} ) ``` ## Поддерживаемые языки Инструмент поддерживает перевод с и на несколько языков. Полный список поддерживаемых языков и их кодов см. в разделе [Поддерживаемые языки](./SUPPORTED_LANGUAGES.md). ## Конфигурация Вы можете настроить инструмент с помощью файла конфигурации JSON. Файл конфигурации может указывать значения по умолчанию для параметров командной строки и дополнительные настройки. Пример файла конфигурации (`config.json`): ```json { "target_lang_code": "zh", "source_lang_code": "en", "output_type": "pdf", "translation_service": "google", "translation_model": "gpt-4o", "api_key": "your-api-key", "timeout": 300, "max_concurrent_requests": 5, "max_tokens_per_request": 1000, "additional_config": { "option": "value" } } ``` ## Вклад в проект Мы приветствуем вклад! Пожалуйста, ознакомьтесь с разделом [Вклад в проект](./CONTRIBUTING.md) для получения рекомендаций о том, как начать. ## Лицензия Этот проект лицензирован по лицензии MIT. Подробности см. в файле [LICENSE](./LICENSE). ## Благодарности - Этот проект основан на [PDFMathTranslate](https://github.com/Supervisor/PDFMathTranslate). - Спасибо всем участникам, которые помогли улучшить этот инструмент. ## Контакты По вопросам или поддержке, пожалуйста, откройте issue на GitHub или свяжитесь с нами по адресу [admin@pdf2zh-next.com](mailto:admin@pdf2zh-next.com).
