Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_AB421930
source: | `--split-short-lines` | Force split short lines into different paragraphs | `pdf2zh_next example.pdf --split-short-lines` |
de: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--split-long-lines` | Force split long lines into different paragraphs | `pdf2zh_next example.pdf --split-long-lines` | | `--split-line-length-threshold` | Set the threshold for splitting lines. Default is `20` for short lines and `50` for long lines | `pdf2zh_next example.pdf --split-long-lines --split-line-length-threshold 60` | | `--split-paragraphs` | Force split paragraphs | `pdf2zh_next example.pdf --split-paragraphs` | | `--split-paragraph-length` | Set the threshold for splitting paragraphs. Default is `200` | `pdf2zh_next example.pdf --split-paragraphs --split-paragraph-length 300` | | `--split-paragraph-lines` | Set the number of lines to split paragraphs. Default is `5` | `pdf2zh_next example.pdf --split-paragraphs --split-paragraph-lines 10` | --- ### TRANSLATED TEXT | `--split-short-lines` | Erzwingt das Aufteilen kurzer Zeilen in verschiedene Absätze | `pdf2zh_next example.pdf --split-short-lines` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--split-long-lines` | Erzwingt das Aufteilen langer Zeilen in verschiedene Absätze | `pdf2zh_next example.pdf --split-long-lines` | | `--split-line-length-threshold` | Legt den Schwellenwert für das Aufteilen von Zeilen fest. Standard ist `20` für kurze Zeilen und `50` für lange Zeilen | `pdf2zh_next example.pdf --split-long-lines --split-line-length-threshold 60` | | `--split-paragraphs` | Erzwingt das Aufteilen von Absätzen | `pdf2zh_next example.pdf --split-paragraphs` | | `--split-paragraph-length` | Legt den Schwellenwert für das Aufteilen von Absätzen fest. Standard ist `200` | `pdf2zh_next example.pdf --split-paragraphs --split-paragraph-length 300` | | `--split-paragraph-lines` | Legt die Anzahl der Zeilen zum Aufteilen von Absätzen fest. Standard ist `5` | `pdf2zh_next example.pdf --split-paragraphs --split-paragraph-lines 10` |
fr: |---------------------------------|-----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------| | `--no-split-short-lines` | Disable splitting short lines into different paragraphs | `pdf2zh_next example.pdf --no-split-short-lines` | | `--split-paragraphs` | Split paragraphs into different lines | `pdf2zh_next example.pdf --split-paragraphs` | | `--no-split-paragraphs` | Disable splitting paragraphs into different lines | `pdf2zh_next example.pdf --no-split-paragraphs` | --- ### OUTPUT | `--split-short-lines` | Forcer la division des lignes courtes en paragraphes différents | `pdf2zh_next example.pdf --split-short-lines` | |---------------------------------|-----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------| | `--no-split-short-lines` | Désactiver la division des lignes courtes en paragraphes différents | `pdf2zh_next example.pdf --no-split-short-lines` | | `--split-paragraphs` | Diviser les paragraphes en lignes différentes | `pdf2zh_next example.pdf --split-paragraphs` | | `--no-split-paragraphs` | Désactiver la division des paragraphes en lignes différentes | `pdf2zh_next example.pdf --no-split-paragraphs` |
it: |---------------------------------|-----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------| | `--split-very-short-lines` | Force split very short lines into different paragraphs | `pdf2zh_next example.pdf --split-very-short-lines` | | `--merge-lines` | Merge lines into paragraphs | `pdf2zh_next example.pdf --merge-lines` | | `--merge-short-lines` | Merge short lines into paragraphs | `pdf2zh_next example.pdf --merge-short-lines` | | `--merge-very-short-lines` | Merge very short lines into paragraphs | `pdf2zh_next example.pdf --merge-very-short-lines` | | `--merge-lines-threshold <int>` | Threshold for merging lines (default: 10) | `pdf2zh_next example.pdf --merge-lines-threshold 5` | | `--merge-short-lines-threshold <int>` | Threshold for merging short lines (default: 5) | `pdf2zh_next example.pdf --merge-short-lines-threshold 3` | | `--merge-very-short-lines-threshold <int>` | Threshold for merging very short lines (default: 3) | `pdf2zh_next example.pdf --merge-very-short-lines-threshold 2` | --- ### TRANSLATION RESULT | `--split-short-lines` | Forza la divisione di righe brevi in paragrafi diversi | `pdf2zh_next example.pdf --split-short-lines` | |---------------------------------|-----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------| | `--split-very-short-lines` | Forza la divisione di righe molto brevi in paragrafi diversi | `pdf2zh_next example.pdf --split-very-short-lines` | | `--merge-lines` | Unisce le righe in paragrafi | `pdf2zh_next example.pdf --merge-lines` | | `--merge-short-lines` | Unisce le righe brevi in paragrafi | `pdf2zh_next example.pdf --merge-short-lines` | | `--merge-very-short-lines` | Unisce le righe molto brevi in paragrafi | `pdf2zh_next example.pdf --merge-very-short-lines` | | `--merge-lines-threshold <int>` | Soglia per unire le righe (predefinito: 10) | `pdf2zh_next example.pdf --merge-lines-threshold 5` | | `--merge-short-lines-threshold <int>` | Soglia per unire le righe brevi (predefinito: 5) | `pdf2zh_next example.pdf --merge-short-lines-threshold 3` | | `--merge-very-short-lines-threshold <int>` | Soglia per unire le righe molto brevi (predefinito: 3) | `pdf2zh_next example.pdf --merge-very-short-lines-threshold 2` |
pt: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--split-short-lines-threshold` | The threshold to determine if a line is short, default is 0.3 | `pdf2zh_next example.pdf --split-short-lines-threshold 0.5` | | `--split-short-lines-max-len` | The max length of a short line, default is 10 | `pdf2zh_next example.pdf --split-short-lines-max-len 20` | | `--remove-short-lines` | Remove short lines | `pdf2zh_next example.pdf --remove-short-lines` | | `--remove-short-lines-threshold`| The threshold to determine if a line is short, default is 0.3 | `pdf2zh_next example.pdf --remove-short-lines-threshold 0.5` | | `--remove-short-lines-max-len` | The max length of a short line, default is 10 | `pdf2zh_next example.pdf --remove-short-lines-max-len 20` | --- ### TRANSLATION RESULT | `--split-short-lines` | Forçar a divisão de linhas curtas em parágrafos diferentes | `pdf2zh_next example.pdf --split-short-lines` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--split-short-lines-threshold` | O limite para determinar se uma linha é curta, o padrão é 0.3 | `pdf2zh_next example.pdf --split-short-lines-threshold 0.5` | | `--split-short-lines-max-len` | O comprimento máximo de uma linha curta, o padrão é 10 | `pdf2zh_next example.pdf --split-short-lines-max-len 20` | | `--remove-short-lines` | Remover linhas curtas | `pdf2zh_next example.pdf --remove-short-lines` | | `--remove-short-lines-threshold`| O limite para determinar se uma linha é curta, o padrão é 0.3 | `pdf2zh_next example.pdf --remove-short-lines-threshold 0.5` | | `--remove-short-lines-max-len` | O comprimento máximo de uma linha curta, o padrão é 10 | `pdf2zh_next example.pdf --remove-short-lines-max-len 20` |
ru: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--split-short-lines-threshold` | The threshold for splitting short lines, default is 0.5. See below for more information | `pdf2zh_next example.pdf --split-short-lines --split-short-lines-threshold 0.7` | | `--split-short-lines-ratio` | The ratio for splitting short lines, default is 0.5. See below for more information | `pdf2zh_next example.pdf --split-short-lines --split-short-lines-ratio 0.7` | | `--no-split-short-lines` | Disable splitting short lines, which is enabled by default | `pdf2zh_next example.pdf --no-split-short-lines` | | `--no-split-long-lines` | Disable splitting long lines, which is enabled by default | `pdf2zh_next example.pdf --no-split-long-lines` | --- ### TRANSLATION RESULT | `--split-short-lines` | Принудительное разделение коротких строк на разные абзацы | `pdf2zh_next example.pdf --split-short-lines` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--split-short-lines-threshold` | Порог для разделения коротких строк, по умолчанию 0.5. Подробнее см. ниже | `pdf2zh_next example.pdf --split-short-lines --split-short-lines-threshold 0.7` | | `--split-short-lines-ratio` | Коэффициент для разделения коротких строк, по умолчанию 0.5. Подробнее см. ниже | `pdf2zh_next example.pdf --split-short-lines --split-short-lines-ratio 0.7` | | `--no-split-short-lines` | Отключить разделение коротких строк, включено по умолчанию | `pdf2zh_next example.pdf --no-split-short-lines` | | `--no-split-long-lines` | Отключить разделение длинных строк, включено по умолчанию | `pdf2zh_next example.pdf --no-split-long-lines` |
