Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_0F2C1928
source: | `--gui` | Interact with GUI | `pdf2zh_next --gui` |
de: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `-i <path>, --input <path>` | Input file path | `pdf2zh_next -i input.pdf` | | `-o <path>, --output <path>` | Output file path | `pdf2zh_next -i input.pdf -o output.pdf` | | `-s <code>, --source <code>` | Source language code | `pdf2zh_next -i input.pdf -s en` | | `-t <code>, --target <code>` | Target language code | `pdf2zh_next -i input.pdf -t zh` | | `-m <code>, --model <code>` | Translation model, refer to [Supported Languages](./SUPPORTED_LANGUAGES.md) for details | `pdf2zh_next -i input.pdf -m gpt-4o-mini` | | `--pdf-translator <translator>` | PDF translator, refer to [Supported Languages](./SUPPORTED_LANGUAGES.md) for details | `pdf2zh_next -i input.pdf --pdf-translator docling` | | `--translator <translator>` | Translation service, refer to [Documentation of Translation Services](./TRANSLATOR.md) | `pdf2zh_next -i input.pdf --translator azure` | | `--key <key>` | API key for translation service | `pdf2zh_next -i input.pdf --translator azure --key <your_key>` | | `--endpoint <endpoint>` | API endpoint for translation service | `pdf2zh_next -i input.pdf --translator azure --endpoint <your_endpoint>` | | `--region <region>` | API region for translation service | `pdf2zh_next -i input.pdf --translator azure --region <your_region>` | | `--workers <number>` | Number of concurrent workers for translation | `pdf2zh_next -i input.pdf --workers 4` | | `--no-split` | Disable paragraph splitting | `pdf2zh_next -i input.pdf --no-split` | | `--no-translate` | Disable translation (useful for extracting text) | `pdf2zh_next -i input.pdf --no-translate` | | `--no-ocr` | Disable OCR (useful for text-based PDFs) | `pdf2zh_next -i input.pdf --no-ocr` | | `--verbose` | Enable verbose output | `pdf2zh_next -i input.pdf --verbose` | | `--version` | Show version information | `pdf2zh_next --version` | | `--help` | Show help message | `pdf2zh_next --help` | --- ### TRANSLATION RESULT | `--gui` | Interaktion mit der GUI | `pdf2zh_next --gui` | | ------------------------------- | --------------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `-i <path>, --input <path>` | Eingabedateipfad | `pdf2zh_next -i input.pdf` | | `-o <path>, --output <path>` | Ausgabedateipfad | `pdf2zh_next -i input.pdf -o output.pdf` | | `-s <code>, --source <code>` | Quellsprachcode | `pdf2zh_next -i input.pdf -s en` | | `-t <code>, --target <code>` | Zielsprachcode | `pdf2zh_next -i input.pdf -t zh` | | `-m <code>, --model <code>` | Übersetzungsmodell, siehe [Unterstützte Sprachen](./SUPPORTED_LANGUAGES.md) für Details | `pdf2zh_next -i input.pdf -m gpt-4o-mini` | | `--pdf-translator <translator>` | PDF-Übersetzer, siehe [Unterstützte Sprachen](./SUPPORTED_LANGUAGES.md) für Details | `pdf2zh_next -i input.pdf --pdf-translator docling` | | `--translator <translator>` | Übersetzungsdienst, siehe [Dokumentation der Übersetzungsdienste](./TRANSLATOR.md) | `pdf2zh_next -i input.pdf --translator azure` | | `--key <key>` | API-Schlüssel für den Übersetzungsdienst | `pdf2zh_next -i input.pdf --translator azure --key <your_key>` | | `--endpoint <endpoint>` | API-Endpunkt für den Übersetzungsdienst | `pdf2zh_next -i input.pdf --translator azure --endpoint <your_endpoint>` | | `--region <region>` | API-Region für den Übersetzungsdienst | `pdf2zh_next -i input.pdf --translator azure --region <your_region>` | | `--workers <number>` | Anzahl der gleichzeitigen Worker für die Übersetzung | `pdf2zh_next -i input.pdf --workers 4` | | `--no-split` | Absatzaufteilung deaktivieren | `pdf2zh_next -i input.pdf --no-split` | | `--no-translate` | Übersetzung deaktivieren (nützlich zum Extrahieren von Text) | `pdf2zh_next -i input.pdf --no-translate` | | `--no-ocr` | OCR deaktivieren (nützlich für textbasierte PDFs) | `pdf2zh_next -i input.pdf --no-ocr` | | `--verbose` | Ausführliche Ausgabe aktivieren | `pdf2zh_next -i input.pdf --verbose` | | `--version` | Versionsinformationen anzeigen | `pdf2zh_next --version` | | `--help` | Hilfenachricht anzeigen | `pdf2zh_next --help` |
fr: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--webui` | Interact with WebUI | `pdf2zh_next --webui` | | `--webui-port` | Set the port for WebUI (default: 8000) | `pdf2zh_next --webui --webui-port 8080` | | `--webui-host` | Set the host for WebUI (default: localhost) | `pdf2zh_next --webui --webui-host 0.0.0.0` | | `--webui-no-browser` | Do not open the browser automatically when starting WebUI | `pdf2zh_next --webui --webui-no-browser` | | `--webui-queue-concurrency` | Set the concurrency of the WebUI queue (default: 1) | `pdf2zh_next --webui --webui-queue-concurrency 2` | | `--webui-queue-timeout` | Set the timeout of the WebUI queue (default: 300) | `pdf2zh_next --webui --webui-queue-timeout 600` | | `--webui-queue-max-size` | Set the max size of the WebUI queue (default: 100) | `pdf2zh_next --webui --webui-queue-max-size 200` | | `--webui-queue-ttl` | Set the TTL of the WebUI queue (default: 300) | `pdf2zh_next --webui --webui-queue-ttl 600` | --- ### TRANSLATED TEXT | `--gui` | Interagir avec l'interface graphique (GUI) | `pdf2zh_next --gui` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--webui` | Interagir avec l'interface Web (WebUI) | `pdf2zh_next --webui` | | `--webui-port` | Définir le port pour WebUI (par défaut : 8000) | `pdf2zh_next --webui --webui-port 8080` | | `--webui-host` | Définir l'hôte pour WebUI (par défaut : localhost) | `pdf2zh_next --webui --webui-host 0.0.0.0` | | `--webui-no-browser` | Ne pas ouvrir automatiquement le navigateur au démarrage de WebUI | `pdf2zh_next --webui --webui-no-browser` | | `--webui-queue-concurrency` | Définir le niveau de concurrence de la file d'attente WebUI (par défaut : 1) | `pdf2zh_next --webui --webui-queue-concurrency 2` | | `--webui-queue-timeout` | Définir le délai d'expiration de la file d'attente WebUI (par défaut : 300) | `pdf2zh_next --webui --webui-queue-timeout 600` | | `--webui-queue-max-size` | Définir la taille maximale de la file d'attente WebUI (par défaut : 100) | `pdf2zh_next --webui --webui-queue-max-size 200` | | `--webui-queue-ttl` | Définir le TTL (durée de vie) de la file d'attente WebUI (par défaut : 300) | `pdf2zh_next --webui --webui-queue-ttl 600` |
it: | :------------------------------ | :-------------------------------------------------------------------------------------- | :-------------------------------------------------------------------------------------------------------------------- | | `--port <port>` | Specify the port for GUI. If not specified, the default port is 3000 | `pdf2zh_next --gui --port 3000` | | `--host <host>` | Specify the host for GUI. If not specified, the default host is `localhost` | `pdf2zh_next --gui --host localhost` | | `--no-open-browser` | Do not open the browser automatically | `pdf2zh_next --gui --no-open-browser` | | `--webui-log-level <log_level>` | Set the log level for the web UI. Options: `error`, `warn`, `info`, `debug`, `verbose` | `pdf2zh_next --gui --webui-log-level debug` | | `--webui-log-format <format>` | Set the log format for the web UI. Options: `combined`, `common`, `dev`, `short`, `tiny` | `pdf2zh_next --gui --webui-log-format dev` | | `--webui-request-timeout <ms>` | Set the request timeout for the web UI in milliseconds. Default is 30000 | `pdf2zh_next --gui --webui-request-timeout 60000` | | `--webui-body-limit <limit>` | Set the body size limit for the web UI. Default is `100kb` | `pdf2zh_next --gui --webui-body-limit 200kb` | --- ### TRANSLATION RESULT | `--gui` | Interagisci con la GUI | `pdf2zh_next --gui` | | :------------------------------ | :-------------------------------------------------------------------------------------- | :-------------------------------------------------------------------------------------------------------------------- | | `--port <port>` | Specifica la porta per la GUI. Se non specificato, la porta predefinita è 3000 | `pdf2zh_next --gui --port 3000` | | `--host <host>` | Specifica l'host per la GUI. Se non specificato, l'host predefinito è `localhost` | `pdf2zh_next --gui --host localhost` | | `--no-open-browser` | Non aprire automaticamente il browser | `pdf2zh_next --gui --no-open-browser` | | `--webui-log-level <log_level>` | Imposta il livello di log per la web UI. Opzioni: `error`, `warn`, `info`, `debug`, `verbose` | `pdf2zh_next --gui --webui-log-level debug` | | `--webui-log-format <format>` | Imposta il formato di log per la web UI. Opzioni: `combined`, `common`, `dev`, `short`, `tiny` | `pdf2zh_next --gui --webui-log-format dev` | | `--webui-request-timeout <ms>` | Imposta il timeout della richiesta per la web UI in millisecondi. Predefinito è 30000 | `pdf2zh_next --gui --webui-request-timeout 60000` | | `--webui-body-limit <limit>` | Imposta il limite di dimensione del corpo per la web UI. Predefinito è `100kb` | `pdf2zh_next --gui --webui-body-limit 200kb` |
pt: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--input` | Specify the input file (can be a file or a folder) | `pdf2zh_next --input ./paper.pdf` | | `--output` | Specify the output path | `pdf2zh_next --input ./paper.pdf --output ./paper_zh.pdf` | | `--target_language` | Specify the target language (default: zh) | `pdf2zh_next --input ./paper.pdf --target_language ja` | | `--model` | Specify the model to use (default: gpt-4o) | `pdf2zh_next --input ./paper.pdf --model gpt-4o-mini` | | `--translation_service` | Specify the translation service to use (default: openai) | `pdf2zh_next --input ./paper.pdf --translation_service azure_openai` | | `--api_key` | Specify the API key (if not set, will use the environment variable) | `pdf2zh_next --input ./paper.pdf --api_key sk-xxx` | | `--max_concurrency` | Specify the maximum number of concurrent requests (default: 3) | `pdf2zh_next --input ./paper.pdf --max_concurrency 5` | | `--max_requests_per_minute` | Specify the maximum number of requests per minute (default: 50) | `pdf2zh_next --input ./paper.pdf --max_requests_per_minute 100` | | `--retry_times` | Specify the number of times to retry if a request fails (default: 3) | `pdf2zh_next --input ./paper.pdf --retry_times 5` | | `--timeout` | Specify the timeout for each request in seconds (default: 60) | `pdf2zh_next --input ./paper.pdf --timeout 120` | | `--check_only` | Only check the translation, do not translate | `pdf2zh_next --input ./paper.pdf --check_only` | | `--resume` | Resume from the last interrupted translation | `pdf2zh_next --input ./paper.pdf --resume` | | `--force` | Force to translate even if the output file already exists | `pdf2zh_next --input ./paper.pdf --output ./paper_zh.pdf --force` | | `--version` | Show the version of the program | `pdf2zh_next --version` | | `--help` | Show the help message | `pdf2zh_next --help` | | `--log_level` | Specify the log level (default: INFO) | `pdf2zh_next --input ./paper.pdf --log_level DEBUG` | | `--no_color` | Disable color output | `pdf2zh_next --input ./paper.pdf --no_color` | | `--proxy` | Specify the proxy to use (e.g., http://127.0.0.1:7890) | `pdf2zh_next --input ./paper.pdf --proxy http://127.0.0.1:7890` | | `--model_list` | List all available models for the specified translation service | `pdf2zh_next --model_list --translation_service openai` | | `--dry_run` | Dry run, only show the translation plan without actually translating | `pdf2zh_next --input ./paper.pdf --dry_run` | | `--page_range` | Specify the page range to translate (e.g., 1-5,10,12-15) | `pdf2zh_next --input ./paper.pdf --page_range 1-5,10,12-15` | | `--custom_prompt` | Specify a custom prompt for translation | `pdf2zh_next --input ./paper.pdf --custom_prompt "Translate the following content to Chinese"` | | `--glossary` | Specify a glossary file to use for translation | `pdf2zh_next --input ./paper.pdf --glossary ./glossary.txt` | | `--output_format` | Specify the output format (default: pdf, options: pdf, markdown, text) | `pdf2zh_next --input ./paper.pdf --output_format markdown` | | `--remove_original_text` | Remove the original text from the output | `pdf2zh_next --input ./paper.pdf --remove_original_text` | | `--layout` | Specify the layout of the output (default: original, options: original, bilingual) | `pdf2zh_next --input ./paper.pdf --layout bilingual` | | `--font` | Specify the font to use for the output (default: Noto Sans SC) | `pdf2zh_next --input ./paper.pdf --font "Source Han Serif SC"` | | `--font_size` | Specify the font size for the output (default: 12) | `pdf2zh_next --input ./paper.pdf --font_size 14` | | `--line_spacing` | Specify the line spacing for the output (default: 1.2) | `pdf2zh_next --input ./paper.pdf --line_spacing 1.5` | | `--margin` | Specify the margin for the output (default: 72) | `pdf2zh_next --input ./paper.pdf --margin 100` | | `--page_size` | Specify the page size for the output (default: A4, options: A4, Letter, Legal, A3, A5) | `pdf2zh_next --input ./paper.pdf --page_size Letter` | | `--page_orientation` | Specify the page orientation for the output (default: portrait, options: portrait, landscape) | `pdf2zh_next --input ./paper.pdf --page_orientation landscape` | | `--title` | Specify the title for the output document | `pdf2zh_next --input ./paper.pdf --title "Translated Paper"` | | `--author` | Specify the author for the output document | `pdf2zh_next --input ./paper.pdf --author "John Doe"` | | `--subject` | Specify the subject for the output document | `pdf2zh_next --input ./paper.pdf --subject "Computer Science"` | | `--keywords` | Specify the keywords for the output document | `pdf2zh_next --input ./paper.pdf --keywords "translation, pdf, ai"` | | `--no_cover` | Do not generate a cover page for the output document | `pdf2zh_next --input ./paper.pdf --no_cover` | | `--no_toc` | Do not generate a table of contents for the output document | `pdf2zh_next --input ./paper.pdf --no_toc` | | `--toc_depth` | Specify the depth of the table of contents (default: 3) | `pdf2zh_next --input ./paper.pdf --toc_depth 2` | | `--watermark` | Specify a watermark text for the output document | `pdf2zh_next --input ./paper.pdf --watermark "DRAFT"` | | `--watermark_opacity` | Specify the opacity of the watermark (default: 0.2) | `pdf2zh_next --input ./paper.pdf --watermark_opacity 0.1` | | `--config` | Specify a config file to use | `pdf2zh_next --config ./config.yaml` | | `--save_config` | Save the current configuration to a file | `pdf2zh_next --input ./paper.pdf --save_config ./config.yaml` | --- ### OUTPUT | `--gui` | Interagir com a GUI | `pdf2zh_next --gui` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--input` | Especificar o arquivo de entrada (pode ser um arquivo ou uma pasta) | `pdf2zh_next --input ./paper.pdf` | | `--output` | Especificar o caminho de saída | `pdf2zh_next --input ./paper.pdf --output ./paper_zh.pdf` | | `--target_language` | Especificar o idioma de destino (padrão: zh) | `pdf2zh_next --input ./paper.pdf --target_language ja` | | `--model` | Especificar o modelo a ser usado (padrão: gpt-4o) | `pdf2zh_next --input ./paper.pdf --model gpt-4o-mini` | | `--translation_service` | Especificar o serviço de tradução a ser usado (padrão: openai) | `pdf2zh_next --input ./paper.pdf --translation_service azure_openai` | | `--api_key` | Especificar a chave da API (se não definida, usará a variável de ambiente) | `pdf2zh_next --input ./paper.pdf --api_key sk-xxx` | | `--max_concurrency` | Especificar o número máximo de solicitações simultâneas (padrão: 3) | `pdf2zh_next --input ./paper.pdf --max_concurrency 5` | | `--max_requests_per_minute` | Especificar o número máximo de solicitações por minuto (padrão: 50) | `pdf2zh_next --input ./paper.pdf --max_requests_per_minute 100` | | `--retry_times` | Especificar o número de tentativas se uma solicitação falhar (padrão: 3) | `pdf2zh_next --input ./paper.pdf --retry_times 5` | | `--timeout` | Especificar o tempo limite para cada solicitação em segundos (padrão: 60) | `pdf2zh_next --input ./paper.pdf --timeout 120` | | `--check_only` | Apenas verificar a tradução, não traduzir | `pdf2zh_next --input ./paper.pdf --check_only` | | `--resume` | Retomar a partir da última tradução interrompida | `pdf2zh_next --input ./paper.pdf --resume` | | `--force` | Forçar a tradução mesmo se o arquivo de saída já existir | `pdf2zh_next --input ./paper.pdf --output ./paper_zh.pdf --force` | | `--version` | Mostrar a versão do programa | `pdf2zh_next --version` | | `--help` | Mostrar a mensagem de ajuda | `pdf2zh_next --help` | | `--log_level` | Especificar o nível de log (padrão: INFO) | `pdf2zh_next --input ./paper.pdf --log_level DEBUG` | | `--no_color` | Desativar a saída colorida | `pdf2zh_next --input ./paper.pdf --no_color` | | `--proxy` | Especificar o proxy a ser usado (por exemplo, http://127.0.0.1:7890) | `pdf2zh_next --input ./paper.pdf --proxy http://127.0.0.1:7890` | | `--model_list` | Listar todos os modelos disponíveis para o serviço de tradução especificado | `pdf2zh_next --model_list --translation_service openai` | | `--dry_run` | Execução seca, apenas mostrar o plano de tradução sem realmente traduzir | `pdf2zh_next --input ./paper.pdf --dry_run` | | `--page_range` | Especificar o intervalo de páginas para traduzir (por exemplo, 1-5,10,12-15) | `pdf2zh_next --input ./paper.pdf --page_range 1-5,10,12-15` | | `--custom_prompt` | Especificar um prompt personalizado para tradução | `pdf2zh_next --input ./paper.pdf --custom_prompt "Translate the following content to Chinese"` | | `--glossary` | Especificar um arquivo de glossário para usar na tradução | `pdf2zh_next --input ./paper.pdf --glossary ./glossary.txt` | | `--output_format` | Especificar o formato de saída (padrão: pdf, opções: pdf, markdown, text) | `pdf2zh_next --input ./paper.pdf --output_format markdown` | | `--remove_original_text` | Remover o texto original da saída | `pdf2zh_next --input ./paper.pdf --remove_original_text` | | `--layout` | Especificar o layout da saída (padrão: original, opções: original, bilingual) | `pdf2zh_next --input ./paper.pdf --layout bilingual` | | `--font` | Especificar a fonte a ser usada na saída (padrão: Noto Sans SC) | `pdf2zh_next --input ./paper.pdf --font "Source Han Serif SC"` | | `--font_size` | Especificar o tamanho da fonte para a saída (padrão: 12) | `pdf2zh_next --input ./paper.pdf --font_size 14` | | `--line_spacing` | Especificar o espaçamento entre linhas para a saída (padrão: 1.2) | `pdf2zh_next --input ./paper.pdf --line_spacing 1.5` | | `--margin` | Especificar a margem para a saída (padrão: 72) | `pdf2zh_next --input ./paper.pdf --margin 100` | | `--page_size` | Especificar o tamanho da página para a saída (padrão: A4, opções: A4, Letter, Legal, A3, A5) | `pdf2zh_next --input ./paper.pdf --page_size Letter` | | `--page_orientation` | Especificar a orientação da página para a saída (padrão: retrato, opções: retrato, paisagem) | `pdf2zh_next --input ./paper.pdf --page_orientation landscape` | | `--title` | Especificar o título para o documento de saída | `pdf2zh_next --input ./paper.pdf --title "Translated Paper"` | | `--author` | Especificar o autor para o documento de saída | `pdf2zh_next --input ./paper.pdf --author "John Doe"` | | `--subject` | Especificar o assunto para o documento de saída | `pdf2zh_next --input ./paper.pdf --subject "Computer Science"` | | `--keywords` | Especificar as palavras-chave para o documento de saída | `pdf2zh_next --input ./paper.pdf --keywords "translation, pdf, ai"` | | `--no_cover` | Não gerar uma página de capa para o documento de saída | `pdf2zh_next --input ./paper.pdf --no_cover` | | `--no_toc` | Não gerar um índice para o documento de saída | `pdf2zh_next --input ./paper.pdf --no_toc` | | `--toc_depth` | Especificar a profundidade do índice (padrão: 3) | `pdf2zh_next --input ./paper.pdf --toc_depth 2` | | `--watermark` | Especificar um texto de marca d'água para o documento de saída | `pdf2zh_next --input ./paper.pdf --watermark "DRAFT"` | | `--watermark_opacity` | Especificar a opacidade da marca d'água (padrão: 0.2) | `pdf2zh_next --input ./paper.pdf --watermark_opacity 0.1` | | `--config` | Especificar um arquivo de configuração para usar | `pdf2zh_next --config ./config.yaml` | | `--save_config` | Salvar a configuração atual em um arquivo | `pdf2zh_next --input ./paper.pdf --save_config ./config.yaml` |
ru: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--input <path>` | Input file path | `pdf2zh_next --input example.pdf` | | `--output <path>` | Output file path | `pdf2zh_next --input example.pdf --output example_zh.pdf` | | `--lang <lang>` | Target language, default is `zh-cn` (Chinese) | `pdf2zh_next --input example.pdf --lang en` | | `--mode <mode>` | Translation mode, default is `fast`. Options: `fast`, `standard`, `quality`, `custom` | `pdf2zh_next --input example.pdf --mode quality` | | `--ocr <ocr>` | OCR engine, default is `easyocr`. Options: `easyocr`, `paddleocr` | `pdf2zh_next --input example.pdf --ocr paddleocr` | | `--translator <translator>` | Translator, default is `google`. Options: `google`, `google_free`, `azure`, `openai` | `pdf2zh_next --input example.pdf --translator azure` | | `--retry <number>` | Retry times, default is `3` | `pdf2zh_next --input example.pdf --retry 5` | | `--timeout <seconds>` | Timeout for each translation request, default is `10` | `pdf2zh_next --input example.pdf --timeout 20` | | `--concurrency <number>` | Concurrency number, default is `5` | `pdf2zh_next --input example.pdf --concurrency 10` | | `--proxy <proxy>` | Proxy for translation, e.g., `http://127.0.0.1:7890` | `pdf2zh_next --input example.pdf --proxy http://127.0.0.1:7890` | | `--api-key <key>` | API key for translation service, e.g., OpenAI API key | `pdf2zh_next --input example.pdf --translator openai --api-key sk-xxx` | | `--api-base <url>` | API base URL for translation service, e.g., OpenAI API base URL | `pdf2zh_next --input example.pdf --translator openai --api-base https://api.openai.com/v1` | | `--model <model>` | Model for translation service, e.g., OpenAI model | `pdf2zh_next --input example.pdf --translator openai --model gpt-4` | | `--no-cache` | Disable cache | `pdf2zh_next --input example.pdf --no-cache` | | `--cache-dir <path>` | Cache directory, default is `./cache` | `pdf2zh_next --input example.pdf --cache-dir /tmp/cache` | | `--config <path>` | Config file path | `pdf2zh_next --input example.pdf --config config.json` | | `--help` | Show help | `pdf2zh_next --help` | --- ### LANGUAGE ru --- ### OUTPUT | `--gui` | Взаимодействие с графическим интерфейсом | `pdf2zh_next --gui` | | ------------------------------- | -------------------------------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--input <path>` | Путь к входному файлу | `pdf2zh_next --input example.pdf` | | `--output <path>` | Путь к выходному файлу | `pdf2zh_next --input example.pdf --output example_zh.pdf` | | `--lang <lang>` | Целевой язык, по умолчанию `zh-cn` (китайский) | `pdf2zh_next --input example.pdf --lang en` | | `--mode <mode>` | Режим перевода, по умолчанию `fast`. Варианты: `fast`, `standard`, `quality`, `custom` | `pdf2zh_next --input example.pdf --mode quality` | | `--ocr <ocr>` | Движок OCR, по умолчанию `easyocr`. Варианты: `easyocr`, `paddleocr` | `pdf2zh_next --input example.pdf --ocr paddleocr` | | `--translator <translator>` | Переводчик, по умолчанию `google`. Варианты: `google`, `google_free`, `azure`, `openai` | `pdf2zh_next --input example.pdf --translator azure` | | `--retry <number>` | Количество повторных попыток, по умолчанию `3` | `pdf2zh_next --input example.pdf --retry 5` | | `--timeout <seconds>` | Таймаут для каждого запроса перевода, по умолчанию `10` | `pdf2zh_next --input example.pdf --timeout 20` | | `--concurrency <number>` | Количество одновременных запросов, по умолчанию `5` | `pdf2zh_next --input example.pdf --concurrency 10` | | `--proxy <proxy>` | Прокси для перевода, например, `http://127.0.0.1:7890` | `pdf2zh_next --input example.pdf --proxy http://127.0.0.1:7890` | | `--api-key <key>` | API-ключ для службы перевода, например, ключ API OpenAI | `pdf2zh_next --input example.pdf --translator openai --api-key sk-xxx` | | `--api-base <url>` | Базовый URL API для службы перевода, например, базовый URL API OpenAI | `pdf2zh_next --input example.pdf --translator openai --api-base https://api.openai.com/v1` | | `--model <model>` | Модель для службы перевода, например, модель OpenAI | `pdf2zh_next --input example.pdf --translator openai --model gpt-4` | | `--no-cache` | Отключить кэширование | `pdf2zh_next --input example.pdf --no-cache` | | `--cache-dir <path>` | Директория кэша, по умолчанию `./cache` | `pdf2zh_next --input example.pdf --cache-dir /tmp/cache` | | `--config <path>` | Путь к файлу конфигурации | `pdf2zh_next --input example.pdf --config config.json` | | `--help` | Показать справку | `pdf2zh_next --help` |
