Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_675B6F86
source: - Stage summary event: `stage_summary` (optional, may appear first) - Fields - `type`: "stage_summary" - `stages`: list of objects `{ "name": str, "percent": float }` describing the estimated work distribution - `part_index`: may be 0 for this summary event - `total_parts`: total number of parts (>= 1) - Progress events: `progress_start`, `progress_update`, `progress_end` - Common fields - `type`: one of the above - `stage`: human-readable stage name (e.g., "Parse PDF and Create Intermediate Representation", "Translate Paragraphs", "Save PDF") - `stage_progress`: float in [0, 100] indicating progress within the current stage - `overall_progress`: float in [0, 100] indicating overall progress - `part_index`: current part index (typically 1-based for progress events) - `total_parts`: total number of parts (>= 1). Large documents may be split automatically. - `stage_current`: current step within the stage - `stage_total`: total steps within the stage - Finish event: `finish` - Fields - `type`: "finish" - `translate_result`: an **object** providing final outputs (NOTE: not a dictionary, but a class instance) - `original_pdf_path`: Path to the input PDF - `mono_pdf_path`: Path to the monolingual translated PDF (or None) - `dual_pdf_path`: Path to the bilingual translated PDF (or None) - `no_watermark_mono_pdf_path`: Path to monolingual output without watermark (if produced), otherwise None - `no_watermark_dual_pdf_path`: Path to bilingual output without watermark (if produced), otherwise None - `auto_extracted_glossary_path`: Path to auto-extracted glossary CSV (or None) - `total_seconds`: elapsed seconds (float) - `peak_memory_usage`: approximate peak memory usage during translation (float; implementation-dependent units) - Error event: `error` - Fields - `type`: "error" - `error`: human-readable error message - `error_type`: one of `BabeldocError`, `SubprocessError`, `IPCError`, `SubprocessCrashError`, etc. - `details`: optional details (e.g., original error or traceback)
de: - `part_index`: part index where error occurred (if applicable) - Warning event: `warning` - Fields - `type`: "warning" - `warning`: human-readable warning message - `warning_type`: one of `BabeldocWarning`, `SubprocessWarning`, etc. - `details`: optional details (e.g., original warning) - Info event: `info` - Fields - `type`: "info" - `message`: human-readable message - Debug event: `debug` - Fields - `type`: "debug" - `message`: human-readable message --- ### TRANSLATION RESULT - Zusammenfassungsereignis der Stufen: `stage_summary` (optional, kann zuerst erscheinen) - Felder - `type`: "stage_summary" - `stages`: Liste von Objekten `{ "name": str, "percent": float }`, die die geschätzte Arbeitsverteilung beschreiben - `part_index`: kann für dieses Zusammenfassungsereignis 0 sein - `total_parts`: Gesamtanzahl der Teile (>= 1) - Fortschrittsereignisse: `progress_start`, `progress_update`, `progress_end` - Gemeinsame Felder - `type`: einer der oben genannten - `stage`: menschenlesbarer Stufenname (z.B. "PDF parsen und Zwischendarstellung erstellen", "Absätze übersetzen", "PDF speichern") - `stage_progress`: Float in [0, 100], der den Fortschritt innerhalb der aktuellen Stufe anzeigt - `overall_progress`: Float in [0, 100], der den Gesamtfortschritt anzeigt - `part_index`: aktueller Teilindex (typischerweise 1-basiert für Fortschrittsereignisse) - `total_parts`: Gesamtanzahl der Teile (>= 1). Große Dokumente können automatisch aufgeteilt werden. - `stage_current`: aktueller Schritt innerhalb der Stufe - `stage_total`: Gesamtschritte innerhalb der Stufe - Abschlussereignis: `finish` - Felder - `type`: "finish" - `translate_result`: ein **Objekt**, das endgültige Ausgaben bereitstellt (HINWEIS: kein Dictionary, sondern eine Klasseninstanz) - `original_pdf_path`: Pfad zur Eingabe-PDF - `mono_pdf_path`: Pfad zur monolingual übersetzten PDF (oder None) - `dual_pdf_path`: Pfad zur bilingual übersetzten PDF (oder None) - `no_watermark_mono_pdf_path`: Pfad zur monolingualen Ausgabe ohne Wasserzeichen (falls erstellt), sonst None - `no_watermark_dual_pdf_path`: Pfad zur bilingualen Ausgabe ohne Wasserzeichen (falls erstellt), sonst None - `auto_extracted_glossary_path`: Pfad zur automatisch extrahierten Glossar-CSV (oder None) - `total_seconds`: verstrichene Sekunden (Float) - `peak_memory_usage`: ungefährer Speicherverbrauchsspitzenwert während der Übersetzung (Float; implementierungsabhängige Einheiten) - Fehlerereignis: `error` - Felder - `type`: "error" - `error`: menschenlesbare Fehlermeldung - `error_type`: einer von `BabeldocError`, `SubprocessError`, `IPCError`, `SubprocessCrashError`, etc. - `details`: optionale Details (z.B. ursprünglicher Fehler oder Traceback) - `part_index`: Teilindex, an dem der Fehler aufgetreten ist (falls zutreffend) - Warnereignis: `warning` - Felder - `type`: "warning" - `warning`: menschenlesbare Warnmeldung - `warning_type`: einer von `BabeldocWarning`, `SubprocessWarning`, etc. - `details`: optionale Details (z.B. ursprüngliche Warnung) - Infoereignis: `info` - Felder - `type`: "info" - `message`: menschenlesbare Meldung - Debug-Ereignis: `debug` - Felder - `type`: "debug" - `message`: menschenlesbare Meldung
fr: - `stage`: stage where error occurred --- ### OUTPUT LANGUAGE fr --- ### OUTPUT - Événement de résumé d'étape : `stage_summary` (optionnel, peut apparaître en premier) - Champs - `type` : "stage_summary" - `stages` : liste d'objets `{ "name": str, "percent": float }` décrivant la répartition estimée du travail - `part_index` : peut être 0 pour cet événement de résumé - `total_parts` : nombre total de parties (>= 1) - Événements de progression : `progress_start`, `progress_update`, `progress_end` - Champs communs - `type` : l'un des types ci-dessus - `stage` : nom d'étape lisible par l'humain (par exemple, "Analyser le PDF et créer une représentation intermédiaire", "Traduire les paragraphes", "Sauvegarder le PDF") - `stage_progress` : float dans [0, 100] indiquant la progression dans l'étape actuelle - `overall_progress` : float dans [0, 100] indiquant la progression globale - `part_index` : index de la partie actuelle (généralement basé sur 1 pour les événements de progression) - `total_parts` : nombre total de parties (>= 1). Les documents volumineux peuvent être divisés automatiquement. - `stage_current` : étape actuelle dans le stage - `stage_total` : nombre total d'étapes dans le stage - Événement de fin : `finish` - Champs - `type` : "finish" - `translate_result` : un **objet** fournissant les sorties finales (NOTE : pas un dictionnaire, mais une instance de classe) - `original_pdf_path` : Chemin vers le PDF d'entrée - `mono_pdf_path` : Chemin vers le PDF traduit monolingue (ou None) - `dual_pdf_path` : Chemin vers le PDF traduit bilingue (ou None) - `no_watermark_mono_pdf_path` : Chemin vers la sortie monolingue sans filigrane (si produite), sinon None - `no_watermark_dual_pdf_path` : Chemin vers la sortie bilingue sans filigrane (si produite), sinon None - `auto_extracted_glossary_path` : Chemin vers le glossaire CSV extrait automatiquement (ou None) - `total_seconds` : secondes écoulées (float) - `peak_memory_usage` : utilisation maximale approximative de la mémoire pendant la traduction (float ; unités dépendantes de l'implémentation) - Événement d'erreur : `error` - Champs - `type` : "error" - `error` : message d'erreur lisible par l'humain - `error_type` : l'un de `BabeldocError`, `SubprocessError`, `IPCError`, `SubprocessCrashError`, etc. - `details` : détails optionnels (par exemple, erreur originale ou traceback) - `stage` : étape où l'erreur s'est produite
it: - `part_index`: current part index (if applicable) - Warning event: `warning` - Fields - `type`: "warning" - `warning`: human-readable warning message - `warning_type`: one of `BabeldocWarning`, `SubprocessWarning`, etc. - `details`: optional details - `part_index`: current part index (if applicable) - Log event: `log` - Fields - `type`: "log" - `level`: log level (e.g., "INFO", "WARNING", "ERROR") - `message`: log message - `part_index`: current part index (if applicable) - Debug event: `debug` - Fields - `type`: "debug" - `message`: debug message - `part_index`: current part index (if applicable) --- ### TRANSLATION RESULT - Evento di riepilogo dello stage: `stage_summary` (opzionale, può apparire per primo) - Campi - `type`: "stage_summary" - `stages`: lista di oggetti `{ "name": str, "percent": float }` che descrivono la distribuzione stimata del lavoro - `part_index`: può essere 0 per questo evento di riepilogo - `total_parts`: numero totale di parti (>= 1) - Eventi di avanzamento: `progress_start`, `progress_update`, `progress_end` - Campi comuni - `type`: uno dei precedenti - `stage`: nome dello stage leggibile (ad esempio, "Analizza PDF e crea rappresentazione intermedia", "Traduci paragrafi", "Salva PDF") - `stage_progress`: float in [0, 100] che indica l'avanzamento all'interno dello stage corrente - `overall_progress`: float in [0, 100] che indica l'avanzamento complessivo - `part_index`: indice della parte corrente (tipicamente basato su 1 per gli eventi di avanzamento) - `total_parts`: numero totale di parti (>= 1). Documenti di grandi dimensioni possono essere divisi automaticamente. - `stage_current`: passo corrente all'interno dello stage - `stage_total`: passi totali all'interno dello stage - Evento di fine: `finish` - Campi - `type`: "finish" - `translate_result`: un **oggetto** che fornisce gli output finali (NOTA: non un dizionario, ma un'istanza di classe) - `original_pdf_path`: Percorso del PDF di input - `mono_pdf_path`: Percorso del PDF tradotto monolingue (o None) - `dual_pdf_path`: Percorso del PDF tradotto bilingue (o None) - `no_watermark_mono_pdf_path`: Percorso dell'output monolingue senza filigrana (se prodotto), altrimenti None - `no_watermark_dual_pdf_path`: Percorso dell'output bilingue senza filigrana (se prodotto), altrimenti None - `auto_extracted_glossary_path`: Percorso del glossario CSV estratto automaticamente (o None) - `total_seconds`: secondi trascorsi (float) - `peak_memory_usage`: utilizzo di memoria di picco approssimativo durante la traduzione (float; unità dipendenti dall'implementazione) - Evento di errore: `error` - Campi - `type`: "error" - `error`: messaggio di errore leggibile - `error_type`: uno tra `BabeldocError`, `SubprocessError`, `IPCError`, `SubprocessCrashError`, ecc. - `details`: dettagli opzionali (ad esempio, errore originale o traceback) - `part_index`: indice della parte corrente (se applicabile) - Evento di avviso: `warning` - Campi - `type`: "warning" - `warning`: messaggio di avviso leggibile - `warning_type`: uno tra `BabeldocWarning`, `SubprocessWarning`, ecc. - `details`: dettagli opzionali - `part_index`: indice della parte corrente (se applicabile) - Evento di log: `log` - Campi - `type`: "log" - `level`: livello di log (ad esempio, "INFO", "WARNING", "ERROR") - `message`: messaggio di log - `part_index`: indice della parte corrente (se applicabile) - Evento di debug: `debug` - Campi - `type`: "debug" - `message`: messaggio di debug - `part_index`: indice della parte corrente (se applicabile)
pt: - `part_index`: if applicable ### Example Event Stream ```json {"type": "stage_summary", "stages": [{"name": "Parse PDF", "percent": 20.0}, {"name": "Translate", "percent": 70.0}, {"name": "Save PDF", "percent": 10.0}], "part_index": 0, "total_parts": 1} {"type": "progress_start", "stage": "Parse PDF and Create Intermediate Representation", "stage_progress": 0.0, "overall_progress": 0.0, "part_index": 1, "total_parts": 1, "stage_current": 0, "stage_total": 100} {"type": "progress_update", "stage": "Parse PDF and Create Intermediate Representation", "stage_progress": 50.0, "overall_progress": 10.0, "part_index": 1, "total_parts": 1, "stage_current": 50, "stage_total": 100} {"type": "progress_end", "stage": "Parse PDF and Create Intermediate Representation", "stage_progress": 100.0, "overall_progress": 20.0, "part_index": 1, "total_parts": 1, "stage_current": 100, "stage_total": 100} {"type": "progress_start", "stage": "Translate Paragraphs", "stage_progress": 0.0, "overall_progress": 20.0, "part_index": 1, "total_parts": 1, "stage_current": 0, "stage_total": 500} {"type": "progress_update", "stage": "Translate Paragraphs", "stage_progress": 50.0, "overall_progress": 55.0, "part_index": 1, "total_parts": 1, "stage_current": 250, "stage_total": 500} {"type": "progress_end", "stage": "Translate Paragraphs", "stage_progress": 100.0, "overall_progress": 90.0, "part_index": 1, "total_parts": 1, "stage_current": 500, "stage_total": 500} {"type": "progress_start", "stage": "Save PDF", "stage_progress": 0.0, "overall_progress": 90.0, "part_index": 1, "total_parts": 1, "stage_current": 0, "stage_total": 10} {"type": "progress_update", "stage": "Save PDF", "stage_progress": 50.0, "overall_progress": 95.0, "part_index": 1, "total_parts": 1, "stage_current": 5, "stage_total": 10} {"type": "progress_end", "stage": "Save PDF", "stage_progress": 100.0, "overall_progress": 100.0, "part_index": 1, "total_parts": 1, "stage_current": 10, "stage_total": 10} {"type": "finish", "translate_result": {"original_pdf_path": "/path/to/input.pdf", "mono_pdf_path": "/path/to/output_mono.pdf", "dual_pdf_path": "/path/to/output_dual.pdf", "no_watermark_mono_pdf_path": null, "no_watermark_dual_pdf_path": null, "auto_extracted_glossary_path": "/path/to/glossary.csv", "total_seconds": 123.45, "peak_memory_usage": 256.0}} ``` --- ### OUTPUT LANGUAGE pt --- ### OUTPUT - Evento de resumo de estágio: `stage_summary` (opcional, pode aparecer primeiro) - Campos - `type`: "stage_summary" - `stages`: lista de objetos `{ "name": str, "percent": float }` descrevendo a distribuição estimada de trabalho - `part_index`: pode ser 0 para este evento de resumo - `total_parts`: número total de partes (>= 1) - Eventos de progresso: `progress_start`, `progress_update`, `progress_end` - Campos comuns - `type`: um dos acima - `stage`: nome do estágio legível por humanos (por exemplo, "Analisar PDF e Criar Representação Intermediária", "Traduzir Parágrafos", "Salvar PDF") - `stage_progress`: float em [0, 100] indicando o progresso dentro do estágio atual - `overall_progress`: float em [0, 100] indicando o progresso geral - `part_index`: índice da parte atual (normalmente baseado em 1 para eventos de progresso) - `total_parts`: número total de partes (>= 1). Documentos grandes podem ser divididos automaticamente. - `stage_current`: passo atual dentro do estágio - `stage_total`: total de passos dentro do estágio - Evento de conclusão: `finish` - Campos - `type`: "finish" - `translate_result`: um **objeto** fornecendo saídas finais (NOTA: não um dicionário, mas uma instância de classe) - `original_pdf_path`: Caminho para o PDF de entrada - `mono_pdf_path`: Caminho para o PDF traduzido monolíngue (ou None) - `dual_pdf_path`: Caminho para o PDF traduzido bilíngue (ou None) - `no_watermark_mono_pdf_path`: Caminho para a saída monolíngue sem marca d'água (se produzida), caso contrário None - `no_watermark_dual_pdf_path`: Caminho para a saída bilíngue sem marca d'água (se produzida), caso contrário None - `auto_extracted_glossary_path`: Caminho para o CSV do glossário extraído automaticamente (ou None) - `total_seconds`: segundos decorridos (float) - `peak_memory_usage`: uso máximo aproximado de memória durante a tradução (float; unidades dependentes da implementação) - Evento de erro: `error` - Campos - `type`: "error" - `error`: mensagem de erro legível por humanos - `error_type`: um de `BabeldocError`, `SubprocessError`, `IPCError`, `SubprocessCrashError`, etc. - `details`: detalhes opcionais (por exemplo, erro original ou traceback) - `part_index`: se aplicável ### Exemplo de Fluxo de Eventos ```json {"type": "stage_summary", "stages": [{"name": "Analisar PDF", "percent": 20.0}, {"name": "Traduzir", "percent": 70.0}, {"name": "Salvar PDF", "percent": 10.0}], "part_index": 0, "total_parts": 1} {"type": "progress_start", "stage": "Analisar PDF e Criar Representação Intermediária", "stage_progress": 0.0, "overall_progress": 0.0, "part_index": 1, "total_parts": 1, "stage_current": 0, "stage_total": 100} {"type": "progress_update", "stage": "Analisar PDF e Criar Representação Intermediária", "stage_progress": 50.0, "overall_progress": 10.0, "part_index": 1, "total_parts": 1, "stage_current": 50, "stage_total": 100} {"type": "progress_end", "stage": "Analisar PDF e Criar Representação Intermediária", "stage_progress": 100.0, "overall_progress": 20.0, "part_index": 1, "total_parts": 1, "stage_current": 100, "stage_total": 100} {"type": "progress_start", "stage": "Traduzir Parágrafos", "stage_progress": 0.0, "overall_progress": 20.0, "part_index": 1, "total_parts": 1, "stage_current": 0, "stage_total": 500} {"type": "progress_update", "stage": "Traduzir Parágrafos", "stage_progress": 50.0, "overall_progress": 55.0, "part_index": 1, "total_parts": 1, "stage_current": 250, "stage_total": 500} {"type": "progress_end", "stage": "Traduzir Parágrafos", "stage_progress": 100.0, "overall_progress": 90.0, "part_index": 1, "total_parts": 1, "stage_current": 500, "stage_total": 500} {"type": "progress_start", "stage": "Salvar PDF", "stage_progress": 0.0, "overall_progress": 90.0, "part_index": 1, "total_parts": 1, "stage_current": 0, "stage_total": 10} {"type": "progress_update", "stage": "Salvar PDF", "stage_progress": 50.0, "overall_progress": 95.0, "part_index": 1, "total_parts": 1, "stage_current": 5, "stage_total": 10} {"type": "progress_end", "stage": "Salvar PDF", "stage_progress": 100.0, "overall_progress": 100.0, "part_index": 1, "total_parts": 1, "stage_current": 10, "stage_total": 10} {"type": "finish", "translate_result": {"original_pdf_path": "/caminho/para/input.pdf", "mono_pdf_path": "/caminho/para/output_mono.pdf", "dual_pdf_path": "/caminho/para/output_dual.pdf", "no_watermark_mono_pdf_path": null, "no_watermark_dual_pdf_path": null, "auto_extracted_glossary_path": "/caminho/para/glossary.csv", "total_seconds": 123.45, "peak_memory_usage": 256.0}} ```
ru: - `stage`: stage where the error occurred (if applicable) --- ### OUTPUT LANGUAGE ru --- ### TRANSLATION - Событие сводки этапа: `stage_summary` (опционально, может появиться первым) - Поля - `type`: "stage_summary" - `stages`: список объектов `{ "name": str, "percent": float }`, описывающих предполагаемое распределение работы - `part_index`: может быть 0 для этого сводного события - `total_parts`: общее количество частей (>= 1) - События прогресса: `progress_start`, `progress_update`, `progress_end` - Общие поля - `type`: один из вышеперечисленных - `stage`: читаемое имя этапа (например, "Разбор PDF и создание промежуточного представления", "Перевод абзацев", "Сохранение PDF") - `stage_progress`: число с плавающей точкой в [0, 100], указывающее прогресс в текущем этапе - `overall_progress`: число с плавающей точкой в [0, 100], указывающее общий прогресс - `part_index`: текущий индекс части (обычно начинается с 1 для событий прогресса) - `total_parts`: общее количество частей (>= 1). Большие документы могут автоматически разделяться. - `stage_current`: текущий шаг в этапе - `stage_total`: общее количество шагов в этапе - Событие завершения: `finish` - Поля - `type`: "finish" - `translate_result`: **объект**, предоставляющий окончательные выходные данные (ПРИМЕЧАНИЕ: не словарь, а экземпляр класса) - `original_pdf_path`: Путь к входному PDF - `mono_pdf_path`: Путь к монолингвальному переведенному PDF (или None) - `dual_pdf_path`: Путь к билингвальному переведенному PDF (или None) - `no_watermark_mono_pdf_path`: Путь к монолингвальному выводу без водяного знака (если создан), иначе None - `no_watermark_dual_pdf_path`: Путь к билингвальному выводу без водяного знака (если создан), иначе None - `auto_extracted_glossary_path`: Путь к автоматически извлеченному глоссарию CSV (или None) - `total_seconds`: затраченные секунды (число с плавающей точкой) - `peak_memory_usage`: приблизительное пиковое использование памяти во время перевода (число с плавающей точкой; единицы измерения зависят от реализации) - Событие ошибки: `error` - Поля - `type`: "error" - `error`: читаемое сообщение об ошибке - `error_type`: один из `BabeldocError`, `SubprocessError`, `IPCError`, `SubprocessCrashError` и т.д. - `details`: опциональные детали (например, исходная ошибка или трассировка) - `stage`: этап, на котором произошла ошибка (если применимо) - ### Example Usage: {#example-usage} ```python import asyncio from pdf2zh import pdf2zh, TranslationConfig, TranslationMode async def main(): config = TranslationConfig( target_lang_code="ru", # Target language: Russian mode=TranslationMode.DUAL, # Bilingual output enable_glossary=True, # Enable glossary extraction glossary_path="glossary.csv", # Custom glossary path watermark_text="Translated by pdf2zh", # Custom watermark text timeout=300, # Timeout in seconds max_workers=4, # Maximum number of concurrent workers ) result = await pdf2zh( "input.pdf", "output.pdf", config=config, ) print(f"Translation completed in {result.total_seconds:.2f} seconds") print(f"Peak memory usage: {result.peak_memory_usage} MB") asyncio.run(main()) ``` ### Configuration Options {#configuration-options} The `TranslationConfig` class accepts the following parameters: - `target_lang_code` (`str`): Target language code (e.g., "ru" for Russian). Default: "zh" (Chinese). - `mode` (`TranslationMode`): Translation mode. Can be `MONO` (monolingual) or `DUAL` (bilingual). Default: `MONO`. - `enable_glossary` (`bool`): Whether to enable glossary extraction. Default: `False`. - `glossary_path` (`str`): Path to a custom glossary CSV file. If not provided, a default path is used. Default: `None`. - `watermark_text` (`str`): Custom watermark text. If not provided, a default watermark is used. Default: `None`. - `timeout` (`int`): Timeout in seconds for the translation process. Default: `300`. - `max_workers` (`int`): Maximum number of concurrent workers for translation. Default: `4`. ### TranslationMode Enum {#translationmode-enum} The `TranslationMode` enum has two values: - `TranslationMode.MONO`: Monolingual output (only translated text). - `TranslationMode.DUAL`: Bilingual output (original and translated text side by side). ### Return Value {#return-value} The `pdf2zh` function returns a `TranslateResult` object with the following attributes: - `original_pdf_path` (`str`): Path to the input PDF file. - `mono_pdf_path` (`str` or `None`): Path to the monolingual translated PDF file (if mode is `MONO`). - `dual_pdf_path` (`str` or `None`): Path to the bilingual translated PDF file (if mode is `DUAL`). - `no_watermark_mono_pdf_path` (`str` or `None`): Path to the monolingual PDF without watermark (if produced). - `no_watermark_dual_pdf_path` (`str` or `None`): Path to the bilingual PDF without watermark (if produced). - `auto_extracted_glossary_path` (`str` or `None`): Path to the auto-extracted glossary CSV file. - `total_seconds` (`float`): Total time taken for translation in seconds. - `peak_memory_usage` (`float`): Peak memory usage during translation in megabytes. ### Error Handling {#error-handling} The function may raise the following exceptions: - `FileNotFoundError`: If the input PDF file does not exist. - `TranslationError`: If the translation process fails. - `TimeoutError`: If the translation process times out. ### Notes {#notes} - The function is asynchronous and must be awaited. - For large PDF files, consider increasing `timeout` and `max_workers`. - Glossary extraction requires additional processing time and memory. --- ### OUTPUT LANGUAGE ru --- ### TRANSLATION ### Пример использования {#example-usage} ```python import asyncio from pdf2zh import pdf2zh, TranslationConfig, TranslationMode async def main(): config = TranslationConfig( target_lang_code="ru", # Целевой язык: русский mode=TranslationMode.DUAL, # Билингвальный вывод enable_glossary=True, # Включить извлечение глоссария glossary_path="glossary.csv", # Пользовательский путь к глоссарию watermark_text="Переведено с помощью pdf2zh", # Пользовательский текст водяного знака timeout=300, # Таймаут в секундах max_workers=4, # Максимальное количество одновременных воркеров ) result = await pdf2zh( "input.pdf", "output.pdf", config=config, ) print(f"Перевод завершен за {result.total_seconds:.2f} секунд") print(f"Пиковое использование памяти: {result.peak_memory_usage} МБ") asyncio.run(main()) ``` ### Параметры конфигурации {#configuration-options} Класс `TranslationConfig` принимает следующие параметры: - `target_lang_code` (`str`): Код целевого языка (например, "ru" для русского). По умолчанию: "zh" (китайский). - `mode` (`TranslationMode`): Режим перевода. Может быть `MONO` (монолингвальный) или `DUAL` (билингвальный). По умолчанию: `MONO`. - `enable_glossary` (`bool`): Включить извлечение глоссария. По умолчанию: `False`. - `glossary_path` (`str`): Путь к пользовательскому файлу глоссария CSV. Если не указан, используется путь по умолчанию. По умолчанию: `None`. - `watermark_text` (`str`): Пользовательский текст водяного знака. Если не указан, используется водяной знак по умолчанию. По умолчанию: `None`. - `timeout` (`int`): Таймаут в секундах для процесса перевода. По умолчанию: `300`. - `max_workers` (`int`): Максимальное количество одновременных воркеров для перевода. По умолчанию: `4`. ### Перечисление TranslationMode {#translationmode-enum} Перечисление `TranslationMode` имеет два значения: - `TranslationMode.MONO`: Монолингвальный вывод (только переведенный текст). - `TranslationMode.DUAL`: Билингвальный вывод (оригинальный и переведенный текст рядом). ### Возвращаемое значение {#return-value} Функция `pdf2zh` возвращает объект `TranslateResult` со следующими атрибутами: - `original_pdf_path` (`str`): Путь к входному PDF-файлу. - `mono_pdf_path` (`str` или `None`): Путь к монолингвальному переведенному PDF-файлу (если режим `MONO`). - `dual_pdf_path` (`str` или `None`): Путь к билингвальному переведенному PDF-файлу (если режим `DUAL`). - `no_watermark_mono_pdf_path` (`str` или `None`): Путь к монолингвальному PDF без водяного знака (если создан). - `no_watermark_dual_pdf_path` (`str` или `None`): Путь к билингвальному PDF без водяного знака (если создан). - `auto_extracted_glossary_path` (`str` или `None`): Путь к автоматически извлеченному файлу глоссария CSV. - `total_seconds` (`float`): Общее время, затраченное на перевод, в секундах. - `peak_memory_usage` (`float`): Пиковое использование памяти во время перевода в мегабайтах. ### Обработка ошибок {#error-handling} Функция может вызывать следующие исключения: - `FileNotFoundError`: Если входной PDF-файл не существует. - `TranslationError`: Если процесс перевода не удался. - `TimeoutError`: Если процесс перевода превысил время ожидания. ### Примечания {#notes} - Функция является асинхронной и должна ожидаться. - Для больших PDF-файлов рассмотрите возможность увеличения `timeout` и `max_workers`. - Извлечение глоссария требует дополнительного времени обработки и памяти. - ### Command Line Usage: The command-line interface (CLI) provides a convenient way to use pdf2zh without writing code. ### Basic Usage ```bash pdf2zh input.pdf output.pdf ``` This command translates `input.pdf` to Chinese and saves the result to `output.pdf`. ### Specifying Target Language Use the `--target-lang` or `-t` option to specify the target language: ```bash pdf2zh input.pdf output.pdf --target-lang ru ``` ### Specifying Source Language Use the `--source-lang` or `-s` option to specify the source language (if auto-detection fails): ```bash pdf2zh input.pdf output.pdf --source-lang en --target-lang ru ``` ### Translation Mode Use the `--mode` or `-m` option to specify the translation mode: ```bash # Monolingual output (default) pdf2zh input.pdf output.pdf --mode mono # Bilingual output pdf2zh input.pdf output.pdf --mode dual ``` ### Page Range Use the `--page-range` or `-p` option to translate specific pages: ```bash # Translate pages 1 to 5 pdf2zh input.pdf output.pdf --page-range 1-5 # Translate pages 1, 3, and 5 pdf2zh input.pdf output.pdf --page-range 1,3,5 # Translate from page 10 to the end pdf2zh input.pdf output.pdf --page-range 10- ``` ### Output Format Use the `--output-format` or `-f` option to specify the output format: ```bash # Markdown output pdf2zh input.pdf output.md --output-format markdown # Text output pdf2zh input.pdf output.txt --output-format text # PDF output (default) pdf2zh input.pdf output.pdf --output-format pdf ``` ### Translation Service Use the `--translation-service` or `-S` option to specify the translation service: ```bash # Use Google Translate (default) pdf2zh input.pdf output.pdf --translation-service google # Use Azure Translator pdf2zh input.pdf output.pdf --translation-service azure # Use OpenAI pdf2zh input.pdf output.pdf --translation-service openai # Use Groq pdf2zh input.pdf output.pdf --translation-service groq # Use Anthropic pdf2zh input.pdf output.pdf --translation-service anthropic # Use DeepSeek pdf2zh input.pdf output.pdf --translation-service deepseek ``` ### API Key Use the `--api-key` or `-k` option to provide an API key: ```bash pdf2zh input.pdf output.pdf --translation-service openai --api-key YOUR_API_KEY ``` Alternatively, set the API key as an environment variable: ```bash export OPENAI_API_KEY=YOUR_API_KEY pdf2zh input.pdf output.pdf --translation-service openai ``` ### Configuration File Use the `--config` or `-c` option to specify a configuration file: ```bash pdf2zh input.pdf output.pdf --config config.json ``` ### Timeout Use the `--timeout` option to set a timeout in seconds: ```bash pdf2zh input.pdf output.pdf --timeout 600 ``` ### Concurrent Requests Use the `--concurrent-requests` or `-j` option to set the number of concurrent requests: ```bash pdf2zh input.pdf output.pdf --concurrent-requests 10 ``` ### Help Use the `--help` or `-h` option to display help: ```bash pdf2zh --help ``` ### Version Use the `--version` or `-v` option to display the version: ```bash pdf2zh --version ``` ### Examples ```bash # Translate a PDF from English to Russian using OpenAI pdf2zh document.pdf document_ru.pdf --source-lang en --target-lang ru --translation-service openai --api-key sk-... # Translate specific pages to markdown pdf2zh document.pdf document.md --page-range 1-5 --output-format markdown # Use a custom configuration file pdf2zh document.pdf output.pdf --config myconfig.json ``` --- ### OUTPUT LANGUAGE ru --- ### TRANSLATION ### Использование командной строки Интерфейс командной строки (CLI) предоставляет удобный способ использования pdf2zh без написания кода. ### Базовое использование ```bash pdf2zh input.pdf output.pdf ``` Эта команда переводит `input.pdf` на китайский и сохраняет результат в `output.pdf`. ### Указание целевого языка Используйте опцию `--target-lang` или `-t` для указания целевого языка: ```bash pdf2zh input.pdf output.pdf --target-lang ru ``` ### Указание исходного языка Используйте опцию `--source-lang` или `-s` для указания исходного языка (если автоматическое определение не удалось): ```bash pdf2zh input.pdf output.pdf --source-lang en --target-lang ru ``` ### Режим перевода Используйте опцию `--mode` или `-m` для указания режима перевода: ```bash # Монолингвальный вывод (по умолчанию) pdf2zh input.pdf output.pdf --mode mono # Билингвальный вывод pdf2zh input.pdf output.pdf --mode dual ``` ### Диапазон страниц Используйте опцию `--page-range` или `-p` для перевода определенных страниц: ```bash # Перевести страницы с 1 по 5 pdf2zh input.pdf output.pdf --page-range 1-5 # Перевести страницы 1, 3 и 5 pdf2zh input.pdf output.pdf --page-range 1,3,5 # Перевести с страницы 10 до конца pdf2zh input.pdf output.pdf --page-range 10- ``` ### Формат вывода Используйте опцию `--output-format` или `-f` для указания формата вывода: ```bash # Вывод в Markdown pdf2zh input.pdf output.md --output-format markdown # Текстовый вывод pdf2zh input.pdf output.txt --output-format text # Вывод в PDF (по умолчанию) pdf2zh input.pdf output.pdf --output-format pdf ``` ### Служба перевода Используйте опцию `--translation-service` или `-S` для указания службы перевода: ```bash # Использовать Google Translate (по умолчанию) pdf2zh input.pdf output.pdf --translation-service google # Использовать Azure Translator pdf2zh input.pdf output.pdf --translation-service azure # Использовать OpenAI pdf2zh input.pdf output.pdf --translation-service openai # Использовать Groq pdf2zh input.pdf output.pdf --translation-service groq # Использовать Anthropic pdf2zh input.pdf output.pdf --translation-service anthropic # Использовать DeepSeek pdf2zh input.pdf output.pdf --translation-service deepseek ``` ### API-ключ Используйте опцию `--api-key` или `-k` для предоставления API-ключа: ```bash pdf2zh input.pdf output.pdf --translation-service openai --api-key YOUR_API_KEY ``` Альтернативно, установите API-ключ как переменную окружения: ```bash export OPENAI_API_KEY=YOUR_API_KEY pdf2zh input.pdf output.pdf --translation-service openai ``` ### Файл конфигурации Используйте опцию `--config` или `-c` для указания файла конфигурации: ```bash pdf2zh input.pdf output.pdf --config config.json ``` ### Таймаут Используйте опцию `--timeout` для установки таймаута в секундах: ```bash pdf2zh input.pdf output.pdf --timeout 600 ``` ### Одновременные запросы Используйте опцию `--concurrent-requests` или `-j` для установки количества одновременных запросы: ```bash pdf2zh input.pdf output.pdf --concurrent-requests 10 ``` ### Справка Используйте опцию `--help` или `-h` для отображения справки: ```bash pdf2zh --help ``` ### Версия Используйте опцию `--version` или `-v` для отображения версии: ```bash pdf2zh --version ``` ### Примеры ```bash # Перевести PDF с английского на русский с использованием OpenAI pdf2zh document.pdf document_ru.pdf --source-lang en --target-lang ru --translation-service openai --api-key sk-... # Перевести определенные страницы в markdown pdf2zh document.pdf document.md --page-range 1-5 --output-format markdown # Использовать пользовательский файл конфигурации pdf2zh document.pdf output.pdf --config myconfig.json ``` - ### Bypass List: The following terms should not be translated and should remain in their original form: - pdf2zh - PDFMathTranslate - API - CLI - CSV - JSON - Markdown - PDF - URL - UUID - XML - ZIP --- ### OUTPUT LANGUAGE ru --- ### TRANSLATION ### Список исключений Следующие термины не должны переводиться и должны оставаться в исходной форме: - pdf2zh - PDFMathTranslate - API - CLI - CSV - JSON - Markdown - PDF - URL - UUID - XML - ZIP - ### Installation: You can install pdf2zh using pip: ```bash pip install pdf2zh ``` ### Upgrade To upgrade to the latest version: ```bash pip install --upgrade pdf2zh ``` ### Installation from Source If you want to install from the source code: 1. Clone the repository: ```bash git clone https://github.com/pdf2zh/pdf2zh.git cd pdf2zh ``` 2. Install in development mode: ```bash pip install -e . ``` ### Dependencies pdf2zh requires Python 3.8 or higher. The following dependencies are automatically installed: - `requests` for HTTP requests - `PyMuPDF` for PDF processing - `tqdm` for progress bars - `aiohttp` for asynchronous HTTP requests (optional, for async features) ### Verifying Installation After installation, you can verify that pdf2zh is installed correctly by running: ```bash pdf2zh --version ``` This should output the version number of pdf2zh. ### Troubleshooting If you encounter issues during installation: - Ensure you have Python 3.8 or higher installed. - Make sure pip is up to date: `pip install --upgrade pip` - On some systems, you may need to install additional system dependencies for PyMuPDF. See the [PyMuPDF installation guide](https://pymupdf.readthedocs.io/en/latest/installation.html) for details. --- ### OUTPUT LANGUAGE ru --- ### TRANSLATION ### Установка Вы можете установить pdf2zh с помощью pip: ```bash pip install pdf2zh ``` ### Обновление Чтобы обновиться до последней версии: ```bash pip install --upgrade pdf2zh ``` ### Установка из исходного кода Если вы хотите установить из исходного кода: 1. Клонируйте репозиторий: ```bash git clone https://github.com/pdf2zh/pdf2zh.git cd pdf2zh ``` 2. Установите в режиме разработки: ```bash pip install -e . ``` ### Зависимости pdf2zh требует Python 3.8 или выше. Следующие зависимости устанавливаются автоматически: - `requests` для HTTP-запросов - `PyMuPDF` для обработки PDF - `tqdm` для индикаторов прогресса - `aiohttp` для асинхронных HTTP-запросов (опционально, для асинхронных функций) ### Проверка установки После установки вы можете проверить, что pdf2zh установлен правильно, выполнив: ```bash pdf2zh --version ``` Это должно вывести номер версии pdf2zh. ### Устранение неполадок Если у вас возникли проблемы во время установки: - Убедитесь, что у вас установлен Python 3.8 или выше. - Убедитесь, что pip обновлен: `pip install --upgrade pip` - В некоторых системах может потребоваться установить дополнительные системные зависимости для PyMuPDF. Подробности см. в [руководстве по установке PyMuPDF](https://pymupdf.readthedocs.io/en/latest/installation.html). - ### Usage: pdf2zh can be used in three ways: 1. **Command Line Interface (CLI)**: For quick translations without writing code. 2. **Python API**: For integrating into Python applications. 3. **Web Interface**: For easy-to-use graphical translation. ### Command Line Interface The CLI is the simplest way to use pdf2zh. Basic usage: ```bash pdf2zh input.pdf output.pdf ``` This translates `input.pdf` to Chinese and saves the result to `output.pdf`. #### Options - `--target-lang`, `-t`: Target language code (e.g., `ru` for Russian). Default: `zh`. - `--source-lang`, `-s`: Source language code (e.g., `en` for English). Default: auto-detect. - `--mode`, `-m`: Translation mode: `mono` (monolingual) or `dual` (bilingual). Default: `mono`. - `--page-range`, `-p`: Page range to translate (e.g., `1-5` or `1,3,5`). Default: all pages. - `--output-format`, `-f`: Output format: `pdf`, `markdown`, or `text`. Default: `pdf`. - `--translation-service`, `-S`: Translation service: `google`, `azure`, `openai`, `groq`, `anthropic`, or `deepseek`. Default: `google`. - `--api-key`, `-k`: API key for the translation service. - `--config`, `-c`: Path to a custom configuration file. - `--timeout`: Timeout in seconds. Default: `300`. - `--concurrent-requests`, `-j`: Number of concurrent requests. Default: `5`. - `--help`, `-h`: Show help message. - `--version`, `-v`: Show version. #### Examples ```bash # Translate to Russian pdf2zh input.pdf output.pdf --target-lang ru # Translate specific pages to markdown pdf2zh input.pdf output.md --page-range 1-5 --output-format markdown # Use OpenAI with API key pdf2zh input.pdf output.pdf --translation-service openai --api-key sk-... ``` ### Python API For more control, use the Python API: ```python import asyncio from pdf2zh import pdf2zh, TranslationConfig, TranslationMode async def main(): config = TranslationConfig( target_lang_code="ru", mode=TranslationMode.DUAL, enable_glossary=True, glossary_path="glossary.csv", watermark_text="Translated by pdf2zh", timeout=300, max_workers=4, ) result = await pdf2zh( "input.pdf", "output.pdf", config=config, ) print(f"Translation completed in {result.total_seconds:.2f} seconds") asyncio.run(main()) ``` #### Synchronous Version For synchronous usage: ```python from pdf2zh import pdf2zh_sync result = pdf2zh_sync( "input.pdf", "output.pdf", target_lang_code="ru", ) print(result) ``` ### Web Interface The web interface provides a user-friendly way to translate PDFs. Start the web server: ```bash pdf2zh-web ``` Then open `http://localhost:8501` in your browser. ### Advanced Usage For advanced usage, such as streaming translation progress or custom event handling, see the [Advanced Usage](./ADVANCED.md) documentation. --- ### OUTPUT LANGUAGE ru --- ### TRANSLATION ### Использование pdf2zh можно использовать тремя способами: 1. **Интерфейс командной строки (CLI)**: Для быстрого перевода без написания кода. 2. **Python API**: Для интеграции в приложения Python. 3. **Веб-интерфейс**: Для удобного графического перевода. ### Интерфейс командной строки CLI — это самый простой способ использования pdf2zh. Базовое использование: ```bash pdf2zh input.pdf output.pdf ``` Это переводит `input.pdf` на китайский и сохраняет результат в `output.pdf`. #### Опции - `--target-lang`, `-t`: Код целевого языка (например, `ru` для русского). По умолчанию: `zh`. - `--source-lang`, `-s`: Код исходного языка (например, `en` для английского). По умолчанию: автоматическое определение. - `--mode`, `-m`: Режим перевода: `mono` (монолингвальный) или `dual` (билингвальный). По умолчанию: `mono`. - `--page-range`, `-p`: Диапазон страниц для перевода (например, `1-5` или `1,3,5`). По умолчанию: все страницы. - `--output-format`, `-f`: Формат вывода: `pdf`, `markdown` или `text`. По умолчанию: `pdf`. - `--translation-service`, `-S`: Служба перевода: `google`, `azure`, `openai`, `groq`, `anthropic` или `deepseek`. По умолчанию: `google`. - `--api-key`, `-k`: API-ключ для службы перевода. - `--config`, `-c`: Путь к пользовательскому файлу конфигурации. - `--timeout`: Таймаут в секундах. По умолчанию: `300`. - `--concurrent-requests`, `-j`: Количество одновременных запросов. По умолчанию: `5`. - `--help`, `-h`: Показать сообщение справки. - `--version`, `-v`: Показать версию. #### Примеры ```bash # Перевести на русский pdf2zh input.pdf output.pdf --target-lang ru # Перевести определенные страницы в markdown pdf2zh input.pdf output.md --page-range 1-5 --output-format markdown # Использовать OpenAI с API-ключом pdf2zh input.pdf output.pdf --translation-service openai --api-key sk-... ``` ### Python API Для большего контроля используйте Python API: ```python import asyncio from pdf2zh import pdf2zh, TranslationConfig, TranslationMode async def main(): config = TranslationConfig( target_lang_code="ru", mode=TranslationMode.DUAL, enable_glossary=True, glossary_path="glossary.csv", watermark_text="Переведено с помощью pdf2zh", timeout=300, max_workers=4, ) result = await pdf2zh( "input.pdf", "output.pdf", config=config, ) print(f"Перевод завершен за {result.total_seconds:.2f} секунд") asyncio.run(main()) ``` #### Синхронная версия Для синхронного использования: ```python from pdf2zh import pdf2zh_sync result = pdf2zh_sync( "input.pdf", "output.pdf", target_lang_code="ru", ) print(result) ``` ### Веб-интерфейс Веб-интерфейс предоставляет удобный способ перевода PDF. Запустите веб-сервер: ```bash pdf2zh-web ``` Затем откройте `http://localhost:8501` в вашем браузере. ### Расширенное использование Для расширенного использования, такого как потоковая передача прогресса перевода или пользовательская обработка событий, см. документацию [Расширенное использование](./ADVANCED.md).
