Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_1336591D
source: | `--skip-scanned-detection` | Skip scanned detection | `pdf2zh_next example.pdf --skip-scanned-detection` |
de: | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--skip-scanned-detection=true` | Skip scanned detection, same as above | `pdf2zh_next example.pdf --skip-scanned-detection=true` | | `--skip-scanned-detection=auto` | Automatically determine if the PDF is a scanned document, and skip if it is a scan | `pdf2zh_next example.pdf --skip-scanned-detection=auto` | | `--skip-scanned-detection=skip` | Skip scanned detection, same as `true` | `pdf2zh_next example.pdf --skip-scanned-detection=skip` | | `--skip-scanned-detection=force`| Force to skip scanned detection, even if the PDF is determined to be a scanned document | `pdf2zh_next example.pdf --skip-scanned-detection=force` | --- ### TRANSLATION RESULT | `--skip-scanned-detection` | Überspringe die Erkennung gescannter Dokumente | `pdf2zh_next example.pdf --skip-scanned-detection` | | ------------------------------- | -------------------------------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--skip-scanned-detection=true` | Überspringe die Erkennung gescannter Dokumente, identisch zur obigen Option | `pdf2zh_next example.pdf --skip-scanned-detection=true` | | `--skip-scanned-detection=auto` | Automatische Erkennung, ob das PDF ein gescanntes Dokument ist, und Überspringen, wenn es sich um einen Scan handelt | `pdf2zh_next example.pdf --skip-scanned-detection=auto` | | `--skip-scanned-detection=skip` | Überspringe die Erkennung gescannter Dokumente, identisch zu `true` | `pdf2zh_next example.pdf --skip-scanned-detection=skip` | | `--skip-scanned-detection=force`| Erzwinge das Überspringen der Erkennung gescannter Dokumente, auch wenn das PDF als gescanntes Dokument erkannt wurde | `pdf2zh_next example.pdf --skip-scanned-detection=force` |
fr: |---------------------------------|-----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------| | `--skip-title-detection` | Skip title detection | `pdf2zh_next example.pdf --skip-title-detection` | | `--skip-table-detection` | Skip table detection | `pdf2zh_next example.pdf --skip-table-detection` | | `--skip-formula-detection` | Skip formula detection | `pdf2zh_next example.pdf --skip-formula-detection` | | `--skip-reference-detection` | Skip reference detection | `pdf2zh_next example.pdf --skip-reference-detection` | | `--skip-figure-detection` | Skip figure detection | `pdf2zh_next example.pdf --skip-figure-detection` | | `--skip-header-footer-detection`| Skip header and footer detection | `pdf2zh_next example.pdf --skip-header-footer-detection` | | `--skip-footnote-detection` | Skip footnote detection | `pdf2zh_next example.pdf --skip-footnote-detection` | | `--skip-page-number-detection` | Skip page number detection | `pdf2zh_next example.pdf --skip-page-number-detection` | | `--skip-margin-text-detection` | Skip margin text detection | `pdf2zh_next example.pdf --skip-margin-text-detection` | | `--skip-watermark-detection` | Skip watermark detection | `pdf2zh_next example.pdf --skip-watermark-detection` | --- ### OUTPUT | `--skip-scanned-detection` | Ignorer la détection de documents scannés | `pdf2zh_next example.pdf --skip-scanned-detection` | |---------------------------------|-----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------| | `--skip-title-detection` | Ignorer la détection de titres | `pdf2zh_next example.pdf --skip-title-detection` | | `--skip-table-detection` | Ignorer la détection de tableaux | `pdf2zh_next example.pdf --skip-table-detection` | | `--skip-formula-detection` | Ignorer la détection de formules | `pdf2zh_next example.pdf --skip-formula-detection` | | `--skip-reference-detection` | Ignorer la détection de références | `pdf2zh_next example.pdf --skip-reference-detection` | | `--skip-figure-detection` | Ignorer la détection de figures | `pdf2zh_next example.pdf --skip-figure-detection` | | `--skip-header-footer-detection`| Ignorer la détection des en-têtes et pieds de page | `pdf2zh_next example.pdf --skip-header-footer-detection` | | `--skip-footnote-detection` | Ignorer la détection de notes de bas de page | `pdf2zh_next example.pdf --skip-footnote-detection` | | `--skip-page-number-detection` | Ignorer la détection des numéros de page | `pdf2zh_next example.pdf --skip-page-number-detection` | | `--skip-margin-text-detection` | Ignorer la détection de texte en marge | `pdf2zh_next example.pdf --skip-margin-text-detection` | | `--skip-watermark-detection` | Ignorer la détection de filigranes | `pdf2zh_next example.pdf --skip-watermark-detection` |
it: | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--skip-table-detection` | Skip table detection | `pdf2zh_next example.pdf --skip-table-detection` | | `--skip-non-text-detection` | Skip non-text detection (such as images) | `pdf2zh_next example.pdf --skip-non-text-detection` | | `--skip-formula-detection` | Skip formula detection | `pdf2zh_next example.pdf --skip-formula-detection` | | `--skip-list-detection` | Skip list detection | `pdf2zh_next example.pdf --skip-list-detection` | | `--skip-title-detection` | Skip title detection | `pdf2zh_next example.pdf --skip-title-detection` | | `--skip-reference-detection` | Skip reference detection | `pdf2zh_next example.pdf --skip-reference-detection` | | `--skip-footer-header-detection`| Skip footer and header detection | `pdf2zh_next example.pdf --skip-footer-header-detection` | | `--skip-figure-detection` | Skip figure detection | `pdf2zh_next example.pdf --skip-figure-detection` | | `--skip-footnote-detection` | Skip footnote detection | `pdf2zh_next example.pdf --skip-footnote-detection` | | `--skip-page-number-detection` | Skip page number detection | `pdf2zh_next example.pdf --skip-page-number-detection` | | `--skip-caption-detection` | Skip caption detection | `pdf2zh_next example.pdf --skip-caption-detection` | | `--skip-abstract-detection` | Skip abstract detection | `pdf2zh_next example.pdf --skip-abstract-detection` | --- ### TRANSLATION RESULT | `--skip-scanned-detection` | Salta il rilevamento dei documenti scansionati | `pdf2zh_next example.pdf --skip-scanned-detection` | | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--skip-table-detection` | Salta il rilevamento delle tabelle | `pdf2zh_next example.pdf --skip-table-detection` | | `--skip-non-text-detection` | Salta il rilevamento degli elementi non testuali (come le immagini) | `pdf2zh_next example.pdf --skip-non-text-detection` | | `--skip-formula-detection` | Salta il rilevamento delle formule | `pdf2zh_next example.pdf --skip-formula-detection` | | `--skip-list-detection` | Salta il rilevamento degli elenchi | `pdf2zh_next example.pdf --skip-list-detection` | | `--skip-title-detection` | Salta il rilevamento dei titoli | `pdf2zh_next example.pdf --skip-title-detection` | | `--skip-reference-detection` | Salta il rilevamento dei riferimenti | `pdf2zh_next example.pdf --skip-reference-detection` | | `--skip-footer-header-detection`| Salta il rilevamento dei piè di pagina e delle intestazioni | `pdf2zh_next example.pdf --skip-footer-header-detection` | | `--skip-figure-detection` | Salta il rilevamento delle figure | `pdf2zh_next example.pdf --skip-figure-detection` | | `--skip-footnote-detection` | Salta il rilevamento delle note a piè di pagina | `pdf2zh_next example.pdf --skip-footnote-detection` | | `--skip-page-number-detection` | Salta il rilevamento dei numeri di pagina | `pdf2zh_next example.pdf --skip-page-number-detection` | | `--skip-caption-detection` | Salta il rilevamento delle didascalie | `pdf2zh_next example.pdf --skip-caption-detection` | | `--skip-abstract-detection` | Salta il rilevamento degli abstract | `pdf2zh_next example.pdf --skip-abstract-detection` |
pt: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--skip-scanned-detection=true` | Skip scanned detection | `pdf2zh_next example.pdf --skip-scanned-detection=true` | | `--skip-scanned-detection=false`| Do not skip scanned detection | `pdf2zh_next example.pdf --skip-scanned-detection=false` | | `--scanned-image-dpi` | Set the DPI for scanned image processing | `pdf2zh_next example.pdf --scanned-image-dpi=300` | | `--scanned-image-dpi=300` | Set the DPI for scanned image processing to 300 | `pdf2zh_next example.pdf --scanned-image-dpi=300` | | `--scanned-image-dpi=600` | Set the DPI for scanned image processing to 600 | `pdf2zh_next example.pdf --scanned-image-dpi=600` | | `--skip-text-extraction` | Skip text extraction | `pdf2zh_next example.pdf --skip-text-extraction` | | `--skip-text-extraction=true` | Skip text extraction | `pdf2zh_next example.pdf --skip-text-extraction=true` | | `--skip-text-extraction=false` | Do not skip text extraction | `pdf2zh_next example.pdf --skip-text-extraction=false` | | `--skip-text-translation` | Skip text translation | `pdf2zh_next example.pdf --skip-text-translation` | | `--skip-text-translation=true` | Skip text translation | `pdf2zh_next example.pdf --skip-text-translation=true` | | `--skip-text-translation=false` | Do not skip text translation | `pdf2zh_next example.pdf --skip-text-translation=false` | | `--skip-image-translation` | Skip image translation | `pdf2zh_next example.pdf --skip-image-translation` | | `--skip-image-translation=true` | Skip image translation | `pdf2zh_next example.pdf --skip-image-translation=true` | | `--skip-image-translation=false`| Do not skip image translation | `pdf2zh_next example.pdf --skip-image-translation=false` | | `--skip-image-ocr` | Skip image OCR | `pdf2zh_next example.pdf --skip-image-ocr` | | `--skip-image-ocr=true` | Skip image OCR | `pdf2zh_next example.pdf --skip-image-ocr=true` | | `--skip-image-ocr=false` | Do not skip image OCR | `pdf2zh_next example.pdf --skip-image-ocr=false` | | `--skip-image-inpainting` | Skip image inpainting | `pdf2zh_next example.pdf --skip-image-inpainting` | | `--skip-image-inpainting=true` | Skip image inpainting | `pdf2zh_next example.pdf --skip-image-inpainting=true` | | `--skip-image-inpainting=false` | Do not skip image inpainting | `pdf2zh_next example.pdf --skip-image-inpainting=false` | | `--skip-image-super-resolution` | Skip image super resolution | `pdf2zh_next example.pdf --skip-image-super-resolution` | | `--skip-image-super-resolution=true` | Skip image super resolution | `pdf2zh_next example.pdf --skip-image-super-resolution=true` | | `--skip-image-super-resolution=false` | Do not skip image super resolution | `pdf2zh_next example.pdf --skip-image-super-resolution=false` | | `--skip-table-translation` | Skip table translation | `pdf2zh_next example.pdf --skip-table-translation` | | `--skip-table-translation=true` | Skip table translation | `pdf2zh_next example.pdf --skip-table-translation=true` | | `--skip-table-translation=false`| Do not skip table translation | `pdf2zh_next example.pdf --skip-table-translation=false` | | `--skip-equation-translation` | Skip equation translation | `pdf2zh_next example.pdf --skip-equation-translation` | | `--skip-equation-translation=true` | Skip equation translation | `pdf2zh_next example.pdf --skip-equation-translation=true` | | `--skip-equation-translation=false` | Do not skip equation translation | `pdf2zh_next example.pdf --skip-equation-translation=false` | | `--skip-reference-translation` | Skip reference translation | `pdf2zh_next example.pdf --skip-reference-translation` | | `--skip-reference-translation=true` | Skip reference translation | `pdf2zh_next example.pdf --skip-reference-translation=true` | | `--skip-reference-translation=false` | Do not skip reference translation | `pdf2zh_next example.pdf --skip-reference-translation=false` | | `--skip-caption-translation` | Skip caption translation | `pdf2zh_next example.pdf --skip-caption-translation` | | `--skip-caption-translation=true` | Skip caption translation | `pdf2zh_next example.pdf --skip-caption-translation=true` | | `--skip-caption-translation=false` | Do not skip caption translation | `pdf2zh_next example.pdf --skip-caption-translation=false` | | `--skip-footnote-translation` | Skip footnote translation | `pdf2zh_next example.pdf --skip-footnote-translation` | | `--skip-footnote-translation=true` | Skip footnote translation | `pdf2zh_next example.pdf --skip-footnote-translation=true` | | `--skip-footnote-translation=false` | Do not skip footnote translation | `pdf2zh_next example.pdf --skip-footnote-translation=false` | | `--skip-header-translation` | Skip header translation | `pdf2zh_next example.pdf --skip-header-translation` | | `--skip-header-translation=true` | Skip header translation | `pdf2zh_next example.pdf --skip-header-translation=true` | | `--skip-header-translation=false` | Do not skip header translation | `pdf2zh_next example.pdf --skip-header-translation=false` | | `--skip-footer-translation` | Skip footer translation | `pdf2zh_next example.pdf --skip-footer-translation` | | `--skip-footer-translation=true` | Skip footer translation | `pdf2zh_next example.pdf --skip-footer-translation=true` | | `--skip-footer-translation=false` | Do not skip footer translation | `pdf2zh_next example.pdf --skip-footer-translation=false` | | `--skip-page-number-translation`| Skip page number translation | `pdf2zh_next example.pdf --skip-page-number-translation` | | `--skip-page-number-translation=true` | Skip page number translation | `pdf2zh_next example.pdf --skip-page-number-translation=true` | | `--skip-page-number-translation=false` | Do not skip page number translation | `pdf2zh_next example.pdf --skip-page-number-translation=false` | | `--skip-toc-translation` | Skip table of contents translation | `pdf2zh_next example.pdf --skip-toc-translation` | | `--skip-toc-translation=true` | Skip table of contents translation | `pdf2zh_next example.pdf --skip-toc-translation=true` | | `--skip-toc-translation=false` | Do not skip table of contents translation | `pdf2zh_next example.pdf --skip-toc-translation=false` | | `--skip-index-translation` | Skip index translation | `pdf2zh_next example.pdf --skip-index-translation` | | `--skip-index-translation=true` | Skip index translation | `pdf2zh_next example.pdf --skip-index-translation=true` | | `--skip-index-translation=false`| Do not skip index translation | `pdf2zh_next example.pdf --skip-index-translation=false` | | `--skip-glossary-translation` | Skip glossary translation | `pdf2zh_next example.pdf --skip-glossary-translation` | | `--skip-glossary-translation=true` | Skip glossary translation | `pdf2zh_next example.pdf --skip-glossary-translation=true` | | `--skip-glossary-translation=false` | Do not skip glossary translation | `pdf2zh_next example.pdf --skip-glossary-translation=false` | | `--skip-bibliography-translation` | Skip bibliography translation | `pdf2zh_next example.pdf --skip-bibliography-translation` | | `--skip-bibliography-translation=true` | Skip bibliography translation | `pdf2zh_next example.pdf --skip-bibliography-translation=true` | | `--skip-bibliography-translation=false` | Do not skip bibliography translation | `pdf2zh_next example.pdf --skip-bibliography-translation=false` | | `--skip-abstract-translation` | Skip abstract translation | `pdf2zh_next example.pdf --skip-abstract-translation` | | `--skip-abstract-translation=true` | Skip abstract translation | `pdf2zh_next example.pdf --skip-abstract-translation=true` | | `--skip-abstract-translation=false` | Do not skip abstract translation | `pdf2zh_next example.pdf --skip-abstract-translation=false` | | `--skip-title-translation` | Skip title translation | `pdf2zh_next example.pdf --skip-title-translation` | | `--skip-title-translation=true` | Skip title translation | `pdf2zh_next example.pdf --skip-title-translation=true` | | `--skip-title-translation=false`| Do not skip title translation | `pdf2zh_next example.pdf --skip-title-translation=false` | | `--skip-author-translation` | Skip author translation | `pdf2zh_next example.pdf --skip-author-translation` | | `--skip-author-translation=true` | Skip author translation | `pdf2zh_next extreme.pdf --skip-author-translation=true` | | `--skip-author-translation=false` | Do not skip author translation | `pdf2zh_next example.pdf --skip-author-translation=false` | | `--skip-date-translation` | Skip date translation | `pdf2zh_next example.pdf --skip-date-translation` | | `--skip-date 极速模式-translation=true` | Skip date translation | `pdf2zh_next example.pdf --skip-date-translation=true` | | `--skip-date-translation=false` | Do not skip date translation | `pdf2zh_next example.pdf --skip-date-translation=false` | --- ### TRANSLATED TEXT | `--skip-scanned-detection` | Ignorar detecção de digitalizado | `pdf2zh_next example.pdf --skip-scanned-detection` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--skip-scanned-detection=true` | Ignorar detecção de digitalizado | `pdf2zh_next example.pdf --skip-scanned-detection=true` | | `--极速模式-skip-scanned-detection=false`| Não ignorar detecção de digitalizado | `pdf2zh_next example.pdf --skip-scanned-detection=false` | | `--scanned-image-dpi` | Definir o DPI para processamento de imagem digitalizada | `pdf2zh_next example.pdf --scanned-image-dpi=300` | | `--scanned-image-dpi=300` | Definir o DPI para processamento de imagem digitalizada como 300 | `pdf2zh_next example.pdf --scanned-image 极速模式-dpi=300` | | `--scanned-image-dpi=600` | Definir o DPI para processamento de imagem digitalizada como 600 | `pdf2zh_next example.pdf --scanned-image-dpi=600` | | `--skip-text-extraction` | Ignorar extração de texto | `pdf2zh_next example.pdf --skip-text-extraction` | | `--skip-text-extraction=true` | Ignorar extração de texto | `pdf2zh_next example.pdf --skip-text-extraction=true` | | `--skip-text-extraction=false` | Não ignorar extração de texto | `pdf2zh_next example.pdf --skip-text-extraction=false` | | `--skip-text-translation` | Ignorar tradução de texto | `pdf2zh_next example.pdf --skip-text-translation` | | `--skip-text-translation=true` | Ignorar tradução de texto | `pdf2zh_next example.pdf --skip-text-translation=true` | | `--skip-text-translation=false` | Não ignorar tradução de texto | `pdf2zh_next example.pdf --skip-text-translation=false` | | `--skip-image-translation` | Ignorar tradução de imagem | `pdf2zh_next example.pdf --skip-image-translation` | | `--skip-image-translation=true` | Ignorar tradução de imagem | `pdf2zh_next example.pdf --skip-image-translation=true` | | `--skip-image-translation=false`| Não ignorar tradução de imagem | `pdf2zh_next example.pdf --skip-image-translation=false` | | `--skip-image-ocr` | Ignorar OCR de imagem | `pdf 极速模式 2zh_next example.pdf --skip-image-ocr` | | `--skip-image-ocr=true` | Ignorar OCR de imagem | `pdf2zh_next example.pdf --skip-image-ocr=true` | | `--skip-image-ocr=false` | Não ignorar OCR de imagem | `pdf2zh_next example.pdf --skip-image-ocr=false` | | `--skip-image-inpainting` | Ignorar preenchimento de imagem | `pdf2zh_next example.pdf --skip-image-inpainting` | | `--skip-image-inpainting=true` | Ignorar preenchimento de imagem | `pdf2zh_next example.pdf --skip-image-inpainting=true` | | `--skip-image-inpainting=false` | Não ignorar preenchimento de imagem | `pdf2zh_next example.pdf --skip-image-inpainting=false` | | `--skip-image-super-resolution` | Ignorar super-resolução de imagem | `pdf2zh_next example.pdf --skip-image-super-resolution` | | `--skip-image-super-resolution=true` | Ignorar super-resolução de imagem | `pdf2zh_next example.pdf --skip-image-super-resolution=true` | | `--skip-image-super-resolution=false` | Não ignorar super-resolução de imagem | `pdf2zh_next example.pdf --skip-image-super-resolution=false` | | `--skip-table-translation` | Ignorar tradução de tabela | `pdf2zh_next example.pdf --skip-table-translation` | | `--skip-table-translation=true` | Ignorar tradução de tabela | `pdf2zh_next example.pdf --skip-table-translation=true` | | `--skip-table-translation=false`| Não ignorar tradução de tabela | `pdf2zh_next example.pdf --skip-table-translation=false` | | `--skip-equation-translation` | Ignorar tradução de equação | `pdf2zh_next example.pdf --skip-equation-translation` | | `--skip-equation-translation=true` | Ignorar tradução de equação | `pdf2zh_next example.pdf --skip-equation-translation=true` | | `--skip-equation-translation=false` | Não ignorar tradução de equação | `pdf2zh_next example.pdf --skip-equation-translation=false` | | `--skip-reference-translation 极速模式` | Ignorar tradução de referência | `pdf2zh_next example.pdf --skip-reference-translation` | | `--skip-reference-translation=true` | Ignorar tradução de referência | `pdf2zh_next example.pdf --skip-reference-translation=true` | | `--skip-reference-translation=false` | Não ignorar tradução de referência | `pdf2zh_next example.pdf --skip-reference-translation=false` | | `--skip-caption-translation` | Ignorar tradução de legenda | `pdf2zh_next example.pdf --skip-caption-translation` | | `--skip-caption-translation=true` | Ignorar tradução de legenda | `pdf2zh_next example.pdf --skip-caption-translation=true` | | `--skip-caption-translation=false` | Não ignorar tradução de legenda | `pdf2zh_next example.pdf --skip-caption-translation=false` | | `--skip-footnote-translation` | Ignorar tradução de nota de rodapé | `pdf2zh_next example.pdf --skip-footnote-translation` | | `--skip-footnote-translation=true` | Ignorar tradução de nota de rodapé | `pdf2zh_next example.pdf --skip-footnote-translation=true` | | `--skip-footnote-translation=false` | Não ignorar tradução de nota de rodapé | `pdf2zh_next example.pdf --skip-footnote-translation=false` | | `--skip-header-translation` | Ignorar tradução de cabeçalho | `pdf2zh_next example.pdf --skip-header-translation` | | `--skip-header-translation=true` | Ignorar tradução de cabeçalho | `pdf2zh_next example.pdf --skip-header-translation=true` | | `--skip-header-translation=false` | Não ignorar tradução de cabeçalho | `pdf2zh_next example.pdf --skip-header-translation=false` | | `--skip-footer-translation` | Ignorar tradução de rodapé | `pdf2zh_next example.pdf --skip-footer-translation 极速模式` | | `--skip-footer-translation=true` | Ignorar tradução de rodapé | `pdf2 极速模式 zh_next example.pdf --skip-footer-translation=true` | | `--skip-footer-translation=false` | Não ignorar tradução de rodapé | `pdf2zh_next example.pdf --skip-footer-translation=false` | | `--skip-page-number-translation`| Ignorar tradução de número de página | `pdf2zh_next example.pdf --skip-page-number-translation` | | `--skip-page-number-translation=true` | Ignorar tradução de número de página | `pdf2zh_next example.pdf --skip-page-number-translation=true` | | `--skip-page-number-translation=false` | Não ignorar tradução de número de página | `pdf2zh_next example.pdf --skip-page-number-translation=false` | | `--skip-toc-translation` | Ignorar tradução de índice | `pdf2zh_next example.pdf --skip-toc-translation` | | `--skip-toc-translation=true` | Ignorar tradução de índice | `pdf2zh_next example.pdf --skip-toc-translation=true` | | `--skip-toc-translation=false` | Não ignorar tradução de índice | `pdf2zh_next example.pdf --skip-toc-translation=false` | | `--skip-index-translation` | Ignorar tradução de índice | `pdf2zh_next example.pdf --skip-index-translation` | | `--skip-index-translation=true` | Ignorar tradução de índice | `pdf2zh_next example.pdf --skip-index-translation=true` | | `--skip-index-translation=false`| Não ignorar tradução de índice | `pdf2zh_next example.pdf --skip-index-translation=false` | | `--skip-glossary-translation` | Ignorar tradução de glossário | `pdf2zh_next example.pdf --skip-glossary-translation` | | `--skip-glossary-translation=true` | Ignorar tradução de glossário | `pdf2zh_next example.pdf --skip-glossary-translation=true` | | `--skip-glossary-translation=false` | Não ignorar tradução de glossário | `pdf2zh_next example.pdf --skip-glossary-translation=false` | | `--skip-bibliography-translation` | Ignorar tradução de bibliografia | `pdf2zh_next example.pdf --skip-bibliography-translation` | | `--skip-bibliography-translation=true` | Ignorar tradução de bibliografia | `pdf2zh_next example.pdf --skip-bibliography-translation=true` | | `--skip-bibliography-translation=false` | Não ignorar tradução de bibliografia | `pdf2zh_next example.pdf --skip-bibliography-translation=false` | | `--skip-abstract-translation` | Ignorar tradução de resumo | `pdf2zh_next example.pdf --skip-abstract-translation` | | `--skip-abstract-translation=true 极速模式` | Ignorar tradução de resumo | `pdf2zh_next example.pdf --skip-abstract-translation=true` | | `--skip-abstract-translation=false` | Não ignorar tradução de resumo | `pdf2zh_next example.pdf --skip-abstract-translation=false` | | `--skip-title-translation` | Ignorar tradução de título | `pdf2zh_next example.pdf --skip-title-translation` | | `--skip-title-translation=true` | Ignorar tradução de título | `pdf2zh_next example.pdf --skip-title-translation=true` | | `--skip-title-translation=false`| Não ignorar tradução de título | `pdf2zh_next example.pdf --skip-title-translation=false` | | `--skip-author-translation` | Ignorar tradução de autor | `pdf2zh_next example.pdf --skip-author-translation` | | `--skip-author-translation=true` | Ignorar tradução de autor | `pdf2zh_next extreme.pdf --skip-author-translation=true` | | `--skip-author-translation=false` | Não ignorar tradução de autor | `pdf2zh_next example.pdf --skip-author-translation=false` | | `--skip-date-translation` | Ignorar tradução de data | `pdf2zh_next example.pdf --skip-date-translation` | | `--skip-date-translation=true` | Ignorar tradução de data | `pdf2zh_next example.pdf --skip-date-translation=true` | | `--skip-date-translation=false` | Não ignorar tradução de data | `pdf2zh_next example.pdf --skip-date-translation=false` |
ru: | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--skip-table-detection` | Skip table detection | `pdf2zh_next example.pdf --skip-table-detection` | | `--skip-formula-detection` | Skip formula detection | `pdf2zh_next example.pdf --skip-formula-detection` | | `--skip-figure-detection` | Skip figure detection | `pdf2zh_next example.pdf --skip-figure-detection` | | `--skip-reference-detection` | Skip reference detection | `pdf2zh_next example.pdf --skip-reference-detection` | | `--skip-title-detection` | Skip title detection | `pdf2zh_next example.pdf --skip-title-detection` | | `--skip-header-footer-detection`| Skip header and footer detection | `pdf2zh_next example.pdf --skip-header-footer-detection` | | `--skip-footnote-detection` | Skip footnote detection | `pdf2zh_next example.pdf --skip-footnote-detection` | | `--skip-caption-detection` | Skip caption detection | `pdf2zh_next example.pdf --skip-caption-detection` | | `--skip-list-detection` | Skip list detection | `pdf2zh_next example.pdf --skip-list-detection` | | `--skip-code-detection` | Skip code detection | `pdf2zh_next example.pdf --skip-code-detection` | | `--skip-quote-detection` | Skip quote detection | `pdf2zh_next example.pdf --skip-quote-detection` | | `--skip-equation-detection` | Skip equation detection | `pdf2zh_next example.pdf --skip-equation-detection` | | `--skip-algorithm-detection` | Skip algorithm detection | `pdf2zh_next example.pdf --skip-algorithm-detection` | | `--skip-theorem-detection` | Skip theorem detection | `pdf2zh_next example.pdf --skip-theorem-detection` | | `--skip-proof-detection` | Skip proof detection | `pdf2zh_next example.pdf --skip-proof-detection` | | `--skip-definition-detection` | Skip definition detection | `pdf2zh_next example.pdf --skip-definition-detection` | | `--skip-example-detection` | Skip example detection | `pdf2zh_next example.pdf --skip-example-detection` | | `--skip-remark-detection` | Skip remark detection | `pdf2zh_next example.pdf --skip-remark-detection` | | `--skip-note-detection` | Skip note detection | `pdf2zh_next example.pdf --skip-note-detection` | | `--skip-warning-detection` | Skip warning detection | `pdf2zh_next example.pdf --skip-warning-detection` | | `--skip-error-detection` | Skip error detection | `pdf2zh_next example.pdf --skip-error-detection` | | `--skip-info-detection` | Skip info detection | `pdf2zh_next example.pdf --skip-info-detection` | | `--skip-tip-detection` | Skip tip detection | `pdf2zh_next example.pdf --skip-tip-detection` | | `--skip-success-detection` | Skip success detection | `pdf2zh_next example.pdf --skip-success-detection` | | `--skip-question-detection` | Skip question detection | `pdf2zh_next example.pdf --skip-question-detection` | | `--skip-caution-detection` | Skip caution detection | `pdf2zh_next example.pdf --skip-caution-detection` | | `--skip-important-detection` | Skip important detection | `pdf2zh_next example.pdf --skip-important-detection` | | `--skip-custom-detection` | Skip custom detection | `pdf2zh_next example.pdf --skip-custom-detection` | | `--skip-all-detection` | Skip all detection | `pdf2zh_next example.pdf --skip-all-detection` | --- ### TRANSLATION RESULT | `--skip-scanned-detection` | Пропустить обнаружение сканированных страниц | `pdf2zh_next example.pdf --skip-scanned-detection` | | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--skip-table-detection` | Пропустить обнаружение таблиц | `pdf2zh_next example.pdf --skip-table-detection` | | `--skip-formula-detection` | Пропустить обнаружение формул | `pdf2zh_next example.pdf --skip-formula-detection` | | `--skip-figure-detection` | Пропустить обнаружение рисунков | `pdf2zh_next example.pdf --skip-figure-detection` | | `--skip-reference-detection` | Пропустить обнаружение ссылок | `pdf2zh_next example.pdf --skip-reference-detection` | | `--skip-title-detection` | Пропустить обнаружение заголовков | `pdf2zh_next example.pdf --skip-title-detection` | | `--skip-header-footer-detection`| Пропустить обнаружение верхних и нижних колонтитулов | `pdf2zh_next example.pdf --skip-header-footer-detection` | | `--skip-footnote-detection` | Пропустить обнаружение сносок | `pdf2zh_next example.pdf --skip-footnote-detection` | | `--skip-caption-detection` | Пропустить обнаружение подписей | `pdf2zh_next example.pdf --skip-caption-detection` | | `--skip-list-detection` | Пропустить обнаружение списков | `pdf2zh_next example.pdf --skip-list-detection` | | `--skip-code-detection` | Пропустить обнаружение кода | `pdf2zh_next example.pdf --skip-code-detection` | | `--skip-quote-detection` | Пропустить обнаружение цитат | `pdf2zh_next example.pdf --skip-quote-detection` | | `--skip-equation-detection` | Пропустить обнаружение уравнений | `pdf2zh_next example.pdf --skip-equation-detection` | | `--skip-algorithm-detection` | Пропустить обнаружение алгоритмов | `pdf2zh_next example.pdf --skip-algorithm-detection` | | `--skip-theorem-detection` | Пропустить обнаружение теорем | `pdf2zh_next example.pdf --skip-theorem-detection` | | `--skip-proof-detection` | Пропустить обнаружение доказательств | `pdf2zh_next example.pdf --skip-proof-detection` | | `--skip-definition-detection` | Пропустить обнаружение определений | `pdf2zh_next example.pdf --skip-definition-detection` | | `--skip-example-detection` | Пропустить обнаружение примеров | `pdf2zh_next example.pdf --skip-example-detection` | | `--skip-remark-detection` | Пропустить обнаружение замечаний | `pdf2zh_next example.pdf --skip-remark-detection` | | `--skip-note-detection` | Пропустить обнаружение примечаний | `pdf2zh_next example.pdf --skip-note-detection` | | `--skip-warning-detection` | Пропустить обнаружение предупреждений | `pdf2zh_next example.pdf --skip-warning-detection` | | `--skip-error-detection` | Пропустить обнаружение ошибок | `pdf2zh_next example.pdf --skip-error-detection` | | `--skip-info-detection` | Пропустить обнаружение информации | `pdf2zh_next example.pdf --skip-info-detection` | | `--skip-tip-detection` | Пропустить обнаружение советов | `pdf2zh_next example.pdf --skip-tip-detection` | | `--skip-success-detection` | Пропустить обнаружение успешных операций | `pdf2zh_next example.pdf --skip-success-detection` | | `--skip-question-detection` | Пропустить обнаружение вопросов | `pdf2zh_next example.pdf --skip-question-detection` | | `--skip-caution-detection` | Пропустить обнаружение предостережений | `pdf2zh_next example.pdf --skip-caution-detection` | | `--skip-important-detection` | Пропустить обнаружение важных заметок | `pdf2zh_next example.pdf --skip-important-detection` | | `--skip-custom-detection` | Пропустить пользовательское обнаружение | `pdf2zh_next example.pdf --skip-custom-detection` | | `--skip-all-detection` | Пропустить все виды обнаружения | `pdf2zh_next example.pdf --skip-all-detection` |
