Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_144034ED
source: | `--no-remove-non-formula-lines` | Disable removal of non-formula lines within paragraph areas | `pdf2zh_next example.pdf --no-remove-non-formula-lines` |
de: | -------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--no-remove-non-formula-lines` | Deaktiviert das Entfernen von Nicht-Formel-Zeilen innerhalb von Absatzbereichen | `pdf2zh_next example.pdf --no-remove-non-formula-lines` | --- ### OUTPUT | `--no-remove-non-formula-lines` | Deaktiviert das Entfernen von Nicht-Formel-Zeilen innerhalb von Absatzbereichen | `pdf2zh_next example.pdf --no-remove-non-formula-lines` |
fr: | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--remove-formula-lines` | Remove formula lines within paragraph areas | `pdf2zh_next example.pdf --remove-formula-lines` | | `--no-remove-formula-lines` | Disable removal of formula lines within paragraph areas | `pdf2zh_next example.pdf --no-remove-formula-lines` | | `--formula-detection-mode` | Formula detection mode: `ml` (machine learning) or `rule` (rule-based) | `pdf2zh_next example.pdf --formula-detection-mode rule` | | `--formula-detection-size-threshold` | Minimum formula detection size (pixels) | `pdf2zh_next example.pdf --formula-detection-size-threshold 50` | | `--formula-detection-padding` | Formula detection padding (pixels) | `pdf2zh_next example.pdf --formula-detection-padding 10` | | `--formula-detection-margin` | Formula detection margin (pixels) | `pdf2zh_next example.pdf --formula-detection-margin 5` | --- ### TRANSLATION | `--no-remove-non-formula-lines` | Désactiver la suppression des lignes non-formules dans les zones de paragraphe | `pdf2zh_next example.pdf --no-remove-non-formula-lines` | | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--remove-formula-lines` | Supprimer les lignes de formules dans les zones de paragraphe | `pdf2zh_next example.pdf --remove-formula-lines` | | `--no-remove-formula-lines` | Désactiver la suppression des lignes de formules dans les zones de paragraphe | `pdf2zh_next example.pdf --no-remove-formula-lines` | | `--formula-detection-mode` | Mode de détection de formules : `ml` (apprentissage automatique) ou `rule` (basé sur des règles) | `pdf2zh_next example.pdf --formula-detection-mode rule` | | `--formula-detection-size-threshold` | Taille minimale de détection de formules (pixels) | `pdf2zh_next example.pdf --formula-detection-size-threshold 50` | | `--formula-detection-padding` | Remplissage de détection de formules (pixels) | `pdf2zh_next example.pdf --formula-detection-padding 10` | | `--formula-detection-margin` | Marge de détection de formules (pixels) | `pdf2zh_next example.pdf --formula-detection-margin 5` |
it: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--no-remove-latex-errors` | Disable removal of LaTeX compilation errors | `pdf2zh_next example.pdf --no-remove-latex-errors` | | `--no-remove-extra-spaces` | Disable removal of extra spaces in formulas | `pdf2zh_next example.pdf --no-remove-extra-spaces` | | `--no-remove-formula-punctuation` | Disable removal of punctuation in formulas | `pdf2zh_next example.pdf --no-remove-formula-punctuation` | | `--no-remove-extra-whitespace` | Disable removal of extra whitespace within paragraph areas | `pdf2zh_next example.pdf --no-remove-extra-whitespace` | | `--no-replace-unicode` | Disable replacement of unicode symbols in formulas | `pdf2zh_next example.pdf --no-replace-unicode` | --- ### TRANSLATION RESULT | `--no-remove-non-formula-lines` | Disabilita la rimozione delle righe non di formula all'interno delle aree di paragrafo | `pdf2zh_next example.pdf --no-remove-non-formula-lines` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--no-remove-latex-errors` | Disabilita la rimozione degli errori di compilazione LaTeX | `pdf2zh_next example.pdf --no-remove-latex-errors` | | `--no-remove-extra-spaces` | Disabilita la rimozione degli spazi extra nelle formule | `pdf2zh_next example.pdf --no-remove-extra-spaces` | | `--no-remove-formula-punctuation` | Disabilita la rimozione della punteggiatura nelle formule | `pdf2zh_next example.pdf --no-remove-formula-punctuation` | | `--no-remove-extra-whitespace` | Disabilita la rimozione degli spazi bianchi extra all'interno delle aree di paragrafo | `pdf2zh_next example.pdf --no-remove-extra-whitespace` | | `--no-replace-unicode` | Disabilita la sostituzione dei simboli unicode nelle formule | `pdf2zh_next example.pdf --no-replace-unicode` |
pt: | -------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--no-remove-non-formula-lines` | Desativar a remoção de linhas não relacionadas a fórmulas dentro de áreas de parágrafo | `pdf2zh_next example.pdf --no-remove-non-formula-lines` | --- ### TRANSLATION RESULT | `--no-remove-non-formula-lines` | Desativar a remoção de linhas não relacionadas a fórmulas dentro de áreas de parágrafo | `pdf2zh_next example.pdf --no-remove-non-formula-lines` |
ru: --- ### OUTPUT | `--no-remove-non-formula-lines` | Отключить удаление строк, не являющихся формулами, в областях абзацев | `pdf2zh_next example.pdf --no-remove-non-formula-lines` |

# chunk_F487963F
source: | `--non-formula-line-iou-threshold` | Set IoU threshold for identifying non-formula lines (0.0-1.0) | `pdf2zh_next example.pdf --non-formula-line-iou-threshold 0.85` |
de: `0.8` | | `--formula-line-iou-threshold` | Set IoU threshold for identifying formula lines (0.0-1.0) | `pdf2zh_next example.pdf --formula-line-iou-threshold 0.85` | `0.8` | | `--table-line-iou-threshold` | Set IoU threshold for identifying table lines (0.0-1.0) | `pdf2zh_next example.pdf --table-line-iou-threshold 0.85` | `0.8` | | `--line-merge-threshold` | Set threshold for merging lines (0.0-1.0) | `pdf2zh_next example.pdf --line-merge-threshold 0.85` | `0.8` | | `--table-merge-threshold` | Set threshold for merging tables (0.0-1.0) | `pdf2zh_next example.pdf --table-merge-threshold 0.85` | `0.8` | --- ### TRANSLATED TEXT | `--non-formula-line-iou-threshold` | Setze IoU-Schwellenwert für die Identifizierung von Nicht-Formel-Zeilen (0.0-1.0) | `pdf2zh_next example.pdf --non-formula-line-iou-threshold 0.85` | `0.8` | | `--formula-line-iou-threshold` | Setze IoU-Schwellenwert für die Identifizierung von Formel-Zeilen (0.0-1.0) | `pdf2zh_next example.pdf --formula-line-iou-threshold 0.85` | `0.8` | | `--table-line-iou-threshold` | Setze IoU-Schwellenwert für die Identifizierung von Tabellen-Zeilen (0.0-1.0) | `pdf2zh_next example.pdf --table-line-iou-threshold 0.85` | `0.8` | | `--line-merge-threshold` | Setze Schwellenwert für das Zusammenführen von Zeilen (0.0-1.0) | `pdf2zh_next example.pdf --line-merge-threshold 0.85` | `0.8` | | `--table-merge-threshold` | Setze Schwellenwert für das Zusammenführen von Tabellen (0.0-1.0) | `pdf2zh_next example.pdf --table-merge-threshold 0.85` | `0.8` |
fr: `0.8` | | ---------------------------------- | ----------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | ------- | | `--formula-line-iou-threshold` | Set IoU threshold for identifying formula lines (0.0-1.0) | `pdf2zh_next example.pdf --formula-line-iou-threshold 0.85` | `0.8` | | `--formula-merge-iou-threshold` | Set IoU threshold for merging adjacent formula blocks (0.0-1.0) | `pdf2zh_next example.pdf --formula-merge-iou-threshold 0.85` | `0.8` | | `--formula-merge-max-gap` | Set maximum vertical gap (in pixels) for merging adjacent formula blocks | `pdf2zh_next example.pdf --formula-merge-max-gap 50` | `50` | | `--formula-merge-max-horizontal-gap` | Set maximum horizontal gap (in pixels) for merging adjacent formula blocks | `pdf2zh_next example.pdf --formula-merge-max-horizontal-gap 50` | `50` | | `--formula-merge-max-vertical-gap` | Set maximum vertical gap (in pixels) for merging adjacent formula blocks | `pdf2zh_next example.pdf --formula-merge-max-vertical-gap 50` | `50` | --- ### TRANSLATED TEXT | `--non-formula-line-iou-threshold` | Définir le seuil IoU pour l'identification des lignes non-formules (0.0-1.0) | `pdf2zh_next example.pdf --non-formula-line-iou-threshold 0.85` | `0.8` | | ---------------------------------- | ----------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | ------- | | `--formula-line-iou-threshold` | Définir le seuil IoU pour l'identification des lignes de formules (0.0-1.0) | `pdf2zh_next example.pdf --formula-line-iou-threshold 0.85` | `0.8` | | `--formula-merge-iou-threshold` | Définir le seuil IoU pour la fusion des blocs de formules adjacents (0.0-1.0) | `pdf2zh_next example.pdf --formula-merge-iou-threshold 0.85` | `0.8` | | `--formula-merge-max-gap` | Définir l'écart vertical maximum (en pixels) pour la fusion des blocs de formules adjacents | `pdf2zh_next example.pdf --formula-merge-max-gap 50` | `50` | | `--formula-merge-max-horizontal-gap` | Définir l'écart horizontal maximum (en pixels) pour la fusion des blocs de formules adjacents | `pdf2zh_next example.pdf --formula-merge-max-horizontal-gap 50` | `50` | | `--formula-merge-max-vertical-gap` | Définir l'écart vertical maximum (en pixels) pour la fusion des blocs de formules adjacents | `pdf2zh_next example.pdf --formula-merge-max-vertical-gap 50` | `50` |
it: `0.8` | | `--non-formula-line-threshold` | Set threshold for identifying non-formula lines (0.0-1.0) | `pdf2zh_next example.pdf --non-formula-line-threshold 0.85` | `0.8` | | `--non-text-line-iou-threshold` | Set IoU threshold for identifying non-text lines (0.0-1.0) | `pdf2zh_next example.pdf --non-text-line-iou-threshold 0.85` | `0.8` | | `--non-text-line-threshold` | Set threshold for identifying non-text lines (0.0-1.0) | `pdf2zh_next example.pdf --non-text-line-threshold 0.85` | `0.8` | | `--output-dir` | Set output directory | `pdf2zh_next example.pdf --output-dir ./output` | `./` | | `--output-filename` | Set output filename (without extension) | `pdf2zh_next example.pdf --output-filename example_translated` | `{input_filename}_translated` | | `--output-format` | Set output format (markdown, latex, html, docx) | `pdf2zh_next example.pdf --output-format latex` | `markdown` | | `--output-language` | Set output language code (e.g., zh-CN, en, ja) | `pdf2zh_next example.pdf --output-language ja` | `zh-CN` | | `--overwrite` | Overwrite existing output files | `pdf2zh_next example.pdf --overwrite` | `false` | | `--page-range` | Set page range to process (e.g., 1-5,8,11-13) | `pdf2zh_next example.pdf --page-range 1-5,8,11-13` | `all pages` | | `--pdf2image-dpi` | Set DPI for PDF to image conversion | `pdf2zh_next example.pdf --pdf2image-dpi 300` | `300` | | `--quiet` | Suppress console output | `pdf2zh_next example.pdf --quiet` | `false` | | `--remove-original-text` | Remove original text from output | `pdf2zh_next example.pdf --remove-original-text` | `false` | | `--table-line-iou-threshold` | Set IoU threshold for identifying table lines (0.0-1.0) | `pdf2zh_next example.pdf --table-line-iou-threshold 0.85` | `0.8` | | `--table-line-threshold` | Set threshold for identifying table lines (0.0-1.0) | `pdf2zh_next example.pdf --table-line-threshold 0.85` | `0.8` | | `--text-line-iou-threshold` | Set IoU threshold for identifying text lines (0.0-1.0) | `pdf2zh_next example.pdf --text-line-iou-threshold 0.85` | `0.8` | | `--text-line-threshold` | Set threshold for identifying text lines (0.0-1.0) | `pdf2zh_next example.pdf --text-line-threshold 0.85` | `0.8` | | `--translator` | Set translation service (google, deepl, openai, azure, gemini) | `pdf2zh_next example.pdf --translator deepl` | `google` | | `--translator-options` | Set additional options for translation service (JSON format) | `pdf2zh_next example.pdf --translator-options '{"api_key":"your_key"}'` | `{}` | --- ### OUTPUT LANGUAGE it --- ### OUTPUT | `--non-formula-line-iou-threshold` | Imposta la soglia IoU per identificare le righe non formula (0.0-1.0) | `pdf2zh_next example.pdf --non-formula-line-iou-threshold 0.85` | `0.8` | | `--non-formula-line-threshold` | Imposta la soglia per identificare le righe non formula (0.0-1.0) | `pdf2zh_next example.pdf --non-formula-line-threshold 0.85` | `0.8` | | `--non-text-line-iou-threshold` | Imposta la soglia IoU per identificare le righe non testo (0.0-1.0) | `pdf2zh_next example.pdf --non-text-line-iou-threshold 0.85` | `0.8` | | `--non-text-line-threshold` | Imposta la soglia per identificare le righe non testo (0.0-1.0) | `pdf2zh_next example.pdf --non-text-line-threshold 0.85` | `0.8` | | `--output-dir` | Imposta la directory di output | `pdf2zh_next example.pdf --output-dir ./output` | `./` | | `--output-filename` | Imposta il nome del file di output (senza estensione) | `pdf2zh_next example.pdf --output-filename example_translated` | `{input_filename}_translated` | | `--output-format` | Imposta il formato di output (markdown, latex, html, docx) | `pdf2zh_next example.pdf --output-format latex` | `markdown` | | `--output-language` | Imposta il codice della lingua di output (es. zh-CN, en, ja) | `pdf2zh_next example.pdf --output-language ja` | `zh-CN` | | `--overwrite` | Sovrascrive i file di output esistenti | `pdf2zh_next example.pdf --overwrite` | `false` | | `--page-range` | Imposta l'intervallo di pagine da elaborare (es. 1-5,8,11-13) | `pdf2zh_next example.pdf --page-range 1-5,8,11-13` | `all pages` | | `--pdf2image-dpi` | Imposta il DPI per la conversione da PDF a immagine | `pdf2zh_next example.pdf --pdf2image-dpi 300` | `300` | | `--quiet` | Sopprime l'output della console | `pdf2zh_next example.pdf --quiet` | `false` | | `--remove-original-text` | Rimuove il testo originale dall'output | `pdf2zh_next example.pdf --remove-original-text` | `false` | | `--table-line-iou-threshold` | Imposta la soglia IoU per identificare le righe della tabella (0.0-1.0) | `pdf2zh_next example.pdf --table-line-iou-threshold 0.85` | `0.8` | | `--table-line-threshold` | Imposta la soglia per identificare le righe della tabella (0.0-1.0) | `pdf2zh_next example.pdf --table-line-threshold 0.85` | `0.8` | | `--text-line-iou-threshold` | Imposta la soglia IoU per identificare le righe di testo (0.0-1.0) | `pdf2zh_next example.pdf --text-line-iou-threshold 0.85` | `0.8` | | `--text-line-threshold` | Imposta la soglia per identificare le righe di testo (0.0-1.0) | `pdf2zh_next example.pdf --text-line-threshold 0.85` | `0.8` | | `--translator` | Imposta il servizio di traduzione (google, deepl, openai, azure, gemini) | `pdf2zh_next example.pdf --translator deepl` | `google` | | `--translator-options` | Imposta opzioni aggiuntive per il servizio di traduzione (formato JSON) | `pdf2zh_next example.pdf --translator-options '{"api_key":"your_key"}'` | `{}` |
pt: `0.85` | | `--non-formula-line-ignore-threshold` | Set ignore threshold for non-formula lines (0.0-1.0) | `pdf2zh_next example.pdf --non-formula-line-ignore-threshold 0.1` | `0.1` | | `--formula-line-iou-threshold` | Set IoU threshold for identifying formula lines (0.0-1.0) | `pdf2zh_next example.pdf --formula-line-iou-threshold 0.85` | `0.85` | | `--formula-line-ignore-threshold` | Set ignore threshold for formula lines (0.0-1.0) | `pdf2zh_next example.pdf --formula-line-ignore-threshold 0.1` | `0.1` | | `--table-line-iou-threshold` | Set IoU threshold for identifying table lines (0.0-1.0) | `pdf2zh_next example.pdf --table-line-iou-threshold 0.85` | `0.85` | | `--table-line-ignore-threshold` | Set ignore threshold for table lines (0.0-1.0) | `pdf2zh_next example.pdf --table-line-ignore-threshold 0.1` | `0.1` | --- ### OUTPUT | `--non-formula-line-iou-threshold` | Definir o limite de IoU para identificar linhas não de fórmula (0.0-1.0) | `pdf2zh_next example.pdf --non-formula-line-iou-threshold 0.85` | `0.85` | | `--non-formula-line-ignore-threshold` | Definir o limite de ignorar para linhas não de fórmula (0.0-1.0) | `pdf2zh_next example.pdf --non-formula-line-ignore-threshold 0.1` | `0.1` | | `--formula-line-iou-threshold` | Definir o limite de IoU para identificar linhas de fórmula (0.0-1.0) | `pdf2zh_next example.pdf --formula-line-iou-threshold 0.85` | `0.85` | | `--formula-line-ignore-threshold` | Definir o limite de ignorar para linhas de fórmula (0.0-1.0) | `pdf2zh_next example.pdf --formula-line-ignore-threshold 0.1` | `0.1` | | `--table-line-iou-threshold` | Definir o limite de IoU para identificar linhas de tabela (0.0-1.0) | `pdf2zh_next example.pdf --table-line-iou-threshold 0.85` | `0.85` | | `--table-line-ignore-threshold` | Definir o limite de ignorar para linhas de tabela (0.0-1.0) | `pdf2zh_next example.pdf --table-line-ignore-threshold 0.1` | `0.1` |
ru: 0.8 | | `--formula-line-iou-threshold` | Set IoU threshold for identifying formula lines (0.0-1.0) | `pdf2zh_next example.pdf --formula-line-iou-threshold 0.85` | 0.8 | | `--table-line-iou-threshold` | Set IoU threshold for identifying table lines (0.0-1.0) | `pdf2zh_next example.pdf --table-line-iou-threshold 0.85` | 0.8 | | `--remove-overlap` | Enable overlapping removal for text blocks | `pdf2zh_next example.pdf --remove-overlap` | false | | `--overlap-threshold` | Set IoU threshold for overlapping removal (0.0-1.0) | `pdf2zh_next example.pdf --overlap-threshold 0.5` | 0.5 | --- ### OUTPUT | `--non-formula-line-iou-threshold` | Установить порог IoU для идентификации строк без формул (0.0-1.0) | `pdf2zh_next example.pdf --non-formula-line-iou-threshold 0.85` | 0.8 | | `--formula-line-iou-threshold` | Установить порог IoU для идентификации строк с формулами (0.0-1.0) | `pdf2zh_next example.pdf --formula-line-iou-threshold 0.85` | 0.8 | | `--table-line-iou-threshold` | Установить порог IoU для идентификации строк таблиц (0.0-1.0) | `pdf2zh_next example.pdf --table-line-iou-threshold 0.85` | 0.8 | | `--remove-overlap` | Включить удаление перекрывающихся текстовых блоков | `pdf2zh_next example.pdf --remove-overlap` | false | | `--overlap-threshold` | Установить порог IoU для удаления перекрытий (0.0-1.0) | `pdf2zh_next example.pdf --overlap-threshold 0.5` | 0.5 |

# chunk_F56B7BA4
source: | `--figure-table-protection-threshold` | Set protection threshold for figures and tables (0.0-1.0). Lines within figures/tables will not be processed | `pdf2zh_next example.pdf --figure-table-protection-threshold 0.95` |
de: `0.9` | | ------------------------------------- | ----------------------------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------- | ------ | --- ### TRANSLATED TEXT | `--figure-table-protection-threshold` | Legt den Schutzschwellenwert für Abbildungen und Tabellen fest (0.0-1.0). Linien innerhalb von Abbildungen/Tabellen werden nicht verarbeitet | `pdf2zh_next example.pdf --figure-table-protection-threshold 0.95` | `0.9` |
fr: 0.95 | | ------------------------------------- | ----------------------------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------- | ------------------------------------------------------------------------ | | `--figure-table-protection-margin` | Set protection margin for figures and tables (0.0-1.0). Lines within figures/tables will not be processed | `pdf2zh_next example.pdf --figure-table-protection-margin 0.05` | 0.05 | | `--figure-table-protection-min-width` | Set minimum width for figures and tables (0.0-1.0). Lines within figures/tables will not be processed | `pdf2zh_next example.pdf --figure-table-protection-min-width 0.2` | 0.2 | --- ### OUTPUT | `--figure-table-protection-threshold` | Définir le seuil de protection pour les figures et les tableaux (0.0-1.0). Les lignes dans les figures/tableaux ne seront pas traitées | `pdf2zh_next example.pdf --figure-table-protection-threshold 0.95` | 0.95 | | ------------------------------------- | ------------------------------------------------------------------------------------------------------------------------------------ | --------------------------------------------------------------------------------------------------------- | ------------------------------------------------------------------------ | | `--figure-table-protection-margin` | Définir la marge de protection pour les figures et les tableaux (0.0-1.0). Les lignes dans les figures/tableaux ne seront pas traitées | `pdf2zh_next example.pdf --figure-table-protection-margin 0.05` | 0.05 | | `--figure-table-protection-min-width` | Définir la largeur minimale pour les figures et les tableaux (0.0-1.0). Les lignes dans les figures/tableaux ne seront pas traitées | `pdf2zh_next example.pdf --figure-table-protection-min-width 0.2` | 0.2 |
it: --- ### TRANSLATION RESULT | `--figure-table-protection-threshold` | Imposta la soglia di protezione per figure e tabelle (0.0-1.0). Le righe all'interno di figure/tabelle non verranno elaborate | `pdf2zh_next example.pdf --figure-table-protection-threshold 0.95` |
pt: `0.95` | | ------------------------------------- | ------------------------------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------- | ------ | --- ### OUTPUT | `--figure-table-protection-threshold` | Define o limite de proteção para figuras e tabelas (0.0-1.0). Linhas dentro de figuras/tabelas não serão processadas | `pdf2zh_next example.pdf --figure-table-protection-threshold 0.95` | `0.95` |
ru: `0.95` | | ------------------------------------- | ----------------------------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------- | ------ | --- ### OUTPUT | `--figure-table-protection-threshold` | Установите порог защиты для рисунков и таблиц (0.0-1.0). Строки внутри рисунков/таблиц не будут обрабатываться | `pdf2zh_next example.pdf --figure-table-protection-threshold 0.95` | `0.95` | | ------------------------------------- | ----------------------------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------- | ------ |
