Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_2B8A2E4A
source: | 英语（英国） | English (UK) | `en-GB` |
de: | Deutsch (Deutschland) | German (Germany) | `de-DE` |
fr: | Français | French | `fr` |
it: | Italiano (Italia) | Italiano (Italia) | `it-IT` |
pt: | Português (Brasil) | Português (Brasil) | `pt-BR` |
ru: | Английский (Великобритания) | English (UK) | `en-GB` |

# chunk_10CEEC80
source: | 葡萄牙语（巴西） | Portuguese (Brazil) | `pt-BR` |
de: | Portugiesisch (Brasilien) | Portuguese (Brazil) | `pt-BR` |
fr: | Portugais (Brésil) | Portuguese (Brazil) | `pt-BR` |
it: | Portoghese (Brasile) | Portoghese (Brasile) | `pt-BR` |
pt: | Português (Brasil) | Portuguese (Brazil) | `pt-BR` |
ru: | Португальский (Бразилия) | Portuguese (Brazil) | `pt-BR` |

# chunk_40F26E94
source: | 保加利亚语 | Bulgarian | `bg` |
de: | Bulgarisch | Bulgarian | `bg` |
fr: | Bulgare | Bulgarian | `bg` |
it: | Bulgaro | Bulgarian | `bg` |
pt: | Búlgaro | Bulgarian | `bg` |
ru: | Болгарский | Bulgarian | `bg` |

# chunk_BAC1D2DD
source: | 加泰罗尼亚语 | Catalan | `ca` |
de: | Katalanisch | Catalan | `ca` |
fr: | Catalan | Catalan | `ca` |
it: | Catalano | Catalan | `ca` |
pt: | Catalão | Catalan | `ca` |
ru: | Каталанский | Catalan | `ca` |

# chunk_6C504077
source: | 克罗地亚语 | Croatian | `hr` |
de: | Kroatisch | Croatian | `hr` |
fr: | Croate | Croatian | `hr` |
it: | Croato | Croatian | `hr` |
pt: | Croata | Croatian | `hr` |
ru: | Хорватский | Croatian | `hr` |

# chunk_EF7519DD
source: | 捷克语 | Czech | `cs` |
de: | Tschechisch | Czech | `cs` |
fr: | Tchèque | Czech | `cs` |
it: | Ceco | Czech | `cs` |
pt: | Tcheco | Czech | `cs` |
ru: | Чешский | Czech | `cs` |

# chunk_52641096
source: | 丹麦语 | Danish | `da` |
de: | Dänisch | Danish | `da` |
fr: | Danois | Danish | `da` |
it: | Danese | Danish | `da` |
pt: | Dinamarquês | Danish | `da` |
ru: | Датский | Danish | `da` |

# chunk_22A8086F
source: | 荷兰语 | Dutch | `nl` |
de: | Niederländisch | Dutch | `nl` |
fr: | Néerlandais | Dutch | `nl` |
it: | Olandese | Dutch | `nl` |
pt: | 荷兰语 | Holandês | `nl` |
ru: | Голландский | Dutch | `nl` |

# chunk_534B2AA9
source: | 英语（美国） | English (US) | `en` |
de: | Englisch (USA) | English (US) | `en` |
fr: | Français (France) | `fr` |
pt: | Inglês (EUA) | English (US) | `en` |
ru: | Английский (США) | English (US) | `en` |

# chunk_5B49CFFF
source: | 爱沙尼亚语 | Estonian | `et` |
de: | Estnisch | Estonian | `et` |
fr: | Estonien | Estonian | `et` |
it: | Estone | Estonian | `et` |
pt: | Estoniano | Estonian | `et` |
ru: | Эстонский | Estonian | `et` |

# chunk_F3BE0662
source: | 菲律宾语 | Filipino | `fil` |
de: | Philippinisch | Filipino | `fil` |
fr: | Philippin | Filipino | `fil` |
it: | Filippino | Filipino | `fil` |
pt: Aqui está a tradução para português (pt) seguindo todas as regras especificadas: | Língua filipina | Filipino | `fil` |
ru: | Филиппинский | Filipino | `fil` |

# chunk_AB091AA3
source: | 芬兰语 | Finnish | `fi` |
de: | Finnisch | Finnish | `fi` |
fr: | Finnois | Finnish | `fi` |
it: | Finlandese | Finnish | `fi` |
pt: | Finlandês | Finnish | `fi` |
ru: | Финский | Finnish | `fi` |

# chunk_E9126CEE
source: | 法语 | French | `fr` |
de: | Französisch | French | `fr` |
fr: | Français | French | `fr` |
it: | Francese | French | `fr` |
pt: | Francês | French | `fr` |
ru: | Французский | French | `fr` |

# chunk_6A475C12
source: | 德语 | German | `de` |
de: | Deutsch | German | `de` |
fr: | Allemand | German | `de` |
it: | Tedesco | German | `de` |
pt: | Alemão | `de` | | 俄语 | Russian | `ru` |
ru: | Немецкий | German | `de` |

# chunk_63D84713
source: | 希腊语 | Greek | `el` |
de: | Griechisch | Greek | `el` |
fr: | Grec | Greek | `el` |
it: | Greco | Greek | `el` |
pt: | Grego | Greek | `el` |
ru: | Греческий | Greek | `el` |

# chunk_A6DD638F
source: | 古吉拉特语 | Gujarati | `gu` |
fr: | Gujarati | Gujarati | `gu` |
pt: | Guzerate | Gujarati | `gu` |
ru: | Гуджарати | Gujarati | `gu` |

# chunk_B85F863E
source: | 希伯来语 | Hebrew | `iw` |
de: | Hebräisch | Hebrew | `iw` |
fr: | Hébreu | Hebrew | `iw` |
it: | Ebraico | Hebrew | `iw` |
pt: | Hebraico | Hebrew | `iw` |
ru: | Иврит | Hebrew | `iw` |

# chunk_108CDAD2
source: | 印地语 | Hindi | `hi` |
de: | Hindi | Hindi | `hi` |
fr: | Hindi | Hindi | `hi` |
it: | हिंदी | Hindi | `hi` |
pt: | Hindi | Hindi | `hi` |
ru: | Хинди | Hindi | `hi` |

# chunk_371C85CF
source: | 匈牙利语 | Hungarian | `hu` |
de: | Ungarisch | Hungarian | `hu` |
fr: | Hongrois | Hungarian | `hu` |
it: | Ungherese | Hungarian | `hu` |
pt: | Húngaro | Hungarian | `hu` |
ru: | Венгерский | Hungarian | `hu` |

# chunk_DFA87215
source: | 冰岛语 | Icelandic | `is` |
de: | Isländisch | Icelandic | `is` |
fr: | Islandais | Icelandic | `is` |
it: | Islandese | Icelandic | `is` |
pt: | Islandês | Icelandic | `is` |
ru: | Исландский | Icelandic | `is` |

# chunk_77057FC2
source: | 印度尼西亚语 | Indonesian | `id` |
de: | Indonesisch | Indonesian | `id` |
fr: | 印尼语 | Indonésien | `id` |
it: | Bahasa Indonesia | Indonesian | `id` |
pt: | Indonésio | Indonesian | `id` |
ru: | Индонезийский | Indonesian | `id` |

# chunk_FF3C4126
source: | 意大利语 | Italian | `it` |
de: | Italienisch | Italian | `it` |
fr: | Italien | Italian | `it` |
it: | Italiano | Italian | `it` |
pt: | Italiano | Italian | `it` |
ru: | Итальянский | Italian | `it` |

# chunk_652E29EB
source: | 日语 | Japanese | `ja` |
de: | Japanisch | Japanese | `ja` |
fr: | Japonais | Japanese | `ja` |
it: | 日本語 | Japanese | `ja` |
pt: | Japonês | Japanese | `ja` |
ru: | Японский | Japanese | `ja` |

# chunk_93927FAF
source: | 卡纳达语 | Kannada | `kn` |
de: | Kannada | `kn` |
fr: | Kannada | Kannada | `kn` |
it: | Kannada | Kannada | `kn` |
pt: | Canarês | Kannada | `kn` |
ru: | 卡纳达语 | Каннада | `kn` |

# chunk_56BC5C4A
source: | 韩语 | Korean | `ko` |
de: | Koreanisch | `ko` |
fr: | Français | `fr` | |------|--------|------|--------|----------|------| | 韩语 | Coréen | `ko` |
it: | 韩语 | Coreano | `ko` |
pt: | 韩语 | Coreano | `ko` |
ru: | 韩语 | Корейский | `ko` |

# chunk_F96E1E17
source: | 拉脱维亚语 | Latvian | `lv` |
de: | Lettisch | Latvian | `lv` |
fr: | Letton | Letton | `lv` |
it: | Lettone | Latvian | `lv` |
pt: | Letão | Latvian | `lv` |
ru: | Латышский | Latvian | `lv` |

# chunk_55EC6BB8
source: | 立陶宛语 | Lithuanian | `lt` |
de: | Litauisch | Lithuanian | `lt` |
fr: | Lituanien | Lithuanian | `lt` |
it: | Lituano | Lithuanian | `lt` |
pt: | Lituano | Lithuanian | `lt` |
ru: | Литовский | Lithuanian | `lt` |

# chunk_D4EE46C1
source: | 马来语 | Malay | `ms` |
de: | Malaiisch | Malay | `ms` |
fr: | Malais | Malay | `ms` |
it: | Malese | Malay | `ms` |
pt: | Malaio | Malay | `ms` |
ru: | Малайский | Malay | `ms` |

# chunk_81884171
source: | 马拉雅拉姆语 | Malayalam | `ml` |
de: | Malayalam | Malayalam | `ml` |
it: | മലയാളം | Malayalam | `ml` |
pt: | Malayalam | Malayalam | `ml` |
ru: | Малаялам | Malayalam | `ml` |

# chunk_2560880A
source: | 马拉地语 | Marathi | `mr` |
de: | Marathi | `mr` |
fr: | Marathi | `mr` |
it: | मराठी | Marathi | `mr` |
pt: | Marata | Marathi | `mr` |
ru: | Маратхи | Marathi | `mr` |

# chunk_FA300B7A
source: | 挪威语 | Norwegian | `no` |
de: | Norwegisch | Norwegian | `no` |
fr: | Norvégien | Norwegian | `no` |
it: | Norvegese | Norwegian | `no` |
pt: | Norueguês | Norwegian | `no` |
ru: | Норвежский | Norwegian | `no` |

# chunk_7EBAF4DE
source: | 波兰语 | Polish | `pl` |
de: | Polnisch | Polish | `pl` |
fr: | Polonais | Polish | `pl` |
it: | Polacco | Polish | `pl` |
pt: | Polonês | Polish | `pl` |
ru: | Польский | Polish | `pl` |

# chunk_07BEC358
source: | 葡萄牙语（葡萄牙） | Portuguese (Portugal) | `pt-PT` |
de: | Portugiesisch (Portugal) | Portuguese (Portugal) | `pt-PT` |
fr: | Portugais (Portugal) | Portuguese (Portugal) | `pt-PT` |
it: | Portoghese (Portogallo) | Portoghese (Portogallo) | `pt-PT` |
pt: | Português (Portugal) | Portuguese (Portugal) | `pt-PT` |
ru: | Португальский (Португалия) | Portuguese (Portugal) | `pt-PT` |

# chunk_0A7A2233
source: | 罗马尼亚语 | Romanian | `ro` |
de: | Rumänisch | Romanian | `ro` |
fr: | Roumain | Romanian | `ro` |
it: | Rumeno | Romanian | `ro` |
pt: | Romeno | Romanian | `ro` |
ru: | Румынский | Romanian | `ro` |

# chunk_AD2D309D
source: | 俄语 | Russian | `ru` |
de: | Russisch | Russian | `ru` |
fr: | Français | `fr` | |------|---------|------|---------|----------|------| | Русский | Russian | `ru` | Français | French | `fr` |
it: | Russo | Russian | `ru` |
pt: | Russo | Russian | `ru` |
ru: | Русский | Russian | `ru` |

# chunk_9BA57E97
source: | 塞尔维亚语 | Serbian | `sr` |
de: | Serbisch | Serbian | `sr` |
fr: | Serbe | Serbian | `sr` |
it: | Serbo | Serbian | `sr` |
pt: | Sérvio | Serbian | `sr` |
ru: | Сербский | Serbian | `sr` |

# chunk_9240CC91
source: | 中文（中国） | Chinese (PRC) | `zh-CN` |
de: | 中文（中国） | Chinesisch (VR China) | `zh-CN` |
fr: | Français (France) | French (France) | `fr-FR` |
it: | Italiano (Italia) | Italian (Italy) | `it-IT` |
pt: | Português (Brasil) | Portuguese (Brazil) | `pt-BR` |

# chunk_A2F7B475
source: | 斯洛伐克语 | Slovak | `sk` |
de: | Slowakisch | Slovak | `sk` |
fr: | Slovaque | Slovak | `sk` |
it: | Slovacco | Slovak | `sk` |
pt: | Eslovaco | Slovak | `sk` |
ru: | Словацкий | Slovak | `sk` |

# chunk_4188ADDD
source: | 斯洛文尼亚语 | Slovenian | `sl` |
de: | Slowenisch | Slovenian | `sl` |
fr: | Slovène | Slovenian | `sl` |
it: | Sloveno | Slovenian | `sl` |
pt: | Esloveno | Slovenian | `sl` |
ru: | Словенский | Slovenian | `sl` |

# chunk_E4F70BC1
source: | 西班牙语 | Spanish | `es` |
de: | Spanisch | Spanish | `es` |
fr: | Espagnol | Spanish | `es` |
it: | Spagnolo | Spanish | `es` |
pt: | Espanhol | Spanish | `es` |
ru: | Испанский | Spanish | `es` |

# chunk_5DCBD4C6
source: | 瑞典语 | Swedish | `sv` |
de: | Schwedisch | Swedish | `sv` |
fr: | Suédois | Swedish | `sv` |
it: | Svedese | Swedish | `sv` |
pt: | Sueco | `sv` |
ru: | Шведский | Swedish | `sv` |

# chunk_A604BFF4
source: | 泰米尔语 | Tamil | `ta` |
de: | Tamil | Tamilisch | `ta` |
fr: | Tamoul | Tamil | `ta` |
pt: | Tâmil | Tamil | `ta` |
ru: | Тамильский | Tamil | `ta` |

# chunk_7E308345
source: | 泰卢固语 | Telugu | `te` |
de: | Telugu | Telugu | `te` |
fr: | Télougou | Telugu | `te` |
pt: | Telugu | Telugu | `te` |
ru: | Телугу | Telugu | `te` |

# chunk_B766F3D4
source: | 泰语 | Thai | `th` |
de: | Thailändisch | Thai | `th` |
fr: | Thaï | Thai | `th` |
pt: | ภาษาไทย | Thai | `th` |

# chunk_C1B06A67
source: | 中文（台湾） | Chinese (Taiwan) | `zh-TW` |
de: | 中文（台湾） | Chinesisch (Taiwan) | `zh-TW` |
fr: | Français | French | `fr` |
pt: | Chinês (Taiwan) | Chinese (Taiwan) | `zh-TW` |

# chunk_4F10E5FB
source: | 土耳其语 | Turkish | `tr` |
de: | Türkisch | Turkish | `tr` |
fr: | Turc | Turkish | `tr` |
pt: | Turco | Turkish | `tr` |
ru: | Турецкий | Turkish | `tr` |

# chunk_1B069A9E
source: | 乌尔都语 | Urdu | `ur` |
de: | Urdu | Urdu | `ur` |
fr: | Ourdou | Urdu | `ur` |
pt: | Urdu | Urdu | `ur` |
ru: | Урду | Urdu | `ur` |

# chunk_906AD05C
source: | 乌克兰语 | Ukrainian | `uk` |
de: | Ukrainisch | Ukrainian | `uk` |
fr: | Ukrainien | Ukrainian | `uk` |
it: | Ucraino | Ukrainian | `uk` |
pt: | Ucraniano | Ukrainian | `uk` |
ru: | Украинский | Ukrainian | `uk` |

# chunk_275139A2
source: | 越南语 | Vietnamese | `vi` |
de: | Vietnamesisch | `vi` |
fr: | Vietnamien | Vietnamese | `vi` |
it: | Tiếng Việt | Vietnamese | `vi` |
pt: | Vietnamita | Vietnamita | `vi` |
ru: | Вьетнамский | Vietnamese | `vi` |

# chunk_CADB0DBE
source: | 威尔士语 | Welsh | `cy` |
de: | Walisisch | Welsh | `cy` |
fr: | Gallois | Welsh | `cy` |
it: | Gallese | Welsh | `cy` |
pt: | Galês | Welsh | `cy` |
ru: | Валлийский | Welsh | `cy` |

# chunk_CD419A2D
source: Source <https://developers.deepl.com/docs/resources/supported-languages>, organized by GPT-4o.
de: Quelle <https://developers.deepl.com/docs/resources/supported-languages>, organisiert von GPT-4o.
fr: Source <https://developers.deepl.com/docs/resources/supported-languages>, organisé par GPT-4o.
it: Fonte <https://developers.deepl.com/docs/resources/supported-languages>, organizzato da GPT-4o.
pt: Fonte <https://developers.deepl.com/docs/resources/supported-languages>, organizado por GPT-4o.
ru: Источник <https://developers.deepl.com/docs/resources/supported-languages>, организовано GPT-4o.

# chunk_73C925CB
source: | Label in Chinese | Label | `Language Code`| Supports | | --- | --- | --- | --- | | 阿拉伯语 | Arabic | `AR` | `source`, `target` |
de: | Bezeichnung auf Chinesisch | Bezeichnung | `Language Code` | Unterstützt | | --- | --- | --- | --- | | Arabisch | Arabic | `AR` | `source`, `target` |
fr: | Libellé en français | Label | `Language Code` | Supports | | --- | --- | --- | --- | | Arabe | Arabic | `AR` | `source`, `target` |
it: | Etichetta in cinese | Etichetta | `Language Code` | Supporta | | --- | --- | --- | --- | | Arabo | Arabic | `AR` | `source`, `target` |
pt: | Rótulo em chinês | Rótulo | `Código do idioma` | Suporta | | --- | --- | --- | --- | | Árabe | Arabic | `AR` | `source`, `target` |
ru: | Метка на китайском | Метка | `Код языка` | Поддерживается | | --- | --- | --- | --- | | Арабский | Arabic | `AR` | `source`, `target` |

# chunk_449EF659
source: | 保加利亚语 | Bulgarian | `BG` | `source`, `target` |
de: | Bulgarisch | Bulgarian | `BG` | `source`, `target` |
fr: | Bulgare | Bulgarian | `BG` | `source`, `target` |
it: | Bulgaro | Bulgarian | `BG` | `source`, `target` |
pt: | Búlgaro | Bulgarian | `BG` | `source`, `target` |
ru: | Болгарский | Bulgarian | `BG` | `source`, `target` |

# chunk_F1AC6529
source: | 捷克语 | Czech | `CS` | `source`, `target` |
de: | Tschechisch | Czech | `CS` | `source`, `target` |
fr: | Tchèque | Czech | `CS` | `source`, `target` |
it: | Ceco | Czech | `CS` | `source`, `target` |
pt: | Tcheco | Czech | `CS` | `source`, `target` |
ru: | Чешский | Czech | `CS` | `source`, `target` |

# chunk_499838A9
source: | 丹麦语 | Danish | `DA` | `source`, `target` |
de: | Dänisch | Danish | `DA` | `source`, `target` |
fr: | Danois | Danish | `DA` | `source`, `target` |
it: | Danese | Danish | `DA` | `source`, `target` |
pt: | Dinamarquês | Danish | `DA` | `source`, `target` |
ru: | Датский | Danish | `DA` | `source`, `target` |

# chunk_6E7A86D5
source: | 德语 | German | `DE` | `source`, `target` |
de: | Deutsch | German | `DE` | `source`, `target` |
fr: | Allemand | German | `DE` | `source`, `target` |
it: | Tedesco | German | `DE` | `source`, `target` |
pt: | Alemão | German | `DE` | `source`, `target` |
ru: | Немецкий | German | `DE` | `source`, `target` |

# chunk_11DB586F
source: | 希腊语 | Greek | `EL` | `source`, `target` |
de: | Griechisch | Greek | `EL` | `source`, `target` |
fr: | Grec | Greek | `EL` | `source`, `target` |
it: | Greco | Greek | `EL` | `source`, `target` |
pt: | Grego | Greek | `EL` | `source`, `target` |
ru: | Греческий | Greek | `EL` | `source`, `target` |

# chunk_B38960C2
source: | 英语 | English | `EN` | `source`, `target` |
de: | Deutsch | German | `DE` | `source`, `target` |
fr: | 英语 | Anglais | `EN` | `source`, `target` |
it: | Italiano | Italiano | `IT` | `source`, `target` |
pt: | Português | Português | `PT` | `source`, `target` |
ru: | Английский | English | `EN` | `source`, `target` |

# chunk_04ACBE3E
source: | 英语（英国） | English (British) | `EN-GB` | `target` |
de: | Deutsch (Deutschland) | German (Germany) | `DE-DE` | `target` |
fr: | Anglais (Britannique) | English (British) | `EN-GB` | `target` |
it: | Italiano (Italia) | Italiano (Italia) | `IT-IT` | `target` |
pt: | Inglês (Britânico) | `EN-GB` | `target` |
ru: | Английский (Великобритания) | English (British) | `EN-GB` | `target` |

# chunk_16A4376D
source: | 英语（美国） | English (American) | `EN-US` | `target` |
de: | Deutsch (Deutschland) | German (German) | `DE-DE` | `target` |
fr: | Français (France) | `FR-FR` | `target` |
it: | Italiano (Italia) | Italiano (Italiano) | `IT-IT` | `target` |
pt: | Português (Brasil) | Português (Brasileiro) | `PT-BR` | `target` |
ru: | Английский (США) | English (American) | `EN-US` | `target` |

# chunk_B4390A6E
source: | 西班牙语 | Spanish | `ES` | `source`, `target` |
de: | Spanisch | Spanish | `ES` | `source`, `target` |
fr: | Espagnol | Spanish | `ES` | `source`, `target` |
it: | Spagnolo | Spanish | `ES` | `source`, `target` |
pt: | Espanhol | Spanish | `ES` | `source`, `target` |
ru: | Испанский | Spanish | `ES` | `source`, `target` |

# chunk_BB651F90
source: | 爱沙尼亚语 | Estonian | `ET` | `source`, `target` |
de: | Estnisch | Estonian | `ET` | `source`, `target` |
fr: | Estonien | Estonian | `ET` | `source`, `target` |
it: | Estone | Estonian | `ET` | `source`, `target` |
pt: | Estoniano | Estonian | `ET` | `source`, `target` |
ru: | Эстонский | Estonian | `ET` | `source`, `target` |

# chunk_8C2548A1
source: | 芬兰语 | Finnish | `FI` | `source`, `target` |
de: | Finnisch | Finnish | `FI` | `source`, `target` |
fr: | Finnois | Finnish | `FI` | `source`, `target` |
it: | Finlandese | Finnish | `FI` | `source`, `target` |
pt: | Finlandês | Finnish | `FI` | `source`, `target` |
ru: | Финский | Finnish | `FI` | `source`, `target` |

# chunk_9D18F62B
source: | 法语 | French | `FR` | `source`, `target` |
de: | Französisch | French | `FR` | `source`, `target` |
fr: | Français | French | `FR` | `source`, `target` |
it: | Francese | French | `FR` | `source`, `target` |
pt: | Francês | French | `FR` | `source`, `target` |
ru: | Французский | French | `FR` | `source`, `target` |

# chunk_9E56C34E
source: | 匈牙利语 | Hungarian | `HU` | `source`, `target` |
de: | Ungarisch | Hungarian | `HU` | `source`, `target` |
fr: | Hongrois | Hungarian | `HU` | `source`, `target` |
it: | Ungherese | Hungarian | `HU` | `source`, `target` |
pt: | Húngaro | Hungarian | `HU` | `source`, `target` |
ru: | Венгерский | Hungarian | `HU` | `source`, `target` |

# chunk_B22D2080
source: | 印度尼西亚语 | Indonesian | `ID` | `source`, `target` |
de: | Indonesisch | Indonesian | `ID` | `source`, `target` |
fr: | Indonésien | Indonesian | `ID` | `source`, `target` |
pt: | Indonésio | Indonesian | `ID` | `source`, `target` |
ru: | Индонезийский | Indonesian | `ID` | `source`, `target` |

# chunk_4033F9B6
source: | 意大利语 | Italian | `IT` | `source`, `target` |
de: | Italienisch | Italian | `IT` | `source`, `target` |
fr: | Italien | Italian | `IT` | `source`, `target` |
it: | Italiano | Italian | `IT` | `source`, `target` |
pt: | Italiano | Italian | `IT` | `source`, `target` |
ru: | Итальянский | Italian | `IT` | `source`, `target` |

# chunk_69D4C3F5
source: | 日语 | Japanese | `JA` | `source`, `target` |
de: | Japanisch | Japanese | `JA` | `source`, `target` |
fr: | Japonais | Japanese | `JA` | `source`, `target` |
it: | 日本語 | Japanese | `JA` | `source`, `target` |
pt: | Português | Portuguese | `PT` | `source`, `target` |
ru: | Японский | Japanese | `JA` | `source`, `target` |

# chunk_D3B9AFD6
source: | 韩语 | Korean | `KO` | `source`, `target` |
de: | Koreanisch | `KO` | `source`, `target` |
fr: | Coréen | Korean | `KO` | `source`, `target` |
it: | Coreano | Coreano | `KO` | `source`, `target` |
pt: | Português | Portuguese | `PT` | `source`, `target` |
ru: | Корейский | Korean | `KO` | `source`, `target` |

# chunk_82B11E30
source: | 立陶宛语 | Lithuanian | `LT` | `source`, `target` |
de: | Litauisch | Lithuanian | `LT` | `source`, `target` |
fr: | Lituanien | Lithuanian | `LT` | `source`, `target` |
it: | Lituano | Lithuanian | `LT` | `source`, `target` |
pt: | Lituano | Lithuanian | `LT` | `source`, `target` |
ru: | Литовский | Lithuanian | `LT` | `source`, `target` |

# chunk_8EE65B58
source: | 拉脱维亚语 | Latvian | `LV` | `source`, `target` |
de: | Lettisch | Latvian | `LV` | `source`, `target` |
fr: | Letton | Latvian | `LV` | `source`, `target` |
it: | Lettone | Lettone | `LV` | `source`, `target` |
pt: | Letão | Latvian | `LV` | `source`, `target` |
ru: | Латышский | Latvian | `LV` | `source`, `target` |

# chunk_BE638C29
source: | 挪威博克马尔语 | Norwegian Bokmål | `NB` | `source`, `target` |
de: | Norwegisch Bokmål | Norwegisch Bokmål | `NB` | `source`, `target` |
fr: | Norvégien Bokmål | Norwegian Bokmål | `NB` | `source`, `target` |
it: | Norvegese Bokmål | Norvegese Bokmål | `NB` | `source`, `target` |
pt: | Norueguês Bokmål | Norwegian Bokmål | `NB` | `source`, `target` |
ru: | Норвежский букмол | Norwegian Bokmål | `NB` | `source`, `target` |

# chunk_6A6B98E7
source: | 荷兰语 | Dutch | `NL` | `source`, `target` |
de: | Niederländisch | Dutch | `NL` | `source`, `target` |
fr: | Néerlandais | Dutch | `NL` | `source`, `target` |
it: | Olandese | Dutch | `NL` | `source`, `target` |
pt: | Holandês | Dutch | `NL` | `source`, `target` |
ru: | Голландский | Dutch | `NL` | `source`, `target` |

# chunk_830AFF98
source: | 波兰语 | Polish | `PL` | `source`, `target` |
de: | Polnisch | Polish | `PL` | `source`, `target` |
fr: | Polonais | Polish | `PL` | `source`, `target` |
it: | Polacco | Polish | `PL` | `source`, `target` |
pt: | Polonês | Polish | `PL` | `source`, `target` |
ru: | Польский | Polish | `PL` | `source`, `target` |

# chunk_49AAA50E
source: | 葡萄牙语 | Portuguese | `PT` | `source`, `target` |
de: | Portugiesisch | Portuguese | `PT` | `source`, `target` |
fr: | Portugais | Portuguese | `PT` | `source`, `target` |
it: | Portoghese | Portoghese | `PT` | `source`, `target` |
pt: | Português | Portuguese | `PT` | `source`, `target` |
ru: | Португальский | Portuguese | `PT` | `source`, `target` |

# chunk_FF12E792
source: | 葡萄牙语（巴西） | Portuguese (Brazilian) | `PT-BR` | `target` |
de: | Portugiesisch (Brasilianisch) | Portuguese (Brazilian) | `PT-BR` | `target` |
fr: | Portugais (Brésilien) | Portuguese (Brazilian) | `PT-BR` | `target` |
it: | Português (Brasil) | Portuguese (Brazilian) | `PT-BR` | `target` |
pt: | Português (Brasil) | Portuguese (Brazilian) | `PT-BR` | `target` |
ru: | Португальский (Бразилия) | Portuguese (Brazilian) | `PT-BR` | `target` |

# chunk_7E188EC0
source: | 葡萄牙语（欧洲） | Portuguese (European) | `PT-PT` | `target` |
de: | Portugiesisch (Europäisch) | Portuguese (European) | `PT-PT` | `target` |
fr: | Portugais (Europe) | Portuguese (European) | `PT-PT` | `target` |
it: | Portoghese (europeo) | Portoghese (europeo) | `PT-PT` | `target` |
pt: | Português (Europeu) | Portuguese (European) | `PT-PT` | `target` |
ru: | португальский (европейский) | Portuguese (European) | `PT-PT` | `target` |

# chunk_557425BD
source: | 罗马尼亚语 | Romanian | `RO` | `source`, `target` |
de: | Rumänisch | Romanian | `RO` | `source`, `target` |
fr: | Roumain | Romanian | `RO` | `source`, `target` |
it: | Rumeno | Romanian | `RO` | `source`, `target` |
pt: | Romeno | Romanian | `RO` | `source`, `target` |
ru: | Румынский | Romanian | `RO` | `source`, `target` |

# chunk_0FBF4463
source: | 俄语 | Russian | `RU` | `source`, `target` |
de: | Russisch | Russian | `RU` | `source`, `target` |
fr: | Russe | Russian | `RU` | `source`, `target` |
it: | Russo | Russian | `RU` | `source`, `target` |
pt: | Russo | Russian | `RU` | `source`, `target` |
ru: | Русский | Russian | `RU` | `source`, `target` |

# chunk_11FAA384
source: | 斯洛伐克语 | Slovak | `SK` | `source`, `target` |
de: | Slowakisch | Slovak | `SK` | `source`, `target` |
fr: | Slovaque | Slovak | `SK` | `source`, `target` |
it: | Slovacco | Slovak | `SK` | `source`, `target` |
pt: | Eslovaco | Slovak | `SK` | `source`, `target` |
ru: | Словацкий | Slovak | `SK` | `source`, `target` |

# chunk_117E9013
source: | 斯洛文尼亚语 | Slovenian | `SL` | `source`, `target` |
de: | Slowenisch | Slovenian | `SL` | `source`, `target` |
fr: | Slovène | Slovenian | `SL` | `source`, `target` |
it: | Sloveno | Slovenian | `SL` | `source`, `target` |
pt: | Esloveno | Slovenian | `SL` | `source`, `target` |
ru: | Словенский | Slovenian | `SL` | `source`, `target` |

# chunk_EF0CF035
source: | 瑞典语 | Swedish | `SV` | `source`, `target` |
de: | Schwedisch | Swedish | `SV` | `source`, `target` |
fr: | Suédois | Swedish | `SV` | `source`, `target` |
it: | Svedese | Swedish | `SV` | `source`, `target` |
pt: | Sueco | Swedish | `SV` | `source`, `target` |
ru: | Шведский | Swedish | `SV` | `source`, `target` |
