Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_9CD70BC3
source: <h2 id="title">PDFMathTranslate</h2> <p>
de: <h2 id="titel">PDFMathTranslate</h2> <p>
fr: <h2 id="titre">PDFMathTranslate</h2> <p>
it: <h2 id="titolo">PDFMathTranslate</h2> <p>
pt: <h2 id="título">PDFMathTranslate</h2> <p>
ru: <h2 id="заголовок">PDFMathTranslate</h2> <p>

# chunk_9DA5FEDD
source: </div> PDF scientific paper translation and bilingual comparison. Based on [BabelDOC](https://github.com/funstory-ai/BabelDOC). Additionally, this project is also the official reference implementation for calling BabelDOC to perform PDF translation.
de: </div> PDF wissenschaftliche Artikel Übersetzung und zweisprachiger Vergleich. Basierend auf [BabelDOC](https://github.com/funstory-ai/BabelDOC). Zusätzlich ist dieses Projekt auch die offizielle Referenzimplementierung für den Aufruf von BabelDOC zur Durchführung von PDF-Übersetzungen.
fr: </div> Traduction d'articles scientifiques PDF et comparaison bilingue. Basé sur [BabelDOC](https://github.com/funstory-ai/BabelDOC). De plus, ce projet est également l'implémentation de référence officielle pour appeler BabelDOC afin d'effectuer la traduction PDF.
it: </div> Traduzione di articoli scientifici in PDF e confronto bilingue. Basato su [BabelDOC](https://github.com/funstory-ai/BabelDOC). Inoltre, questo progetto è anche l'implementazione di riferimento ufficiale per chiamare BabelDOC per eseguire la traduzione di PDF.
pt: </div> Tradução de artigos científicos em PDF e comparação bilíngue. Baseado em [BabelDOC](https://github.com/funstory-ai/BabelDOC). Além disso, este projeto também é a implementação de referência oficial para chamar o BabelDOC para realizar a tradução de PDF.
ru: </div> Перевод научных статей в формате PDF и двуязычное сравнение. Основано на [BabelDOC](https://github.com/funstory-ai/BabelDOC). Кроме того, этот проект также является официальной эталонной реализацией для вызова BabelDOC для выполнения перевода PDF.

# chunk_3BE38B9A
source: - 📊 Preserve formulas, charts, table of contents, and annotations _([preview](#preview))_. - 🌐 Support [multiple languages](https://pdf2zh-next.com/supported_languages.html), and diverse [translation services](https://pdf2zh-next.com/advanced/Documentation-of-Translation-Services.html). - 🤖 Provides [commandline tool](https://pdf2zh-next.com/getting-started/USAGE_commandline.html), [interactive user interface](https://pdf2zh-next.com/getting-started/USAGE_webui.html), and [Docker](https://pdf2zh-next.com/getting-started/INSTALLATION_docker.html)
de: - 📊 Erhalten Sie Formeln, Diagramme, Inhaltsverzeichnisse und Anmerkungen _([Vorschau](#vorschau))_. - 🌐 Unterstützt [mehrere Sprachen](https://pdf2zh-next.com/supported_languages.html) und verschiedene [Übersetzungsdienste](https://pdf2zh-next.com/advanced/Documentation-of-Translation-Services.html). - 🤖 Bietet [Kommandozeilen-Tool](https://pdf2zh-next.com/getting-started/USAGE_commandline.html), [interaktive Benutzeroberfläche](https://pdf2zh-next.com/getting-started/USAGE_webui.html) und [Docker](https://pdf2zh-next.com/getting-started/INSTALLATION_docker.html)
fr: - 📊 Préserve les formules, les graphiques, la table des matières et les annotations _([aperçu](#aperçu))_. - 🌐 Prend en charge [plusieurs langues](https://pdf2zh-next.com/supported_languages.html) et divers [services de traduction](https://pdf2zh-next.com/advanced/Documentation-of-Translation-Services.html). - 🤖 Fournit un [outil en ligne de commande](https://pdf2zh-next.com/getting-started/USAGE_commandline.html), une [interface utilisateur interactive](https://pdf2zh-next.com/getting-started/USAGE_webui.html) et [Docker](https://pdf2zh-next.com/getting-started/INSTALLATION_docker.html)
it: - 📊 Conserva formule, grafici, indice e annotazioni _([anteprima](#anteprima))_. - 🌐 Supporta [molte lingue](https://pdf2zh-next.com/supported_languages.html) e diversi [servizi di traduzione](https://pdf2zh-next.com/advanced/Documentation-of-Translation-Services.html). - 🤖 Fornisce [strumento da riga di comando](https://pdf2zh-next.com/getting-started/USAGE_commandline.html), [interfaccia utente interattiva](https://pdf2zh-next.com/getting-started/USAGE_webui.html) e [Docker](https://pdf2zh-next.com/getting-started/INSTALLATION_docker.html)
pt: - 📊 Preserve fórmulas, gráficos, sumário e anotações _([prévia](#prévia))_. - 🌐 Suporta [múltiplos idiomas](https://pdf2zh-next.com/supported_languages.html) e diversos [serviços de tradução](https://pdf2zh-next.com/advanced/Documentation-of-Translation-Services.html). - 🤖 Oferece [ferramenta de linha de comando](https://pdf2zh-next.com/getting-started/USAGE_commandline.html), [interface de usuário interativa](https://pdf2zh-next.com/getting-started/USAGE_webui.html) e [Docker](https://pdf2zh-next.com/getting-started/INSTALLATION_docker.html)
ru: - 📊 Сохранение формул, диаграмм, оглавления и аннотаций _([предварительный просмотр](#предварительный-просмотр))_. - 🌐 Поддержка [множества языков](https://pdf2zh-next.com/supported_languages.html) и разнообразных [служб перевода](https://pdf2zh-next.com/advanced/Documentation-of-Translation-Services.html). - 🤖 Предоставляет [инструмент командной строки](https://pdf2zh-next.com/getting-started/USAGE_commandline.html), [интерактивный пользовательский интерфейс](https://pdf2zh-next.com/getting-started/USAGE_webui.html) и [Docker](https://pdf2zh-next.com/getting-started/INSTALLATION_docker.html)

# chunk_9DB1D4F2
source: > [!WARNING] > > This project is provided "as is" under the [AGPL v3](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/blob/main/LICENSE) license, and no guarantees are provided for the quality and performance of the program. **The entire risk of the program's quality and performance is borne by you.** If the program is found to be defective, you will be responsible for all necessary service, repair, or correction costs. > > Due to the maintainers' limited energy, we do not provide any form of usage assistance or problem-solving. Related issues will be closed directly! (Pull requests to improve project documentation are welcome; bugs or friendly issues that follow the issue template are not affected by this)
de: > [!WARNING] > > Dieses Projekt wird "wie besehen" unter der [AGPL v3](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/blob/main/LICENSE)-Lizenz bereitgestellt, und es werden keine Garantien für die Qualität und Leistung des Programms übernommen. **Das gesamte Risiko bezüglich der Qualität und Leistung des Programms tragen Sie.** Sollte sich das Programm als fehlerhaft erweisen, sind Sie für alle anfallenden Kosten für Service, Reparatur oder Korrektur verantwortlich. > > Aufgrund der begrenzten Kapazitäten der Maintainer bieten wir keine Unterstützung bei der Nutzung oder Problemlösung in irgendeiner Form an. Entsprechende Issues werden direkt geschlossen! (Pull Requests zur Verbesserung der Projektdokumentation sind willkommen; Fehler oder freundliche Issues, die der Issue-Vorlage folgen, sind davon nicht betroffen)
fr: > [!WARNING] > > Ce projet est fourni "tel quel" sous la licence [AGPL v3](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/blob/main/LICENSE), et aucune garantie n'est fournie quant à la qualité et aux performances du programme. **L'intégralité du risque concernant la qualité et les performances du programme est supportée par vous.** Si le programme s'avère défectueux, vous serez responsable de tous les coûts nécessaires de service, de réparation ou de correction. > > En raison de l'énergie limitée des mainteneurs, nous ne fournissons aucune forme d'assistance à l'utilisation ou de résolution de problèmes. Les problèmes liés seront fermés directement ! (Les pull requests pour améliorer la documentation du projet sont les bienvenues ; les bugs ou les problèmes amicaux qui suivent le modèle de problème ne sont pas affectés par cela)
it: > [!WARNING] > > Questo progetto è fornito "così com'è" sotto la licenza [AGPL v3](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/blob/main/LICENSE), e non vengono fornite garanzie sulla qualità e le prestazioni del programma. **L'intero rischio relativo alla qualità e alle prestazioni del programma è a tuo carico.** Se il programma risulta difettoso, sarai responsabile di tutti i costi necessari per la manutenzione, la riparazione o la correzione. > > A causa delle energie limitate dei manutentori, non forniamo alcuna forma di assistenza all'utilizzo o risoluzione dei problemi. Le issue correlate verranno chiuse direttamente! (Sono benvenuti i pull request per migliorare la documentazione del progetto; i bug o le issue amichevoli che seguono il template delle issue non sono influenzati da questo)
pt: > [!WARNING] > > Este projeto é fornecido "como está" sob a licença [AGPL v3](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/blob/main/LICENSE), e não são fornecidas garantias para a qualidade e desempenho do programa. **Todo o risco da qualidade e desempenho do programa é suportado por você.** Se o programa for considerado defeituoso, você será responsável por todos os custos necessários de serviço, reparo ou correção. > > Devido à energia limitada dos mantenedores, não fornecemos qualquer forma de assistência de uso ou resolução de problemas. Questões relacionadas serão fechadas diretamente! (Pull requests para melhorar a documentação do projeto são bem-vindos; bugs ou questões amigáveis que seguem o modelo de problema não são afetados por isso)
ru: > [!WARNING] > > Этот проект предоставляется «как есть» по лицензии [AGPL v3](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/blob/main/LICENSE), и никаких гарантий относительно качества и производительности программы не предоставляется. **Весь риск, связанный с качеством и производительностью программы, лежит на вас.** Если программа окажется дефектной, вы будете нести ответственность за все необходимые расходы на обслуживание, ремонт или исправление. > > В связи с ограниченными ресурсами сопровождающих мы не предоставляем никакой помощи в использовании или решении проблем. Соответствующие вопросы будут закрыты напрямую! (Приветствуются пул-реквесты для улучшения документации проекта; на ошибки или дружелюбные вопросы, следующие шаблону вопроса, это не распространяется)

# chunk_CAEA8F3C
source: For details on how to contribute, please consult the [Contribution Guide](https://pdf2zh-next.com/community/Contribution-Guide.html). <h2 id="preview">Preview</h2> <div align="center">
de: Weitere Einzelheiten zur Mitwirkung finden Sie im [Contribution Guide](https://pdf2zh-next.com/community/Contribution-Guide.html). <h2 id="vorschau">Vorschau</h2> <div align="center">
fr: Pour plus de détails sur la manière de contribuer, veuillez consulter le [Guide de contribution](https://pdf2zh-next.com/community/Contribution-Guide.html). <h2 id="preview">Aperçu</h2> <div align="center">
it: Per i dettagli su come contribuire, si prega di consultare la [Guida al Contributo](https://pdf2zh-next.com/community/Contribution-Guide.html). <h2 id="anteprima">Anteprima</h2> <div align="center">
pt: Para obter detalhes sobre como contribuir, consulte o [Guia de Contribuição](https://pdf2zh-next.com/community/Contribution-Guide.html). <h2 id="preview">Pré-visualização</h2> <div align="center">
ru: Для получения подробной информации о том, как внести свой вклад, обратитесь к [Руководству по внесению вклада](https://pdf2zh-next.com/community/Contribution-Guide.html). <h2 id="предпросмотр">Предпросмотр</h2> <div align="center">

# chunk_C7B63F0F
source: </div> <h2 id="demo">Online Service 🌟</h2> You can try our application out using either of the following services:
de: </div> <h2 id="demo">Online Service 🌟</h2> Sie können unsere Anwendung über einen der folgenden Dienste ausprobieren:
fr: </div> <h2 id="demo">Service en Ligne 🌟</h2> Vous pouvez essayer notre application en utilisant l'un des services suivants :
it: </div> <h2 id="demo">Online Service 🌟</h2> Puoi provare la nostra applicazione utilizzando uno dei seguenti servizi:
pt: </div> <h2 id="demo">Serviço Online 🌟</h2> Você pode experimentar nossa aplicação usando qualquer um dos seguintes serviços:
ru: </div> <h2 id="демо">Онлайн-сервис 🌟</h2> Вы можете опробовать наше приложение, используя любой из следующих сервисов:

# chunk_F86E0964
source: - [Immersive Translate - BabelDOC](https://app.immersivetranslate.com/babel-doc/) Free usage quota is available; please refer to the FAQ section on the page for details.
de: - [Immersive Translate - BabelDOC](https://app.immersivetranslate.com/babel-doc/) Ein kostenloses Nutzungskontingent ist verfügbar; Einzelheiten finden Sie im FAQ-Bereich auf der Seite.
fr: - [Immersive Translate - BabelDOC](https://app.immersivetranslate.com/babel-doc/) Un quota d'utilisation gratuit est disponible ; veuillez consulter la section FAQ de la page pour plus de détails.
it: - [Immersive Translate - BabelDOC](https://app.immersivetranslate.com/babel-doc/) È disponibile una quota di utilizzo gratuita; per i dettagli, consultare la sezione Domande frequenti nella pagina.
pt: - [Immersive Translate - BabelDOC](https://app.immersivetranslate.com/babel-doc/) Cota de uso gratuito disponível; consulte a seção de Perguntas frequentes na página para obter detalhes.
ru: - [Immersive Translate - BabelDOC](https://app.immersivetranslate.com/babel-doc/) Доступна бесплатная квота использования; подробности смотрите в разделе FAQ на странице.

# chunk_C20CF59D
source: <h2 id="install">Installation and Usage</h2>
de: <h2 id="install">Installation und Verwendung</h2>
fr: <h2 id="install">Installation et Utilisation</h2>
it: <h2 id="installazione">Installazione e Utilizzo</h2>
pt: <h2 id="instalacao">Instalação e Uso</h2>
ru: <h2 id="установка">Установка и использование</h2>

# chunk_36D1B1ED
source: ### Installation
it: ### Installazione
pt: ### Instalação
ru: ### Установка

# chunk_545A02FF
source: 1. [**Windows EXE**](https://pdf2zh-next.com/getting-started/INSTALLATION_winexe.html) <small>Recommand for Windows</small> 2. [**Docker**](https://pdf2zh-next.com/getting-started/INSTALLATION_docker.html) <small>Recommand for Linux</small> 3. [**uv** (a Python package manager)](https://pdf2zh-next.com/getting-started/INSTALLATION_uv.html) <small>Recommand for macOS</small>
de: 1. [**Windows EXE**](https://pdf2zh-next.com/getting-started/INSTALLATION_winexe.html) <small>Empfohlen für Windows</small> 2. [**Docker**](https://pdf2zh-next.com/getting-started/INSTALLATION_docker.html) <small>Empfohlen für Linux</small> 3. [**uv** (ein Python-Paketmanager)](https://pdf2zh-next.com/getting-started/INSTALLATION_uv.html) <small>Empfohlen für macOS</small>
fr: 1. [**Windows EXE**](https://pdf2zh-next.com/getting-started/INSTALLATION_winexe.html) <small>Recommandé pour Windows</small> 2. [**Docker**](https://pdf2zh-next.com/getting-started/INSTALLATION_docker.html) <small>Recommandé pour Linux</small> 3. [**uv** (un gestionnaire de paquets Python)](https://pdf2zh-next.com/getting-started/INSTALLATION_uv.html) <small>Recommandé pour macOS</small>
it: 1. [**Windows EXE**](https://pdf2zh-next.com/getting-started/INSTALLATION_winexe.html) <small>Consigliato per Windows</small> 2. [**Docker**](https://pdf2zh-next.com/getting-started/INSTALLATION_docker.html) <small>Consigliato per Linux</small> 3. [**uv** (un gestore di pacchetti Python)](https://pdf2zh-next.com/getting-started/INSTALLATION_uv.html) <small>Consigliato per macOS</small>
pt: 1. [**Windows EXE**](https://pdf2zh-next.com/getting-started/INSTALLATION_winexe.html) <small>Recomendado para Windows</small> 2. [**Docker**](https://pdf2zh-next.com/getting-started/INSTALLATION_docker.html) <small>Recomendado para Linux</small> 3. [**uv** (um gerenciador de pacotes Python)](https://pdf2zh-next.com/getting-started/INSTALLATION_uv.html) <small>Recomendado para macOS</small>
ru: 1. [**Windows EXE**](https://pdf2zh-next.com/getting-started/INSTALLATION_winexe.html) <small>Рекомендуется для Windows</small> 2. [**Docker**](https://pdf2zh-next.com/getting-started/INSTALLATION_docker.html) <small>Рекомендуется для Linux</small> 3. [**uv** (менеджер пакетов Python)](https://pdf2zh-next.com/getting-started/INSTALLATION_uv.html) <small>Рекомендуется для macOS</small>

# chunk_047D6F23
source: ### Usage
de: ### Verwendung
fr: ### Utilisation
it: ### Utilizzo
pt: ### Uso
ru: ### Использование

# chunk_A49D7830
source: 1. [Using **WebUI**](https://pdf2zh-next.com/getting-started/USAGE_webui.html) 2. [Using **Zotero Plugin**](https://github.com/guaguastandup/zotero-pdf2zh) (Third party program) 3. [Using **Commandline**](https://pdf2zh-next.com/getting-started/USAGE_commandline.html)
de: 1. [Verwendung von **WebUI**](https://pdf2zh-next.com/getting-started/USAGE_webui.html) 2. [Verwendung des **Zotero-Plugins**](https://github.com/guaguastandup/zotero-pdf2zh) (Drittanbieter-Programm) 3. [Verwendung der **Kommandozeile**](https://pdf2zh-next.com/getting-started/USAGE_commandline.html)
fr: 1. [Utilisation de **WebUI**](https://pdf2zh-next.com/getting-started/USAGE_webui.html) 2. [Utilisation du **Plugin Zotero**](https://github.com/guaguastandup/zotero-pdf2zh) (Programme tiers) 3. [Utilisation de la **Ligne de commande**](https://pdf2zh-next.com/getting-started/USAGE_commandline.html)
it: 1. [Utilizzo di **WebUI**](https://pdf2zh-next.com/getting-started/USAGE_webui.html) 2. [Utilizzo di **Zotero Plugin**](https://github.com/guaguastandup/zotero-pdf2zh) (Programma di terze parti) 3. [Utilizzo di **Riga di comando**](https://pdf2zh-next.com/getting-started/USAGE_commandline.html)
pt: 1. [Usando **WebUI**](https://pdf2zh-next.com/getting-started/USAGE_webui.html) 2. [Usando **Plugin do Zotero**](https://github.com/guaguastandup/zotero-pdf2zh) (Programa de terceiros) 3. [Usando **Linha de comando**](https://pdf2zh-next.com/getting-started/USAGE_commandline.html)
ru: 1. [Использование **WebUI**](https://pdf2zh-next.com/getting-started/USAGE_webui.html) 2. [Использование **Плагина Zotero**](https://github.com/guaguastandup/zotero-pdf2zh) (Сторонняя программа) 3. [Использование **Командной строки**](https://pdf2zh-next.com/getting-started/USAGE_commandline.html)

# chunk_F57A3EE5
source: For different use cases, we provide distinct methods to use our program. Check out [this page](./getting-started/getting-started.md) for more information. <h2 id="usage">Advanced Options</h2> For detailed explanations, please refer to our document about [Advanced Usage](https://pdf2zh-next.com/advanced/advanced.html) for a full list of each option. <h2 id="downstream">Secondary Development (APIs)</h2>
de: Für verschiedene Anwendungsfälle bieten wir unterschiedliche Methoden zur Nutzung unseres Programms. Weitere Informationen finden Sie auf [dieser Seite](./getting-started/getting-started.md). <h2 id="usage">Erweiterte Optionen</h2> Detaillierte Erklärungen finden Sie in unserem Dokument zur [Erweiterten Verwendung](https://pdf2zh-next.com/advanced/advanced.html) für eine vollständige Liste aller Optionen. <h2 id="downstream">Weiterentwicklung (APIs)</h2>
fr: Pour différents cas d'utilisation, nous fournissons des méthodes distinctes pour utiliser notre programme. Consultez [cette page](./getting-started/getting-started.md) pour plus d'informations. <h2 id="usage">Options avancées</h2> Pour des explications détaillées, veuillez vous référer à notre document sur [l'Utilisation avancée](https://pdf2zh-next.com/advanced/advanced.html) pour une liste complète de chaque option. <h2 id="downstream">Développement secondaire (APIs)</h2>
it: Per diversi casi d'uso, forniamo metodi distinti per utilizzare il nostro programma. Consulta [questa pagina](./getting-started/getting-started.md) per maggiori informazioni. <h2 id="usage">Opzioni avanzate</h2> Per spiegazioni dettagliate, si prega di fare riferimento al nostro documento su [Utilizzo avanzato](https://pdf2zh-next.com/advanced/advanced.html) per un elenco completo di ogni opzione. <h2 id="downstream">Sviluppo secondario (API)</h2>
pt: Para diferentes casos de uso, fornecemos métodos distintos para usar nosso programa. Confira [esta página](./getting-started/getting-started.md) para mais informações. <h2 id="uso">Opções Avançadas</h2> Para explicações detalhadas, consulte nosso documento sobre [Uso Avançado](https://pdf2zh-next.com/advanced/advanced.html) para obter uma lista completa de cada opção. <h2 id="desenvolvimento-secundario">Desenvolvimento Secundário (APIs)</h2>
ru: Для различных случаев использования мы предоставляем различные методы работы с нашей программой. Подробнее смотрите на [этой странице](./getting-started/getting-started.md). <h2 id="usage">Расширенные параметры</h2> Подробные объяснения смотрите в нашем документе о [Расширенном использовании](https://pdf2zh-next.com/advanced/advanced.html) для получения полного списка каждой опции. <h2 id="downstream">Вторичная разработка (API)</h2>

# chunk_7BA06D24
source: - [Python API](./docs/en/advanced/API/python.md), how to use the program in other Python programs
de: - [Python API](./docs/de/advanced/API/python.md), wie man das Programm in anderen Python-Programmen verwendet
fr: - [API Python](./docs/fr/advanced/API/python.md), comment utiliser le programme dans d'autres programmes Python
it: - [API Python](./docs/it/advanced/API/python.md), come utilizzare il programma in altri programmi Python
pt: - [API Python](./docs/pt/advanced/API/python.md), como usar o programa em outros programas Python
ru: - [Python API](./docs/ru/advanced/API/python.md), как использовать программу в других программах на Python

# chunk_7512C664
source: <h2 id="langcode">Language Code</h2> If you don't know what code to use to translate to the language you need, check out [this documentation](https://pdf2zh-next.com/advanced/Language-Codes.html) <h2 id="acknowledgement">Acknowledgements</h2>
de: <h2 id="langcode">Sprachcode</h2> Wenn Sie nicht wissen, welchen Code Sie verwenden müssen, um in die gewünschte Sprache zu übersetzen, lesen Sie [diese Dokumentation](https://pdf2zh-next.com/advanced/Language-Codes.html) <h2 id="acknowledgement">Danksagungen</h2>
fr: <h2 id="langcode">Code de langue</h2> Si vous ne savez pas quel code utiliser pour traduire dans la langue dont vous avez besoin, consultez [cette documentation](https://pdf2zh-next.com/advanced/Language-Codes.html) <h2 id="acknowledgement">Remerciements</h2>
it: <h2 id="codice-lingua">Codice lingua</h2> Se non sai quale codice utilizzare per tradurre nella lingua di cui hai bisogno, consulta [questa documentazione](https://pdf2zh-next.com/advanced/Language-Codes.html) <h2 id="ringraziamenti">Ringraziamenti</h2>
pt: <h2 id="código-do-idioma">Código do Idioma</h2> Se você não sabe qual código usar para traduzir para o idioma que precisa, consulte [esta documentação](https://pdf2zh-next.com/advanced/Language-Codes.html) <h2 id="agradecimentos">Agradecimentos</h2>
ru: <h2 id="кодязыка">Код языка</h2> Если вы не знаете, какой код использовать для перевода на нужный вам язык, ознакомьтесь с [этой документацией](https://pdf2zh-next.com/advanced/Language-Codes.html) <h2 id="благодарности">Благодарности</h2>
