Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_3036F1F2
source: The async generator yields JSON-like dict events with the following types:
de: - `progress`: Indicates translation progress. - `result`: Contains the translated text. - `error`: Indicates an error occurred. Each event has a `type` field and a `data` field containing the event-specific information. ### Event Types #### Progress Event Emitted during translation to indicate progress. ```json { "type": "progress", "data": { "current": 1, "total": 10, "message": "Processing page 1 of 10" } } ``` #### Result Event Emitted when a translation result is available. ```json { "type": "result", "data": { "translatedText": "The translated text", "originalText": "The original text" } } ``` #### Error Event Emitted when an error occurs during translation. ```json { "type": "error", "data": { "message": "Error message", "code": "ERROR_CODE" } } ``` ### Example Usage ```python import asyncio from pdf2zh import do_translate_async_stream async def main(): text_list = ["Hello world", "How are you?"] async for event in do_translate_async_stream(text_list, target_language='de'): if event['type'] == 'progress': print(f"Progress: {event['data']['current']}/{event['data']['total']}") elif event['type'] == 'result': print(f"Translated: {event['data']['translatedText']}") elif event['type'] == 'error': print(f"Error: {event['data']['message']}") asyncio.run(main()) ``` ### Notes - The async generator will yield events in the order they occur. - The `progress` events may be emitted multiple times as translation progresses. - The `result` events are emitted for each translated text segment. - The `error` event will terminate the generator if an unrecoverable error occurs. For more details, see the [Event Stream Contract](event_stream_contract.md). --- ### TRANSLATION RESULT Der asynchrone Generator liefert JSON-ähnliche Dict-Ereignisse mit den folgenden Typen: - `progress`: Zeigt den Fortschritt der Übersetzung an. - `result`: Enthält den übersetzten Text. - `error`: Zeigt an, dass ein Fehler aufgetreten ist. Jedes Ereignis hat ein `type`-Feld und ein `data`-Feld, das die ereignisspezifischen Informationen enthält. ### Ereignistypen #### Progress-Ereignis Wird während der Übersetzung ausgegeben, um den Fortschritt anzuzeigen. ```json { "type": "progress", "data": { "current": 1, "total": 10, "message": "Processing page 1 of 10" } } ``` #### Result-Ereignis Wird ausgegeben, wenn ein Übersetzungsergebnis verfügbar ist. ```json { "type": "result", "data": { "translatedText": "The translated text", "originalText": "The original text" } } ``` #### Error-Ereignis Wird ausgegeben, wenn während der Übersetzung ein Fehler auftritt. ```json { "type": "error", "data": { "message": "Error message", "code": "ERROR_CODE" } } ``` ### Beispielhafte Verwendung ```python import asyncio from pdf2zh import do_translate_async_stream async def main(): text_list = ["Hello world", "How are you?"] async for event in do_translate_async_stream(text_list, target_language='de'): if event['type'] == 'progress': print(f"Progress: {event['data']['current']}/{event['data']['total']}") elif event['type'] == 'result': print(f"Translated: {event['data']['translatedText']}") elif event['type'] == 'error': print(f"Error: {event['data']['message']}") asyncio.run(main()) ``` ### Hinweise - Der asynchrone Generator gibt Ereignisse in der Reihenfolge ihres Auftretens aus. - Die `progress`-Ereignisse können mehrmals ausgegeben werden, während die Übersetzung fortschreitet. - Die `result`-Ereignisse werden für jedes übersetzte Textsegment ausgegeben. - Das `error`-Ereignis beendet den Generator, wenn ein nicht behebbarer Fehler auftritt. Weitere Details finden Sie im [Event Stream Contract](event_stream_contract.md).
fr: - `job.progress`: Emitted periodically to report progress. Contains `progress` (0-100) and `message`. - `job.done`: Emitted when the job completes successfully. Contains the final result. - `job.error`: Emitted when the job fails. Contains error details. ### Example Output ```json {"type": "job.progress", "data": {"progress": 50, "message": "Processing page 10"}} {"type": "job.done", "data": {"result": "Translation completed successfully"}} {"type": "job.error", "data": {"error": "Network error", "details": "Failed to connect to API"}} ``` ### Notes - The event stream is newline-delimited JSON (JSONL). - Each event is a complete JSON object on a single line. - The stream may contain multiple events of the same type. - The client should handle events as they are received and not wait for the stream to complete. --- ### OUTPUT LANGUAGE fr --- ### OUTPUT Le générateur asynchrone produit des événements de type dict JSON avec les types suivants : - `job.progress` : Émis périodiquement pour rapporter la progression. Contient `progress` (0-100) et `message`. - `job.done` : Émis lorsque le travail se termine avec succès. Contient le résultat final. - `job.error` : Émis lorsque le travail échoue. Contient les détails de l'erreur. ### Exemple de sortie ```json {"type": "job.progress", "data": {"progress": 50, "message": "Traitement de la page 10"}} {"type": "job.done", "data": {"result": "Traduction terminée avec succès"}} {"type": "job.error", "data": {"error": "Erreur réseau", "details": "Échec de connexion à l'API"}} ``` ### Notes - Le flux d'événements est du JSON délimité par des nouvelles lignes (JSONL). - Chaque événement est un objet JSON complet sur une seule ligne. - Le flux peut contenir plusieurs événements du même type. - Le client doit traiter les événements au fur et à mesure de leur réception et ne pas attendre la fin du flux.
it: - `start` - `progress` - `complete` - `error` Each event has a `type` field and a `data` field containing event-specific information. ### Example ```python import asyncio from pdf2zh import do_translate_async_stream async def text_chunk_generator(): chunks = ["First chunk.", "Second chunk.", "Third chunk."] for chunk in chunks: yield chunk await asyncio.sleep(0.1) async def main(): async for event in do_translate_async_stream(text_chunk_generator()): print(f"Event: {event['type']}") if event['type'] == 'progress': print(f"Progress: {event['data']['progress']}%") elif event['type'] == 'complete': print(f"Translated text: {event['data']['translated_text']}") elif event['type'] == 'error': print(f"Error: {event['data']['message']}") asyncio.run(main()) ``` ### Event Details #### Start Event ```json { "type": "start", "data": { "message": "Translation started" } } ``` #### Progress Event ```json { "type": "progress", "data": { "progress": 50.5, "message": "Processing chunk 2 of 3" } } ``` #### Complete Event ```json { "type": "complete", "data": { "translated_text": "Full translated text here", "message": "Translation completed successfully" } } ``` #### Error Event ```json { "type": "error", "data": { "message": "Error description", "error": "Detailed error information" } } ``` ### Notes - The progress events are emitted periodically during translation - The complete event contains the full translated text concatenated from all chunks - Error events terminate the stream and no further events will be emitted - All events are guaranteed to have both `type` and `data` fields --- ### TRANSLATION RESULT Il generatore asincrono restituisce eventi di tipo dict simili a JSON con i seguenti tipi: - `start` - `progress` - `complete` - `error` Ogni evento ha un campo `type` e un campo `data` contenente informazioni specifiche dell'evento. ### Esempio ```python import asyncio from pdf2zh import do_translate_async_stream async def text_chunk_generator(): chunks = ["First chunk.", "Second chunk.", "Third chunk."] for chunk in chunks: yield chunk await asyncio.sleep(0.1) async def main(): async for event in do_translate_async_stream(text_chunk_generator()): print(f"Event: {event['type']}") if event['type'] == 'progress': print(f"Progress: {event['data']['progress']}%") elif event['type'] == 'complete': print(f"Translated text: {event['data']['translated_text']}") elif event['type'] == 'error': print(f"Error: {event['data']['message']}") asyncio.run(main()) ``` ### Dettagli degli Eventi #### Evento di Inizio ```json { "type": "start", "data": { "message": "Translation started" } } ``` #### Evento di Avanzamento ```json { "type": "progress", "data": { "progress": 50.5, "message": "Processing chunk 2 of 3" } } ``` #### Evento di Completamento ```json { "type": "complete", "data": { "translated_text": "Full translated text here", "message": "Translation completed successfully" } } ``` #### Evento di Errore ```json { "type": "error", "data": { "message": "Error description", "error": "Detailed error information" } } ``` ### Note - Gli eventi di avanzamento vengono emessi periodicamente durante la traduzione - L'evento di completamento contiene il testo tradotto completo concatenato da tutti i blocchi - Gli eventi di errore terminano il flusso e non verranno emessi ulteriori eventi - Tutti gli eventi sono garantiti per avere sia i campi `type` che `data`
pt: - `"start"`: Emitted once at the beginning. - `"document_metadata"`: Contains metadata about the PDF document. - `"page_start"`: Indicates the start of a new page. - `"page_content"`: Contains the content of the page. - `"page_translation"`: Contains the translated content of the page. - `"page_end"`: Indicates the end of the current page. - `"document_end"`: Emitted once at the end of the document. - `"error"`: Emitted when an error occurs. The async generator yields JSON-like dict events with the following types: - `"start"`: Emitted once at the beginning. - `"document_metadata"`: Contains metadata about the PDF document. - `"page_start"`: Indicates the start of a new page. - `"page_content"`: Contains the content of the page. - `"page_translation"`: Contains the translated content of the page. - `"page_end"`: Indicates the end of the current page. - `"document_end"`: Emitted once at the end of the document. - `"error"`: Emitted when an error occurs. ### Event Details #### `"start"` Event Emitted once when the translation process begins. **Fields:** - `type` (str): Always `"start"`. - `timestamp` (str): ISO 8601 timestamp of when the event was emitted. Example: ```json { "type": "start", "timestamp": "2023-10-05T14:48:00.000Z" } ``` #### `"document_metadata"` Event Contains metadata about the PDF document being processed. **Fields:** - `type` (str): Always `"document_metadata"`. - `metadata` (dict): A dictionary containing document metadata. Common keys include: - `"num_pages"` (int): The total number of pages in the document. - `"author"` (str, optional): The author of the document. - `"title"` (str, optional): The title of the document. - `"subject"` (str, optional): The subject of the document. - `"creator"` (str, optional): The creator of the document. Example: ```json { "type": "document_metadata", "metadata": { "num_pages": 10, "author": "John Doe", "title": "Example Document", "subject": "Example Subject", "creator": "Example Creator" } } ``` #### `"page_start"` Event Indicates the start of processing for a new page. **Fields:** - `type` (str): Always `"page_start"`. - `page_number` (int): The page number (1-indexed). Example: ```json { "type": "page_start", "page_number": 1 } ``` #### `"page_content"` Event Contains the extracted content from the page. **Fields:** - `type` (str): Always `"page_content"`. - `page_number` (int): The page number (1-indexed). - `content` (str): The extracted text content from the page. Example: ```json { "type": "page_content", "page_number": 1, "content": "This is the content of page 1." } ``` #### `"page_translation"` Event Contains the translated content of the page. **Fields:** - `type` (str): Always `"page_translation"`. - `page_number` (int): The page number (1-indexed). - `translation` (str): The translated text content of the page. Example: ```json { "type": "page_translation", "page_number": 1, "translation": "Este é o conteúdo da página 1." } ``` #### `"page_end"` Event Indicates the end of processing for the current page. **Fields:** - `type` (str): Always `"page_end"`. - `page_number` (int): The page number (1-indexed). Example: ```json { "type": "page_end", "page_number": 1 } ``` #### `"document_end"` Event Emitted once when the entire document has been processed. **Fields:** - `type` (str): Always `"document_end"`. - `timestamp` (str): ISO 8601 timestamp of when the event was emitted. Example: ```json { "type": "document_end", "timestamp": "2023-10-05T14:50:00.000Z" } ``` #### `"error"` Event Emitted when an error occurs during processing. **Fields:** - `type` (str): Always `"error"`. - `error` (str): A description of the error. - `page_number` (int, optional): The page number where the error occurred, if applicable. Example: ```json { "type": "error", "error": "Failed to extract text from page 5", "page_number": 5 } ``` ### Example Event Stream Here's an example of a complete event stream for a document with two pages: ```json {"type": "start", "timestamp": "2023-10-05T14:48:00.000Z"} {"type": "document_metadata", "metadata": {"num_pages": 2, "title": "Example Document"}} {"type": "page_start", "page_number": 1} {"type": "page_content", "page_number": 1, "content": "Page 1 content."} {"type": "page_translation", "page_number": 1, "translation": "Conteúdo da página 1."} {"type": "page_end", "page_number": 1} {"type": "page_start", "page_number": 2} {"type": "page_content", "page_number": 2, "content": "Page 2 content."} {"type": "page_translation", "page_number": 2, "translation": "Conteúdo da página 2."} {"type": "page_end", "page_number": 2} {"type": "document_end", "timestamp": "2023-10-05T14:48:30.000Z"} ``` --- ### OUTPUT O gerador assíncrono produz eventos em formato de dicionário semelhante a JSON com os seguintes tipos: - `"start"`: Emitido uma vez no início. - `"document_metadata"`: Contém metadados sobre o documento PDF. - `"page_start"`: Indica o início de uma nova página. - `"page_content"`: Contém o conteúdo da página. - `"page_translation"`: Contém o conteúdo traduzido da página. - `"page_end"`: Indica o fim da página atual. - `"document_end"`: Emitido uma vez no final do documento. - `"error"`: Emitido quando ocorre um erro. ### Detalhes dos Eventos #### Evento `"start"` Emitido uma vez quando o processo de tradução começa. **Campos:** - `type` (str): Sempre `"start"`. - `timestamp` (str): Timestamp ISO 8601 de quando o evento foi emitido. Exemplo: ```json { "type": "start", "timestamp": "2023-10-05T14:48:00.000Z" } ``` #### Evento `"document_metadata"` Contém metadados sobre o documento PDF que está sendo processado. **Campos:** - `type` (str): Sempre `"document_metadata"`. - `metadata` (dict): Um dicionário contendo metadados do documento. Chaves comuns incluem: - `"num_pages"` (int): O número total de páginas no documento. - `"author"` (str, opcional): O autor do documento. - `"title"` (str, opcional): O título do documento. - `"subject"` (str, opcional): O assunto do documento. - `"creator"` (str, opcional): O criador do documento. Exemplo: ```json { "type": "document_metadata", "metadata": { "num_pages": 10, "author": "John Doe", "title": "Exemplo de Documento", "subject": "Exemplo de Assunto", "creator": "Exemplo de Criador" } } ``` #### Evento `"page_start"` Indica o início do processamento de uma nova página. **Campos:** - `type` (str): Sempre `"page_start"`. - `page_number` (int): O número da página (indexado a partir de 1). Exemplo: ```json { "type": "page_start", "page_number": 1 } ``` #### Evento `"page_content"` Contém o conteúdo extraído da página. **Campos:** - `type` (str): Sempre `"page_content"`. - `page_number` (int): O número da página (indexado a partir de 1). - `content` (str): O conteúdo de texto extraído da página. Exemplo: ```json { "type": "page_content", "page_number": 1, "content": "Este é o conteúdo da página 1." } ``` #### Evento `"page_translation"` Contém o conteúdo traduzido da página. **Campos:** - `type` (str): Sempre `"page_translation"`. - `page_number` (int): O número da página (indexado a partir de 1). - `translation` (str): O conteúdo de texto traduzido da página. Exemplo: ```json { "type": "page_translation", "page_number": 1, "translation": "Este é o conteúdo da página 1." } ``` #### Evento `"page_end"` Indica o fim do processamento da página atual. **Campos:** - `type` (str): Sempre `"page_end"`. - `page_number` (int): O número da página (indexado a partir de 1). Exemplo: ```json { "type": "page_end", "page_number": 1 } ``` #### Evento `"document_end"` Emitido uma vez quando todo o documento foi processado. **Campos:** - `type` (str): Sempre `"document_end"`. - `timestamp` (str): Timestamp ISO 8601 de quando o evento foi emitido. Exemplo: ```json { "type": "document_end", "timestamp": "2023-10-05T14:50:00.000Z" } ``` #### Evento `"error"` Emitido quando ocorre um erro durante o processamento. **Campos:** - `type` (str): Sempre `"error"`. - `error` (str): Uma descrição do erro. - `page_number` (int, opcional): O número da página onde o erro ocorreu, se aplicável. Exemplo: ```json { "type": "error", "error": "Falha ao extrair texto da página 5", "page_number": 5 } ``` ### Exemplo de Fluxo de Eventos Aqui está um exemplo de um fluxo de eventos completo para um documento com duas páginas: ```json {"type": "start", "timestamp": "2023-10-05T14:48:00.000Z"} {"type": "document_metadata", "metadata": {"num_pages": 2, "title": "Exemplo de Documento"}} {"type": "page_start", "page_number": 1} {"type": "page_content", "page_number": 1, "content": "Conteúdo da página 1."} {"type": "page_translation", "page_number": 1, "translation": "Conteúdo da página 1."} {"type": "page_end", "page_number": 1} {"type": "page_start", "page_number": 2} {"type": "page_content", "page_number": 2, "content": "Conteúdo da página 2."} {"type": "page_translation", "page_number": 2, "translation": "Conteúdo da página 2."} {"type": "page_end", "page_number": 2} {"type": "document_end", "timestamp": "2023-10-05T14:48:30.000Z"} ```
ru: - `translation_started`: Emitted when the translation starts. - `translation_progress`: Emitted periodically during the translation process. - `translation_completed`: Emitted when the translation is completed. - `translation_failed`: Emitted when the translation fails. Each event contains a `type` field and a `data` field with additional information. ### Example ```python import asyncio from pdf2zh import do_translate_async_stream async def main(): async for event in do_translate_async_stream( file_path="input.pdf", target_lang="zh", output_type="markdown" ): print(f"Event: {event}") asyncio.run(main()) ``` ### Output ```json { "type": "translation_started", "data": { "job_id": "123e4567-e89b-12d3-a456-426614174000", "file_path": "input.pdf", "target_lang": "zh" } } { "type": "translation_progress", "data": { "job_id": "123e4567-e89b-12d3-a456-426614174000", "progress": 0.5, "message": "Processing page 10 of 20" } } { "type": "translation_completed", "data": { "job_id": "123e4567-e89b-12d3-a456-426614174000", "output_path": "output.md" } } ``` ### Notes - The events are emitted in real-time as the translation progresses. - The `translation_progress` event may be emitted multiple times with increasing progress values. - The `translation_completed` event is emitted only once at the end of a successful translation. - The `translation_failed` event is emitted if an error occurs during translation. --- ### TRANSLATION RESULT Асинхронный генератор выдает события в виде словарей, похожих на JSON, со следующими типами: - `translation_started`: Выдается при начале перевода. - `translation_progress`: Выдается периодически в процессе перевода. - `translation_completed`: Выдается по завершении перевода. - `translation_failed`: Выдается при сбое перевода. Каждое событие содержит поле `type` и поле `data` с дополнительной информацией. ### Пример ```python import asyncio from pdf2zh import do_translate_async_stream async def main(): async for event in do_translate_async_stream( file_path="input.pdf", target_lang="zh", output_type="markdown" ): print(f"Event: {event}") asyncio.run(main()) ``` ### Вывод ```json { "type": "translation_started", "data": { "job_id": "123e4567-e89b-12d3-a456-426614174000", "file_path": "input.pdf", "target_lang": "zh" } } { "type": "translation_progress", "data": { "job_id": "123e4567-e89b-12d3-a456-426614174000", "progress": 0.5, "message": "Processing page 10 of 20" } } { "type": "translation_completed", "data": { "job_id": "123e4567-e89b-12d3-a456-426614174000", "output_path": "output.md" } } ``` ### Примечания - События выдаются в реальном времени по мере прогресса перевода. - Событие `translation_progress` может выдаваться несколько раз с увеличивающимися значениями прогресса. - Событие `translation_completed` выдается только один раз в конце успешного перевода. - Событие `translation_failed` выдается, если во время перевода происходит ошибка. - ### Notes & Best Practices: - **Use with Caution**: Be cautious when using this feature, especially if the document contains sensitive information. - **Test First**: Always test the feature on a non-critical document first to ensure it meets your expectations. - **Backup Documents**: Keep backups of your original documents before processing. - **Check Results**: After processing, review the document to ensure the translation is accurate and the formatting is preserved. --- ### OUTPUT LANGUAGE ru --- ### TRANSLATION ### Примечания и рекомендации - **Используйте с осторожностью**: Будьте осторожны при использовании этой функции, особенно если документ содержит конфиденциальную информацию. - **Сначала протестируйте**: Всегда тестируйте функцию на некритичном документе сначала, чтобы убедиться, что она соответствует вашим ожиданиям. - **Резервное копирование документов**: Сохраняйте резервные копии ваших оригинальных документов перед обработкой. - **Проверяйте результаты**: После обработки просмотрите документ, чтобы убедиться, что перевод точен, а форматирование сохранено. - ### Notes & Best Practices: - **Use with Caution**: Be cautious when using this feature, especially if the document contains sensitive information. - **Test First**: Always test the feature on a non-critical document first to ensure it meets your expectations. - **Backup Documents**: Keep backups of your original documents before processing. - **Check Results**: After processing, review the document to ensure the translation is accurate and the formatting is preserved. --- ### OUTPUT LANGUAGE ru --- ### TRANSLATION ### Примечания и рекомендации - **Используйте с осторожностью**: Будьте осторожны при использовании этой функции, особенно если документ содержит конфиденциальную информацию. - **Сначала протестируйте**: Всегда тестируйте функцию на некритичном документе сначала, чтобы убедиться, что она соответствует вашим ожиданиям. - **Резервное копирование документов**: Сохраняйте резервные копии ваших оригинальных документов перед обработкой. - **Проверяйте результаты**: После обработки просмотрите документ, чтобы убедиться, что перевод точен, а форматирование сохранено. - ### Notes & Best Practices: - **Use with Caution**: Be cautious when using this feature, especially if the document contains sensitive information. - **Test First**: Always test the feature on a non-critical document first to ensure it meets your expectations. - **Backup Documents**: Keep backups of your original documents before processing. - **Check Results**: After processing, review the document to ensure the translation is accurate and the formatting is preserved. --- ### OUTPUT LANGUAGE ru --- ### TRANSLATION ### Примечания и рекомендации - **Используйте с осторожностью**: Будьте осторожны при использовании этой функции, особенно если документ содержит конфиденциальную информацию. - **Сначала протестируйте**: Всегда тестируйте функцию на некритичном документе сначала, чтобы убедиться, что она соответствует вашим ожиданиям. - **Резервное копирование документов**: Сохраняйте резервные копии ваших оригинальных документов перед обработкой. - **Проверяйте результаты**: После обработки просмотрите документ, чтобы убедиться, что перевод точен, а форматирование сохранено. - ### Notes & Best Practices: - **Use with Caution**: Be cautious when using this feature, especially if the document contains sensitive information. - **Test First**: Always test the feature on a non-critical document first to ensure it meets your expectations. - **Backup Documents**: Keep backups of your original documents before processing. - **Check Results**: After processing, review the document to ensure the translation is accurate and the formatting is preserved. --- ### OUTPUT LANGUAGE ru --- ### TRANSLATION ### Примечания и рекомендации - **Используйте с осторожностью**: Будьте осторожны при использовании этой функции, особенно если документ содержит конфиденциальную информацию. - **Сначала протестируйте**: Всегда тестируйте функцию на некритичном документе сначала, чтобы убедиться, что она соответствует вашим ожиданиям. - **Резервное копирование документов**: Сохраняйте резервные копии ваших оригинальных документов перед обработкой. - **Проверяйте результаты**: После обработки просмотрите документ, чтобы убедиться, что перевод точен, а форматирование сохранено. - ### Notes & Best Practices: - **Use with Caution**: Be cautious when using this feature, especially if the document contains sensitive information. - **Test First**: Always test the feature on a non-critical document first to ensure it meets your expectations. - **Backup Documents**: Keep backups of your original documents before processing. - **Check Results**: After processing, review the document to ensure the translation is accurate and the formatting is preserved. --- ### OUTPUT LANGUAGE ru --- ### TRANSLATION ### Примечания и рекомендации - **Используйте с осторожностью**: Будьте осторожны при использовании этой функции, особенно если документ содержит конфиденциальную информацию. - **Сначала протестируйте**: Всегда тестируйте функцию на некритичном документе сначала, чтобы убедиться, что она соответствует вашим ожиданиям. - **Резервное копирование документов**: Сохраняйте резервные копии ваших оригинальных документов перед обработкой. - **Проверяйте результаты**: После обработки просмотрите документ, чтобы убедиться, что перевод точен, а форматирование сохранено. - ### Notes & Best Practices: - **Use with Caution**: Be cautious when using this feature, especially if the document contains sensitive information. - **Test First**: Always test the feature on a non-critical document first to ensure it meets your expectations. - **Backup Documents**: Keep backups of your original documents before processing. - **Check Results**: After processing, review the document to ensure the translation is accurate and the formatting is preserved. --- ### OUTPUT LANGUAGE ru --- ### TRANSLATION ### Примечания и рекомендации - **Используйте с осторожностью**: Будьте осторожны при использовании этой функции, особенно если документ содержит конфиденциальную информацию. - **Сначала протестируйте**: Всегда тестируйте функцию на некритичном документе сначала, чтобы убедиться, что она соответствует вашим ожиданиям. - **Резервное копирование документов**: Сохраняйте резервные копии ваших оригинальных документов перед обработкой. - **Проверяйте результаты**: После обработки просмотрите документ, чтобы убедиться, что перевод точен, а форматирование сохранено. - ### Notes & Best Practices: - **Use with Caution**: Be cautious when using this feature, especially if the document contains sensitive information. - **Test First**: Always test the feature on a non-critical document first to ensure it meets your expectations. - **Backup Documents**: Keep backups of your original documents before processing. -极速 PDF 翻译助手是一款强大的工具，可将 PDF 文档翻译成多种语言。它支持命令行界面（CLI）、Web 用户界面（WebUI）和 Python API，满足不同用户的需求。 ### 主要特性 - **多格式输出**: 支持 Markdown、文本和 PDF 输出格式。 - **多语言支持**: 支持 50 多种语言，包括中文、英文、日文、韩文等。 - **多种翻译服务**: 集成 Google、Azure、OpenAI、Groq、Anthropic 和 DeepSeek 等翻译服务。 - **高性能**: 利用异步处理和并发请求，实现快速翻译。 - **易于使用**: 提供简单的命令行工具和直观的 Web 界面。 ### 快速开始 要开始使用极速 PDF 翻译助手，请参阅 [快速开始](./GETTING_STARTED.md) 指南。 ### 安装 极速 PDF 翻译助手可以通过 pip 安装： ```bash pip install pdf2zh ``` ### 使用方法 #### 命令行界面（CLI） ```bash pdf2zh input.pdf output.md --to zh ``` #### Web 用户界面（WebUI） 启动 Web 服务器： ```bash pdf2zh-web ``` 然后在浏览器中打开 `http://localhost:8501`。 #### Python API ```python from pdf2zh import pdf2zh result = pdf2zh("input.pdf", "output.md", target_lang="zh") ``` ### 支持的语言 极速 PDF 翻译助手支持多种语言。有关完整列表，请参阅 [支持的语言](./SUPPORTED_LANGUAGES.md)。 ### 高级用法 有关高级用法和配置选项，请参阅 [高级指南](./ADVANCED.md)。 ### 社区 加入我们的 [社区](https://github.com/pdf2zh-next/pdf2zh-next/discussions)，分享您的经验、提出问题或贡献代码。 ### 常见问题 有关常见问题和解答，请参阅 [FAQ](./FAQ.md)。 ### 许可证 极速 PDF 翻译助手采用 MIT 许可证。有关更多信息，请参阅 [LICENSE](https://github.com/pdf2zh-next/pdf2zh-next/blob/main/LICENSE) 文件。 --- ### OUTPUT LANGUAGE ru --- ### TRANSLATION 极速 PDF 翻译助手 — это мощный инструмент для перевода PDF-документов на множество языков. Он поддерживает интерфейс командной строки (CLI), веб-интерфейс (WebUI) и Python API, удовлетворяя потребности различных пользователей. ### Основные особенности - **Множество форматов вывода**: Поддерживает форматы вывода Markdown, текст и PDF. - **Поддержка множества языков**: Поддерживает более 50 языков, включая китайский, английский, японский, корейский и другие. - **Различные службы перевода**: Интегрированы службы перевода Google, Azure, OpenAI, Groq, Anthropic и DeepSeek. - **Высокая производительность**: Использует асинхронную обработку и параллельные запросы для быстрого перевода. - **Простота использования**: Предоставляет простые инструменты командной строки и интуитивно понятный веб-интерфейс. ### Начало работы Чтобы начать работу с 极速 PDF 翻译助手，обратитесь к руководству [Начало работы](./GETTING_STARTED.md). ### Установка 极速 PDF 翻译助手 можно установить через pip: ```bash pip install pdf2zh ``` ### Использование #### Интерфейс командной строки (CLI) ```bash pdf2zh input.pdf output.md --to zh ``` #### Веб-интерфейс (WebUI) Запустите веб-сервер: ```bash pdf2zh-web ``` Затем откройте в браузере `http://localhost:8501`. #### Python API ```python from pdf2zh import pdf2zh result = pdf2zh("input.pdf", "output.md", target_lang="zh") ``` ### Поддерживаемые языки 极速 PDF 翻译助手 поддерживает множество языков. Полный список см. в разделе [Поддерживаемые языки](./SUPPORTED_LANGUAGES.md). ### Расширенное использование Информацию о расширенных возможностях и параметрах конфигурации см. в [Расширенном руководстве](./ADVANCED.md). ### Сообщество Присоединяйтесь к нашему [сообществу](https://github.com/pdf2zh-next/pdf2zh-next/discussions), чтобы делиться опытом, задавать вопросы или вносить вклад в код. ### Часто задаваемые вопросы Ответы на часто задаваемые вопросы см. в разделе [FAQ](./FAQ.md). ### Лицензия 极速 PDF 翻译助手 распространяется под лицензией MIT. Подробнее см. в файле [LICENSE](https://github.com/pdf2zh-next/pdf2zh-next/blob/main/LICENSE).
