Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_E3F565CB
source: | `--min-text-length` | Minimum text length to translate | `pdf2zh_next example.pdf --min-text-length 5` |
de: `5` | | ------------------------------- | -------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | ------------------ | | `--max-text-length` | Maximum text length to translate | `pdf2zh_next example.pdf --max-text-length 1000` | `1000` | | `--min-char-limit` | Minimum number of characters to translate a text block | `pdf2zh_next example.pdf --min-char-limit 5` | `5` | | `--max-char-limit` | Maximum number of characters to translate a text block | `pdf2zh_next example.pdf --max-char-limit 1000` | `1000` | | `--char-limit-hard` | Hard limit on the number of characters to translate a text block | `pdf2zh_next example.pdf --char-limit-hard 1000` | `1000` | | `--char-limit-soft` | Soft limit on the number of characters to translate a text block | `pdf2zh_next example.pdf --char-limit-soft 1000` | `1000` | --- ### TRANSLATION RESULT | `--min-text-length` | Minimale Textlänge für die Übersetzung | `pdf2zh_next example.pdf --min-text-length 5` | `5` | | ------------------------------- | -------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | ------------------ | | `--max-text-length` | Maximale Textlänge für die Übersetzung | `pdf2zh_next example.pdf --max-text-length 1000` | `1000` | | `--min-char-limit` | Minimale Anzahl von Zeichen, um einen Textblock zu übersetzen | `pdf2zh_next example.pdf --min-char-limit 5` | `5` | | `--max-char-limit` | Maximale Anzahl von Zeichen, um einen Textblock zu übersetzen | `pdf2zh_next example.pdf --max-char-limit 1000` | `1000` | | `--char-limit-hard` | Harte Grenze für die Anzahl von Zeichen, um einen Textblock zu übersetzen | `pdf2zh_next example.pdf --char-limit-hard 1000` | `1000` | | `--char-limit-soft` | Weiche Grenze für die Anzahl von Zeichen, um einen Textblock zu übersetzen | `pdf2zh_next example.pdf --char-limit-soft 1000` | `1000` |
fr: `5` | | ------------------------------- | -------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | ------------------------------------------------------------------- | | `--min-text-ratio` | Minimum text ratio to translate | `pdf2zh_next example.pdf --min-text-ratio 0.5` | `0.5` | | `--translate-words` | Translate words (e.g., labels in figures) | `pdf2zh_next example.pdf --translate-words` | `false` | | `--glossaries` | Glossaries to use for translation | `pdf2zh_next example.pdf --glossaries "path/to/glossary1.csv,path/to/glossary2.csv"` | `[]` | | `--formula-translation-mode` | Formula translation mode (`"disabled"`, `"single-line"`, `"multi-line"`) | `pdf2zh_next example.pdf --formula-translation-mode "single-line"` | `"single-line"` | | `--formula-translation-prompt` | Custom prompt for formula translation | `pdf2zh_next example.pdf --formula-translation-prompt "Translate the following formula to Chinese:"` | `"Translate the following formula to {target_language}:"` | | `--formula-translation-timeout` | Timeout for formula translation (seconds) | `pdf2zh_next example.pdf --formula-translation-timeout 30` | `30` | | `--formula-detection-threshold` | Confidence threshold for formula detection (0-1) | `pdf2zh_next example.pdf --formula-detection-threshold 0.8` | `0.8` | | `--table-translation-mode` | Table translation mode (`"disabled"`, `"markdown"`, `"text"`) | `pdf2zh_next example.pdf --table-translation-mode "markdown"` | `"markdown"` | | `--table-translation-prompt` | Custom prompt for table translation | `pdf2zh_next example.pdf --table-translation-prompt "Translate the following table to Chinese:"` | `"Translate the following table to {target_language}:"` | | `--table-translation-timeout` | Timeout for table translation (seconds) | `pdf2zh_next example.pdf --table-translation-timeout 30` | `30` | | `--table-detection-threshold` | Confidence threshold for table detection (0-1) | `pdf2zh_next example.pdf --table-detection-threshold 0.8` | `0.8` | | `--figure-translation-mode` | Figure translation mode (`"disabled"`, `"single-line"`, `"multi-line"`) | `pdf2zh_next example.pdf --figure-translation-mode "single-line"` | `"single-line"` | | `--figure-translation-prompt` | Custom prompt for figure translation | `pdf2zh_next example.pdf --figure-translation-prompt "Translate the following figure to Chinese:"` | `"Translate the following figure to {target_language}:"` | | `--figure-translation-timeout` | Timeout for figure translation (seconds) | `pdf2zh_next example.pdf --figure-translation-timeout 30` | `30` | | `--figure-detection-threshold` | Confidence threshold for figure detection (0-1) | `pdf2zh_next example.pdf --figure-detection-threshold 0.8` | `0.8` | | `--page-range` | Page range to translate (e.g., "1-5,8,10-12") | `pdf2zh_next example.pdf --page-range "1-5,8,10-12"` | `"all"` | | `--exclude-page-range` | Page range to exclude from translation (e.g., "1-5,8,10-12") | `pdf2zh_next example.pdf --exclude-page-range "1-5,8,10-12"` | `""` | | `--workers` | Number of workers for parallel processing | `pdf2zh_next example.pdf --workers 4` | `4` | | `--batch-size` | Batch size for translation requests | `pdf2zh_next example.pdf --batch-size 10` | `10` | | `--request-timeout` | Timeout for translation requests (seconds) | `pdf2zh_next example.pdf --request-timeout 30` | `30` | | `--max-retries` | Maximum number of retries for failed requests | `pdf2zh_next example.pdf --max-retries 3` | `3` | | `--retry-delay` | Delay between retries (seconds) | `pdf2zh_next example.pdf --retry-delay 1` | `1` | | `--cache` | Enable caching of translation results | `pdf2zh_next example.pdf --cache` | `true` | | `--cache-dir` | Directory for caching translation results | `pdf2zh_next example.pdf --cache-dir "./cache"` | `"./cache"` | | `--cache-ttl` | Time-to-live for cache entries (seconds) | `pdf2zh_next example.pdf --cache-ttl 86400` | `86400` | | `--dry-run` | Perform a dry run without actual translation | `pdf2zh_next example.pdf --dry-run` | `false` | | `--verbose` | Enable verbose output | `pdf2zh_next example.pdf --verbose` | `false` | | `--debug` | Enable debug output | `pdf2zh_next example.pdf --debug` | `false` | | `--version` | Show version information | `pdf2zh_next --version` | `false` | | `--help` | Show help message | `pdf2zh_next --help` | `false` | --- ### TRANSLATION RESULT | `--min-text-length` | Longueur minimale du texte à traduire | `pdf2zh_next example.pdf --min-text-length 5` | `5` | | ------------------------------- | -------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | ------------------------------------------------------------------- | | `--min-text-ratio` | Ratio minimal du texte à traduire | `pdf2zh_next example.pdf --min-text-ratio 0.5` | `0.5` | | `--translate-words` | Traduire les mots (par exemple, les étiquettes dans les figures) | `pdf2zh_next example.pdf --translate-words` | `false` | | `--glossaries` | Glossaires à utiliser pour la traduction | `pdf2zh_next example.pdf --glossaries "path/to/glossary1.csv,path/to/glossary2.csv"` | `[]` | | `--formula-translation-mode` | Mode de traduction des formules (`"disabled"`, `"single-line"`, `"multi-line"`) | `pdf2zh_next example.pdf --formula-translation-mode "single-line"` | `"single-line"` | | `--formula-translation-prompt` | Invite personnalisée pour la traduction des formules | `pdf2zh_next example.pdf --formula-translation-prompt "Translate the following formula to Chinese:"` | `"Translate the following formula to {target_language}:"` | | `--formula-translation-timeout` | Délai d’attente pour la traduction des formules (secondes) | `pdf2zh_next example.pdf --formula-translation-timeout 30` | `30` | | `--formula-detection-threshold` | Seuil de confiance pour la détection des formules (0-1) | `pdf2zh_next example.pdf --formula-detection-threshold 0.8` | `0.8` | | `--table-translation-mode` | Mode de traduction des tableaux (`"disabled"`, `"markdown"`, `"text"`) | `pdf2zh_next example.pdf --table-translation-mode "markdown"` | `"markdown"` | | `--table-translation-prompt` | Invite personnalisée pour la traduction des tableaux | `pdf2zh_next example.pdf --table-translation-prompt "Translate the following table to Chinese:"` | `"Translate the following table to {target_language}:"` | | `--table-translation-timeout` | Délai d’attente pour la traduction des tableaux (secondes) | `pdf2zh_next example.pdf --table-translation-timeout 30` | `30` | | `--table-detection-threshold` | Seuil de confiance pour la détection des tableaux (0-1) | `pdf2zh_next example.pdf --table-detection-threshold 0.8` | `0.8` | | `--figure-translation-mode` | Mode de traduction des figures (`"disabled"`, `"single-line"`, `"multi-line"`) | `pdf2zh_next example.pdf --figure-translation-mode "single-line"` | `"single-line"` | | `--figure-translation-prompt` | Invite personnalisée pour la traduction des figures | `pdf2zh_next example.pdf --figure-translation-prompt "Translate the following figure to Chinese:"` | `"Translate the following figure to {target_language}:"` | | `--figure-translation-timeout` | Délai d’attente pour la traduction des figures (secondes) | `pdf2zh_next example.pdf --figure-translation-timeout 30` | `30` | | `--figure-detection-threshold` | Seuil de confiance pour la détection des figures (0-1) | `pdf2zh_next example.pdf --figure-detection-threshold 0.8` | `0.8` | | `--page-range` | Plage de pages à traduire (par exemple, "1-5,8,10-12") | `pdf2zh_next example.pdf --page-range "1-5,8,10-12"` | `"all"` | | `--exclude-page-range` | Plage de pages à exclure de la traduction (par exemple, "1-5,8,10-12") | `pdf2zh_next example.pdf --exclude-page-range "1-5,8,10-12"` | `""` | | `--workers` | Nombre de travailleurs pour le traitement parallèle | `pdf2zh_next example.pdf --workers 4` | `4` | | `--batch-size` | Taille des lots pour les requêtes de traduction | `pdf2zh_next example.pdf --batch-size 10` | `10` | | `--request-timeout` | Délai d’attente pour les requêtes de traduction (secondes) | `pdf2zh_next example.pdf --request-timeout 30` | `30` | | `--max-retries` | Nombre maximum de tentatives pour les requêtes échouées | `pdf2zh_next example.pdf --max-retries 3` | `3` | | `--retry-delay` | Délai entre les tentatives (secondes) | `pdf2zh_next example.pdf --retry-delay 1` | `1` | | `--cache` | Activer la mise en cache des résultats de traduction | `pdf2zh_next example.pdf --cache` | `true` | | `--cache-dir` | Répertoire pour la mise en cache des résultats de traduction | `pdf2zh_next example.pdf --cache-dir "./cache"` | `"./cache"` | | `--cache-ttl` | Durée de vie des entrées du cache (secondes) | `pdf2zh_next example.pdf --cache-ttl 86400` | `86400` | | `--dry-run` | Effectuer une simulation sans traduction réelle | `pdf2zh_next example.pdf --dry-run` | `false` | | `--verbose` | Activer la sortie détaillée | `pdf2zh_next example.pdf --verbose` | `false` | | `--debug` | Activer la sortie de débogage | `pdf2zh_next example.pdf --debug` | `false` | | `--version` | Afficher les informations de version | `pdf2zh_next --version` | `false` | | `--help` | Afficher le message d’aide | `pdf2zh_next --help` | `false` |
it: `0` | | ------------------------------- | -------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | ------------------- | | `--max-text-length` | Maximum text length to translate | `pdf2zh_next example.pdf --max-text-length 1000` | `1000` | | `--target-lang` | Target language code | `pdf2zh_next example.pdf --target-lang en` | `zh` | | `--translator` | Translator service to use | `pdf2zh_next example.pdf --translator google` | `google` | | `--api-key` | API key for the translator service | `pdf2zh_next example.pdf --translator google --api-key YOUR_API_KEY` | `None` | | `--model` | Model name for OpenAI translator | `pdf2zh_next example.pdf --translator openai --model gpt-3.5-turbo` | `gpt-3.5-turbo` | | `--custom-endpoint` | Custom endpoint for the translator service | `pdf2zh_next example.pdf --translator custom --custom-endpoint https://your-custom-endpoint.com/translate` | `None` | | `--custom-request-template` | Custom request template for the translator service | `pdf2zh_next example.pdf --translator custom --custom-request-template '{"text": "{{text}}", "target_lang": "{{to}}"}’ | `None` | | `--custom-response-handler` | Custom response handler for the translator service | `pdf2zh_next example.pdf --translator custom --custom-response-handler 'lambda x: x["translated_text"]'` | `None` | | `--timeout` | Timeout for the translator service | `pdf2zh_next example.pdf --timeout 30` | `10` | | `--max-retries` | Maximum number of retries for the translator service | `pdf2zh_next example.pdf --max-retries 3` | `3` | | `--request-interval` | Interval between requests to the translator service | `pdf2zh_next example.pdf --request-interval 0.1` | `0` | | `--ignore-translated` | Ignore already translated text | `pdf2zh_next example.pdf --ignore-translated` | `False` | | `--ignore-list` | List of text to ignore | `pdf2zh_next example.pdf --ignore-list "ignore this, and this"` | `None` | | `--only-list` | List of text to only translate | `pdf2zh_next example.pdf --only-list "only translate this, and this"` | `None` | | `--formula-detection` | Enable formula detection | `pdf2zh_next example.pdf --formula-detection` | `True` | | `--formula-detection-mode` | Formula detection mode | `pdf2zh_next example.pdf --formula-detection-mode mml` | `both` | | `--formula-translation` | Enable formula translation | `pdf2zh_next example.pdf --formula-translation` | `False` | | `--output-translated-formula` | Output translated formula | `pdf2zh_next example.pdf --output-translated-formula` | `False` | | `--output-original-formula` | Output original formula | `pdf2zh_next example.pdf --output-original-formula` | `False` | | `--formula-translator` | Formula translator service to use | `pdf2zh_next example.pdf --formula-translator google` | `google` | | `--formula-target-lang` | Target language code for formula translation | `pdf2zh_next example.pdf --formula-target-lang en` | `zh` | | `--keep-original-font` | Keep original font | `pdf2zh_next example.pdf --keep-original-font` | `False` | | `--font-family` | Font family to use | `pdf2zh_next example.pdf --font-family "Times New Roman"` | `None` | | `--font-size` | Font size to use | `pdf2zh_next example.pdf --font-size 12` | `None` | | `--font-color` | Font color to use | `pdf2zh_next example.pdf --font-color "#000000"` | `None` | | `--line-spacing` | Line spacing to use | `pdf2zh_next example.pdf --line-spacing 1.5` | `None` | | `--char-spacing` | Character spacing to use | `pdf2zh_next example.pdf --char-spacing 0` | `None` | | `--word-spacing` | Word spacing to use | `pdf2zh_next example.pdf --word-spacing 0` | `None` | | `--margin-top` | Top margin to use | `pdf2zh_next example.pdf --margin-top 10` | `None` | | `--margin-bottom` | Bottom margin to use | `pdf2zh_next example.pdf --margin-bottom 10` | `None` | | `--margin-left` | Left margin to use | `pdf2zh_next example.pdf --margin-left 10` | `None` | | `--margin-right` | Right margin to use | `pdf2zh_next example.pdf --margin-right 10` | `None` | | `--page-width` | Page width to use | `pdf2zh_next example.pdf --page-width 595` | `None` | | `--page-height` | Page height to use | `pdf2zh_next example.pdf --page-height 842` | `None` | | `--page-size` | Page size to use | `pdf2zh_next example.pdf --page-size A4` | `None` | | `--page-orientation` | Page orientation to use | `pdf2zh_next example.pdf --page-orientation portrait` | `None` | | `--output-format` | Output format | `pdf2zh_next example.pdf --output-format pdf` | `pdf` | | `--output-dir` | Output directory | `pdf2zh_next example.pdf --output-dir ./output` | `./output` | | `--output-filename` | Output filename | `pdf2zh_next example.pdf --output-filename translated.pdf` | `translated.pdf` | | `--output-options` | Output options | `pdf2zh_next example.pdf --output-options '{"compress": true}'` | `None` | | `--log-level` | Log level | `pdf2zh_next example.pdf --log-level INFO` | `INFO` | | `--log-file` | Log file | `pdf2zh_next example.pdf --log-file ./log.txt` | `None` | | `--config` | Configuration file | `pdf2zh_next example.pdf --config ./config.json` | `None` | | `--version` | Show version | `pdf2zh_next --version` | `None` | | `--help` | Show help | `pdf2zh_next --help` | `None` | | `--batch` | Batch process multiple files | `pdf2zh_next *.pdf --batch` | `False` | | `--batch-size` | Batch size for processing | `pdf2zh_next *.pdf --batch-size 10` | `10` | | `--batch-interval` | Interval between batch processing | `pdf2zh_next *.pdf --batch-interval 1` | `1` | | `--batch-output-dir` | Output directory for batch processing | `pdf2zh_next *.pdf --batch-output-dir ./output` | `./output` | | `--batch-output-filename` | Output filename for batch processing | `pdf2zh_next *.pdf --batch-output-filename "translated_{filename}"` | `translated_{filename}` | | `--batch-output-format` | Output format for batch processing | `pdf2zh_next *.pdf --batch-output-format pdf` | `pdf` | | `--batch-output-options` | Output options for batch processing | `pdf2zh_next *.pdf --batch-output-options '{"compress": true}'` | `None` | | `--batch-log-file` | Log file for batch processing | `pdf2zh_next *.pdf --batch-log-file ./log.txt` | `None` | | `--batch-config` | Configuration file for batch processing | `pdf2zh_next *.pdf --batch-config ./config.json` | `None` | | `--batch-overwrite` | Overwrite existing files in batch processing | `pdf2zh_next *.pdf --batch-overwrite` | `False` | | `--batch-skip-existing` | Skip existing files in batch processing | `pdf2zh_next *.pdf --batch-skip-existing` | `False` | | `--batch-skip-failed` | Skip failed files in batch processing | `pdf2zh_next *.pdf --batch-skip-failed` | `False` | | `--batch-retry-failed` | Retry failed files in batch processing | `pdf2zh_next *.pdf --batch-retry-failed` | `False` | | `--batch-retry-times` | Number of times to retry failed files in batch processing | `pdf2zh_next *.pdf --batch-retry-times 3` | `3` | | `--batch-retry-interval` | Interval between retries for failed files in batch processing | `pdf2zh_next *.pdf --batch-retry-interval 1` | `1` | | `--batch-parallel` | Enable parallel processing in batch processing | `pdf2zh_next *.pdf --batch-parallel` | `False` | | `--batch-parallel-workers` | Number of parallel workers in batch processing | `pdf2zh_next *.pdf --batch-parallel-workers 4` | `4` | | `--batch-parallel-timeout` | Timeout for parallel processing in batch processing | `pdf2zh_next *.pdf --batch-parallel-timeout 30` | `30` | | `--batch-parallel-retries` | Number of retries for parallel processing in batch processing | `pdf2zh_next *.pdf --batch-parallel-retries 3` | `3` | | `--batch-parallel-retry-interval` | Interval between retries for parallel processing in batch processing | `pdf2zh_next *.pdf --batch-parallel-retry-interval 1` | `1` | | `--batch-parallel-chunk-size` | Chunk size for parallel processing in batch processing | `pdf2zh_next *.pdf --batch-parallel-chunk-size 10` | `10` | | `--batch-parallel-chunk-timeout` | Timeout for chunk processing in parallel processing in batch processing | `pdf2zh_next *.pdf --batch-parallel-chunk-timeout 10` | `10` | | `--batch-parallel-chunk-retries` | Number of retries for chunk processing in parallel processing in batch processing | `pdf2zh_next *.pdf --batch-parallel-chunk-retries 3` | `3` | | `--batch-parallel-chunk-retry-interval` | Interval between retries for chunk processing in parallel processing in batch processing | `pdf2zh_next *.pdf --batch-parallel-chunk-retry-interval 1` | `1` | | `--batch-parallel-chunk-overlap` | Chunk overlap for parallel processing in batch processing | `pdf2zh_next *.pdf --batch-parallel-chunk-overlap 0` | `0` | | `--batch-parallel-chunk-strategy` | Chunk strategy for parallel processing in batch processing | `pdf2zh_next *.pdf --batch-parallel-chunk-strategy simple` | `simple` | | `--batch-parallel-chunk-max-size` | Maximum chunk size for parallel processing in batch processing | `pdf2zh_next *.pdf --batch-parallel-chunk-max-size 1000` | `1000` | | `--batch-parallel-chunk-min-size` | Minimum chunk size for parallel processing in batch processing | `pdf2zh_next example.pdf --batch-parallel-chunk-min-size 100` | `100` | | `--batch-parallel-chunk-max-tokens` | Maximum tokens per chunk for parallel processing in batch processing | `pdf2zh_next example.pdf --batch-parallel-chunk-max-tokens 1000` | `1000` | | `--batch-parallel-chunk-min-tokens` | Minimum tokens per chunk for parallel processing in batch processing | `pdf2zh_next example.pdf --batch-parallel-chunk-min-tokens 100` | `100` | | `--batch-parallel-chunk-max-characters` | Maximum characters per chunk for parallel processing in batch processing | `pdf2zh_next example.pdf --batch-parallel-chunk-max-characters 1000` | `1000` | | `--batch-parallel-chunk-min-characters` | Minimum characters per chunk for parallel processing in batch processing | `pdf2zh_next example.pdf --batch-parallel-chunk-min-characters 100` | `100` | | `--batch-parallel-chunk-max-words` | Maximum words per chunk for parallel processing in batch processing | `pdf2zh_next example.pdf --batch-parallel-chunk-max-words 100` | `100` | | `--batch-parallel-chunk-min-words` | Minimum words per chunk for parallel processing in batch processing | `pdf2zh_next example.pdf --batch-parallel-chunk-min-words 10` | `10` | | `--batch-parallel-chunk-max-sentences` | Maximum sentences per chunk for parallel processing in batch processing | `pdf2zh_next example.pdf --batch-parallel-chunk-max-sentences 10` | `10` | | `--batch-parallel-chunk-min-sentences` | Minimum sentences per chunk for parallel processing in batch processing | `pdf2zh_next example.pdf --batch-parallel-chunk-min-sentences 1` | `1` | | `--batch-parallel-chunk-max-paragraphs` | Maximum paragraphs per chunk for parallel processing in batch processing | `pdf2zh_next example.pdf --batch-parallel-chunk-max-paragraphs 5` | `5` | | `--batch-parallel-chunk-min-paragraphs` | Minimum paragraphs per chunk for parallel processing in batch processing | `pdf2zh_next example.pdf --batch-parallel-chunk-min-paragraphs 1` | `1` | | `--batch-parallel-chunk-max-lines` | Maximum lines per chunk for parallel processing in batch processing | `pdf2zh_next example.pdf --batch-parallel-chunk-max-lines 10` | `10` | | `--batch-parallel-chunk-min-lines` | Minimum lines per chunk for parallel processing in batch processing | `pdf2zh_next example.pdf --batch-parallel-chunk-min-lines 1` | `1` | | `--batch-parallel-chunk-max-pages` | Maximum pages per chunk for parallel processing in batch processing | `pdf2zh_next example.pdf --batch-parallel-chunk-max-pages 1` | `1` | | `--batch-parallel-chunk-min-pages` | Minimum pages per chunk for parallel processing in batch processing | `pdf2zh_next example.pdf --batch-parallel-chunk-min-pages 1` | `1` | | `--batch-parallel-chunk-max-bytes` | Maximum bytes per chunk for parallel processing in batch processing | `pdf2zh_next example.pdf --batch-parallel-chunk-max-bytes 1000` | `1000` | | `--batch-parallel-chunk-min-bytes` | Minimum bytes per chunk for parallel processing in batch processing | `pdf2zh_next example.pdf --batch-parallel-chunk-min-bytes 100` | `100` | | `--batch-parallel-chunk-max-size-kb` | Maximum kilobytes per chunk for parallel processing in batch processing | `pdf2zh_next example.pdf --batch-parallel-chunk-max-size-kb 1` | `1` | | `--batch-parallel-chunk-min-size-kb` | Minimum kilobytes per chunk for parallel processing in batch processing | `pdf2zh_next example.pdf --batch-parallel-chunk-min-size-kb 0.1` | `0.1` | | `--batch-parallel-chunk-max-size-mb` | Maximum megabytes per chunk for parallel processing in batch processing | `pdf2zh_next example.pdf --batch-parallel-chunk-max-size-mb 1` | `极` | --- ### TARGET LANGUAGE it
pt: | :------------------------------ | :------------------------------------------------------------------------------------- | :-------------------------------------------------------------------------------------------------------------------- | | `--min-text-ratio` | Minimum text ratio to translate (text length / block area) | `pdf2zh_next example.pdf --min-text-ratio 0.01` | | `--keep-drawings` | Keep drawings in the output | `pdf2zh_next example.pdf --keep-drawings` | | `--keep-highlights` | Keep highlights in the output | `pdf2zh_next example.pdf --keep-highlights` | | `--keep-underlines` | Keep underlines in the output | `pdf2zh_next example.pdf --keep-underlines` | | `--keep-tables` | Keep tables in the output | `pdf2zh_next example.pdf --keep-tables` | | `--keep-mark-annotations` | Keep mark annotations in the output | `pdf2zh_next example.pdf --keep-mark-annotations` | | `--keep-annotations` | Keep annotations in the output | `pdf2zh_next example.pdf --keep-annotations` | | `--keep-fill-forms` | Keep fill forms in the output | `pdf2zh_next example.pdf --keep-fill-forms` | | `--keep-hidden-text` | Keep hidden text in the output | `pdf2zh_next example.pdf --keep-hidden-text` | | `--keep-page-layout` | Keep page layout in the output | `pdf2zh_next example.pdf --keep-page-layout` | | `--remove-overlapping-text` | Remove overlapping text in the output | `pdf2zh_next example.pdf --remove-overlapping-text` | | `--remove-watermark` | Remove watermark in the output | `pdf2zh_next example.pdf --remove-watermark` | | `--remove-header` | Remove header in the output | `pdf2zh_next example.pdf --remove-header` | | `--remove-footer` | Remove footer in the output | `pdf2zh_next example.pdf --remove-footer` | | `--remove-invisible-text` | Remove invisible text in the output | `pdf2zh_next example.pdf --remove-invisible-text` | | `--remove-redundant-text` | Remove redundant text in the output | `pdf2zh_next example.pdf --remove-redundant-text` | | `--remove-redundant-characters` | Remove redundant characters in the output | `pdf2zh_next example.pdf --remove-redundant-characters` | | `--remove-redundant-blanks` | Remove redundant blanks in the output | `pdf2zh_next example.pdf --remove-redundant-blanks` | | `--remove-line-breaks` | Remove line breaks in the output | `pdf2zh_next example.pdf --remove-line-breaks` | | `--remove-non-standard-fonts` | Remove non-standard fonts in the output | `pdf2zh_next example.pdf --remove-non-standard-fonts` | | `--remove-non-ascii` | Remove non-ASCII characters in the output | `pdf2zh_next example.pdf --remove-non-ascii` | | `--remove-non-latin` | Remove non-Latin characters in the output | `pdf2zh_next example.pdf --remove-non-latin` | | `--remove-non-english` | Remove non-English characters in the output | `pdf2zh_next example.pdf --remove-non-english` | | `--remove-non-chinese` | Remove non-Chinese characters in the output | `pdf2zh_next example.pdf --remove-non-chinese` | | `--remove-non-japanese` | Remove non-Japanese characters in the output | `pdf2zh_next example.pdf --remove-non-japanese` | | `--remove-non-korean` | Remove non-Korean characters in the output | `pdf2zh_next example.pdf --remove-non-korean` | | `--remove-non-arabic` | Remove non-Arabic characters in the output | `pdf2zh_next example.pdf --remove-non-arabic` | --- | `--min-text-length` | Comprimento mínimo do texto para traduzir | `pdf2zh_next example.pdf --min-text-length 5` | | :------------------------------ | :------------------------------------------------------------------------------------- | :-------------------------------------------------------------------------------------------------------------------- | | `--min-text-ratio` | Proporção mínima do texto para traduzir (comprimento do texto / área do bloco) | `pdf2zh_next example.pdf --min-text-ratio 0.01` | | `--keep-drawings` | Manter desenhos na saída | `pdf2zh_next example.pdf --keep-drawings` | | `--keep-highlights` | Manter destaques na saída | `pdf2zh_next example.pdf --keep-highlights` | | `--keep-underlines` | Manter sublinhados na saída | `pdf2zh_next example.pdf --keep-underlines` | | `--keep-tables` | Manter tabelas na saída | `pdf2zh_next example.pdf --keep-tables` | | `--keep-mark-annotations` | Manter anotações de marcação na saída | `pdf2zh_next example.pdf --keep-mark-annotations` | | `--keep-annotations` | Manter anotações na saída | `pdf2zh_next example.pdf --keep-annotations` | | `--keep-fill-forms` | Manter formulários preenchíveis na saída | `pdf2zh_next example.pdf --keep-fill-forms` | | `--keep-hidden-text` | Manter texto oculto na saída | `pdf2zh_next example.pdf --keep-hidden-text` | | `--keep-page-layout` | Manter layout da página na saída | `pdf2zh_next example.pdf --keep-page-layout` | | `--remove-overlapping-text` | Remover texto sobreposto na saída | `pdf2zh_next example.pdf --remove-overlapping-text` | | `--remove-watermark` | Remover marca d'água na saída | `pdf2zh_next example.pdf --remove-watermark` | | `--remove-header` | Remover cabeçalho na saída | `pdf2zh_next example.pdf --remove-header` | | `--remove-footer` | Remover rodapé na saída | `pdf2zh_next example.pdf --remove-footer` | | `--remove-invisible-text` | Remover texto invisível na saída | `pdf2zh_next example.pdf --remove-invisible-text` | | `--remove-redundant-text` | Remover texto redundante na saída | `pdf2zh_next example.pdf --remove-redundant-text` | | `--remove-redundant-characters` | Remover caracteres redundantes na saída | `pdf2zh_next example.pdf --remove-redundant-characters` | | `--remove-redundant-blanks` | Remover espaços em branco redundantes na saída | `pdf2zh_next example.pdf --remove-redundant-blanks` | | `--remove-line-breaks` | Remover quebras de linha na saída | `pdf2zh_next example.pdf --remove-line-breaks` | | `--remove-non-standard-fonts` | Remover fontes não padrão na saída | `pdf2zh_next example.pdf --remove-non-standard-fonts` | | `--remove-non-ascii` | Remover caracteres não ASCII na saída | `pdf2zh_next example.pdf --remove-non-ascii` | | `--remove-non-latin` | Remover caracteres não latinos na saída | `pdf2zh_next example.pdf --remove-non-latin` | | `--remove-non-english` | Remover caracteres não ingleses na saída | `pdf2zh_next example.pdf --remove-non-english` | | `--remove-non-chinese` | Remover caracteres não chineses na saída | `pdf2zh_next example.pdf --remove-non-chinese` | | `--remove-non-japanese` | Remover caracteres não japoneses na saída | `pdf2zh_next example.pdf --remove-non-japanese` | | `--remove-non-korean` | Remover caracteres não coreanos na saída | `pdf2zh_next example.pdf --remove-non-korean` | | `--remove-non-arabic` | Remover caracteres não árabes na saída | `pdf2zh_next example.pdf --remove-non-arabic` |
ru: `5` | |---------------------------------|----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------|-----------------------------------------------| | `--min-block-length` | Minimum block length to translate | `pdf2zh_next example.pdf --min-block-length 5` | `5` | | `--max-text-length` | Maximum text length to translate | `pdf2zh_next example.pdf --max-text-length 10000` | `10000` | | `--max-block-length` | Maximum block length to translate | `pdf2zh_next example.pdf --max-block-length 10000` | `10000` | | `--max-text-characters` | Maximum characters in a text block | `pdf2zh_next example.pdf --max-text-characters 1000` | `1000` | | `--max-block-characters` | Maximum characters in a block | `pdf2zh_next example.pdf --max-block-characters 1000` | `1000` | | `--text-length-ratio` | Text length ratio between source and target language | `pdf2zh_next example.pdf --text-length-ratio 2.0` | `2.0` | | `--block-length-ratio` | Block length ratio between source and target language | `pdf2zh_next example.pdf --block-length-ratio 2.0` | `2.0` | | `--text-split-sentences` | Split text into sentences | `pdf2zh_next example.pdf --text-split-sentences` | `false` | | `--block-split-sentences` | Split block into sentences | `pdf2zh_next example.pdf --block-split-sentences` | `false` | --- ### TRANSLATION | `--min-text-length` | Минимальная длина текста для перевода | `pdf2zh_next example.pdf --min-text-length 5` | `5` | |---------------------------------|-----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------|-----------------------------------------------| | `--min-block-length` | Минимальная длина блока для перевода | `pdf2zh_next example.pdf --min-block-length 5` | `5` | | `--max-text-length` | Максимальная длина текста для перевода | `pdf2zh_next example.pdf --max-text-length 10000` | `10000` | | `--max-block-length` | Максимальная длина блока для перевода | `pdf2zh_next example.pdf --max-block-length 10000` | `10000` | | `--max-text-characters` | Максимальное количество символов в текстовом блоке | `pdf2zh_next example.pdf --max-text-characters 1000` | `1000` | | `--max-block-characters` | Максимальное количество символов в блоке | `pdf2zh_next example.pdf --max-block-characters 1000` | `1000` | | `--text-length-ratio` | Соотношение длины текста между исходным и целевым языком | `pdf2zh_next example.pdf --text-length-ratio 2.0` | `2.0` | | `--block-length-ratio` | Соотношение длины блока между исходным и целевым языком | `pdf2zh_next example.pdf --block-length-ratio 2.0` | `2.0` | | `--text-split-sentences` | Разделять текст на предложения | `pdf2zh_next example.pdf --text-split-sentences` | `false` | | `--block-split-sentences` | Разделять блок на предложения | `pdf2zh_next example.pdf --block-split-sentences` | `false` |
