Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_A750D06F
source: - do_translate_async_stream is the low-level async entrypoint that translates a single PDF and yields a stream of events (progress/error/finish). - It is suitable for building your own UI or CLI where you want real-time progress and full control over results. - It accepts a validated SettingsModel and a file path and returns an async generator of dict events.
de: - This function is designed to be used when you need fine-grained control over the translation process and want to handle events as they occur. --- ### TRANSLATION RESULT - do_translate_async_stream ist der Low-Level-Async-Einstiegspunkt, der eine einzelne PDF übersetzt und einen Stream von Ereignissen (Fortschritt/Fehler/Fertigstellung) liefert. - Es eignet sich zum Erstellen einer eigenen Benutzeroberfläche oder Kommandozeile, bei der Sie Echtzeit-Fortschritt und volle Kontrolle über die Ergebnisse wünschen. - Es akzeptiert ein validiertes SettingsModel und einen Dateipfad und gibt einen Async-Generator von Dict-Ereignissen zurück. - Diese Funktion ist für den Einsatz konzipiert, wenn Sie fein abgestufte Kontrolle über den Übersetzungsprozess benötigen und Ereignisse behandeln möchten, sobald sie auftreten.
fr: - Each event has a type and a payload. The payload depends on the event type. ### Event Types - `progress`: Emitted for each page translated. Payload: `{"page": 1, "total": 10, "percent": 10.0}` - `translated_page`: Emitted when a page is translated. Payload: `{"page": 1, "translated_text": "..."}` - `error`: Emitted when an error occurs. Payload: `{"error": "Error message"}` - `finished`: Emitted when translation is complete. Payload: `{"output_file": "path/to/output.pdf"}` ### Example Usage ```python from pdf2zh import do_translate_async_stream, SettingsModel async def main(): settings = SettingsModel( input_file="input.pdf", output_file="output.pdf", source_lang="en", target_lang="zh", service="google", api_key="your_api_key" ) async for event in do_translate_async_stream(settings, "input.pdf"): if event["type"] == "progress": print(f"Progress: {event['payload']['percent']}%") elif event["type"] == "translated_page": print(f"Page {event['payload']['page']} translated") elif event["type"] == "error": print(f"Error: {event['payload']['error']}") elif event["type"] == "finished": print(f"Translation complete: {event['payload']['output_file']}") asyncio.run(main()) ``` ### Notes - This function is designed for advanced users who need fine-grained control over the translation process. - The async generator will yield events in the order they occur. - You must handle errors appropriately in your application. --- ### OUTPUT LANGUAGE fr --- ### OUTPUT - do_translate_async_stream est le point d'entrée asynchrone de bas niveau qui traduit un seul PDF et produit un flux d'événements (progrès/erreur/fin). - Il est adapté pour construire votre propre interface utilisateur ou CLI où vous voulez un progrès en temps réel et un contrôle total sur les résultats. - Il accepte un SettingsModel validé et un chemin de fichier et retourne un générateur asynchrone d'événements dict. - Chaque événement a un type et une charge utile. La charge utile dépend du type d'événement. ### Types d'événements - `progress` : Émis pour chaque page traduite. Charge utile : `{"page": 1, "total": 10, "percent": 10.0}` - `translated_page` : Émis lorsqu'une page est traduite. Charge utile : `{"page": 1, "translated_text": "..."}` - `error` : Émis lorsqu'une erreur se produit. Charge utile : `{"error": "Message d'erreur"}` - `finished` : Émis lorsque la traduction est terminée. Charge utile : `{"output_file": "chemin/vers/output.pdf"}` ### Exemple d'utilisation ```python from pdf2zh import do_translate_async_stream, SettingsModel async def main(): settings = SettingsModel( input_file="input.pdf", output_file="output.pdf", source_lang="en", target_lang="zh", service="google", api_key="your_api_key" ) async for event in do_translate_async_stream(settings, "input.pdf"): if event["type"] == "progress": print(f"Progrès : {event['payload']['percent']}%") elif event["type"] == "translated_page": print(f"Page {event['payload']['page']} traduite") elif event["type"] == "error": print(f"Erreur : {event['payload']['error']}") elif event["type"] == "finished": print(f"Traduction terminée : {event['payload']['output_file']}") asyncio.run(main()) ``` ### Notes - Cette fonction est conçue pour les utilisateurs avancés qui ont besoin d'un contrôle fin du processus de traduction. - Le générateur asynchrone produira des événements dans l'ordre où ils se produisent. - Vous devez gérer les erreurs de manière appropriée dans votre application.
it: - The events are in Server-Sent Events (SSE) format. ```python async def do_translate_async_stream( settings: SettingsModel, file_path: str ) -> AsyncGenerator[dict, None]: ... ``` ### Example Usage ```python import asyncio from pdf2zh import SettingsModel, do_translate_async_stream async def main(): settings = SettingsModel( target_language="it", translation_service="google", enable_ocr=True ) async for event in do_translate_async_stream(settings, "document.pdf"): if event["type"] == "progress": print(f"Progress: {event['data']['percent']}%") elif event["type"] == "error": print(f"Error: {event['data']['message']}") elif event["type"] == "finish": print(f"Finished: {event['data']['output_path']}") asyncio.run(main()) ``` ### Event Types - `progress`: Contains `percent` (0-100) indicating translation progress - `error`: Contains `message` with error details - `finish`: Contains `output_path` with the path to the translated file ### Notes - This function handles all the translation pipeline internally (OCR, text extraction, translation, PDF reconstruction) - It automatically creates appropriate temporary directories and cleans them up - The function is fully async and non-blocking - For simple use cases, consider using the higher-level `pdf2zh_async` function --- ### TRANSLATION RESULT - `do_translate_async_stream` è il punto di ingresso asincrono di basso livello che traduce un singolo PDF e restituisce un flusso di eventi (avanzamento/errore/fine). - È adatto per costruire la propria interfaccia utente o CLI dove si desidera un avanzamento in tempo reale e il controllo completo sui risultati. - Accetta un SettingsModel convalidato e un percorso di file e restituisce un generatore asincrono di eventi dict. - Gli eventi sono in formato Server-Sent Events (SSE). ```python async def do_translate_async_stream( settings: SettingsModel, file_path: str ) -> AsyncGenerator[dict, None]: ... ``` ### Esempio di Utilizzo ```python import asyncio from pdf2zh import SettingsModel, do_translate_async_stream async def main(): settings = SettingsModel( target_language="it", translation_service="google", enable_ocr=True ) async for event in do_translate_async_stream(settings, "document.pdf"): if event["type"] == "progress": print(f"Progresso: {event['data']['percent']}%") elif event["type"] == "error": print(f"Errore: {event['data']['message']}") elif event["type"] == "finish": print(f"Completato: {event['data']['output_path']}") asyncio.run(main()) ``` ### Tipi di Evento - `progress`: Contiene `percent` (0-100) che indica lo stato di avanzamento della traduzione - `error`: Contiene `message` con i dettagli dell'errore - `finish`: Contiene `output_path` con il percorso del file tradotto ### Note - Questa funzione gestisce internamente tutta la pipeline di traduzione (OCR, estrazione del testo, traduzione, ricostruzione del PDF) - Crea automaticamente le directory temporanee appropriate e le pulisce - La funzione è completamente asincrona e non bloccante - Per casi d'uso semplici, considera di utilizzare la funzione di livello superiore `pdf2zh_async` - ### Overview: This document provides a comprehensive guide for translators who wish to contribute to the **pdf2zh** project. It covers everything from setting up the environment to submitting translations. The guide is divided into several sections for clarity. !!! Note The main translation platform for this project is [Crowdin](https://crowdin.com/project/pdf2zh). If you are not familiar with Crowdin, please refer to the [Crowdin Documentation](https://support.crowdin.com/). ### Table of Contents - [Getting Started](#getting-started) - [Advanced](#advanced) - [Supported Languages](#supported-languages) - [Community](#community) - [FAQ](#faq) --- ### Getting Started This section will guide you through the initial steps to start translating. #### Step 1: Join the Project 1. Visit the [Crowdin project page](https://crowdin.com/project/pdf2zh). 2. Click the "Join" button to request access to the project. 3. Wait for approval from the project maintainers. #### Step 2: Choose a Language 1. After joining, select the language you wish to translate into from the list of supported languages. 2. If your language is not listed, you can request it by contacting the project maintainers. #### Step 3: Start Translating 1. Navigate to the file you wish to translate. 2. Click on a segment to open the translation editor. 3. Enter your translation in the provided field. 4. Save your translation. !!! Tip You can use the translation memory and machine translation suggestions to speed up your work. ### Advanced This section covers advanced topics for experienced translators. #### Translation Memory Translation Memory (TM) is a database that stores previously translated segments. It helps maintain consistency and speed up the translation process. #### Glossary The project glossary contains key terms and their approved translations. Please refer to the glossary to ensure consistency. #### Quality Assurance Crowdin provides quality assurance checks to help you identify potential issues in your translations. Please pay attention to these checks. ### Supported Languages The project currently supports the following languages: - English (en) - Chinese (zh-CN) - Japanese (ja) - Korean (ko) - French (fr) - German (de) - Spanish (es) - Italian (it) - Russian (ru) - Arabic (ar) If you would like to add a new language, please contact the project maintainers. ### Community Join our community to connect with other translators and get help. - [Discord Server](https://discord.gg/example) - [GitHub Discussions](https://github.com/pdf2zh/pdf2zh/discussions) ### FAQ #### How do I become a proofreader? To become a proofreader, you need to have a good track record of quality translations. Contact the project maintainers to express your interest. #### Can I translate the documentation? Yes! The documentation is also hosted on Crowdin. You can find it under the "Documentation" folder. #### What if I find a mistake in the source text? If you find a mistake in the source text, please report it by creating an issue on [GitHub](https://github.com/pdf2zh/pdf2zh/issues). --- ### OUTPUT LANGUAGE it --- ### TRANSLATION RESULT ### Panoramica Questo documento fornisce una guida completa per i traduttori che desiderano contribuire al progetto **pdf2zh**. Copre tutto, dalla configurazione dell'ambiente all'invio delle traduzioni. La guida è divisa in diverse sezioni per chiarezza. !!! Note La piattaforma di traduzione principale per questo progetto è [Crowdin](https://crowdin.com/project/pdf2zh). Se non hai familiarità con Crowdin, consulta la [Documentazione di Crowdin](https://support.crowdin.com/). ### Indice - [Iniziare](#iniziare) - [Opzioni avanzate](#opzioni-avanzate) - [Lingue supportate](#lingue-supportate) - [Comunità](#comunità) - [Domande frequenti](#domande-frequenti) --- ### Iniziare Questa sezione ti guiderà attraverso i passi iniziali per iniziare a tradurre. #### Passo 1: Unisciti al progetto 1. Visita la [pagina del progetto Crowdin](https://crowdin.com/project/pdf2zh). 2. Clicca il pulsante "Unisciti" per richiedere l'accesso al progetto. 3. Attendi l'approvazione dai maintainer del progetto. #### Passo 2: Scegli una lingua 1. Dopo esserti unito, seleziona la lingua in cui desideri tradurre dalla lista delle lingue supportate. 2. Se la tua lingua non è elencata, puoi richiederla contattando i maintainer del progetto. #### Passo 3: Inizia a tradurre 1. Naviga fino al file che desideri tradurre. 2. Clicca su un segmento per aprire l'editor di traduzione. 3. Inserisci la tua traduzione nel campo fornito. 4. Salva la tua traduzione. !!! Tip Puoi utilizzare la memoria di traduzione e i suggerimenti di traduzione automatica per velocizzare il tuo lavoro. ### Opzioni avanzate Questa sezione tratta argomenti avanzati per traduttori esperti. #### Memoria di traduzione La Memoria di Traduzione (TM) è un database che memorizza segmenti precedentemente tradotti. Aiuta a mantenere la coerenza e a velocizzare il processo di traduzione. #### Glossario Il glossario del progetto contiene i termini chiave e le loro traduzioni approvate. Si prega di fare riferimento al glossario per garantire la coerenza. #### Controllo qualità Crowdin fornisce controlli di garanzia della qualità per aiutarti a identificare potenziali problemi nelle tue traduzioni. Si prega di prestare attenzione a questi controlli. ### Lingue supportate Il progetto supporta attualmente le seguenti lingue: - Inglese (en) - Cinese (zh-CN) - Giapponese (ja) - Coreano (ko) - Francese (fr) - Tedesco (de) - Spagnolo (es) - Italiano (it) - Russo (ru) - Arabo (ar) Se desideri aggiungere una nuova lingua, contatta i maintainer del progetto. ### Comunità Unisciti alla nostra comunità per connetterti con altri traduttori e ottenere aiuto. - [Server Discord](https://discord.gg/example) - [Discussioni GitHub](https://github.com/pdf2zh/pdf2zh/discussions) ### Domande frequenti #### Come posso diventare un correttore di bozze? Per diventare un correttore di bozze, devi avere una buona storia di traduzioni di qualità. Contatta i maintainer del progetto per esprimere il tuo interesse. #### Posso tradurre la documentazione? Sì! La documentazione è anche ospitata su Crowdin. Puoi trovarla sotto la cartella "Documentazione". #### Cosa succede se trovo un errore nel testo sorgente? Se trovi un errore nel testo sorgente, segnalalo creando un issue su [GitHub](https://github.com/pdf2zh/pdf2zh/issues).
pt: - The events are in the same format as the WebUI's SSE events. --- ### OUTPUT - do_translate_async_stream é o ponto de entrada assíncrono de baixo nível que traduz um único PDF e produz um fluxo de eventos (progresso/erro/conclusão). - É adequado para construir sua própria UI ou CLI onde você deseja progresso em tempo real e controle total sobre os resultados. - Aceita um SettingsModel validado e um caminho de arquivo e retorna um gerador assíncrono de eventos dict. - Os eventos estão no mesmo formato que os eventos SSE da WebUI. - ### Installation: The installation process is straightforward. You can install `pdf2zh` using `pip`: ```bash pip install pdf2zh ``` ### Dependencies `pdf2zh` depends on the following packages: - `pdfplumber`: For extracting text from PDF files. - `requests`: For making HTTP requests to translation services. - `aiohttp`: For asynchronous HTTP requests. - `Pillow`: For image processing (if needed). These dependencies will be installed automatically when you install `pdf2zh`. ### Upgrading To upgrade to the latest version of `pdf2zh`, use: ```bash pip install --upgrade pdf2zh ``` ### Verifying Installation After installation, you can verify that `pdf2zh` is installed correctly by running: ```bash python -c "import pdf2zh; print('pdf2zh installed successfully')" ``` If you see the message "pdf2zh installed successfully", the installation was successful. ### Troubleshooting If you encounter any issues during installation, please check the following: 1. Ensure you have Python 3.7 or higher installed. 2. Make sure you have the latest version of `pip`. 3. Check your internet connection. If problems persist, please open an issue on the [GitHub repository](https://github.com/PDFMathTranslate/pdf2zh/issues). --- ### OUTPUT LANGUAGE pt --- ### OUTPUT ### Instalação O processo de instalação é simples. Você pode instalar o `pdf2zh` usando `pip`: ```bash pip install pdf2zh ``` ### Dependências O `pdf2zh` depende dos seguintes pacotes: - `pdfplumber`: Para extrair texto de arquivos PDF. - `requests`: Para fazer solicitações HTTP para serviços de tradução. - `aiohttp`: Para solicitações HTTP assíncronas. - `Pillow`: Para processamento de imagens (se necessário). Essas dependências serão instaladas automaticamente quando você instalar o `pdf2zh`. ### Atualização Para atualizar para a versão mais recente do `pdf2zh`, use: ```bash pip install --upgrade pdf2zh ``` ### Verificando a Instalação Após a instalação, você pode verificar se o `pdf2zh` foi instalado corretamente executando: ```bash python -c "import pdf2zh; print('pdf2zh instalado com sucesso')" ``` Se você vir a mensagem "pdf2zh instalado com sucesso", a instalação foi bem-sucedida. ### Solução de Problemas Se você encontrar qualquer problema durante a instalação, por favor, verifique o seguinte: 1. Certifique-se de ter o Python 3.7 ou superior instalado. 2. Certifique-se de ter a versão mais recente do `pip`. 3. Verifique sua conexão com a internet. Se os problemas persistirem, por favor, abra um issue no [repositório do GitHub](https://github.com/PDFMathTranslate/pdf2zh/issues). - ### Command Line Interface: The Command Line Interface (CLI) of `pdf2zh` provides a convenient way to translate PDF files directly from the terminal. ### Basic Usage To translate a PDF file, use the following command: ```bash pdf2zh translate input.pdf ``` This command will translate `input.pdf` from English to Chinese (the default target language) and output the result to the terminal. ### Specifying Output File To save the translation to a file, use the `-o` or `--output` option: ```bash pdf2zh translate input.pdf -o output.txt ``` ### Changing Target Language You can specify the target language using the `-t` or `--target-lang` option: ```bash pdf2zh translate input.pdf -t es ``` This will translate the PDF to Spanish. ### Specifying Source Language If the source language is not English, you can specify it with the `-s` or `--source-lang` option: ```bash pdf2zh translate input.pdf -s fr -t en ``` This will translate a French PDF to English. ### Using Different Translation Services `pdf2zh` supports multiple translation services. You can choose one with the `--service` option: ```bash pdf2zh translate input.pdf --service google ``` Available services include `google`, `deepl`, `openai`, and `azure`. ### Batch Processing To translate multiple PDF files at once, you can use: ```bash pdf2zh translate *.pdf ``` This will translate all PDF files in the current directory. ### Help Command For more information on the available options, use the help command: ```bash pdf2zh translate --help ``` ### Environment Variables You can set API keys for translation services as environment variables: ```bash export GOOGLE_TRANSLATE_API_KEY="your_api_key" export DEEPL_API_KEY="your_api_key" export OPENAI_API_KEY="your_api_key" export AZURE_TRANSLATOR_KEY="your_api_key" ``` Then, `pdf2zh` will use these keys automatically. ### Example Here's an example command that uses all the options: ```bash pdf2zh translate document.pdf -s en -t pt -o translated_document.txt --service deepl ``` This command translates `document.pdf` from English to Portuguese using DeepL and saves the result to `translated_document.txt`. --- ### OUTPUT LANGUAGE pt --- ### OUTPUT ### Interface de Linha de Comando A Interface de Linha de Comando (CLI) do `pdf2zh` fornece uma maneira conveniente de traduzir arquivos PDF diretamente do terminal. ### Uso Básico Para traduzir um arquivo PDF, use o seguinte comando: ```bash pdf2zh translate input.pdf ``` Este comando irá traduzir `input.pdf` do inglês para o chinês (o idioma de destino padrão) e enviar o resultado para o terminal. ### Especificando Arquivo de Saída Para salvar a tradução em um arquivo, use a opção `-o` ou `--output`: ```bash pdf2zh translate input.pdf -o output.txt ``` ### Alterando o Idioma de Destino Você pode especificar o idioma de destino usando a opção `-t` ou `--target-lang`: ```bash pdf2zh translate input.pdf -t es ``` Isso irá traduzir o PDF para espanhol. ### Especificando o Idioma de Origem Se o idioma de origem não for inglês, você pode especificá-lo com a opção `-s` ou `--source-lang`: ```bash pdf2zh translate input.pdf -s fr -t en ``` Isso irá traduzir um PDF em francês para inglês. ### Usando Diferentes Serviços de Tradução O `pdf2zh` suporta vários serviços de tradução. Você pode escolher um com a opção `--service`: ```bash pdf2zh translate input.pdf --service google ``` Os serviços disponíveis incluem `google`, `deepl`, `openai` e `azure`. ### Processamento em Lote Para traduzir vários arquivos PDF de uma vez, você pode usar: ```bash pdf2zh translate *.pdf ``` Isso irá traduzir todos os arquivos PDF no diretório atual. ### Comando de Ajuda Para mais informações sobre as opções disponíveis, use o comando de ajuda: ```bash pdf2zh translate --help ``` ### Variáveis de Ambiente Você pode definir chaves de API para serviços de tradução como variáveis de ambiente: ```bash export GOOGLE_TRANSLATE_API_KEY="sua_chave_api" export DEEPL_API_KEY="sua_chave_api" export OPENAI_API_KEY="sua_chave_api" export AZURE_TRANSLATOR_KEY="sua_chave_api" ``` Então, o `pdf2zh` usará essas chaves automaticamente. ### Exemplo Aqui está um exemplo de comando que usa todas as opções: ```bash pdf2zh translate document.pdf -s en -t pt -o translated_document.txt --service deepl ``` Este comando traduz `document.pdf` do inglês para português usando o DeepL e salva o resultado em `translated_document.txt`. - ### Web UI: The Web UI provides a user-friendly interface for translating PDF files without using the command line. ### Accessing the Web UI To start the Web UI, run the following command: ```bash pdf2zh serve ``` This will start a local server, and you can access the Web UI by opening your browser and navigating to `http://localhost:7860`. ### Uploading a PDF 1. Click the **Upload** button to select a PDF file from your computer. 2. Alternatively, you can drag and drop a PDF file into the upload area. ### Selecting Languages 1. Choose the source language of your PDF from the **Source Language** dropdown. 2. Choose the target language for translation from the **Target Language** dropdown. ### Translation Options You can customize the translation process with the following options: - **Translation Service**: Choose from supported translation services (Google, DeepL, OpenAI, Azure). - **Ignore Formatting**: If enabled, only the text content will be translated, and formatting will be ignored. - **Ignore Images**: Skip processing of images in the PDF. - **Ignore Tables**: Skip processing of tables in the PDF. - **Ignore Equations**: Skip processing of mathematical equations. ### Starting the Translation Click the **Translate** button to start the translation process. The progress will be displayed in real-time. ### Viewing the Result Once the translation is complete, the translated text will be displayed on the screen. You can: - **Copy** the text to clipboard. - **Download** the translated text as a text file. - **Download** the translated PDF (if formatting is preserved). ### Saving API Keys If you are using a translation service that requires an API key, you can enter it in the **API Key** field. The key will be saved in your browser's local storage for future use. ### Exiting the Web UI To stop the Web UI, press `Ctrl+C` in the terminal where the server is running. --- ### OUTPUT LANGUAGE pt --- ### OUTPUT ### Web UI A Web UI fornece uma interface amigável para traduzir arquivos PDF sem usar a linha de comando. ### Acessando a Web UI Para iniciar a Web UI, execute o seguinte comando: ```bash pdf2zh serve ``` Isso iniciará um servidor local, e você pode acessar a Web UI abrindo seu navegador e navegando para `http://localhost:7860`. ### Fazendo Upload de um PDF 1. Clique no botão **Upload** para selecionar um arquivo PDF do seu computador. 2. Alternativamente, você pode arrastar e soltar um arquivo PDF na área de upload. ### Selecionando Idiomas 1. Escolha o idioma de origem do seu PDF no menu suspenso **Idioma de Origem**. 2. Escolha o idioma de destino para a tradução no menu suspenso **Idioma de Destino**. ### Opções de Tradução Você pode personalizar o processo de tradução com as seguintes opções: - **Serviço de Tradução**: Escolha entre os serviços de tradução suportados (Google, DeepL, OpenAI, Azure). - **Ignorar Formatação**: Se habilitado, apenas o conteúdo de texto será traduzido, e a formatação será ignorada. - **Ignorar Imagens**: Pular o processamento de imagens no PDF. - **Ignorar Tabelas**: Pular o processamento de tabelas no PDF. - **Ignorar Equações**: Pular o processamento de equações matemáticas. ### Iniciando a Tradução Clique no botão **Traduzir** para iniciar o processo de tradução. O progresso será exibido em tempo real. ### Visualizando o Resultado Quando a tradução estiver concluída, o texto traduzido será exibido na tela. Você pode: - **Copiar** o texto para a área de transferência. - **Baixar** o texto traduzido como um arquivo de texto. - **Baixar** o PDF traduzido (se a formatação for preservada). ### Salvando Chaves de API Se você estiver usando um serviço de tradução que requer uma chave de API, pode inseri-la no campo **Chave de API**. A chave será salva no armazenamento local do seu navegador para uso futuro. ### Saindo da Web UI Para parar a Web UI, pressione `Ctrl+C` no terminal onde o servidor está sendo executado.
ru: - The events are of the form: `{"type": "progress", "progress": 0.5}` or `{"type": "error", "error": "..."}` or `{"type": "finish", "result": ...}`. --- ### TRANSLATION - `do_translate_async_stream` — это низкоуровневая асинхронная точка входа, которая переводит один PDF и выдает поток событий (прогресс/ошибка/завершение). - Она подходит для создания собственного пользовательского интерфейса или CLI, где требуется реальное время прогресса и полный контроль над результатами. - Она принимает проверенную модель SettingsModel и путь к файлу и возвращает асинхронный генератор событий в виде словарей. - События имеют вид: `{"type": "progress", "progress": 0.5}` или `{"type": "error", "error": "..."}` или `{"type": "finish", "result": ...}`.
