Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_30F3E646
source: | `--disable-rich-text-translate` | Disable rich text translation | `pdf2zh_next example.pdf --disable-rich-text-translate` |
de: | :------------------------------ | :-------------------------------------------------------------------------------------- | :-------------------------------------------------------------------------------------------------------------------- | | `--disable-image-translate` | Disable image translation | `pdf2zh_next example.pdf --disable-image-translate` | | `-o`, `--output` | Specify output file path | `pdf2zh_next example.pdf -o example_translated.pdf` | | `-d`, `--output-dir` | Specify output directory | `pdf2zh_next example.pdf -d output/` | | `-f`, `--force` | Force overwrite output file if it exists | `pdf2zh_next example.pdf -f` | | `-l`, `--target-language` | Specify target language (default: zh) | `pdf2zh_next example.pdf -l en` | | `-s`, `--service` | Specify translation service (default: google) | `pdf2zh_next example.pdf -s deepl` | | `--api-key` | Specify API key for translation service (if required) | `pdf2zh_next example.pdf -s deepl --api-key YOUR_DEEPL_API_KEY` | | `--api-base-url` | Specify API base URL for translation service (if required) | `pdf2zh_next example.pdf -s deepl --api-base-url https://api-free.deepl.com` | | `--api-region` | Specify API region for translation service (if required) | `pdf2zh_next example.pdf -s azure --api-region eastus` | | `--timeout` | Set timeout for translation requests in seconds (default: 10) | `pdf2zh_next example.pdf --timeout 30` | | `--retry` | Set number of retries for failed translation requests (default: 3) | `pdf2zh_next example.pdf --retry 5` | | `--concurrency` | Set maximum number of concurrent translation requests (default: 10) | `pdf2zh_next example.pdf --concurrency 20` | | `--dry-run` | Perform a dry run without actually translating | `pdf2zh_next example.pdf --dry-run` | | `--verbose` | Enable verbose output | `pdf2zh_next example.pdf --verbose` | | `--version` | Show version information | `pdf2zh_next --version` | | `--help` | Show help message | `pdf2zh_next --help` | --- ### ORIGINAL LANGUAGE en --- ### TARGET LANGUAGE de
fr: [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | ----------------------------------------------------------------------------------------- | | `--disable-math-translate` | Disable math translation | `pdf2zh_next example.pdf --disable-math-translate` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--disable-figure-translate` | Disable figure translation | `pdf2zh_next example.pdf --disable-figure-translate` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--disable-table-translate` | Disable table translation | `pdf2zh_next example.pdf --disable-table-translate` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--disable-code-translate` | Disable code translation | `pdf2zh_next example.pdf --disable-code-translate` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--disable-caption-translate` | Disable caption translation | `pdf2zh_next example.pdf --disable-caption-translate` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--disable-header-footer` | Disable header and footer translation | `pdf2zh_next example.pdf --disable-header-footer` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--disable-footnote-translate` | Disable footnote translation | `pdf2zh_next example.pdf --disable-footnote-translate` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--disable-annotation-translate` | Disable annotation translation | `pdf2zh_next example.pdf --disable-annotation-translate` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--disable-reference-translate` | Disable reference translation | `pdf2zh_next example.pdf --disable-reference-translate` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--disable-bibliography-translate` | Disable bibliography translation | `pdf2zh_next example.pdf --disable-bibliography-translate` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | --- ### TRANSLATION RESULT | `--disable-rich-text-translate` | Désactiver la traduction de texte enrichi | `pdf2zh_next example.pdf --disable-rich-text-translate` | [Utilisation de la **Ligne de commande**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------- | | `--disable-math-translate` | Désactiver la traduction mathématique | `pdf2zh_next example.pdf --disable-math-translate` | [Utilisation de la **Ligne de commande**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--disable-figure-translate` | Désactiver la traduction des figures | `pdf2zh_next example.pdf --disable-figure-translate` | [Utilisation de la **Ligne de commande**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--disable-table-translate` | Désactiver la traduction des tableaux | `pdf2zh_next example.pdf --disable-table-translate` | [Utilisation de la **Ligne de commande**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--disable-code-translate` | Désactiver la traduction du code | `pdf2zh_next example.pdf --disable-code-translate` | [Utilisation de la **Ligne de commande**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--disable-caption-translate` | Désactiver la traduction des légendes | `pdf2zh_next example.pdf --disable-caption-translate` | [Utilisation de la **Ligne de commande**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--disable-header-footer` | Désactiver la traduction des en-têtes et pieds de page | `pdf2zh_next example.pdf --disable-header-footer` | [Utilisation de la **Ligne de commande**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--disable-footnote-translate` | Désactiver la traduction des notes de bas de page | `pdf2zh_next example.pdf --disable-footnote-translate` | [Utilisation de la **Ligne de commande**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--disable-annotation-translate` | Désactiver la traduction des annotations | `pdf2zh_next example.pdf --disable-annotation-translate` | [Utilisation de la **Ligne de commande**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--disable-reference-translate` | Désactiver la traduction des références | `pdf2zh_next example.pdf --disable-reference-translate` | [Utilisation de la **Ligne de commande**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--disable-bibliography-translate` | Désactiver la traduction de la bibliographie | `pdf2zh_next example.pdf --disable-bibliography-translate` | [Utilisation de la **Ligne de commande**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) |
it: This will disable rich text translation in the output document. | | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | --------------------------------------------------------------- | --- ### TRANSLATION RESULT | `--disable-rich-text-translate` | Disabilita la traduzione del testo formattato | `pdf2zh_next example.pdf --disable-rich-text-translate` | Questo disabiliterà la traduzione del testo formattato nel documento di output. |
pt: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--disable-latex-translate` | Disable LaTeX translation | `pdf2zh_next example.pdf --disable-latex-translate` | | `--disable-formula-translate` | Disable formula translation | `pdf2zh_next example.pdf --disable-formula-translate` | | `--disable-table-translate` | Disable table translation | `pdf2zh_next example.pdf --disable-table-translate` | | `--disable-figure-translate` | Disable figure translation | `pdf2zh_next example.pdf --disable-figure-translate` | | `--disable-algorithm-translate` | Disable algorithm translation | `pdf2zh_next example.pdf --disable-algorithm-translate` | | `--disable-list-translate` | Disable list translation | `pdf2zh_next example.pdf --disable-list-translate` | | `--disable-code-translate` | Disable code translation | `pdf2zh_next example.pdf --disable-code-translate` | | `--disable-quote-translate` | Disable quote translation | `pdf2zh_next example.pdf --disable-quote-translate` | | `--disable-reference-translate` | Disable reference translation | `pdf2zh_next example.pdf --disable-reference-translate` | | `--disable-citation-translate` | Disable citation translation | `pdf2zh_next example.pdf --disable-citation-translate` | | `--disable-footnote-translate` | Disable footnote translation | `pdf2zh_next example.pdf --disable-footnote-translate` | | `--disable-header-translate` | Disable header translation | `pdf2zh_next example.pdf --disable-header-translate` | | `--disable-footer-translate` | Disable footer translation | `pdf2zh_next example.pdf --disable-footer-translate` | | `--disable-note-translate` | Disable note translation | `pdf2zh_next example.pdf --disable-note-translate` | | `--disable-proof-translate` | Disable proof translation | `pdf2zh_next example.pdf --disable-proof-translate` | | `--disable-example-translate` | Disable example translation | `pdf2zh_next example.pdf --disable-example-translate` | | `--disable-definition-translate`| Disable definition translation | `pdf2zh_next example.pdf --disable-definition-translate` | | `--disable-theorem-translate` | Disable theorem translation | `pdf2zh_next example.pdf --disable-theorem-translate` | | `--disable-corollary-translate` | Disable corollary translation | `pdf2zh_next example.pdf --disable-corollary-translate` | | `--disable-lemma-translate` | Disable lemma translation | `pdf2zh_next example.pdf --disable-lemma-translate` | | `--disable-proposition-translate`| Disable proposition translation | `pdf2zh_next example.pdf --disable-proposition-translate` | | `--disable-remark-translate` | Disable remark translation | `pdf2zh_next example.pdf --disable-remark-translate` | | `--disable-assumption-translate`| Disable assumption translation | `pdf2zh_next example.pdf --disable-assumption-translate` | | `--disable-conjecture-translate`| Disable conjecture translation | `pdf2zh_next example.pdf --disable-conjecture-translate` | | `--disable-axiom-translate` | Disable axiom translation | `pdf2zh_next example.pdf --disable-axiom-translate` | | `--disable-property-translate` | Disable property translation | `pdf2zh_next example.pdf --disable-property-translate` | | `--disable-exercise-translate` | Disable exercise translation | `pdf2zh_next example.pdf --disable-exercise-translate` | | `--disable-solution-translate` | Disable solution translation | `pdf2zh_next example.pdf --disable-solution-translate` | | `--disable-problem-translate` | Disable problem translation | `pdf2zh_next example.pdf --disable-problem-translate` | | `--disable-question-translate` | Disable question translation | `pdf2zh_next example.pdf --disable-question-translate` | | `--disable-answer-translate` | Disable answer translation | `pdf2zh_next example.pdf --disable-answer-translate` | | `--disable-hint-translate` | Disable hint translation | `pdf2zh_next example.pdf --disable-hint-translate` | | `--disable-note-translate` | Disable note translation | `pdf2zh_next example.pdf --disable-note-translate` | | `--disable-tip-translate` | Disable tip translation | `pdf2zh_next example.pdf --disable-tip-translate` | | `--disable-warning-translate` | Disable warning translation | `pdf2zh_next example.pdf --disable-warning-translate` | | `--disable-caution-translate` | Disable caution translation | `pdf2zh_next example.pdf --disable-caution-translate` | | `--disable-important-translate` | Disable important translation | `pdf2zh_next example.pdf --disable-important-translate` | | `--disable-error-translate` | Disable error translation | `pdf2zh_next example.pdf --disable-error-translate` | | `--disable-success-translate` | Disable success translation | `pdf2zh_next example.pdf --disable-success-translate` | | `--disable-info-translate` | Disable info translation | `pdf2zh_next example.pdf --disable-info-translate` | | `--disable-admonition-translate`| Disable admonition translation | `pdf2zh_next example.pdf --disable-admonition-translate` | --- ### TRANSLATION RESULT | `--disable-rich-text-translate` | Desativar tradução de texto rico | `pdf2zh_next example.pdf --disable-rich-text-translate` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--disable-latex-translate` | Desativar tradução de LaTeX | `pdf2zh_next example.pdf --disable-latex-translate` | | `--disable-formula-translate` | Desativar tradução de fórmulas | `pdf2zh_next example.pdf --disable-formula-translate` | | `--disable-table-translate` | Desativar tradução de tabelas | `pdf2zh_next example.pdf --disable-table-translate` | | `--disable-figure-translate` | Desativar tradução de figuras | `pdf2zh_next example.pdf --disable-figure-translate` | | `--disable-algorithm-translate` | Desativar tradução de algoritmos | `pdf2zh_next example.pdf --disable-algorithm-translate` | | `--disable-list-translate` | Desativar tradução de listas | `pdf2zh_next example.pdf --disable-list-translate` | | `--disable-code-translate` | Desativar tradução de código | `pdf2zh_next example.pdf --disable-code-translate` | | `--disable-quote-translate` | Desativar tradução de citações | `pdf2zh_next example.pdf --disable-quote-translate` | | `--disable-reference-translate` | Desativar tradução de referências | `pdf2zh_next example.pdf --disable-reference-translate` | | `--disable-citation-translate` | Desativar tradução de citações | `pdf2zh_next example.pdf --disable-citation-translate` | | `--disable-footnote-translate` | Desativar tradução de notas de rodapé | `pdf2zh_next example.pdf --disable-footnote-translate` | | `--disable-header-translate` | Desativar tradução de cabeçalhos | `pdf2zh_next example.pdf --disable-header-translate` | | `--disable-footer-translate` | Desativar tradução de rodapés | `pdf2zh_next example.pdf --disable-footer-translate` | | `--disable-note-translate` | Desativar tradução de notas | `pdf2zh_next example.pdf --disable-note-translate` | | `--disable-proof-translate` | Desativar tradução de provas | `pdf2zh_next example.pdf --disable-proof-translate` | | `--disable-example-translate` | Desativar tradução de exemplos | `pdf2zh_next example.pdf --disable-example-translate` | | `--disable-definition-translate`| Desativar tradução de definições | `pdf2zh_next example.pdf --disable-definition-translate` | | `--disable-theorem-translate` | Desativar tradução de teoremas | `pdf2zh_next example.pdf --disable-theorem-translate` | | `--disable-corollary-translate` | Desativar tradução de corolários | `pdf2zh_next example.pdf --disable-corollary-translate` | | `--disable-lemma-translate` | Desativar tradução de lemas | `pdf2zh_next example.pdf --disable-lemma-translate` | | `--disable-proposition-translate`| Desativar tradução de proposições | `pdf2zh_next example.pdf --disable-proposition-translate` | | `--disable-remark-translate` | Desativar tradução de observações | `pdf2zh_next example.pdf --disable-remark-translate` | | `--disable-assumption-translate`| Desativar tradução de suposições | `pdf2zh_next example.pdf --disable-assumption-translate` | | `--disable-conjecture-translate`| Desativar tradução de conjecturas | `pdf2zh_next example.pdf --disable-conjecture-translate` | | `--disable-axiom-translate` | Desativar tradução de axiomas | `pdf2zh_next example.pdf --disable-axiom-translate` | | `--disable-property-translate` | Desativar tradução de propriedades | `pdf2zh_next example.pdf --disable-property-translate` | | `--disable-exercise-translate` | Desativar tradução de exercícios | `pdf2zh_next example.pdf --disable-exercise-translate` | | `--disable-solution-translate` | Desativar tradução de soluções | `pdf2zh_next example.pdf --disable-solution-translate` | | `--disable-problem-translate` | Desativar tradução de problemas | `pdf2zh_next example.pdf --disable-problem-translate` | | `--disable-question-translate` | Desativar tradução de perguntas | `pdf2zh_next example.pdf --disable-question-translate` | | `--disable-answer-translate` | Desativar tradução de respostas | `pdf2zh_next example.pdf --disable-answer-translate` | | `--disable-hint-translate` | Desativar tradução de dicas | `pdf2zh_next example.pdf --disable-hint-translate` | | `--disable-note-translate` | Desativar tradução de notas | `pdf2zh_next example.pdf --disable-note-translate` | | `--disable-tip-translate` | Desativar tradução de dicas | `pdf2zh_next example.pdf --disable-tip-translate` | | `--disable-warning-translate` | Desativar tradução de avisos | `pdf2zh_next example.pdf --disable-warning-translate` | | `--disable-caution-translate` | Desativar tradução de cautelas | `pdf2zh_next example.pdf --disable-caution-translate` | | `--disable-important-translate` | Desativar tradução de importantes | `pdf2zh_next example.pdf --disable-important-translate` | | `--disable-error-translate` | Desativar tradução de erros | `pdf2zh_next example.pdf --disable-error-translate` | | `--disable-success-translate` | Desativar tradução de sucessos | `pdf2zh_next example.pdf --disable-success-translate` | | `--disable-info-translate` | Desativar tradução de informações | `pdf2zh_next example.pdf --disable-info-translate` | | `--disable-admonition-translate`| Desativar tradução de admoestações | `pdf2zh_next example.pdf --disable-admonition-translate` |
ru: | `--disable-rich-text-translate` | Отключить перевод форматированного текста | `pdf2zh_next example.pdf --disable-rich-text-translate` |
