Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_C8ABE7AA
source: - An optional `stage_summary` may be emitted before progress begins. - On certain failures, the generator will first yield an `error` event and then raise an exception derived from `TranslationError`. You should both check for error events and be prepared to catch exceptions. - `progress_update` events may repeat with identical values; consumers should debounce if necessary. - Stop consuming the stream when you receive a `finish` event.
de: - The `stage_summary` event contains a dictionary with the keys `total_pages` (int) and `total_characters` (int). - The `progress_update` event contains a dictionary with the keys `page` (int) and `character` (int). - The `error` event contains a dictionary with the keys `message` (str) and `code` (str). - The `finish` event contains a dictionary with the key `output_file` (str). --- ### TRANSLATION RESULT - Ein optionales `stage_summary` kann vor Beginn des Fortschritts ausgegeben werden. - Bei bestimmten Fehlern gibt der Generator zuerst ein `error`-Event aus und löst dann eine von `TranslationError` abgeleitete Ausnahme aus. Sie sollten sowohl auf Fehler-Events prüfen als auch darauf vorbereitet sein, Ausnahmen abzufangen. - `progress_update`-Events können sich mit identischen Werten wiederholen; Verbraucher sollten bei Bedarf entprellen. - Stoppen Sie den Verbrauch des Streams, wenn Sie ein `finish`-Event erhalten. - Das `stage_summary`-Event enthält ein Wörterbuch mit den Schlüsseln `total_pages` (int) und `total_characters` (int). - Das `progress_update`-Event enthält ein Wörterbuch mit den Schlüsseln `page` (int) und `character` (int). - Das `error`-Event enthält ein Wörterbuch mit den Schlüsseln `message` (str) und `code` (str). - Das `finish`-Event enthält ein Wörterbuch mit dem Schlüssel `output_file` (str).
fr: - The generator is not reusable after completion or error. - The generator may be prematurely closed by the caller, which will cancel the translation. --- ### TRANSLATION RESULT - Un `stage_summary` facultatif peut être émis avant le début de la progression. - En cas de certains échecs, le générateur émettra d'abord un événement `error`, puis lèvera une exception dérivée de `TranslationError`. Vous devez à la fois vérifier les événements d'erreur et être prêt à attraper les exceptions. - Les événements `progress_update` peuvent se répéter avec des valeurs identiques ; les consommateurs doivent effectuer un debounce si nécessaire. - Arrêtez de consommer le flux lorsque vous recevez un événement `finish`. - Le générateur n'est pas réutilisable après achèvement ou erreur. - Le générateur peut être fermé prématurément par l'appelant, ce qui annulera la traduction. --- ### OUTPUT LANGUAGE fr --- ### OUTPUT - Un `stage_summary` facultatif peut être émis avant le début de la progression. - En cas de certains échecs, le générateur émettra d'abord un événement `error`, puis lèvera une exception dérivée de `TranslationError`. Vous devez à la fois vérifier les événements d'erreur et être prêt à attraper les exceptions. - Les événements `progress_update` peuvent se répéter avec des valeurs identiques ; les consommateurs doivent effectuer un debounce si nécessaire. - Arrêtez de consommer le flux lorsque vous recevez un événement `finish`. - Le générateur n'est pas réutilisable après achèvement ou erreur. - Le générateur peut être fermé prématurément par l'appelant, ce qui annulera la traduction.
it: - The `finish` event is guaranteed to be the last event emitted by the generator. --- ### TRANSLATION RESULT - Un `stage_summary` opzionale può essere emesso prima che inizi lo stato di avanzamento. - In caso di determinati errori, il generatore emetterà prima un evento `error` e poi solleverà un'eccezione derivata da `TranslationError`. Dovresti sia controllare gli eventi di errore che essere preparato a catturare le eccezioni. - Gli eventi `progress_update` possono ripetersi con valori identici; i consumatori dovrebbero eseguire il debounce se necessario. - Interrompi il consumo dello stream quando ricevi un evento `finish`. - L'evento `finish` è garantito essere l'ultimo evento emesso dal generatore.
pt: - The generator will not yield any more events after `finish`. - If you need to cancel the translation, you can call the `.close()` method on the generator. --- ### TRANSLATION RESULT - Um `stage_summary` opcional pode ser emitido antes do progresso começar. - Em certas falhas, o gerador primeiro irá produzir um evento `error` e depois levantar uma exceção derivada de `TranslationError`. Você deve tanto verificar eventos de erro quanto estar preparado para capturar exceções. - Eventos `progress_update` podem se repetir com valores idênticos; os consumidores devem fazer debounce se necessário. - Pare de consumir o fluxo quando receber um evento `finish`. - O gerador não produzirá mais eventos após `finish`. - Se precisar cancelar a tradução, pode chamar o método `.close()` no gerador. - ### Example Event Shapes: This is a list of example event shapes. !!! note The examples below are for illustration purposes only. The actual events may vary. #### Example 1: Simple Event ```json { "event_id": "12345", "event_type": "user_login", "timestamp": "2023-10-05T14:48:00Z", "user_id": "user_67890", "ip_address": "192.168.1.1" } ``` #### Example 2: Event with Nested Data ```json { "event_id": "67890", "event_type": "purchase", "timestamp": "2023-10-05T15:30:00Z", "user": { "user_id": "user_12345", "email": "user@example.com", "name": "John Doe" }, "items": [ { "product_id": "prod_1", "quantity": 2, "price": 19.99 }, { "product_id": "prod_2", "quantity": 1, "price": 9.99 } ], "total_amount": 49.97 } ``` #### Example 3: Event with Array of Strings ```json { "event_id": "abcde", "event_type": "search", "timestamp": "2023-10-05T16:15:00Z", "query": "example query", "filters": ["filter1", "filter2", "filter3"], "results_count": 15 } ``` --- ### OUTPUT ### Exemplo de Formas de Evento Esta é uma lista de exemplo de formas de evento. !!! note Os exemplos abaixo são apenas para fins de ilustração. Os eventos reais podem variar. #### Exemplo 1: Evento Simples ```json { "event_id": "12345", "event_type": "user_login", "timestamp": "2023-10-05T14:48:00Z", "user_id": "user_67890", "ip_address": "192.168.1.1" } ``` #### Exemplo 2: Evento com Dados Aninhados ```json { "event_id": "67890", "event_type": "purchase", "timestamp": "2023-10-05T15:30:00Z", "user": { "user_id": "user_12345", "email": "user@example.com", "name": "John Doe" }, "items": [ { "product_id": "prod_1", "quantity": 2, "price": 19.99 }, { "product_id": "prod_2", "quantity": 1, "price": 9.99 } ], "total_amount": 49.97 } ``` #### Exemplo 3: Evento com Array de Strings ```json { "event_id": "abcde", "event_type": "search", "timestamp": "2023-10-05T16:15:00Z", "query": "example query", "filters": ["filter1", "filter2", "filter3"], "results_count": 15 } ``` - ### Using the WebUI: The WebUI provides a user-friendly interface for translating PDF documents. You can access it at [https://pdf2zh-next.com](https://pdf2zh-next.com). #### Steps to Use the WebUI 1. **Open the WebUI**: Navigate to [https://pdf2zh-next.com](https://pdf2zh-next.com) in your web browser. 2. **Upload a PDF File**: Click the **Upload** button and select the PDF file you want to translate. 3. **Select Languages**: Choose the source and target languages from the dropdown menus. The source language can be set to **Auto-Detect** if you are unsure. 4. **Start Translation**: Click the **Translate** button to begin the translation process. 5. **View Results**: Once the translation is complete, the translated text will be displayed on the screen. You can then download the translated document or copy the text to clipboard. #### Features - **Auto-Detect Language**: The WebUI can automatically detect the source language of your PDF document. - **Multiple Translation Services**: You can choose from multiple translation services, including Google Translate, DeepL, and OpenAI. - **Real-Time Progress**: The translation progress is displayed in real-time. - **Error Handling**: If an error occurs, the WebUI will display an error message with suggestions for resolution. #### Limitations - The WebUI may not handle very large PDF files (e.g., over 100 pages) efficiently. For large files, consider using the [Command Line Interface](https://pdf2zh-next.com/getting-started/USAGE_cli.html). - The WebUI requires an internet connection to use translation services. --- ### OUTPUT ### Usando a WebUI A WebUI fornece uma interface amigável para traduzir documentos PDF. Você pode acessá-la em [https://pdf2zh-next.com](https://pdf2zh-next.com). #### Passos para Usar a WebUI 1. **Abra a WebUI**: Navegue para [https://pdf2zh-next.com](https://pdf2zh-next.com) no seu navegador web. 2. **Faça Upload de um Arquivo PDF**: Clique no botão **Upload** e selecione o arquivo PDF que deseja traduzir. 3. **Selecione os Idiomas**: Escolha os idiomas de origem e destino nos menus suspensos. O idioma de origem pode ser definido como **Auto-Detectar** se você não tiver certeza. 4. **Inicie a Tradução**: Clique no botão **Traduzir** para iniciar o processo de tradução. 5. **Visualize os Resultados**: Uma vez que a tradução esteja concluída, o texto traduzido será exibido na tela. Você pode então baixar o documento traduzido ou copiar o texto para a área de transferência. #### Funcionalidades - **Auto-Detecção de Idioma**: A WebUI pode detectar automaticamente o idioma de origem do seu documento PDF. - **Múltiplos Serviços de Tradução**: Você pode escolher entre vários serviços de tradução, incluindo Google Translate, DeepL e OpenAI. - **Progresso em Tempo Real**: O progresso da tradução é exibido em tempo real. - **Tratamento de Erros**: Se ocorrer um erro, a WebUI exibirá uma mensagem de erro com sugestões para resolução. #### Limitações - A WebUI pode não lidar eficientemente com arquivos PDF muito grandes (por exemplo, mais de 100 páginas). Para arquivos grandes, considere usar a [Interface de Linha de Comando](https://pdf2zh-next.com/getting-started/USAGE_cli.html). - A WebUI requer uma conexão com a internet para usar os serviços de tradução. - ### Notes & Best Practices: - **Check for Existing Translations**: Before starting a new translation, check the [Supported Languages](https://pdf2zh-next.com/getting-started/SUPPORTED_LANGUAGES.html) page to see if the language is already supported or if there's an ongoing effort. - **Use the Official Glossary**: To maintain consistency, always refer to the project's [official glossary](https://github.com/PDFMathTranslate/pdf2zh-next/blob/main/docs/GLOSSARY.md) for key terms. - **Consistency in Terminology**: Ensure that the same term is translated consistently throughout the documentation. - **Cultural Adaptation**: Adapt examples and references to be culturally relevant to the target audience when necessary. - **Keep It Simple**: Use clear and straightforward language. Avoid overly complex sentences. - **Test Your Translations**: After translating, test the functionality to ensure that the translated text works well in the application context. - **Collaborate**: Use pull requests and issues to collaborate with other translators and maintainers. ### Translation Style Guide 1. **Tone**: Maintain a professional and helpful tone. The documentation should be approachable yet authoritative. 2. **Voice**: Use active voice whenever possible to make the text more engaging and easier to understand. 3. **Punctuation**: Follow the punctuation rules of the target language. For example, in Chinese, use full-width punctuation marks. 4. **Formatting**: Preserve the original formatting, including code blocks, links, and headings. Only translate the textual content. 5. **Accessibility**: Ensure that the translation is accessible, using clear language and avoiding jargon unless it is well-defined. --- ### OUTPUT ### Notas e Melhores Práticas - **Verifique Traduções Existentes**: Antes de iniciar uma nova tradução, verifique a página [Idiomas Suportados](https://pdf2zh-next.com/getting-started/SUPPORTED_LANGUAGES.html) para ver se o idioma já é suportado ou se há um esforço em andamento. - **Use o Glossário Oficial**: Para manter a consistência, consulte sempre o [glossário oficial](https://github.com/PDFMathTranslate/pdf2zh-next/blob/main/docs/GLOSSARY.md) do projeto para termos-chave. - **Consistência na Terminologia**: Certifique-se de que o mesmo termo seja traduzido de forma consistente em toda a documentação. - **Adaptação Cultural**: Adapte exemplos e referências para serem culturalmente relevantes para o público-alvo quando necessário. - **Mantenha Simples**: Use linguagem clara e direta. Evite frases excessivamente complexas. - **Teste Suas Traduções**: Após traduzir, teste a funcionalidade para garantir que o texto traduzido funcione bem no contexto da aplicação. - **Colabore**: Use pull requests e issues para colaborar com outros tradutores e mantenedores. ### Guia de Estilo de Tradução 1. **Tom**: Mantenha um tom profissional e prestativo. A documentação deve ser acessível, mas autoritária. 2. **Voz**: Use voz ativa sempre que possível para tornar o texto mais envolvente e fácil de entender. 3. **Pontuação**: Siga as regras de pontuação do idioma de destino. Por exemplo, em português, use sinais de pontuação de largura total. 4. **Formatação**: Preserve a formatação original, incluindo blocos de código, links e cabeçalhos. Traduza apenas o conteúdo textual. 5. **Acessibilidade**: Certifique-se de que a tradução seja acessível, usando linguagem clara e evitando jargões, a menos que estejam bem definidos.
ru: - The `finish` event may be followed by a `stage_summary` event. - The `finish` event is only emitted for successful translations. - The `error` event is emitted for both translation failures and stream processing errors. --- ### TRANSLATION RESULT
