Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_2B98CF3B
source: | `--<Services>` | Use [**specific service**](./Documentation-of-Translation-Services.md) for translation | `pdf2zh_next example.pdf --openai`<br>`pdf2zh_next example.pdf --deepseek` |
de: | ------------------------------- | ------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--<Services>-<Config>` | Use [**specific service**](./Documentation-of-Translation-Services.md) with config | `pdf2zh_next example.pdf --openai --openai-api-key=xxx --openai-model=gpt-4o` | | `--<Services>-<Config>-<Proxy>` | Use [**specific service**](./Documentation-of-Translation-Services.md) with proxy | `pdf2zh_next example.pdf --openai --openai-api-key=xxx --openai-model=gpt-4o --openai-proxy=http://127.0.0.1:7890` | | `--<Services>-<Config>-<Proxy>` | Use [**specific service**](./Documentation-of-Translation-Services.md) with proxy | `pdf2zh_next example.pdf --openai --openai-api-key=xxx --openai-model=gpt-4o --openai-proxy=http://127.0.0.1:7890` | | `--<Services>-<Config>-<Proxy>` | Use [**specific service**](./Documentation-of-Translation-Services.md) with proxy | `pdf2zh_next example.pdf --openai --openai-api-key=xxx --openai-model=gpt-4o --openai-proxy=http://127.0.0.1:7890` | --- ### TRANSLATION RESULT | `--<Services>` | Verwenden Sie einen [**bestimmten Service**](./Documentation-of-Translation-Services.md) für die Übersetzung | `pdf2zh_next example.pdf --openai`<br>`pdf2zh_next example.pdf --deepseek` | | ------------------------------- | ------------------------------------------------------------------------------------------------------------ | --------------------------------------------------------------------------------------------------------------------- | | `--<Services>-<Config>` | Verwenden Sie einen [**bestimmten Service**](./Documentation-of-Translation-Services.md) mit Konfiguration | `pdf2zh_next example.pdf --openai --openai-api-key=xxx --openai-model=gpt-4o` | | `--<Services>-<Config>-<Proxy>` | Verwenden Sie einen [**bestimmten Service**](./Documentation-of-Translation-Services.md) mit Proxy | `pdf2zh_next example.pdf --openai --openai-api-key=xxx --openai-model=gpt-4o --openai-proxy=http://127.0.0.1:7890` | | `--<Services>-<Config>-<Proxy>` | Verwenden Sie einen [**bestimmten Service**](./Documentation-of-Translation-Services.md) mit Proxy | `pdf2zh_next example.pdf --openai --openai-api-key=xxx --openai-model=gpt-4o --openai-proxy=http://127.0.0.1:7890` | | `--<Services>-<Config>-<Proxy>` | Verwenden Sie einen [**bestimmten Service**](./Documentation-of-Translation-Services.md) mit Proxy | `pdf2zh_next example.pdf --openai --openai-api-key=xxx --openai-model=gpt-4o --openai-proxy=http://127.0.0.1:7890` |
fr: | ------------------------------- | -------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--<Services>-<Config>` | Set [**service config**](./Documentation-of-Translation-Services.md) | `pdf2zh_next example.pdf --openai-api-key <your api key>`<br>`pdf2zh_next example.pdf --openai-base-url <your base url>` | | `--cache-dir <path>` | Set cache directory for translation results | `pdf2zh_next example.pdf --cache-dir ./cache` | | `--no-cache` | Disable cache for translation results | `pdf2zh_next example.pdf --no-cache` | | `--target-lang <language code>` | Set target language, default is `zh` | `pdf2zh_next example.pdf --target-lang en` | --- ### OUTPUT | `--<Services>` | Utiliser un [**service spécifique**](./Documentation-of-Translation-Services.md) pour la traduction | `pdf2zh_next example.pdf --openai`<br>`pdf2zh_next example.pdf --deepseek` | | ------------------------------- | --------------------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--<Services>-<Config>` | Définir la [**configuration du service**](./Documentation-of-Translation-Services.md) | `pdf2zh_next example.pdf --openai-api-key <your api key>`<br>`pdf2zh_next example.pdf --openai-base-url <your base url>` | | `--cache-dir <path>` | Définir le répertoire de cache pour les résultats de traduction | `pdf2zh_next example.pdf --cache-dir ./cache` | | `--no-cache` | Désactiver le cache pour les résultats de traduction | `pdf2zh_next example.pdf --no-cache` | | `--target-lang <language code>` | Définir la langue cible, par défaut `zh` | `pdf2zh_next example.pdf --target-lang en` |
it: | ------------------------------- | -------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--<Languages>` | Use [**specific language**](./Supported-Languages.md) for translation | `pdf2zh_next example.pdf --lang ja`<br>`pdf2zh_next example.pdf --lang en` | | `--<Output>` | Specify the output file path | `pdf2zh_next example.pdf --output example_translated.pdf`<br>`pdf2zh_next example.pdf --output ./output/result.pdf` | | `--<Options>` | Use [**specific options**](./Advanced.md) for translation | `pdf2zh_next example.pdf --keep_format`<br>`pdf2zh_next example.pdf --keep_format --keep_latex` | --- ### LANGUAGE it
pt: | ------------------------------- | -------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--<Language Code>` | Specify the target [**language code**](./Supported-Languages.md) | `pdf2zh_next example.pdf --lang en`<br>`pdf2zh_next example.pdf --lang ru` | | `--<Advanced>` | Enable **advanced** options | `pdf2zh_next example.pdf --advanced` | | `--<Community>` | Enable **community** features | `pdf2zh_next example.pdf --community` | | `--faq` | Show **FAQ** page | `pdf2zh_next --faq` | | `--for-translators` | Show **translator guide** page | `pdf2zh_next --for-translators` | --- ### OUTPUT | `--<Services>` | Usar [**serviço específico**](./Documentation-of-Translation-Services.md) para tradução | `pdf2zh_next example.pdf --openai`<br>`pdf2zh_next example.pdf --deepseek` | | ------------------------------- | -------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--<Language Code>` | Especificar o [**código do idioma**](./Supported-Languages.md) de destino | `pdf2zh_next example.pdf --lang en`<br>`pdf2zh_next example.pdf --lang ru` | | `--<Advanced>` | Ativar opções **avançadas** | `pdf2zh_next example.pdf --advanced` | | `--<Community>` | Ativar recursos da **comunidade** | `pdf2zh_next example.pdf --community` | | `--faq` | Mostrar página de **perguntas frequentes** | `pdf2zh_next --faq` | | `--for-translators` | Mostrar página do **guia de contribuição para traduções** | `pdf2zh_next --for-translators` |
ru: | ------------------------------- | ------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--<Languages>` | Set source/target language | `pdf2zh_next example.pdf --source-lang en --target-lang zh` | | `--<Output>` | Set output file/folder name | `pdf2zh_next example.pdf --output example_translated.pdf`<br>`pdf2zh_next example.pdf --output-dir ./translated_pdfs` | | `--<Advanced>` | Set advanced options | `pdf2zh_next example.pdf --page 1-5,10`<br>`pdf2zh_next example.pdf --ocr` | --- ### OUTPUT | `--<Services>` | Использование [**специфического сервиса**](./Documentation-of-Translation-Services.md) для перевода | `pdf2zh_next example.pdf --openai`<br>`pdf2zh_next example.pdf --deepseek` | | ------------------------------- | --------------------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--<Languages>` | Установка исходного/целевого языка | `pdf2zh_next example.pdf --source-lang en --target-lang zh` | | `--<Output>` | Установка имени выходного файла/папки | `pdf2zh_next example.pdf --output example_translated.pdf`<br>`pdf2zh_next example.pdf --output-dir ./translated_pdfs` | | `--<Advanced>` | Установка расширенных параметров | `pdf2zh_next example.pdf --page 1-5,10`<br>`pdf2zh_next example.pdf --ocr` |
