Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_F076772C
source: > [!NOTE] > This documentation may contain AI-generated content. While we strive for accuracy, there might be inaccuracies. Please report any issues via: > > - [GitHub Issues](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/issues) > - Community contribution (PRs welcome!)
de: > > **Need help?** Join our [Discord Community](https://discord.gg/your-invite-link)! ## Installation ### Prerequisites - Python 3.8+ - `pip` (Python package manager) ### Install via pip ```bash pip install pdf2zh ``` ### Install from Source 1. Clone the repository: ```bash git clone https://github.com/PDFMathTranslate-next/PDFMathTranslate-next.git cd PDFMathTranslate-next ``` 2. Install dependencies: ```bash pip install -e . ``` ### Verify Installation ```bash pdf2zh --version ``` ## Quick Start ### Basic Usage 1. **Translate a PDF file**: ```bash pdf2zh translate input.pdf ``` This will create `input_translated.pdf` in the same directory. 2. **Specify output file**: ```bash pdf2zh translate input.pdf -o output.pdf ``` 3. **Translate to different language**: ```bash pdf2zh translate input.pdf -l en # English translation ``` ### Web Interface Launch the web UI: ```bash pdf2zh web ``` Then open `http://localhost:8501` in your browser. ## Advanced Usage ### Configuration File Create `config.yaml`: ```yaml translation_service: "google" target_language: "zh" api_key: "your_api_key" ``` Use config file: ```bash pdf2zh translate input.pdf -c config.yaml ``` ### Batch Processing Process multiple files: ```bash pdf2zh batch-translate *.pdf ``` ### API Usage ```python from pdf2zh import PDFTranslator translator = PDFTranslator() result = translator.translate("input.pdf") print(result.text) ``` ## Supported Languages The tool supports translation between these languages: | Language | Code | |----------|------| | Chinese | `zh` | | English | `en` | | Japanese | `ja` | | Korean | `ko` | | French | `fr` | | German | `de` | | Spanish | `es` | See [Supported Languages](supported_languages.md) for complete list. ## Troubleshooting ### Common Issues 1. **Missing Dependencies**: ```bash pip install -r requirements.txt ``` 2. **API Key Errors**: - Ensure correct API key configuration - Check service quotas 3. **PDF Extraction Issues**: - Try with different PDF engines - Check PDF file permissions ### Getting Help - Check [FAQ](faq.md) - Join [Discord Community](https://discord.gg/your-invite-link) - Create [GitHub Issue](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/issues) ## Contributing We welcome contributions! Please see: - [Contributing Guide](contributing.md) - [Code of Conduct](code_of_conduct.md) ## License MIT License - see [LICENSE](LICENSE) file for details. --- > [!TIP] > For the best experience: > > - Use high-quality PDFs with clear text > - Ensure sufficient API quotas for translation services > - Process large documents in batches --- ### TRANSLATION RESULT > [!NOTE] > Diese Dokumentation kann KI-generierte Inhalte enthalten. Obwohl wir auf Genauigkeit achten, können Ungenauigkeiten auftreten. Bitte melden Sie etwaige Probleme über: > > - [GitHub Issues](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/issues) > - Gemeinschaftsbeiträge (PRs willkommen!) > > **Brauchen Sie Hilfe?** Treten Sie unserer [Discord Community](https://discord.gg/your-invite-link) bei! ## Installation ### Voraussetzungen - Python 3.8+ - `pip` (Python-Paketmanager) ### Installation über pip ```bash pip install pdf2zh ``` ### Installation von der Quelle 1. Repository klonen: ```bash git clone https://github.com/PDFMathTranslate-next/PDFMathTranslate-next.git cd PDFMathTranslate-next ``` 2. Abhängigkeiten installieren: ```bash pip install -e . ``` ### Installation überprüfen ```bash pdf2zh --version ``` ## Erste Schritte ### Grundlegende Verwendung 1. **Eine PDF-Datei übersetzen**: ```bash pdf2zh translate input.pdf ``` Dies erstellt `input_translated.pdf` im gleichen Verzeichnis. 2. **Ausgabedatei angeben**: ```bash pdf2zh translate input.pdf -o output.pdf ``` 3. **In eine andere Sprache übersetzen**: ```bash pdf2zh translate input.pdf -l en # Englische Übersetzung ``` ### Weboberfläche Starten Sie die Web-Oberfläche: ```bash pdf2zh web ``` Öffnen Sie dann `http://localhost:8501` in Ihrem Browser. ## Erweiterte Verwendung ### Konfigurationsdatei Erstellen Sie `config.yaml`: ```yaml translation_service: "google" target_language: "zh" api_key: "your_api_key" ``` Verwenden Sie die Konfigurationsdatei: ```bash pdf2zh translate input.pdf -c config.yaml ``` ### Stapelverarbeitung Mehrere Dateien verarbeiten: ```bash pdf2zh batch-translate *.pdf ``` ### API-Verwendung ```python from pdf2zh import PDFTranslator translator = PDFTranslator() result = translator.translate("input.pdf") print(result.text) ``` ## Unterstützte Sprachen Das Tool unterstützt die Übersetzung zwischen diesen Sprachen: | Sprache | Code | |---------|------| | Chinesisch | `zh` | | Englisch | `en` | | Japanisch | `ja` | | Koreanisch | `ko` | | Französisch | `fr` | | Deutsch | `de` | | Spanisch | `es` | Siehe [Unterstützte Sprachen](supported_languages.md) für die vollständige Liste. ## Fehlerbehebung ### Häufige Probleme 1. **Fehlende Abhängigkeiten**: ```bash pip install -r requirements.txt ``` 2. **API-Schlüssel-Fehler**: - Stellen Sie die korrekte API-Schlüssel-Konfiguration sicher - Überprüfen Sie die Service-Kontingente 3. **PDF-Extraktionsprobleme**: - Versuchen Sie es mit verschiedenen PDF-Engines - Überprüfen Sie die PDF-Dateiberechtigungen ### Hilfe erhalten - Lesen Sie [FAQ](faq.md) - Treten Sie der [Discord Community](https://discord.gg/your-invite-link) bei - Erstellen Sie ein [GitHub Issue](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/issues) ## Mitwirken Wir freuen uns über Beiträge! Bitte lesen Sie: - [Contributing Guide](contributing.md) - [Code of Conduct](code_of_conduct.md) ## Lizenz MIT-Lizenz - siehe [LICENSE](LICENSE)-Datei für Details. --- > [!TIP] > Für die beste Erfahrung: > > - Verwenden Sie hochwertige PDFs mit klarem Text > - Stellen Sie ausreichende API-Kontingente für Übersetzungsdienste sicher > - Verarbeiten Sie große Dokumente in Stapeln
fr: > > Thank you for your understanding and support! ### Quick Links - [Home](https://pdf2zh-next.com/) - [Getting Started](https://pdf2zh-next.com/getting-started/) - [Command Line](https://pdf2zh-next.com/getting-started/CLI.html) - [WebUI](https://pdf2zh-next.com/getting-started/USAGE_webui.html) - [Supported Languages](https://pdf2zh-next.com/advanced/LANGUAGE.html) - [FAQ](https://pdf2zh-next.com/community/FAQ.html) - [For Translators](https://pdf2zh-next.com/community/CONTRIBUTING_translation.html) --- ### OUTPUT LANGUAGE fr --- ### OUTPUT > [!NOTE] > Cette documentation peut contenir du contenu généré par IA. Bien que nous nous efforcions d'être précis, il peut y avoir des inexactitudes. Veuillez signaler tout problème via : > > - [Problèmes GitHub](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/issues) > - Contribution communautaire (les PR sont les bienvenues !) > > Merci pour votre compréhension et votre soutien ! ### Liens rapides - [Accueil](https://pdf2zh-next.com/) - [Commencer](https://pdf2zh-next.com/getting-started/) - [Ligne de commande](https://pdf2zh-next.com/getting-started/CLI.html) - [WebUI](https://pdf2zh-next.com/getting-started/USAGE_webui.html) - [Langues supportées](https://pdf2zh-next.com/advanced/LANGUAGE.html) - [FAQ](https://pdf2zh-next.com/community/FAQ.html) - [Guide de contribution des traductions](https://pdf2zh-next.com/community/CONTRIBUTING_translation.html)
it: > > For more information, read our [Documentation Guide](https://pdf2zh.com/docs/guide). --- ### TRANSLATION RESULT > [!NOTE] > Questa documentazione potrebbe contenere contenuti generati da AI. Sebbene ci sforziamo per l'accuratezza, potrebbero esserci imprecisioni. Si prega di segnalare eventuali problemi tramite: > > - [GitHub Issues](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/issues) > - Contributo della comunità (PR benvenuti!) > > Per ulteriori informazioni, leggi la nostra [Guida alla documentazione](https://pdf2zh.com/docs/guide).
pt: > > For details, see [Translation Contribution Guide](https://pdf2zh-next.com/community/FOR_TRANSLATORS.html). --- ### OUTPUT > [!NOTE] > Esta documentação pode conter conteúdo gerado por IA. Embora nos esforcemos pela precisão, podem ocorrer imprecisões. Por favor, reporte quaisquer problemas através de: > > - [GitHub Issues](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/issues) > - Contribuição da comunidade (PRs são bem-vindos!) > > Para detalhes, consulte o [Guia de Contribuição para Traduções](https://pdf2zh-next.com/community/FOR_TRANSLATORS.html).
ru: > > For more details, please read our [Documentation Contribution Guide](./CONTRIBUTING_DOCS.md). --- ### TRANSLATION RESULT > [!NOTE] > Эта документация может содержать контент, созданный искусственным интеллектом. Хотя мы стремимся к точности, могут быть неточности. Пожалуйста, сообщайте о любых проблемах через: > > - [Проблемы на GitHub](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/issues) > - Вклад сообщества (PR приветствуются!) > > Для получения дополнительной информации прочитайте наше [Руководство по внесению вклада в документацию](./CONTRIBUTING_DOCS.md). --- ### ORIGINAL TEXT # Getting Started This guide will help you get started with pdf2zh. You can choose to use the **Command Line Interface (CLI)**, the **Web User Interface (WebUI)**, or the **Python API**. ## Using the CLI The CLI is the most powerful way to use pdf2zh. It supports all features and is suitable for batch processing. ### Installation See [Installation](./INSTALLATION.md) for detailed instructions. ### Basic Usage ```bash pdf2zh input.pdf output.pdf ``` This command will translate `input.pdf` to Chinese and save it as `output.pdf`. ### Advanced Usage You can specify the source and target languages, page range, and more: ```bash pdf2zh input.pdf output.pdf --from en --to zh --pages 1-5,10 ``` For more options, see [Command Line Usage](./USAGE_cli.md). ## Using the WebUI The WebUI provides a user-friendly interface for translating PDF files. ### Accessing the WebUI After installing pdf2zh, run: ```bash pdf2zh --web ``` Then open your browser and go to `http://localhost:7860`. ### Basic Usage 1. Upload a PDF file. 2. Select the target language. 3. Click "Translate". 4. Download the translated file. For more details, see [WebUI Usage](./USAGE_webui.md). ## Using the Python API The Python API allows you to integrate pdf2zh into your own applications. ### Installation Install the package: ```bash pip install pdf2zh ``` ### Basic Usage ```python from pdf2zh import pdf2zh pdf2zh("input.pdf", "output.pdf") ``` ### Async Usage For asynchronous operations, use: ```python import asyncio from pdf2zh import pdf2zh_async async def main(): await pdf2zh_async("input.pdf", "output.pdf") asyncio.run(main()) ``` For more details, see [Python API Usage](./USAGE_python.md). ## Next Steps - Learn about [Advanced Features](./ADVANCED.md) - Check the [Supported Languages](./SUPPORTED_LANGUAGES.md) - Join the [Community](./COMMUNITY.md) for help and discussions - Read the [FAQ](./FAQ.md) for common questions --- ### OUTPUT LANGUAGE ru --- ### TRANSLATION # Начало работы Это руководство поможет вам начать работу с pdf2zh. Вы можете выбрать использование **Интерфейса командной строки (CLI)**, **Веб-интерфейса пользователя (WebUI)** или **Python API**. ## Использование CLI CLI — это самый мощный способ использования pdf2zh. Он поддерживает все функции и подходит для пакетной обработки. ### Установка См. [Установка](./INSTALLATION.md) для получения подробных инструкций. ### Базовое использование ```bash pdf2zh input.pdf output.pdf ``` Эта команда переведет `input.pdf` на китайский язык и сохранит его как `output.pdf`. ### Расширенное использование Вы можете указать исходный и целевой языки, диапазон страниц и многое другое: ```bash pdf2zh input.pdf output.pdf --from en --to zh --pages 1-5,10 ``` Для получения дополнительных опций см. [Использование командной строки](./USAGE_cli.md). ## Использование WebUI WebUI предоставляет удобный интерфейс для перевода PDF-файлов. ### Доступ к WebUI После установки pdf2zh выполните: ```bash pdf2zh --web ``` Затем откройте браузер и перейдите по адресу `http://localhost:7860`. ### Базовое использование 1. Загрузите PDF-файл. 2. Выберите целевой язык. 3. Нажмите «Перевести». 4. Скачайте переведенный файл. Для получения дополнительной информации см. [Использование WebUI](./USAGE_webui.md). ## Использование Python API Python API позволяет интегрировать pdf2zh в ваши собственные приложения. ### Установка Установите пакет: ```bash pip install pdf2zh ``` ### Базовое использование ```python from pdf2zh import pdf2zh pdf2zh("input.pdf", "output.pdf") ``` ### Асинхронное использование Для асинхронных операций используйте: ```python import asyncio from pdf2zh import pdf2zh_async async def main(): await pdf2zh_async("input.pdf", "output.pdf") asyncio.run(main()) ``` Для получения дополнительной информации см. [Использование Python API](./USAGE_python.md). ## Следующие шаги - Узнайте о [Расширенных функциях](./ADVANCED.md) - Проверьте [Поддерживаемые языки](./SUPPORTED_LANGUAGES.md) - Присоединяйтесь к [Сообществу](./COMMUNITY.md) для получения помощи и обсуждений - Прочитайте [FAQ](./FAQ.md) для ответов на распространенные вопросы
