Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_A3B72E30
source: | `--report-interval` | Progress report interval in seconds | `pdf2zh_next example.pdf --report-interval 5` |
de: `5` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | -------------------------------------------------------------------------------------- | | `--save-interval` | Save interval in seconds | `pdf2zh_next example.pdf --save-interval 5` | `5` | | `--skip-upload` | Skip Uploading, only process local files | `pdf2zh_next example.pdf --skip-upload` | `False` | | `--skip-download` | Skip Downloading, only process online files | `pdf2zh_next example.pdf --skip-download` | `False` | | `--skip-process` | Skip Processing, only upload or download | `pdf2zh_next example.pdf --skip-process` | `False` | | `--skip-save` | Skip Saving, only process without saving | `pdf2zh_next example.pdf --skip-save` | `False` | | `--skip-clean` | Skip Cleaning, keep temporary files | `pdf2zh_next example.pdf --skip-clean` | `False` | | `--skip-ocr` | Skip OCR, only process text | `pdf2zh_next example.pdf --skip-ocr` | `False` | | `--skip-translate` | Skip Translate, only process OCR | `pdf2zh_next example.pdf --skip-translate` | `False` | | `--skip-merge` | Skip Merge, only process without merging | `pdf2zh_next example.pdf --skip-merge` | `False` | --- ### OUTPUT | `--report-interval` | Fortschrittsberichtsintervall in Sekunden | `pdf2zh_next example.pdf --report-interval 5` | `5` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | -------------------------------------------------------------------------------------- | | `--save-interval` | Speicherintervall in Sekunden | `pdf2zh_next example.pdf --save-interval 5` | `5` | | `--skip-upload` | Hochladen überspringen, nur lokale Dateien verarbeiten | `pdf2zh_next example.pdf --skip-upload` | `False` | | `--skip-download` | Herunterladen überspringen, nur Online-Dateien verarbeiten | `pdf2zh_next example.pdf --skip-download` | `False` | | `--skip-process` | Verarbeitung überspringen, nur hochladen oder herunterladen | `pdf2zh_next example.pdf --skip-process` | `False` | | `--skip-save` | Speichern überspringen, nur verarbeiten ohne zu speichern | `pdf2zh_next example.pdf --skip-save` | `False` | | `--skip-clean` | Bereinigen überspringen, temporäre Dateien behalten | `pdf2zh_next example.pdf --skip-clean` | `False` | | `--skip-ocr` | OCR überspringen, nur Text verarbeiten | `pdf2zh_next example.pdf --skip-ocr` | `False` | | `--skip-translate` | Übersetzung überspringen, nur OCR verarbeiten | `pdf2zh_next example.pdf --skip-translate` | `False` | | `--skip-merge` | Zusammenführen überspringen, nur verarbeiten ohne Zusammenführung | `pdf2zh_next example.pdf --skip-merge` | `False` |
fr: `5` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | ---------------------------------------------------------------- | | `--concurrency` | Number of concurrent translation tasks | `pdf2zh_next example.pdf --concurrency 5` | `5` | | `--gpt-request-interval` | Interval in seconds between requests to GPT API | `pdf2zh_next example.pdf --gpt-request-interval 5` | `5` | | `--rate-limit` | Rate limit for translation requests (requests per minute) | `pdf2zh_next example.pdf --rate-limit 60` | `60` | | `--max-retries` | Maximum number of retries for failed translation requests | `pdf2zh_next example.pdf --max-retries 5` | `5` | | `--timeout` | Timeout in seconds for each translation request | `pdf2zh_next example.pdf --timeout 30` | `30` | | `--ignore-errors` | Continue processing even if translation errors occur | `pdf2zh_next example.pdf --ignore-errors` | `false` | | `--retry-wait` | Wait time in seconds before retrying a failed request | `pdf2zh_next example.pdf --retry-wait 5` | `5` | | `--batch-size` | Number of text segments to process in each batch | `pdf2zh_next example.pdf --batch-size 10` | `10` | | `--max-requests` | Maximum number of requests to make (for testing) | `pdf2zh_next example.pdf --max-requests 100` | `100` | | `--dry-run` | Simulate the process without making actual API calls | `pdf2zh_next example.pdf --dry-run` | `false` | | `--resume` | Resume from the last checkpoint | `pdf2zh_next example.pdf --resume` | `false` | | `--checkpoint-interval` | Interval in seconds for saving checkpoints | `pdf2zh_next example.pdf --checkpoint-interval 300` | `300` | | `--log-level` | Log level (debug, info, warning, error, critical) | `pdf2zh_next example.pdf --log-level info` | `info` | | `--log-file` | File path to save logs | `pdf2zh_next example.pdf --log-file output.log` | `output.log` | | `--quiet` | Suppress all output except errors | `pdf2zh_next example.pdf --quiet` | `false` | | `--version` | Show version information and exit | `pdf2zh_next --version` | `false` | | `--help` | Show help message and exit | `pdf2zh_next --help` | `false` | --- ### TRANSLATION RESULT | `--report-interval` | Intervalle de rapport de progression en secondes | `pdf2zh_next example.pdf --report-interval 5` | `5` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | ---------------------------------------------------------------- | | `--concurrency` | Nombre de tâches de traduction simultanées | `pdf2zh_next example.pdf --concurrency 5` | `5` | | `--gpt-request-interval` | Intervalle en secondes entre les requêtes à l'API GPT | `pdf2zh_next example.pdf --gpt-request-interval 5` | `5` | | `--rate-limit` | Limite de débit pour les requêtes de traduction (requêtes par minute) | `pdf2zh_next example.pdf --rate-limit 60` | `60` | | `--max-retries` | Nombre maximum de tentatives pour les requêtes de traduction échouées | `pdf2zh_next example.pdf --max-retries 5` | `5` | | `--timeout` | Délai d'attente en secondes pour chaque requête de traduction | `pdf2zh_next example.pdf --timeout 30` | `30` | | `--ignore-errors` | Continuer le traitement même si des erreurs de traduction se produisent | `pdf2zh_next example.pdf --ignore-errors` | `false` | | `--retry-wait` | Temps d'attente en secondes avant de réessayer une requête échouée | `pdf2zh_next example.pdf --retry-wait 5` | `5` | | `--batch-size` | Nombre de segments de texte à traiter dans chaque lot | `pdf2zh_next example.pdf --batch-size 10` | `10` | | `--max-requests` | Nombre maximum de requêtes à effectuer (pour les tests) | `pdf2zh_next example.pdf --max-requests 100` | `100` | | `--dry-run` | Simuler le processus sans effectuer d'appels API réels | `pdf2zh_next example.pdf --dry-run` | `false` | | `--resume` | Reprendre à partir du dernier point de contrôle | `pdf2zh_next example.pdf --resume` | `false` | | `--checkpoint-interval` | Intervalle en secondes pour enregistrer les points de contrôle | `pdf2zh_next example.pdf --checkpoint-interval 300` | `300` | | `--log-level` | Niveau de journalisation (debug, info, warning, error, critical) | `pdf2zh_next example.pdf --log-level info` | `info` | | `--log-file` | Chemin du fichier pour enregistrer les journaux | `pdf2zh_next example.pdf --log-file output.log` | `output.log` | | `--quiet` | Supprimer toute sortie sauf les erreurs | `pdf2zh_next example.pdf --quiet` | `false` | | `--version` | Afficher les informations de version et quitter | `pdf2zh_next --version` | `false` | | `--help` | Afficher le message d'aide et quitter | `pdf2zh_next --help` | `false` |
it: | :------------------------------ | :-------------------------------------------------------------------------------------- | :--------------------------------------------------------------------------------------------------------------------- | | `--report-interval` | Intervallo di segnalazione dei progressi in secondi | `pdf2zh_next example.pdf --report-interval 5` | --- ### TARGET LANGUAGE it
pt: `1` | |---------------------------------|-----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------|-----------| | `--max-file-size` | Maximum file size (in MB) for translation | `pdf2zh_next example.pdf --max-file-size 10` | `10` | | `--max-pages` | Maximum number of pages to translate | `pdf2zh_next example.pdf --max-pages 5` | `100` | | `--ignore-images` | Do not process images | `pdf2zh_next example.pdf --ignore-images` | `false` | | `--ignore-equations` | Do not process equations | `pdf2zh_next example.pdf --ignore-equations` | `false` | | `--ignore-tables` | Do not process tables | `pdf2zh_next example.pdf --ignore-tables` | `false` | | `--ignore-code-blocks` | Do not process code blocks | `pdf2zh_next example.pdf --ignore-code-blocks` | `false` | | `--ignore-text-outside-body` | Do not translate text outside the body of the document (e.g., headers, footers, etc.) | `pdf2zh_next example.pdf --ignore-text-outside-body` | `false` | | `--ignore-figure-captions` | Do not translate figure captions | `pdf2zh_next example.pdf --ignore-figure-captions` | `false` | | `--ignore-table-captions` | Do not translate table captions | `pdf2zh_next example.pdf --ignore-table-captions` | `false` | | `--ignore-abstract` | Do not translate abstract section | `pdf2zh_next example.pdf --ignore-abstract` | `false` | | `--ignore-references` | Do not translate references section | `pdf2zh_next example.pdf --ignore-references` | `false` | | `--ignore-footnotes` | Do not translate footnotes | `pdf2zh_next example.pdf --ignore-footnotes` | `false` | | `--ignore-appendix` | Do not translate appendix section | `pdf2zh_next example.pdf --ignore-appendix` | `false` | | `--ignore-document-metadata` | Do not translate document metadata (e.g., title, author, etc.) | `pdf2zh_next example.pdf --ignore-document-metadata` | `false` | | `--ignore-document-properties` | Do not translate document properties (e.g., subject, keywords, etc.) | `pdf2zh_next example.pdf --ignore-document-properties` | `false` | | `--ignore-watermarks` | Do not translate watermarks | `pdf2zh_next example.pdf --ignore-watermarks` | `false` | | `--ignore-annotations` | Do not translate annotations (e.g., comments, highlights, etc.) | `pdf2zh_next example.pdf --ignore-annotations` | `false` | --- ### OUTPUT | `--report-interval` | Intervalo do relatório de progresso em segundos | `pdf2zh_next exemplo.pdf --report-interval 5` | `1` | |---------------------------------|-----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------|-----------| | `--max-file-size` | Tamanho máximo do arquivo (em MB) para tradução | `pdf2zh_next exemplo.pdf --max-file-size 10` | `10` | | `--max-pages` | Número máximo de páginas para traduzir | `pdf2zh_next exemplo.pdf --max-pages 5` | `100` | | `--ignore-images` | Não processar imagens | `pdf2zh_next exemplo.pdf --ignore-images` | `false` | | `--ignore-equations` | Não processar equações | `pdf2zh_next exemplo.pdf --ignore-equations` | `false` | | `--ignore-tables` | Não processar tabelas | `pdf2zh_next exemplo.pdf --ignore-tables` | `false` | | `--ignore-code-blocks` | Não processar blocos de código | `pdf2zh_next exemplo.pdf --ignore-code-blocks` | `false` | | `--ignore-text-outside-body` | Não traduzir texto fora do corpo do documento (por exemplo, cabeçalhos, rodapés, etc.) | `pdf2zh_next exemplo.pdf --ignore-text-outside-body` | `false` | | `--ignore-figure-captions` | Não traduzir legendas de figuras | `pdf2zh_next exemplo.pdf --ignore-figure-captions` | `false` | | `--ignore-table-captions` | Não traduzir legendas de tabelas | `pdf2zh_next exemplo.pdf --ignore-table-captions` | `false` | | `--ignore-abstract` | Não traduzir seção de resumo | `pdf2zh_next exemplo.pdf --ignore-abstract` | `false` | | `--ignore-references` | Não traduzir seção de referências | `pdf2zh_next exemplo.pdf --ignore-references` | `false` | | `--ignore-footnotes` | Não traduzir notas de rodapé | `pdf2zh_next exemplo.pdf --ignore-footnotes` | `false` | | `--ignore-appendix` | Não traduzir seção de apêndice | `pdf2zh_next exemplo.pdf --ignore-appendix` | `false` | | `--ignore-document-metadata` | Não traduzir metadados do documento (por exemplo, título, autor, etc.) | `pdf2zh_next exemplo.pdf --ignore-document-metadata` | `false` | | `--ignore-document-properties` | Não traduzir propriedades do documento (por exemplo, assunto, palavras-chave, etc.) | `pdf2zh_next exemplo.pdf --ignore-document-properties` | `false` | | `--ignore-watermarks` | Não traduzir marcas d'água | `pdf2zh_next exemplo.pdf --ignore-watermarks` | `false` | | `--ignore-annotations` | Não traduzir anotações (por exemplo, comentários, destaques, etc.) | `pdf2zh_next exemplo.pdf --ignore-annotations` | `false` |
ru: `5` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------- | | `--report-interval:milliseconds` | Progress report interval in milliseconds | `pdf2zh_next example.pdf --report-interval:milliseconds 5000` | `5000` | | `--report-interval:seconds` | Progress report interval in seconds | `pdf2zh_next example.pdf --report-interval:seconds 5` | `5` | | `--report-interval:minutes` | Progress report interval in minutes | `pdf2zh_next example.pdf --report-interval:minutes 1` | `1` | | `--report-interval:hours` | Progress report interval in hours | `pdf2zh_next example.pdf --report-interval:hours 1` | `1` | --- ### OUTPUT | `--report-interval` | Интервал отчёта о прогрессе в секундах | `pdf2zh_next example.pdf --report-interval 5` | `5` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------- | | `--report-interval:milliseconds` | Интервал отчёта о прогрессе в миллисекундах | `pdf2zh_next example.pdf --report-interval:milliseconds 5000` | `5000` | | `--report-interval:seconds` | Интервал отчёта о прогрессе в секундах | `pdf2zh_next example.pdf --report-interval:seconds 5` | `5` | | `--report-interval:minutes` | Интервал отчёта о прогрессе в минутах | `pdf2zh_next example.pdf --report-interval:minutes 1` | `1` | | `--report-interval:hours` | Интервал отчёта о прогрессе в часах | `pdf2zh_next example.pdf --report-interval:hours 1` | `1` |
