Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_2DBF0B10
source: ### Translation Engine Support Policy
de: pdf2zh supports multiple translation engines. Each engine has different characteristics, including speed, quality, and cost. We recommend using different engines for different scenarios. #### **Recommended Engine:** - **`google`**: Free, fast, and high-quality. Recommended for most scenarios. - **`azure`**: Paid, high-quality, supports more languages. Recommended for scenarios requiring high translation quality. - **`gpt-3.5-turbo`**: Paid, high-quality, supports more languages. Recommended for scenarios requiring high translation quality. - **`gpt-4`**: Paid, best quality, supports more languages. Recommended for scenarios requiring the highest translation quality. #### **Other Engines:** - **`google_cloud`**: Paid, high-quality, supports more languages. The paid version of Google Translate. - **`deepl`**: Paid, high-quality, supports fewer languages. Recommended for European languages. - **`youdao`**: Paid, average quality, supports more languages. Recommended for scenarios where cost is a concern. - **`baidu`**: Paid, average quality, supports more languages. Recommended for scenarios where cost is a concern. - **`volcengine`**: Paid, average quality, supports more languages. Recommended for scenarios where cost is a concern. - **`caiyun`**: Free, average quality, supports fewer languages. Recommended for scenarios where cost is a concern. - **`nllb`**: Free, average quality, supports more languages. Open-source model, requires local deployment. - **`offline`**: Free, poor quality, supports more languages. Open-source model, requires local deployment. #### **Engine Comparison Table:** | Engine | Free/Paid | Speed | Quality | Language Support | Notes | |--------|-----------|-------|---------|------------------|-------| | `google` | Free | Fast | High | Many | Recommended for most scenarios | | `azure` | Paid | Fast | High | Many | Recommended for high-quality scenarios | | `gpt-3.5-turbo` | Paid | Medium | High | Many | Recommended for high-quality scenarios | | `gpt-4` | Paid | Slow | Highest | Many | Recommended for highest quality scenarios | | `google_cloud` | Paid | Fast | High | Many | Paid version of Google Translate | | `deepl` | Paid | Fast | High | Few | Recommended for European languages | | `youdao` | Paid | Fast | Average | Many | Recommended for cost-sensitive scenarios | | `baidu` | Paid | Fast | Average | Many | Recommended for cost-sensitive scenarios | | `volcengine` | Paid | Fast | Average | Many | Recommended for cost-sensitive scenarios | | `caiyun` | Free | Fast | Average | Few | Recommended for cost-sensitive scenarios | | `nllb` | Free | Slow | Average | Many | Open-source, requires local deployment | | `offline` | Free | Slow | Poor | Many | Open-source, requires local deployment | #### **Notes:** 1. The free engines (`google`, `caiyun`, `nllb`, `offline`) may have usage limits. If you encounter issues, consider using a paid engine. 2. The quality of the `offline` engine is poor and not recommended for production use. 3. For the `nllb` and `offline` engines, you need to deploy the model locally. Refer to the [Offline Model Deployment Documentation](https://pdf2zh-next.com/advanced/offline_model.html) for details. --- ### TRANSLATION RESULT ### Richtlinie zur Unterstützung von Übersetzungs-Engines pdf2zh unterstützt mehrere Übersetzungs-Engines. Jede Engine hat unterschiedliche Eigenschaften, einschließlich Geschwindigkeit, Qualität und Kosten. Wir empfehlen, je nach Szenario verschiedene Engines zu verwenden. #### **Empfohlene Engines:** - **`google`**: Kostenlos, schnell und von hoher Qualität. Empfohlen für die meisten Szenarien. - **`azure`**: Bezahlt, hohe Qualität, unterstützt mehr Sprachen. Empfohlen für Szenarien, die hohe Übersetzungsqualität erfordern. - **`gpt-3.5-turbo`**: Bezahlt, hohe Qualität, unterstützt mehr Sprachen. Empfohlen für Szenarien, die hohe Übersetzungsqualität erfordern. - **`gpt-4`**: Bezahlt, beste Qualität, unterstützt mehr Sprachen. Empfohlen für Szenarien, die die höchste Übersetzungsqualität erfordern. #### **Andere Engines:** - **`google_cloud`**: Bezahlt, hohe Qualität, unterstützt mehr Sprachen. Die bezahlte Version von Google Translate. - **`deepl`**: Bezahlt, hohe Qualität, unterstützt weniger Sprachen. Empfohlen für europäische Sprachen. - **`youdao`**: Bezahlt, durchschnittliche Qualität, unterstützt mehr Sprachen. Empfohlen für Szenarien, bei denen die Kosten eine Rolle spielen. - **`baidu`**: Bezahlt, durchschnittliche Qualität, unterstützt mehr Sprachen. Empfohlen für Szenarien, bei denen die Kosten eine Rolle spielen. - **`volcengine`**: Bezahlt, durchschnittliche Qualität, unterstützt mehr Sprachen. Empfohlen für Szenarien, bei denen die Kosten eine Rolle spielen. - **`caiyun`**: Kostenlos, durchschnittliche Qualität, unterstützt weniger Sprachen. Empfohlen für Szenarien, bei denen die Kosten eine Rolle spielen. - **`nllb`**: Kostenlos, durchschnittliche Qualität, unterstützt mehr Sprachen. Open-Source-Modell, erfordert lokale Bereitstellung. - **`offline`**: Kostenlos, schlechte Qualität, unterstützt mehr Sprachen. Open-Source-Modell, erfordert lokale Bereitstellung. #### **Engine-Vergleichstabelle:** | Engine | Kostenlos/Bezahlt | Geschwindigkeit | Qualität | Sprachunterstützung | Hinweise | |--------|-----------|-------|---------|------------------|-------| | `google` | Kostenlos | Schnell | Hoch | Viele | Empfohlen für die meisten Szenarien | | `azure` | Bezahlt | Schnell | Hoch | Viele | Empfohlen für hochwertige Szenarien | | `gpt-3.5-turbo` | Bezahlt | Mittel | Hoch | Viele | Empfohlen für hochwertige Szenarien | | `gpt-4` | Bezahlt | Langsam | Höchste | Viele | Empfohlen für Szenarien mit höchster Qualität | | `google_cloud` | Bezahlt | Schnell | Hoch | Viele | Bezahlte Version von Google Translate | | `deepl` | Bezahlt | Schnell | Hoch | Wenige | Empfohlen für europäische Sprachen | | `youdao` | Bezahlt | Schnell | Durchschnittlich | Viele | Empfohlen für kostensensitive Szenarien | | `baidu` | Bezahlt | Schnell | Durchschnittlich | Viele | Empfohlen für kostensensitive Szenarien | | `volcengine` | Bezahlt | Schnell | Durchschnittlich | Viele | Empfohlen für kostensensitive Szenarien | | `caiyun` | Kostenlos | Schnell | Durchschnittlich | Wenige | Empfohlen für kostensensitive Szenarien | | `nllb` | Kostenlos | Langsam | Durchschnittlich | Viele | Open-Source, erfordert lokale Bereitstellung | | `offline` | Kostenlos | Langsam | Schlecht | Viele | Open-Source, erfordert lokale Bereitstellung | #### **Hinweise:** 1. Die kostenlosen Engines (`google`, `caiyun`, `nllb`, `offline`) können Nutzungsbeschränkungen haben. Wenn Sie auf Probleme stoßen, ziehen Sie in Betracht, eine bezahlte Engine zu verwenden. 2. Die Qualität der `offline`-Engine ist schlecht und wird nicht für den Produktionseinsatz empfohlen. 3. Für die `nllb`- und `offline`-Engines müssen Sie das Modell lokal bereitstellen. Weitere Details finden Sie in der [Dokumentation zur Offline-Modellbereitstellung](https://pdf2zh-next.com/advanced/offline_model.html).
fr: --- #### Translation Engine Support Policy pdf2zh provides a unified interface for various translation engines. Currently, we support: - **Google Translate**: Free, supports most languages, but may be unstable. - **DeepL Translate**: High accuracy, supports some languages, free version has usage limits. - **OpenAI Translator**: High accuracy, supports most languages, requires API key. - **Gemini Translator**: High accuracy, supports most languages, requires API key. #### Notes on Translation Engine Usage - You can configure multiple engines and set priorities. If one engine fails, it will automatically switch to the next one. - If you need to use a paid service (such as DeepL Pro), please configure the API key in the settings. #### How to Choose a Translation Engine? - **For beginners**: It is recommended to use Google Translate or DeepL Translate (free version). - **For professional users**: It is recommended to use DeepL Pro or OpenAI Translator for higher translation quality. - **For developers**: All engines support API calls, and you can extend custom engines. #### Supported Languages Each engine supports different languages. For details, please refer to: - [Google Translate Supported Languages](https://cloud.google.com/translate/docs/languages) - [DeepL Translate Supported Languages](https://www.deepl.com/docs-api/translating-text/) - [OpenAI Translator Supported Languages](https://platform.openai.com/docs/guides/text-to-speech) #### Troubleshooting - If translation fails, please check your network connection and API key configuration. - If you encounter a usage limit, try switching to another engine or wait for a while before retrying. #### Feedback and Suggestions If you have any questions or suggestions about translation engines, please submit feedback via [GitHub Issues](https://github.com/your-repo/issues). --- ### OUTPUT LANGUAGE CODE fr --- ### OUTPUT ### Politique de support des moteurs de traduction --- #### Politique de support des moteurs de traduction pdf2zh fournit une interface unifiée pour divers moteurs de traduction. Actuellement, nous supportons : - **Google Translate** : Gratuit, supporte la plupart des langues, mais peut être instable. - **DeepL Translate** : Haute précision, supporte certaines langues, la version gratuite a des limites d'utilisation. - **OpenAI Translator** : Haute précision, supporte la plupart des langues, nécessite une clé API. - **Gemini Translator** : Haute précision, supporte la plupart des langues, nécessite une clé API. #### Notes sur l'utilisation des moteurs de traduction - Vous pouvez configurer plusieurs moteurs et définir des priorités. Si un moteur échoue, il passera automatiquement au suivant. - Si vous avez besoin d'utiliser un service payant (comme DeepL Pro), veuillez configurer la clé API dans les paramètres. #### Comment choisir un moteur de traduction ? - **Pour les débutants** : Il est recommandé d'utiliser Google Translate ou DeepL Translate (version gratuite). - **Pour les utilisateurs professionnels** : Il est recommandé d'utiliser DeepL Pro ou OpenAI Translator pour une qualité de traduction plus élevée. - **Pour les développeurs** : Tous les moteurs supportent les appels API, et vous pouvez étendre des moteurs personnalisés. #### Langues supportées Chaque moteur supporte différentes langues. Pour plus de détails, veuillez vous référer à : - [Google Translate Langues supportées](https://cloud.google.com/translate/docs/languages) - [DeepL Translate Langues supportées](https://www.deepl.com/docs-api/translating-text/) - [OpenAI Translator Langues supportées](https://platform.openai.com/docs/guides/text-to-speech) #### Dépannage - Si la traduction échoue, veuillez vérifier votre connexion réseau et la configuration de votre clé API. - Si vous rencontrez une limite d'utilisation, essayez de passer à un autre moteur ou attendez un peu avant de réessayer. #### Retours et suggestions Si vous avez des questions ou des suggestions concernant les moteurs de traduction, veuillez soumettre vos retours via [GitHub Issues](https://github.com/your-repo/issues). ---
it: - OCR: [PaddleOCR](https://github.com/PaddlePaddle/PaddleOCR), [EasyOCR](https://github.com/JaidedAI/EasyOCR) - Translation: [Google Translate](https://translate.google.com), [Deepl](https://www.deepl.com/translator), [Gemini](https://deepmind.google/technologies/gemini/), [ChatGPT](https://chat.openai.com), [Ollama](https://ollama.ai/), [Azure OpenAI](https://azure.microsoft.com/en-us/products/ai-services/openai-service), [OpenAI](https://openai.com), [Claude](https://www.anthropic.com), [Moonshot](https://moonshot.cn), [ZhiPuAI](https://www.zhipuai.cn), [Qwen](https://qwenlm.github.io), [DeepSeek](https://www.deepseek.com), [VolcEngine](https://www.volcengine.com/product/machine-translation), [Youdao](https://ai.youdao.com), [Baidu](https://fanyi.baidu.com), [Tencent](https://fanyi.qq.com), [Aliyun](https://www.aliyun.com/product/ai/machine_trans), [Huoshan](https://www.volcengine.com/product/machine-translation), [Sogou](https://fanyi.sogou.com), [Caiyun](https://fanyi.caiyunapp.com), [Niutrans](https://niutrans.com), [Bing](https://www.bing.com/translator), [Bing Microsoft Translator](https://www.bing.com/translator), [Yandex](https://translate.yandex.com) --- ### TRANSLATION ### Politica di supporto dei motori di traduzione - OCR: [PaddleOCR](https://github.com/PaddlePaddle/PaddleOCR), [EasyOCR](https://github.com/JaidedAI/EasyOCR) - Traduzione: [Google Translate](https://translate.google.com), [Deepl](https://www.deepl.com/translator), [Gemini](https://deepmind.google/technologies/gemini/), [ChatGPT](https://chat.openai.com), [Ollama](https://ollama.ai/), [Azure OpenAI](https://azure.microsoft.com/en-us/products/ai-services/openai-service), [OpenAI](https://openai.com), [Claude](https://www.anthropic.com), [Moonshot](https://moonshot.cn), [ZhiPuAI](https://www.zhipuai.cn), [Qwen](https://qwenlm.github.io), [DeepSeek](https://www.deepseek.com), [VolcEngine](https://www.volcengine.com/product/machine-translation), [Youdao](https://ai.youdao.com), [Baidu](https://fanyi.baidu.com), [Tencent](https://fanyi.qq.com), [Aliyun](https://www.aliyun.com/product/ai/machine_trans), [Huoshan](https://www.volcengine.com/product/machine-translation), [Sogou](https://fanyi.sogou.com), [Caiyun](https://fanyi.caiyunapp.com), [Niutrans](https://niutrans.com), [Bing](https://www.bing.com/translator), [Bing Microsoft Translator](https://www.bing.com/translator), [Yandex](https://translate.yandex.com)
pt: pdf2zh supports multiple translation engines, including: - [DeepL](https://www.deepl.com/translator) - [Google Translate](https://translate.google.com/) - [Azure](https://azure.microsoft.com/en-us/products/ai-services/ai-translator) - [Baidu](https://fanyi.baidu.com/) - [Youdao](https://fanyi.youdao.com/) - [GPT](https://openai.com/index/openai-api/) - [Ollama](https://ollama.ai/) - [OpenAI](https://openai.com/index/openai-api/) - [Gemini](https://deepmind.google/technologies/gemini/) - [Claude](https://claude.ai/) - [Qianfan](https://cloud.baidu.com/product/wenzin/) - [ZhiPu](https://open.bigmodel.cn/) Each engine has different features and requirements. Here are the details: #### DeepL - **Free Tier**: Limited to 500,000 characters per month. - **Paid Tier**: Higher limits, requires API key. - **Usage**: Requires API key for both free and paid tiers. #### Google Translate - **Free Tier**: Limited to 500,000 characters per month. - **Paid Tier**: Higher limits, requires API key. - **Usage**: Requires API key for both free and paid tiers. #### Azure - **Free Tier**: Limited to 2,000,000 characters per month. - **Paid Tier**: Higher limits, requires API key. - **Usage**: Requires API key for both free and paid tiers. #### Baidu - **Free Tier**: Limited to 1,000,000 characters per month. - **Paid Tier**: Higher limits, requires API key. - **Usage**: Requires API key for both free and paid tiers. #### Youdao - **Free Tier**: Limited to 1,000,000 characters per month. - **Paid Tier**: Higher limits, requires API key. - **Usage**: Requires API key for both free and paid tiers. #### GPT - **Free Tier**: No free tier, requires API key. - **Paid Tier**: Pay-as-you-go, requires API key. - **Usage**: Requires API key. #### Ollama - **Free Tier**: No free tier, requires local setup. - **Paid Tier**: Not applicable. - **Usage**: Requires local Ollama server. #### OpenAI - **Free Tier**: No free tier, requires API key. - **Paid Tier**: Pay-as-you-go, requires API key. - **Usage**: Requires API key. #### Gemini - **Free Tier**: Limited usage, requires API key. - **Paid Tier**: Pay-as-you-go, requires API key. - **Usage**: Requires API key. #### Claude - **Free Tier**: No free tier, requires API key. - **Paid Tier**: Pay-as-you-go, requires API key. - **Usage**: Requires API key. #### Qianfan - **Free Tier**: Limited to 1,000,000 characters per month. - **Paid Tier**: Higher limits, requires API key. - **Usage**: Requires API key for both free and paid tiers. #### ZhiPu - **Free Tier**: Limited to 1,000,000 characters per month. - **Paid Tier**: Higher limits, requires API key. - **Usage**: Requires API key for both free and paid tiers. --- ### Política de Suporte aos Motores de Tradução O pdf2zh suporta vários motores de tradução, incluindo: - [DeepL](https://www.deepl.com/translator) - [Google Translate](https://translate.google.com/) - [Azure](https://azure.microsoft.com/en-us/products/ai-services/ai-translator) - [Baidu](https://fanyi.baidu.com/) - [Youdao](https://fanyi.youdao.com/) - [GPT](https://openai.com/index/openai-api/) - [Ollama](https://ollama.ai/) - [OpenAI](https://openai.com/index/openai-api/) - [Gemini](https://deepmind.google/technologies/gemini/) - [Claude](https://claude.ai/) - [Qianfan](https://cloud.baidu.com/product/wenzin/) - [ZhiPu](https://open.bigmodel.cn/) Cada motor possui características e requisitos diferentes. Aqui estão os detalhes: #### DeepL - **Camada Gratuita**: Limitado a 500.000 caracteres por mês. - **Camada Paga**: Limites mais altos, requer chave de API. - **Uso**: Requer chave de API para as camadas gratuita e paga. #### Google Translate - **Camada Gratuita**: Limitado a 500.000 caracteres por mês. - **Camada Paga**: Limites mais altos, requer chave de API. - **Uso**: Requer chave de API para as camadas gratuita e paga. #### Azure - **Camada Gratuita**: Limitado a 2.000.000 caracteres por mês. - **Camada Paga**: Limites mais altos, requer chave de API. - **Uso**: Requer chave de API para as camadas gratuita e paga. #### Baidu - **Camada Gratuita**: Limitado a 1.000.000 caracteres por mês. - **Camada Paga**: Limites mais altos, requer chave de API. - **Uso**: Requer chave de API para as camadas gratuita e paga. #### Youdao - **Camada Gratuita**: Limitado a 1.000.000 caracteres por mês. - **Camada Paga**: Limites mais altos, requer chave de API. - **Uso**: Requer chave de API para as camadas gratuita e paga. #### GPT - **Camada Gratuita**: Sem camada gratuita, requer chave de API. - **Camada Paga**: Pagamento conforme o uso, requer chave de API. - **Uso**: Requer chave de API. #### Ollama - **Camada Gratuita**: Sem camada gratuita, requer configuração local. - **Camada Paga**: Não aplicável. - **Uso**: Requer servidor Ollama local. #### OpenAI - **Camada Gratuita**: Sem camada gratuita, requer chave de API. - **Camada Paga**: Pagamento conforme o uso, requer chave de API. - **Uso**: Requer chave de API. #### Gemini - **Camada Gratuita**: Uso limitado, requer chave de API. - **Camada Paga**: Pagamento conforme o uso, requer chave de API. - **Uso**: Requer chave de API. #### Claude - **Camada Gratuita**: Sem camada gratuita, requer chave de API. - **Camada Paga**: Pagamento conforme o uso, requer chave de API. - **Uso**: Requer chave de API. #### Qianfan - **Camada Gratuita**: Limitado a 1.000.000 caracteres por mês. - **Camada Paga**: Limites mais altos, requer chave de API. - **Uso**: Requer chave de API para as camadas gratuita e paga. #### ZhiPu - **Camada Gratuita**: Limitado a 1.000.000 caracteres por mês. - **Camada Paga**: Limites mais altos, requer chave de API. - **Uso**: Requer chave de API para as camadas gratuita e paga.
ru: We support multiple translation engines, and you can choose the appropriate one based on your needs. ### Supported Translation Engines !!! Note The translation engines listed below are all free to use, but they may have usage limits. If you need to translate large volumes of documents, it is recommended to use a translation engine with higher usage limits. #### DeepL DeepL is a high-quality translation engine that supports multiple languages and provides high-quality translations. - **Usage Limits**: Free users have a limit of 500,000 characters per month. - **Supported Languages**: English, Chinese, Japanese, German, French, Italian, Spanish, Dutch, Polish, Portuguese, Russian, and more. - **Configuration**: You need to apply for a DeepL API key and then configure it in the settings. #### Google Translate Google Translate is a widely used translation engine that supports a large number of languages and provides stable translation services. - **Usage Limits**: Free users have a limit of 500,000 characters per month. - **Supported Languages**: Over 100 languages, including English, Chinese, Japanese, Korean, French, German, Spanish, and more. - **Configuration**: You need to apply for a Google Cloud API key and then configure it in the settings. #### Azure Translator Azure Translator is a translation service provided by Microsoft that supports multiple languages and provides high-quality translations. - **Usage Limits**: Free users have a limit of 2 million characters per month. - **Supported Languages**: Over 100 languages, including English, Chinese, Japanese, Korean, French, German, Spanish, and more. - **Configuration**: You need to apply for an Azure Translator API key and then configure it in the settings. #### Youdao Translate Youdao Translate is a translation engine provided by NetEase that supports multiple languages and provides high-quality translations. - **Usage Limits**: Free users have a limit of 1 million characters per hour. - **Supported Languages**: Chinese, English, Japanese, Korean, French, German, Spanish, and more. - **Configuration**: You need to apply for a Youdao Translate API key and then configure it in the settings. #### Baidu Translate Baidu Translate is a translation engine provided by Baidu that supports multiple languages and provides high-quality translations. - **Usage Limits**: Free users have a limit of 1 million characters per month. - **Supported Languages**: Chinese, English, Japanese, Korean, French, German, Spanish, and more. - **Configuration**: You need to apply for a Baidu Translate API key and then configure it in the settings. #### Tencent Translate Tencent Translate is a translation engine provided by Tencent that supports multiple languages and provides high-quality translations. - **Usage Limits**: Free users have a limit of 5 million characters per month. - **Supported Languages**: Chinese, English, Japanese, Korean, French, German, Spanish, and more. - **Configuration**: You need to apply for a Tencent Translate API key and then configure it in the settings. #### OpenAI OpenAI provides translation services through its API, supporting multiple languages and offering high-quality translations. - **Usage Limits**: Based on the usage of the OpenAI API, specific limits depend on your OpenAI account. - **Supported Languages**: Supports multiple languages, but the specific supported languages depend on the model used. - **Configuration**: You need to apply for an OpenAI API key and then configure it in the settings. --- ### Политика поддержки движков перевода Мы поддерживаем несколько движков перевода, и вы можете выбрать подходящий в зависимости от ваших потребностей. ### Поддерживаемые движки перевода !!! Note Перечисленные ниже движки перевода бесплатны для использования, но могут иметь ограничения по использованию. Если вам нужно переводить большие объемы документов, рекомендуется использовать движок перевода с более высокими лимитами использования. #### DeepL DeepL — это высококачественный движок перевода, который поддерживает несколько языков и предоставляет переводы высокого качества. - **Лимиты использования**: Бесплатные пользователи имеют лимит в 500 000 символов в месяц. - **Поддерживаемые языки**: Английский, китайский, японский, немецкий, французский, итальянский, испанский, голландский, польский, португальский, русский и другие. - **Настройка**: Вам необходимо подать заявку на ключ API DeepL, а затем настроить его в настройках. #### Google Translate Google Translate — это широко используемый движок перевода, который поддерживает большое количество языков и предоставляет стабильные услуги перевода. - **Лимиты использования**: Бесплатные пользователи имеют лимит в 500 000 символов в месяц. - **Поддерживаемые языки**: Более 100 языков, включая английский, китайский, японский, корейский, французский, немецкий, испанский и другие. - **Настройка**: Вам необходимо подать заявку на ключ API Google Cloud, а затем настроить его в настройках. #### Azure Translator Azure Translator — это служба перевода от Microsoft, которая поддерживает несколько языков и предоставляет переводы высокого качества. - **Лимиты использования**: Бесплатные пользователи имеют лимит в 2 миллиона символов в месяц. - **Поддерживаемые языки**: Более 100 языков, включая английский, китайский, японский, корейский, французский, немецкий, испанский и другие. - **Настройка**: Вам необходимо подать заявку на ключ API Azure Translator, а затем настроить его в настройках. #### Youdao Translate Youdao Translate — это движок перевода от NetEase, который поддерживает несколько языков и предоставляет переводы высокого качества. - **Лимиты использования**: Бесплатные пользователи имеют лимит в 1 миллион символов в час. - **Поддерживаемые языки**: Китайский, английский, японский, корейский, французский, немецкий, испанский и другие. - **Настройка**: Вам необходимо подать заявку на ключ API Youdao Translate, а затем настроить его в настройках. #### Baidu Translate Baidu Translate — это движок перевода от Baidu, который поддерживает несколько языков и предоставляет переводы высокого качества. - **Лимиты использования**: Бесплатные пользователи имеют лимит в 1 миллион символов в месяц. - **Поддерживаемые языки**: Китайский, английский, японский, корейский, французский, немецкий, испанский и другие. - **Настройка**: Вам необходимо подать заявку на ключ API Baidu Translate, а затем настроить его в настройках. #### Tencent Translate Tencent Translate — это движок перевода от Tencent, который поддерживает несколько языков и предоставляет переводы высокого качества. - **Лимиты использования**: Бесплатные пользователи имеют лимит в 5 миллионов символов в месяц. - **Поддерживаемые языки**: Китайский, английский, японский, корейский, французский, немецкий, испанский и другие. - **Настройка**: Вам необходимо подать заявку на ключ API Tencent Translate, а затем настроить его в настройках. #### OpenAI OpenAI предоставляет услуги перевода через свой API, поддерживая несколько языков и предлагая переводы высокого качества. - **Лимиты использования**: Основаны на использовании API OpenAI, конкретные лимиты зависят от вашей учетной записи OpenAI. - **Поддерживаемые языки**: Поддерживает несколько языков, но конкретные поддерживаемые языки зависят от используемой модели. - **Настройка**: Вам необходимо подать заявку на ключ API OpenAI, а затем настроить его в настройках.
