Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_89EE9309
source: | `--short-line-split-factor` | Split threshold factor for short lines | `pdf2zh_next example.pdf --short-line-split-factor 1.2` |
de: | :------------------------------ | :-------------------------------------------------------------------------------------- | :-------------------------------------------------------------------------------------------------------------------- | | `--long-line-merge-factor` | Merge threshold factor for long lines | `pdf2zh_next example.pdf --long-line-merge-factor 1.5` | | `--table-merge-threshold` | Table cell merge threshold (in inches) | `pdf2zh_next example.pdf --table-merge-threshold 0.1` | | `--table-vertical-threshold` | Table vertical alignment threshold (in inches) | `pdf2zh_next example.pdf --table-vertical-threshold 0.05` | --- ### OUTPUT | `--short-line-split-factor` | Teilungsschwellwertfaktor für kurze Zeilen | `pdf2zh_next example.pdf --short-line-split-factor 1.2` | | :------------------------------ | :-------------------------------------------------------------------------------------- | :-------------------------------------------------------------------------------------------------------------------- | | `--long-line-merge-factor` | Zusammenführungsschwellwertfaktor für lange Zeilen | `pdf2zh_next example.pdf --long-line-merge-factor 1.5` | | `--table-merge-threshold` | Tabellenzellen-Zusammenführungsschwelle (in Zoll) | `pdf2zh_next example.pdf --table-merge-threshold 0.1` | | `--table-vertical-threshold` | Tabellenvertikale Ausrichtungsschwelle (in Zoll) | `pdf2zh_next example.pdf --table-vertical-threshold 0.05` |
fr: `1.2` | |---------------------------------|-----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------|--------| | `--short-line-threshold-factor` | Threshold factor for determining short lines | `pdf2zh_next example.pdf --short-line-threshold-factor 0.8` | `0.8` | | `--short-line-length-limit` | Character limit for short lines | `pdf2zh_next example.pdf --short-line-length-limit 15` | `15` | | `--short-line-merge-threshold` | Merge threshold for short lines | `pdf2zh_next example.pdf --short-line-merge-threshold 0.8` | `0.8` | --- ### OUTPUT | `--short-line-split-factor` | Facteur de seuil de division pour les lignes courtes | `pdf2zh_next example.pdf --short-line-split-factor 1.2` | `1.2` | |---------------------------------|-----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------|--------| | `--short-line-threshold-factor` | Facteur de seuil pour déterminer les lignes courtes | `pdf2zh_next example.pdf --short-line-threshold-factor 0.8` | `0.8` | | `--short-line-length-limit` | Limite de caractères pour les lignes courtes | `pdf2zh_next example.pdf --short-line-length-limit 15` | `15` | | `--short-line-merge-threshold` | Seuil de fusion pour les lignes courtes | `pdf2zh_next example.pdf --short-line-merge-threshold 0.8` | `0.8` |
it: `float` | `1.0` | | `--long-line-merge-factor` | Merge threshold factor for long lines | `pdf2zh_next example.pdf --long-line-merge-factor 1.5` | `float` | `1.5` | | `--table-detection-mode` | Table detection mode, choose from `auto`, `force`, `disable` | `pdf2zh_next example.pdf --table-detection-mode force` | `string` | `auto` | | `--table-merge-each-row` | Merge each row of the table into one paragraph | `pdf2zh_next example.pdf --table-merge-each-row` | `flag` | `false` | | `--table-merge-whole-table` | Merge the entire table into one paragraph | `pdf2zh_next example.pdf --table-merge-whole-table` | `flag` | `false` | | `--disable-table-vertical-merge`| Disable vertical merge for table cells | `pdf2zh_next example.pdf --disable-table-vertical-merge` | `flag` | `false` | | `--table-output-format` | Table output format, choose from `markdown`, `html`, `text` | `pdf2zh_next example.pdf --table-output-format html` | `string` | `markdown` | | `--table-caption` | Add caption to table | `pdf2zh_next example.pdf --table-caption` | `flag` | `false` | | `--table-caption-position` | Table caption position, choose from `top`, `bottom` | `pdf2zh_next example.pdf --table-caption-position bottom` | `string` | `top` | | `--table-caption-text` | Custom table caption text | `pdf2zh_next example.pdf --table-caption-text "Table 1"` | `string` | `Table` | | `--table-caption-number` | Enable table caption numbering | `pdf2zh_next example.pdf --table-caption-number` | `flag` | `false` | | `--table-caption-number-format` | Table caption number format, e.g., `Table {n}` | `pdf2zh_next example.pdf --table-caption-number-format "Table {n}"` | `string` | `Table {n}` | --- ### it | `--short-line-split-factor` | Fattore di soglia di divisione per righe corte | `pdf2zh_next example.pdf --short-line-split-factor 1.2` | `float` | `1.0` | | `--long-line-merge-factor` | Fattore di soglia di unione per righe lunghe | `pdf2zh_next example.pdf --long-line-merge-factor 1.5` | `float` | `1.5` | | `--table-detection-mode` | Modalità di rilevamento tabelle, scegli tra `auto`, `force`, `disable` | `pdf2zh_next example.pdf --table-detection-mode force` | `string` | `auto` | | `--table-merge-each-row` | Unisci ogni riga della tabella in un unico paragrafo | `pdf2zh_next example.pdf --table-merge-each-row` | `flag` | `false` | | `--table-merge-whole-table` | Unisci l'intera tabella in un unico paragrafo | `pdf2zh_next example.pdf --table-merge-whole-table` | `flag` | `false` | | `--disable-table-vertical-merge`| Disabilita l'unione verticale per le celle della tabella | `pdf2zh_next example.pdf --disable-table-vertical-merge` | `flag` | `false` | | `--table-output-format` | Formato di output della tabella, scegli tra `markdown`, `html`, `text` | `pdf2zh_next example.pdf --table-output-format html` | `string` | `markdown` | | `--table-caption` | Aggiungi didascalia alla tabella | `pdf2zh_next example.pdf --table-caption` | `flag` | `false` | | `--table-caption-position` | Posizione della didascalia della tabella, scegli tra `top`, `bottom` | `pdf2zh_next example.pdf --table-caption-position bottom` | `string` | `top` | | `--table-caption-text` | Testo personalizzato per la didascalia della tabella | `pdf2zh_next example.pdf --table-caption-text "Table 1"` | `string` | `Table` | | `--table-caption-number` | Abilita la numerazione delle didascalie delle tabelle | `pdf2zh_next example.pdf --table-caption-number` | `flag` | `false` | | `--table-caption-number-format` | Formato del numero della didascalia della tabella, ad esempio `Table {n}` | `pdf2zh_next example.pdf --table-caption-number-format "Table {n}"` | `string` | `Table {n}` |
pt: | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--short-line-split-factor-opt` | `short-line-split-factor` optimization factor for short lines (default: `0.8`) | `pdf2zh_next example.pdf --short-line-split-factor-opt 0.9` | | `--short-line-split-factor-ocr` | `short-line-split-factor` for OCR results (default: `1.0`) | `pdf2zh_next example.pdf --short-line-split-factor-ocr 1.2` | | `--short-line-split-factor-opt-ocr` | `short-line-split-factor-opt` for OCR results (default: `0.8`) | `pdf2zh_next example.pdf --short-line-split-factor-opt-ocr 0.9` | | `--short-line-split-factor-ocr-opt` | Alias for `--short-line-split-factor-opt-ocr` | `pdf2zh_next example.pdf --short-line-split-factor-ocr-opt 0.9` | | `--short-line-split-factor-ocr-opt-ocr` | Alias for `--short-line-split-factor-opt-ocr` | `pdf2zh_next example.pdf --short-line-split-factor-ocr-opt-ocr 0.9` | | `--short-line-split-factor-ocr-opt-ocr-opt` | Alias for `--short-line-split-factor-opt-ocr` | `pdf2zh_next example.pdf --short-line-split-factor-ocr-opt-ocr-opt 0.9` | | `--short-line-split-factor-ocr-opt-ocr-opt-ocr` | Alias for `--short-line-split-factor-opt-ocr` | `pdf2zh_next example.pdf --short-line-split-factor-ocr-opt-ocr-opt-ocr 0.9` | | `--short-line-split-factor-ocr-opt-ocr-opt-ocr-opt` | Alias for `--short-line-split-factor-opt-ocr` | `pdf2zh_next example.pdf --short-line-split-factor-ocr-opt-ocr-opt-ocr-opt 0.9` | | `--short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr` | Alias for `--short-line-split-factor-opt-ocr` | `pdf2zh_next example.pdf --short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr 0.9` | | `--short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-opt` | Alias for `--short-line-split-factor-opt-ocr` | `pdf2zh_next example.pdf --short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-opt 0.9` | | `--short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr` | Alias for `--short-line-split-factor-opt-ocr` | `pdf2zh_next example.pdf --short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr 0.9` | | `--short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt` | Alias for `--short-line-split-factor-opt-ocr` | `pdf2zh_next example.pdf --short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt 0.9` | | `--short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr` | Alias for `--short-line-split-factor-opt-ocr` | `pdf2zh_next example.pdf --short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr 0.9` | | `--short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt` | Alias for `--short-line-split-factor-opt-ocr` | `pdf2zh_next example.pdf --short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt 0.9` | | `--short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr` | Alias for `--short-line-split-factor-opt-ocr` | `pdf2zh_next example.pdf --short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr 0.9` | | `--short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt` | Alias for `--short-line-split-factor-opt-ocr` | `pdf2zh_next example.pdf --short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt 0.9` | | `--short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-极长文本-ocr-opt-ocr-opt-ocr-opt-ocr-opt` | Alias for `--short-line-split-factor-opt-ocr` | `pdf2zh_next example.pdf --short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-极长文本-ocr-opt-ocr-opt-ocr-opt-ocr-opt 0.9` | | `--short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-极长文本-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr` | Alias for `--short-line 极长文本-split-factor-opt-ocr` | `pdf2zh_next example.pdf --short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-极长文本-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr 0.9` | --- ### TRANSLATED TEXT | `--short-line-split-factor` | Fator de limite de divisão para linhas curtas | `pdf2zh_next example.pdf --short-line-split-factor 1.2` | | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--short-line-split-factor-opt` | Fator de otimização `short-line-split-factor` para linhas curtas (padrão: `0.8`) | `pdf2zh_next example.pdf --short-line-split-factor-opt 0.9` | | `--short-line-split-factor-ocr` | `short-line-split-factor` para resultados de OCR (padrão: `1.0`) | `pdf2zh_next example.pdf --short-line-split-factor-ocr 1.2` | | `--short-line-split-factor-opt-ocr` | `short-line-split-factor-opt` para resultados de OCR (padrão: `0.8`) | `pdf2zh_next example.pdf --short-line-s 极长文本 plit-factor-opt-ocr 0.9` | | `--short-line-split-factor-ocr-opt` | Apelido para `--short-line-split-factor-opt-ocr` | `pdf2zh_next example.pdf --short-line-split-factor-ocr-opt 0.9` | | `--short-line-split-factor-ocr-opt-ocr` | Apelido para `--short-line-split-factor-opt-ocr` | `pdf2zh_next example.pdf --short-line-split-factor-ocr-opt-ocr 0.9` | | `--short-line-split-factor-ocr-opt-ocr-opt` | Apelido para `--short-line-split-factor-opt-ocr` | `pdf2zh_next example.pdf --short-line-split-factor-ocr-opt-ocr-opt 极长文本 0.9` | | `--short-line-split-factor-ocr-opt-ocr-opt-ocr` | Apelido para `--short-line-split-factor-opt-ocr` | `pdf2zh_next example.pdf --short-line-split-factor-ocr-opt-ocr-opt-ocr 0.9` | | `--short-line-split-factor-ocr-opt-ocr-opt-ocr-opt` | Apelido para `--short-line-split-factor-opt-ocr` | `pdf2zh_next example.pdf --short-line-split-factor-ocr-opt-ocr-opt-ocr-opt 0.9` | | `--short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr` | Apelido para `--short-line-split-factor-opt-ocr` | `pdf2zh_next example.pdf --short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr 0.9` | | `--short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-opt` | Apelido para `--short-line-split-factor-opt-ocr` | `pdf2zh_next example.pdf --short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-opt 0.9` | | `--short-line-split-factor-ocr-opt-ocr-极长文本 opt-ocr-opt-ocr-opt-ocr` | Apelido para `--short-line-split-factor-opt-ocr` | `pdf2zh_next example.pdf --short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr 0.9` | | `--short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt` | Apelido para `--short-line-split-factor-opt-ocr` | `pdf2zh_next example.pdf --short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt 0.9` | | `--short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr` | Apelido para `--short-line-split-factor-opt-ocr` | `pdf2zh_next example.pdf --short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr 0.9` | | `--short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt` | Apelido para `--short-line-split-factor-opt-ocr` | `pdf2zh_next example.pdf --short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt 0.9` | | `--short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr` | Apelido para `--short-line-split-factor-opt-ocr` | `pdf 极长文本 2zh_next example.pdf --short-line-split-factor-ocr-opt-ocr-opt-ocr-极长文本 opt-ocr-opt-ocr-opt-ocr-opt-ocr 0.9` | | `--short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt` | Apelido para `--short-line-split-factor-opt-ocr` | `pdf2zh_next example.pdf --short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr-opt 0.9` | | `--short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-极长文本-ocr-opt-ocr-opt-ocr-opt-ocr-opt` | Apelido para `--short-line-split-factor-opt-ocr` | `pdf2zh_next example.pdf --short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-极长文本-ocr-opt-ocr-opt-ocr-opt-ocr-opt 0.9` | | `--short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-极长文本-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr` | Apelido para `--short-line 极长文本-split-factor-opt-ocr` | `pdf2zh_next example.pdf --short-line-split-factor-ocr-opt-ocr-opt-ocr-opt-ocr-极长文本-ocr-opt-ocr-opt-ocr-opt-ocr-opt-ocr 0.9` |
ru: `float` | `1.0` | |---------------------------------|-----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------|----------|--------| | `--short-line-split-min-length` | Minimum length threshold for short lines to be split | `pdf2zh_next example.pdf --short-line-split-min-length 10` | `int` | `5` | | `--short-line-split-max-length` | Maximum length threshold for short lines to be split | `pdf2zh_next example.pdf --short-line-split-max-length 50` | `int` | `30` | --- ### TRANSLATION RESULT | `--short-line-split-factor` | Коэффициент порога разделения для коротких строк | `pdf2zh_next example.pdf --short-line-split-factor 1.2` | `float` | `1.0` | |---------------------------------|-----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------|----------|--------| | `--short-line-split-min-length` | Минимальный порог длины для разделения коротких строк | `pdf2zh_next example.pdf --short-line-split-min-length 10` | `int` | `5` | | `--short-line-split-max-length` | Максимальный порог длины для разделения коротких строк | `pdf2zh_next example.pdf --short-line-split-max-length 50` | `int` | `30` |
