Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_56087045
source: ### Overview
de: Welcome to **pdf2zh**! This documentation will guide you through all the features and usage of our tool. **pdf2zh** is a powerful tool designed to extract text from PDF files and translate it into various languages. It supports multiple translation services and offers both command-line and web-based interfaces for ease of use. --- ### Features - **Text Extraction**: Accurately extracts text from PDF files. - **Multi-language Translation**: Translates extracted text into multiple languages using services like Google Translate, DeepL, and more. - **Command Line Interface**: Use the tool directly from your terminal for quick and efficient processing. - **Web Interface**: A user-friendly web interface for those who prefer a graphical approach. - **Customizable**: Offers various options to customize the translation process, including language selection and output formatting. --- ### Quick Start To get started with **pdf2zh**, follow these steps: 1. **Installation**: Install the tool using pip or from source. See the [Installation](installation.md) guide for detailed instructions. 2. **Basic Usage**: Learn how to use the command line interface with the [Command Line](command_line.md) guide. 3. **Web Interface**: Alternatively, use the web interface by following the [Web Interface](web_interface.md) guide. For more advanced usage, check out the [Advanced](advanced.md) section. --- ### Supported Languages **pdf2zh** supports a wide range of languages for translation. For a complete list, refer to the [Supported Languages](supported_languages.md) page. --- ### Community and Support Join our community for support, share your experiences, and contribute to the project: - **GitHub**: [https://github.com/your-repo](https://github.com/your-repo) - **Discord**: [Join our Discord server](https://discord.gg/your-invite) For frequently asked questions, visit the [FAQ](faq.md) page. --- ### Contributing We welcome contributions! If you're interested in helping improve **pdf2zh**, please see our [Contributing Guide](contributing.md). --- ### License **pdf2zh** is licensed under the MIT License. See the [LICENSE](LICENSE) file for more details. --- Thank you for using **pdf2zh**! We hope you find it useful.
fr: pdf2zh is an open-source tool that allows you to translate PDF documents from English to Chinese, supporting various translation services. !!! Note This tool is based on the [PDFMathTranslate](https://github.com/SUSYUSTC/PdfTranslate) project, which is licensed under the GPLv3. We have made some modifications and optimizations. ### Features - [x] Support for multiple translation services - [x] Support for command line and WebUI - [x] Support for LaTeX and Word output formats - [x] Support for custom translation prompts - [x] Support for bilingual output --- ### TRANSLATION RESULT ### Aperçu pdf2zh est un outil open-source qui vous permet de traduire des documents PDF de l'anglais vers le chinois, en prenant en charge divers services de traduction. !!! Note Cet outil est basé sur le projet [PDFMathTranslate](https://github.com/SUSYUSTC/PdfTranslate), qui est sous licence GPLv3. Nous avons effectué quelques modifications et optimisations. ### Fonctionnalités - [x] Prise en charge de plusieurs services de traduction - [x] Prise en charge de la ligne de commande et de l'interface WebUI - [x] Prise en charge des formats de sortie LaTeX et Word - [x] Prise en charge des invites de traduction personnalisées - [x] Prise en charge de la sortie bilingue
it: This document provides a comprehensive guide for translators who wish to contribute to the **pdf2zh** project. It covers everything from setting up the environment to submitting translations. The guide is divided into several sections for clarity. !!! Note The main translation platform for this project is [Crowdin](https://crowdin.com/project/pdf2zh). If you are not familiar with Crowdin, please refer to the [Crowdin Documentation](https://support.crowdin.com/). ### Table of Contents - [Getting Started](#getting-started) - [Advanced](#advanced) - [Supported Languages](#supported-languages) - [Community](#community) - [FAQ](#faq) --- ### Getting Started This section will guide you through the initial steps to start translating. #### Step 1: Join the Project 1. Visit the [Crowdin project page](https://crowdin.com/project/pdf2zh). 2. Click the "Join" button to request access to the project. 3. Wait for approval from the project maintainers. #### Step 2: Choose a Language 1. After joining, select the language you wish to translate into from the list of supported languages. 2. If your language is not listed, you can request it by contacting the project maintainers. #### Step 3: Start Translating 1. Navigate to the file you wish to translate. 2. Click on a segment to open the translation editor. 3. Enter your translation in the provided field. 4. Save your translation. !!! Tip You can use the translation memory and machine translation suggestions to speed up your work. ### Advanced This section covers advanced topics for experienced translators. #### Translation Memory Translation Memory (TM) is a database that stores previously translated segments. It helps maintain consistency and speed up the translation process. #### Glossary The project glossary contains key terms and their approved translations. Please refer to the glossary to ensure consistency. #### Quality Assurance Crowdin provides quality assurance checks to help you identify potential issues in your translations. Please pay attention to these checks. ### Supported Languages The project currently supports the following languages: - English (en) - Chinese (zh-CN) - Japanese (ja) - Korean (ko) - French (fr) - German (de) - Spanish (es) - Italian (it) - Russian (ru) - Arabic (ar) If you would like to add a new language, please contact the project maintainers. ### Community Join our community to connect with other translators and get help. - [Discord Server](https://discord.gg/example) - [GitHub Discussions](https://github.com/pdf2zh/pdf2zh/discussions) ### FAQ #### How do I become a proofreader? To become a proofreader, you need to have a good track record of quality translations. Contact the project maintainers to express your interest. #### Can I translate the documentation? Yes! The documentation is also hosted on Crowdin. You can find it under the "Documentation" folder. #### What if I find a mistake in the source text? If you find a mistake in the source text, please report it by creating an issue on [GitHub](https://github.com/pdf2zh/pdf2zh/issues). --- ### ORIGINAL TEXT END --- ### TRANSLATION RESULT ### Panoramica Questo documento fornisce una guida completa per i traduttori che desiderano contribuire al progetto **pdf2zh**. Copre tutto, dalla configurazione dell'ambiente all'invio delle traduzioni. La guida è divisa in diverse sezioni per chiarezza. !!! Note La piattaforma di traduzione principale per questo progetto è [Crowdin](https://crowdin.com/project/pdf2zh). Se non hai familiarità con Crowdin, consulta la [Documentazione di Crowdin](https://support.crowdin.com/). ### Indice - [Iniziare](#iniziare) - [Opzioni avanzate](#opzioni-avanzate) - [Lingue supportate](#lingue-supportate) - [Comunità](#comunità) - [Domande frequenti](#domande-frequenti) --- ### Iniziare Questa sezione ti guiderà attraverso i passi iniziali per iniziare a tradurre. #### Passo 1: Unisciti al progetto 1. Visita la [pagina del progetto Crowdin](https://crowdin.com/project/pdf2zh). 2. Clicca il pulsante "Unisciti" per richiedere l'accesso al progetto. 3. Attendi l'approvazione dai maintainer del progetto. #### Passo 2: Scegli una lingua 1. Dopo esserti unito, seleziona la lingua in cui desideri tradurre dalla lista delle lingue supportate. 2. Se la tua lingua non è elencata, puoi richiederla contattando i maintainer del progetto. #### Passo 3: Inizia a tradurre 1. Naviga fino al file che desideri tradurre. 2. Clicca su un segmento per aprire l'editor di traduzione. 3. Inserisci la tua traduzione nel campo fornito. 4. Salva la tua traduzione. !!! Tip Puoi utilizzare la memoria di traduzione e i suggerimenti di traduzione automatica per velocizzare il tuo lavoro. ### Opzioni avanzate Questa sezione tratta argomenti avanzati per traduttori esperti. #### Memoria di traduzione La Memoria di Traduzione (TM) è un database che memorizza segmenti precedentemente tradotti. Aiuta a mantenere la coerenza e a velocizzare il processo di traduzione. #### Glossario Il glossario del progetto contiene i termini chiave e le loro traduzioni approvate. Si prega di fare riferimento al glossario per garantire la coerenza. #### Controllo qualità Crowdin fornisce controlli di garanzia della qualità per aiutarti a identificare potenziali problemi nelle tue traduzioni. Si prega di prestare attenzione a questi controlli. ### Lingue supportate Il progetto supporta attualmente le seguenti lingue: - Inglese (en) - Cinese (zh-CN) - Giapponese (ja) - Coreano (ko) - Francese (fr) - Tedesco (de) - Spagnolo (es) - Italiano (it) - Russo (ru) - Arabo (ar) Se desideri aggiungere una nuova lingua, contatta i maintainer del progetto. ### Comunità Unisciti alla nostra comunità per connetterti con altri traduttori e ottenere aiuto. - [Server Discord](https://discord.gg/example) - [Discussioni GitHub](https://github.com/pdf2zh/pdf2zh/discussions) ### Domande frequenti #### Come posso diventare un correttore di bozze? Per diventare un correttore di bozze, devi avere una buona storia di traduzioni di qualità. Contatta i maintainer del progetto per esprimere il tuo interesse. #### Posso tradurre la documentazione? Sì! La documentazione è anche ospitata su Crowdin. Puoi trovarla sotto la cartella "Documentazione". #### Cosa succede se trovo un errore nel testo sorgente? Se trovi un errore nel testo sorgente, segnalalo creando un issue su [GitHub](https://github.com/pdf2zh/pdf2zh/issues). ---
pt: This document describes the process for contributing translations to the `pdf2zh` project. We welcome contributions for any language, whether it's adding new translations or improving existing ones. ### How to Contribute #### 1. Fork the Repository First, fork the [pdf2zh repository](https://github.com/PDFMathTranslate/pdf2zh) to your own GitHub account. #### 2. Clone Your Fork Clone your forked repository to your local machine: ```bash git clone https://github.com/your-username/pdf2zh.git cd pdf2zh ``` #### 3. Create a New Branch Create a new branch for your translation work: ```bash git checkout -b translate-your-language ``` Replace `your-language` with the language you are translating to (e.g., `translate-spanish`). #### 4. Add or Edit Translation Files Translation files are located in the `docs` directory. Each language has its own subdirectory named with its [ISO 639-1](https://en.wikipedia.org/wiki/List_of_ISO_639-1_codes) language code (e.g., `es` for Spanish, `fr` for French). - If you are adding a new language, create a new directory for it (e.g., `docs/es` for Spanish). - If you are improving an existing translation, navigate to the corresponding language directory. Inside each language directory, the structure mirrors the English documentation. For example, the English file `docs/getting-started/installation.md` would have a Spanish translation at `docs/es/getting-started/installation.md`. #### 5. Translate the Content Translate the content of the Markdown files. Please follow these guidelines: - **Do not** translate technical terms, code blocks, or URLs unless necessary. - Maintain the original Markdown structure and formatting. - Use the same file names and directory structure as the English version. #### 6. Test Your Changes After translating, test your changes locally to ensure everything renders correctly. You can use tools like [MkDocs](https://www.mkdocs.org/) to preview the documentation. #### 7. Commit and Push Commit your changes and push them to your fork: ```bash git add . git commit -m "Add translation for [language]" git push origin translate-your-language ``` #### 8. Create a Pull Request Go to the original [pdf2zh repository](https://github.com/PDFMathTranslate/pdf2zh) and create a pull request from your branch. Provide a clear description of the changes you made. ### Translation Guidelines - **Accuracy**: Ensure translations are accurate and convey the same meaning as the original text. - **Consistency**: Use consistent terminology across all translated documents. - **Clarity**: Write clearly and naturally in the target language. - **Cultural Sensitivity**: Be mindful of cultural differences and avoid literal translations that may not make sense in the target language. ### Supported Languages We currently support translations for the following languages: - Spanish (`es`) - French (`fr`) - German (`de`) - Chinese (`zh`) - Japanese (`ja`) - Korean (`ko`) - Portuguese (`pt`) - Russian (`ru`) - Arabic (`ar`) - Hindi (`hi`) If your language is not listed, feel free to add it! ### Need Help? If you have any questions or need assistance, please open an issue in the repository or reach out to the community. Thank you for contributing to `pdf2zh`! --- ### OUTPUT LANGUAGE CODE pt --- ### OUTPUT ### Visão Geral Este documento descreve o processo para contribuir com traduções para o projeto `pdf2zh`. Acolhemos contribuições para qualquer idioma, seja adicionando novas traduções ou melhorando as existentes. ### Como Contribuir #### 1. Fazer um Fork do Repositório Primeiro, faça um fork do [repositório pdf2zh](https://github.com/PDFMathTranslate/pdf2zh) para a sua própria conta do GitHub. #### 2. Clonar o Seu Fork Clone o seu repositório forkado para a sua máquina local: ```bash git clone https://github.com/your-username/pdf2zh.git cd pdf2zh ``` #### 3. Criar um Novo Branch Crie um novo branch para o seu trabalho de tradução: ```bash git checkout -b translate-your-language ``` Substitua `your-language` pelo idioma para o qual está a traduzir (por exemplo, `translate-portuguese`). #### 4. Adicionar ou Editar Ficheiros de Tradução Os ficheiros de tradução estão localizados no diretório `docs`. Cada idioma tem o seu próprio subdiretório nomeado com o seu código de idioma [ISO 639-1](https://en.wikipedia.org/wiki/List_of_ISO_639-1_codes) (por exemplo, `es` para espanhol, `fr` para francês). - Se estiver a adicionar um novo idioma, crie um novo diretório para ele (por exemplo, `docs/pt` para português). - Se estiver a melhorar uma tradução existente, navegue para o diretório do idioma correspondente. Dentro de cada diretório de idioma, a estrutura espelha a documentação em inglês. Por exemplo, o ficheiro em inglês `docs/getting-started/installation.md` teria uma tradução em português em `docs/pt/getting-started/installation.md`. #### 5. Traduzir o Conteúdo Traduza o conteúdo dos ficheiros Markdown. Por favor, siga estas diretrizes: - **Não** traduza termos técnicos, blocos de código ou URLs, a menos que seja necessário. - Mantenha a estrutura e formatação Markdown originais. - Use os mesmos nomes de ficheiro e estrutura de diretório que a versão em inglês. #### 6. Testar as Suas Alterações Após traduzir, teste as suas alterações localmente para garantir que tudo é renderizado corretamente. Pode usar ferramentas como [MkDocs](https://www.mkdocs.org/) para pré-visualizar a documentação. #### 7. Fazer Commit e Push Faça commit das suas alterações e envie-as para o seu fork: ```bash git add . git commit -m "Add translation for [language]" git push origin translate-your-language ``` #### 8. Criar um Pull Request Vá ao [repositório pdf2zh](https://github.com/PDFMathTranslate/pdf2zh) original e crie um pull request a partir do seu branch. Forneça uma descrição clara das alterações que fez. ### Diretrizes de Tradução - **Precisão**: Garanta que as traduções são precisas e transmitem o mesmo significado que o texto original. - **Consistência**: Use terminologia consistente em todos os documentos traduzidos. - **Clareza**: Escreva de forma clara e natural no idioma de destino. - **Sensibilidade Cultural**: Esteja atento às diferenças culturais e evite traduções literais que possam não fazer sentido no idioma de destino. ### Idiomas Suportados Atualmente, suportamos traduções para os seguintes idiomas: - Espanhol (`es`) - Francês (`fr`) - Alemão (`de`) - Chinês (`zh`) - Japonês (`ja`) - Coreano (`ko`) - Português (`pt`) - Russo (`ru`) - Árabe (`ar`) - Hindi (`hi`) Se o seu idioma não estiver listado, sinta-se à vontade para adicioná-lo! ### Precisa de Ajuda? Se tiver alguma dúvida ou precisar de assistência, por favor, abra um issue no repositório ou contacte a comunidade. Obrigado por contribuir para o `pdf2zh`!
ru: This document details the supported languages and their corresponding codes for the pdf2zh project. These codes are utilized in the `--to` and `--from` arguments to specify the target and source languages for translation. ### Language Codes The following table lists the supported languages along with their codes: | Language | Code | | :--- | :--- | | Chinese (Simplified) | zh | | Chinese (Traditional) | zh-Hant | | English | en | | German | de | | French | fr | | Italian | it | | Portuguese | pt | | Spanish | es | | Japanese | ja | | Korean | ko | | Russian | ru | | Arabic | ar | | Dutch | nl | | Greek | el | | Hindi | hi | | Indonesian | id | | Malay | ms | | Burmese | my | | Thai | th | | Turkish | tr | | Vietnamese | vi | | Ukrainian | uk | | Polish | pl | | Czech | cs | | Danish | da | | Finnish | fi | | Hungarian | hu | | Norwegian | no | | Romanian | ro | | Slovak | sk | | Swedish | sv | | Catalan | ca | | Croatian | hr | | Lithuanian | lt | | Latvian | lv | | Serbian | sr | | Slovenian | sl | | Estonian | et | | Bulgarian | bg | | Hebrew | he | | Farsi | fa | ### Usage To translate a document from English to Simplified Chinese, use: ```bash pdf2zh --from en --to zh input.pdf ``` To translate from Traditional Chinese to English: ```bash pdf2zh --from zh-Hant --to en input.pdf ``` ### Notes - The language codes follow the ISO 639-1 standard where applicable. - For Chinese, `zh` refers to Simplified Chinese, and `zh-Hant` refers to Traditional Chinese. - Ensure the correct code is used to avoid translation errors. --- ### OUTPUT LANGUAGE ru --- ### OUTPUT ### Обзор В этом документе подробно описаны поддерживаемые языки и их соответствующие коды для проекта pdf2zh. Эти коды используются в аргументах `--to` и `--from` для указания целевого и исходного языков перевода. ### Коды языков В следующей таблице перечислены поддерживаемые языки вместе с их кодами: | Язык | Код | | :--- | :--- | | Китайский (упрощенный) | zh | | Китайский (традиционный) | zh-Hant | | Английский | en | | Немецкий | de | | Французский | fr | | Итальянский | it | | Португальский | pt | | Испанский | es | | Японский | ja | | Корейский | ko | | Русский | ru | | Арабский | ar | | Голландский | nl | | Греческий | el | | Хинди | hi | | Индонезийский | id | | Малайский | ms | | Бирманский | my | | Тайский | th | | Турецкий | tr | | Вьетнамский | vi | | Украинский | uk | | Польский | pl | | Чешский | cs | | Датский | da | | Финский | fi | | Венгерский | hu | | Норвежский | no | | Румынский | ro | | Словацкий | sk | | Шведский | sv | | Каталанский | ca | | Хорватский | hr | | Литовский | lt | | Латышский | lv | | Сербский | sr | | Словенский | sl | | Эстонский | et | | Болгарский | bg | | Иврит | he | | Фарси | fa | ### Использование Чтобы перевести документ с английского на упрощенный китайский, используйте: ```bash pdf2zh --from en --to zh input.pdf ``` Чтобы перевести с традиционного китайского на английский: ```bash pdf2zh --from zh-Hant --to en input.pdf ``` ### Примечания - Коды языков соответствуют стандарту ISO 639-1, где это применимо. - Для китайского языка `zh` означает упрощенный китайский, а `zh-Hant` — традиционный китайский. - Убедитесь, что используется правильный код, чтобы избежать ошибок перевода.
