Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_B4068DB4
source: > [!TIP] > **Cannot run the .exe file** > > If you have some problems running pdf2zh.exe, please install `https://aka.ms/vs/17/release/vc_redist.x64.exe` and try again.
de: > [!TIP] > **Kann die .exe-Datei nicht ausführen** > > Wenn Sie Probleme beim Ausführen von pdf2zh.exe haben, installieren Sie bitte `https://aka.ms/vs/17/release/vc_redist.x64.exe` und versuchen Sie es erneut.
fr: > [!TIP] > **Impossible d'exécuter le fichier .exe** > > Si vous rencontrez des problèmes pour exécuter pdf2zh.exe, veuillez installer `https://aka.ms/vs/17/release/vc_redist.x64.exe` et réessayer.
it: > [!TIP] > **Non riesci a eseguire il file .exe** > > Se hai problemi nell'eseguire pdf2zh.exe, installa `https://aka.ms/vs/17/release/vc_redist.x64.exe` e riprova.
pt: > [!TIP] > **Não consegue executar o arquivo .exe** > > Se você tiver algum problema ao executar o pdf2zh.exe, por favor instale `https://aka.ms/vs/17/release/vc_redist.x64.exe` e tente novamente.
ru: > [!TIP] > **Не удается запустить файл .exe** > > Если у вас возникли проблемы с запуском pdf2zh.exe, установите `https://aka.ms/vs/17/release/vc_redist.x64.exe` и попробуйте снова.

# chunk_68C037E0
source: ***Step 4*** | A terminal will pop up after double-clicking the exe file. After about half a minute to a minute, a webpage will open in your default browser. If it does not happen, you can try to manually access `http://localhost:7860/`.
de: ***Schritt 4*** | Nach dem Doppelklicken auf die exe-Datei öffnet sich ein Terminal. Nach etwa einer halben bis einer Minute öffnet sich eine Webseite in Ihrem Standardbrowser. Falls dies nicht geschieht, können Sie versuchen, manuell auf `http://localhost:7860/` zuzugreifen.
fr: ***Étape 4*** | Un terminal s'ouvrira après avoir double-cliqué sur le fichier exe. Après environ une demi-minute à une minute, une page web s'ouvrira dans votre navigateur par défaut. Si cela ne se produit pas, vous pouvez essayer d'accéder manuellement à `http://localhost:7860/`.
it: ***Passo 4*** | Dopo aver fatto doppio clic sul file exe, apparirà un terminale. Dopo circa mezzo minuto o un minuto, una pagina web si aprirà nel tuo browser predefinito. Se ciò non accade, puoi provare ad accedere manualmente a `http://localhost:7860/`.
pt: ***Passo 4*** | Um terminal será exibido após clicar duas vezes no arquivo .exe. Após cerca de meio minuto a um minuto, uma página da web será aberta no seu navegador padrão. Se isso não acontecer, você pode tentar acessar manualmente `http://localhost:7860/`.
ru: ***Шаг 4*** | После двойного щелчка по файлу exe появится терминал. Примерно через полминуты или минуту в вашем браузере по умолчанию откроется веб-страница. Если этого не произошло, попробуйте вручную перейти по адресу `http://localhost:7860/`.

# chunk_E9C46195
source: > [!NOTE] > > If you encounter any issues during use WebUI, please refer to [this webpage](./USAGE_webui.md).
de: > [!NOTE] > > Wenn Sie Probleme bei der Verwendung von WebUI haben, lesen Sie bitte [diese Webseite](./USAGE_webui.md).
fr: > [!NOTE] > > Si vous rencontrez des problèmes lors de l'utilisation de WebUI, veuillez consulter [cette page web](./USAGE_webui.md).
it: > [!NOTE] > > Se riscontri problemi durante l'utilizzo di WebUI, consulta [questa pagina web](./USAGE_webui.md).
pt: > [!NOTE] > > Se você encontrar qualquer problema durante o uso do WebUI, consulte [esta página](./USAGE_webui.md).
ru: > [!NOTE] > > Если у вас возникли проблемы при использовании WebUI, обратитесь к [этой веб-странице](./USAGE_webui.md).

# chunk_703B946D
source: ***Step 5*** | Enjoy!
de: ***Schritt 5*** | Viel Spaß!
fr: ***Étape 5*** | Profitez-en !
it: ***Passo 5*** | Goditelo!
pt: ***Passo 5*** | Aproveite!
ru: ***Шаг 5*** | Наслаждайтесь!

# chunk_BF8657F3
source: > [!TIP] > **You can use the .exe file via command line** > > Use the .exe file through command line as follows: > > - Launch your terminal and navigate to the folder containing the .exe file: > > ```bash > cd /path/pdf2zh_next/build > ``` > > - Call the .exe file: > > ```bash > ./pdf2zh_next.exe "document.pdf" > ``` > > You can use other command line parameters as normal: > > ```bash > ./pdf2zh_next.exe "document.pdf" --lang-in en --lang-out ja > ``` > > If you need more information about command line usage, please refer to this article.
de: > [!TIP] > **Sie können die .exe-Datei über die Kommandozeile verwenden** > > Verwenden Sie die .exe-Datei über die Kommandozeile wie folgt: > > - Starten Sie Ihr Terminal und navigieren Sie zum Ordner, der die .exe-Datei enthält: > > ```bash > cd /path/pdf2zh_next/build > ``` > > - Rufen Sie die .exe-Datei auf: > > ```bash > ./pdf2zh_next.exe "document.pdf" > ``` > > Sie können andere Kommandozeilenparameter wie gewohnt verwenden: > > ```bash > ./pdf2zh_next.exe "document.pdf" --lang-in en --lang-out ja > ``` > > Wenn Sie weitere Informationen zur Verwendung der Kommandozeile benötigen, lesen Sie bitte diesen Artikel.
fr: > [!TIP] > **Vous pouvez utiliser le fichier .exe via la ligne de commande** > > Utilisez le fichier .exe via la ligne de commande comme suit : > > - Lancez votre terminal et naviguez vers le dossier contenant le fichier .exe : > > ```bash > cd /path/pdf2zh_next/build > ``` > > - Appelez le fichier .exe : > > ```bash > ./pdf2zh_next.exe "document.pdf" > ``` > > Vous pouvez utiliser d'autres paramètres de ligne de commande comme d'habitude : > > ```bash > ./pdf2zh_next.exe "document.pdf" --lang-in en --lang-out ja > ``` > > Si vous avez besoin de plus d'informations sur l'utilisation de la ligne de commande, veuillez vous référer à cet article.
it: > [!TIP] > **Puoi utilizzare il file .exe tramite riga di comando** > > Utilizza il file .exe tramite riga di comando come segue: > > - Avvia il terminale e naviga nella cartella contenente il file .exe: > > ```bash > cd /path/pdf2zh_next/build > ``` > > - Chiama il file .exe: > > ```bash > ./pdf2zh_next.exe "document.pdf" > ``` > > Puoi utilizzare altri parametri della riga di comando come al solito: > > ```bash > ./pdf2zh_next.exe "document.pdf" --lang-in en --lang-out ja > ``` > > Se hai bisogno di maggiori informazioni sull'utilizzo della riga di comando, consulta questo articolo.
pt: > [!TIP] > **Você pode usar o arquivo .exe via linha de comando** > > Use o arquivo .exe através da linha de comando da seguinte forma: > > - Inicie seu terminal e navegue até a pasta que contém o arquivo .exe: > > ```bash > cd /path/pdf2zh_next/build > ``` > > - Chame o arquivo .exe: > > ```bash > ./pdf2zh_next.exe "document.pdf" > ``` > > Você pode usar outros parâmetros de linha de comando normalmente: > > ```bash > ./pdf2zh_next.exe "document.pdf" --lang-in en --lang-out ja > ``` > > Se precisar de mais informações sobre o uso da linha de comando, consulte este artigo.
ru: > [!TIP] > **Вы можете использовать файл .exe через командную строку** > > Используйте файл .exe через командную строку следующим образом: > > - Запустите терминал и перейдите в папку, содержащую файл .exe: > > ```bash > cd /path/pdf2zh_next/build > ``` > > - Вызовите файл .exe: > > ```bash > ./pdf2zh_next.exe "document.pdf" > ``` > > Вы можете использовать другие параметры командной строки как обычно: > > ```bash > ./pdf2zh_next.exe "document.pdf" --lang-in en --lang-out ja > ``` > > Если вам нужна дополнительная информация об использовании командной строки, обратитесь к этой статье.

# chunk_1C59CC51
source: [**Getting Started**](./getting-started.md) > **Usage** > **Command Line** _(current)_
de: [**Erste Schritte**](./getting-started.md) > **Verwendung** > **Kommandozeile** _(aktuell)_
fr: [**Commencer**](./getting-started.md) > **Utilisation** > **Ligne de commande** _(current)_
it: [**Iniziare**](./getting-started.md) > **Utilizzo** > **Riga di comando** _(current)_
pt: [**Começar**](./getting-started.md) > **Uso** > **Linha de comando** _(atual)_
ru: [**Начало работы**](./getting-started.md) > **Использование** > **Командная строка** _(текущая)_

# chunk_9C810511
source: ### Use PDFMathTranslate via command line
de: ### Verwenden Sie PDFMathTranslate über die Kommandozeile
fr: ### Utiliser PDFMathTranslate via la ligne de commande
it: ### Utilizzare PDFMathTranslate tramite riga di comando
pt: ### Usar PDFMathTranslate via linha de comando
ru: ### Использование PDFMathTranslate через командную строку

# chunk_30052F3A
source: #### Basic Usage
de: #### Grundlegende Verwendung
fr: #### Utilisation de base
it: #### Utilizzo di base
pt: #### Uso Básico
ru: #### Основное использование

# chunk_ACC119CF
source: After Installation, please enter this command to translate your PDF.
de: Nach der Installation geben Sie bitte diesen Befehl ein, um Ihr PDF zu übersetzen.
fr: Après l'installation, veuillez entrer cette commande pour traduire votre PDF.
it: Dopo l'installazione, inserisci questo comando per tradurre il tuo PDF.
pt: Após a Instalação, digite este comando para traduzir seu PDF.
ru: После установки введите эту команду для перевода вашего PDF.

# chunk_744BFC94
source: > [!NOTE] > > If your pathname contains spaces, please enclose it in quotation marks. > > ```bash > pdf2zh_next "path with spaces/document.pdf" > ```
de: > [!NOTE] > > Wenn Ihr Pfadname Leerzeichen enthält, schließen Sie ihn bitte in Anführungszeichen ein. > > ```bash > pdf2zh_next "path with spaces/document.pdf" > ```
fr: > [!NOTE] > > Si votre chemin d'accès contient des espaces, veuillez l'encadrer de guillemets. > > ```bash > pdf2zh_next "path with spaces/document.pdf" > ```
it: > [!NOTE] > > Se il tuo percorso contiene spazi, per favore racchiudilo tra virgolette. > > ```bash > pdf2zh_next "path with spaces/document.pdf" > ```
pt: > [!NOTE] > > Se o caminho do arquivo contiver espaços, por favor, coloque-o entre aspas. > > ```bash > pdf2zh_next "path with spaces/document.pdf" > ```
ru: > [!NOTE] > > Если имя пути содержит пробелы, пожалуйста, заключите его в кавычки. > > ```bash > pdf2zh_next "path with spaces/document.pdf" > ```

# chunk_6375D505
source: After execute translation, files generated in **current working directory**.
de: Nach der Ausführung der Übersetzung werden Dateien im **aktuellen Arbeitsverzeichnis** erstellt.
fr: Après avoir exécuté la traduction, les fichiers sont générés dans le **répertoire de travail actuel**.
it: Dopo aver eseguito la traduzione, i file vengono generati nella **directory di lavoro corrente**.
pt: Após executar a tradução, arquivos são gerados no **diretório de trabalho atual**.
ru: После выполнения перевода файлы создаются в **текущем рабочем каталоге**.

# chunk_1E0F4B41
source: > [!TIP] > **Where is my "Current Working Directory" ?** > Before entering a command in the terminal, you might see a pathname displayed in your terminal: > > ```powershell > PS C:\Users\XXX> > ``` > > This directory is the "*Current working directory*." > > If there is no pathname, try running this command in the terminal: > > ```bash > pwd > ``` > > After executing this command, a pathname will be output. This pathname is the "**Current working directory**". The translated files will appear here.
de: > [!TIP] > **Wo ist mein "aktuelles Arbeitsverzeichnis"?** > Bevor Sie einen Befehl im Terminal eingeben, sehen Sie möglicherweise einen Pfadnamen in Ihrem Terminal angezeigt: > > ```powershell > PS C:\Users\XXX> > ``` > > Dieses Verzeichnis ist das "*Aktuelle Arbeitsverzeichnis*." > > Wenn kein Pfadname angezeigt wird, versuchen Sie, diesen Befehl im Terminal auszuführen: > > ```bash > pwd > ``` > > Nach der Ausführung dieses Befehls wird ein Pfadname ausgegeben. Dieser Pfadname ist das "**Aktuelle Arbeitsverzeichnis**". Die übersetzten Dateien werden hier erscheinen.
fr: > [!TIP] > **Où se trouve mon "Répertoire de travail actuel" ?** > Avant d'entrer une commande dans le terminal, vous pourriez voir un chemin affiché dans votre terminal : > > ```powershell > PS C:\Users\XXX> > ``` > > Ce répertoire est le "*Répertoire de travail actuel*". > > S'il n'y a pas de chemin, essayez d'exécuter cette commande dans le terminal : > > ```bash > pwd > ``` > > Après avoir exécuté cette commande, un chemin sera affiché. Ce chemin est le "**Répertoire de travail actuel**". Les fichiers traduits apparaîtront ici.
it: > [!TIP] > **Dov'è la mia "Directory di lavoro corrente"?** > Prima di inserire un comando nel terminale, potresti vedere un percorso visualizzato nel tuo terminale: > > ```powershell > PS C:\Users\XXX> > ``` > > Questa directory è la "*Directory di lavoro corrente*." > > Se non c'è un percorso, prova a eseguire questo comando nel terminale: > > ```bash > pwd > ``` > > Dopo aver eseguito questo comando, verrà visualizzato un percorso. Questo percorso è la "**Directory di lavoro corrente**". I file tradotti appariranno qui.
pt: > [!TIP] > **Onde está o meu "Diretório de Trabalho Atual"?** > Antes de inserir um comando no terminal, você pode ver um nome de caminho exibido no seu terminal: > > ```powershell > PS C:\Users\XXX> > ``` > > Este diretório é o "*Diretório de trabalho atual*". > > Se não houver um nome de caminho, tente executar este comando no terminal: > > ```bash > pwd > ``` > > Após executar este comando, um nome de caminho será exibido. Este nome de caminho é o "**Diretório de trabalho atual**". Os arquivos traduzidos aparecerão aqui.
ru: > [!TIP] > **Где находится моя "Текущая рабочая директория"?** > Перед вводом команды в терминале вы можете увидеть путь, отображаемый в вашем терминале: > > ```powershell > PS C:\Users\XXX> > ``` > > Эта директория является "*Текущей рабочей директорией*." > > Если путь не отображается, попробуйте выполнить эту команду в терминале: > > ```bash > pwd > ``` > > После выполнения этой команды будет выведен путь. Этот путь является "**Текущей рабочей директорией**". Переведённые файлы появятся здесь.

# chunk_67DBD505
source: #### Advance Usage
de: #### Erweiterte Verwendung
fr: #### Options avancées
it: #### Opzioni avanzate
pt: #### Opções avançadas
ru: #### Расширенные параметры

# chunk_98AF19D9
source: For detailed explanations of additional command line parameters, please refer to [advanced usage](./../advanced/advanced.md).
de: Für detaillierte Erklärungen zusätzlicher Kommandozeilenparameter lesen Sie bitte [erweiterte Verwendung](./../advanced/advanced.md).
fr: Pour des explications détaillées sur les paramètres supplémentaires de la ligne de commande, veuillez vous référer à [options avancées](./../advanced/advanced.md).
it: Per spiegazioni dettagliate sui parametri aggiuntivi della riga di comando, fare riferimento a [opzioni avanzate](./../advanced/advanced.md).
pt: Para explicações detalhadas de parâmetros adicionais da linha de comando, consulte [opções avançadas](./../advanced/advanced.md).
ru: Для подробного объяснения дополнительных параметров командной строки обратитесь к [расширенным параметрам](./../advanced/advanced.md).

# chunk_03FD0E12
source: [**Getting Started**](./getting-started.md) > **Installation** > **WebUI** _(current)_
de: [**Erste Schritte**](./getting-started.md) > **Installation** > **WebUI** _(aktuell)_
fr: [**Commencer**](./getting-started.md) > **Installation** > **WebUI** _(current)_
it: [**Iniziare**](./getting-started.md) > **Installazione** > **WebUI** _(current)_
pt: [**Começar**](./getting-started.md) > **Instalação** > **WebUI** _(atual)_
ru: [**Начало работы**](./getting-started.md) > **Установка** > **WebUI** _(текущая)_

# chunk_EDC72645
source: ### Use PDFMathTranslate via Webui
de: ### Verwendung von PDFMathTranslate über Webui
fr: ### Utiliser PDFMathTranslate via Webui
it: ### Utilizzo di PDFMathTranslate tramite Webui
pt: ### Usar PDFMathTranslate via Webui
ru: ### Использование PDFMathTranslate через Webui

# chunk_D75BD342
source: #### How to open the WebUI page:
de: #### So öffnen Sie die WebUI-Seite:
fr: #### Comment ouvrir la page WebUI :
it: #### Come aprire la pagina WebUI:
pt: #### Como abrir a página WebUI:
ru: #### Как открыть страницу WebUI:

# chunk_65E65B28
source: There are several methods to open the WebUI interface. If you are using **Windows**, please refer to [this article](./INSTALLATION_winexe.md);
de: Es gibt mehrere Methoden, um die WebUI-Oberfläche zu öffnen. Wenn Sie **Windows** verwenden, lesen Sie bitte [diesen Artikel](./INSTALLATION_winexe.md);
fr: Il existe plusieurs méthodes pour ouvrir l'interface WebUI. Si vous utilisez **Windows**, veuillez consulter [cet article](./INSTALLATION_winexe.md);
it: Esistono diversi metodi per aprire l'interfaccia WebUI. Se stai utilizzando **Windows**, consulta [questo articolo](./INSTALLATION_winexe.md);
pt: Existem vários métodos para abrir a interface WebUI. Se você estiver usando **Windows**, consulte [este artigo](./INSTALLATION_winexe.md);
ru: Существует несколько способов открытия интерфейса WebUI. Если вы используете **Windows**, обратитесь к [этой статье](./INSTALLATION_winexe.md);

# chunk_3B3548CA
source: 1. Python installed (3.10 <= version <= 3.12) 2. Install our package: 3. Start using in browser: ```bash pdf2zh_next --gui ``` 4. If your browswer has not been started automatically, goto ```bash http://localhost:7860/ ``` Drop the PDF file into the window and click `Translate`. 5. If you deploy PDFMathTranslate with docker, and you are using ollama as PDFMathTranslate's backend LLM, you should fill "Ollama host" with ```bash http://host.docker.internal:11434 ```
de: 1. Python installiert (3.10 <= Version <= 3.12) 2. Installieren Sie unser Paket: 3. Beginnen Sie mit der Verwendung im Browser: ```bash pdf2zh_next --gui ``` 4. Falls Ihr Browser nicht automatisch gestartet wurde, gehen Sie zu ```bash http://localhost:7860/ ``` Ziehen Sie die PDF-Datei in das Fenster und klicken Sie auf `Translate`. 5. Wenn Sie PDFMathTranslate mit Docker bereitstellen und ollama als Backend-LLM für PDFMathTranslate verwenden, sollten Sie "Ollama host" mit folgendem Wert ausfüllen: ```bash http://host.docker.internal:11434 ```
fr: 1. Python installé (version 3.10 <= version <= 3.12) 2. Installez notre package : 3. Commencez à utiliser dans le navigateur : ```bash pdf2zh_next --gui ``` 4. Si votre navigateur ne s'est pas lancé automatiquement, allez à ```bash http://localhost:7860/ ``` Déposez le fichier PDF dans la fenêtre et cliquez sur `Translate`. 5. Si vous déployez PDFMathTranslate avec docker, et que vous utilisez ollama comme backend LLM de PDFMathTranslate, vous devez remplir "Ollama host" avec ```bash http://host.docker.internal:11434 ```
it: 1. Python installato (versione 3.10 <= versione <= 3.12) 2. Installa il nostro pacchetto: 3. Inizia a utilizzare nel browser: ```bash pdf2zh_next --gui ``` 4. Se il tuo browser non si è avviato automaticamente, vai a ```bash http://localhost:7860/ ``` Trascina il file PDF nella finestra e clicca `Translate`. 5. Se distribuisci PDFMathTranslate con docker e stai utilizzando ollama come backend LLM di PDFMathTranslate, dovresti inserire "Ollama host" con ```bash http://host.docker.internal:11434 ```
pt: 1. Python instalado (versão entre 3.10 e 3.12) 2. Instale nosso pacote: 3. Comece a usar no navegador: ```bash pdf2zh_next --gui ``` 4. Se o seu navegador não foi iniciado automaticamente, acesse ```bash http://localhost:7860/ ``` Arraste o arquivo PDF para a janela e clique em `Translate`. 5. Se você implantar o PDFMathTranslate com docker e estiver usando o ollama como o LLM de backend do PDFMathTranslate, você deve preencher "Ollama host" com ```bash http://host.docker.internal:11434 ```
ru: 1. Установленный Python (версия от 3.10 до 3.12) 2. Установите наш пакет: 3. Начните использование в браузере: ```bash pdf2zh_next --gui ``` 4. Если ваш браузер не запустился автоматически, перейдите по адресу: ```bash http://localhost:7860/ ``` Перетащите `PDF` файл в окно и нажмите `Translate`. 5. Если вы развертываете PDFMathTranslate с помощью docker и используете ollama в качестве бэкенд LLM для PDFMathTranslate, вам следует указать "Ollama host" как: ```bash http://host.docker.internal:11434 ```

# chunk_2FDC0409
source: ### Environment Variables
de: ### Umgebungsvariablen
fr: ### Variables d'environnement
it: ### Variabili d'ambiente
pt: ### Variáveis de Ambiente
ru: ### Переменные среды

# chunk_7865A8EB
source: You can set the source and target languages using environment variables:
de: Sie können die Quell- und Zielsprachen mit Umgebungsvariablen festlegen:
fr: Vous pouvez définir les langues source et cible en utilisant des variables d'environnement :
it: Puoi impostare le lingue di origine e di destinazione utilizzando le variabili d'ambiente:
pt: Você pode definir os idiomas de origem e destino usando variáveis de ambiente:
ru: Вы можете установить исходный и целевой языки с помощью переменных среды:

# chunk_104D91B6
source: - `PDF2ZH_LANG_FROM`: Sets the source language. Defaults to "English". - `PDF2ZH_LANG_TO`: Sets the target language. Defaults to "Simplified Chinese".
de: - `PDF2ZH_LANG_FROM`: Legt die Ausgangssprache fest. Standardmäßig "English". - `PDF2ZH_LANG_TO`: Legt die Zielsprache fest. Standardmäßig "Simplified Chinese".
fr: - `PDF2ZH_LANG_FROM`: Définit la langue source. Par défaut, "English". - `PDF2ZH_LANG_TO`: Définit la langue cible. Par défaut, "Simplified Chinese".
it: - `PDF2ZH_LANG_FROM`: Imposta la lingua di origine. Il valore predefinito è "English". - `PDF2ZH_LANG_TO`: Imposta la lingua di destinazione. Il valore predefinito è "Simplified Chinese".
pt: - `PDF2ZH_LANG_FROM`: Define o idioma de origem. O padrão é "English". - `PDF2ZH_LANG_TO`: Define o idioma de destino. O padrão é "Simplified Chinese".
ru: - `PDF2ZH_LANG_FROM`: Устанавливает исходный язык. По умолчанию "English". - `PDF2ZH_LANG_TO`: Устанавливает целевой язык. По умолчанию "Simplified Chinese".

# chunk_EEBEC547
source: ## Preview
de: ## Vorschau
fr: ## Aperçu
it: ## Anteprima
pt: ## Visualização
ru: ## Предпросмотр

# chunk_451D1544
source: ### Getting Started
de: ### Erste Schritte
fr: ### Commencer
it: ### Iniziare
pt: ### Começar
ru: ### Начало работы

# chunk_5534569E
source: PDFMathTranslate is a powerful PDF translation tool. You can install and start using this tool in various ways.
de: PDFMathTranslate ist ein leistungsstarkes PDF-Übersetzungstool. Sie können dieses Tool auf verschiedene Arten installieren und mit der Nutzung beginnen.
fr: PDFMathTranslate est un puissant outil de traduction de PDF. Vous pouvez installer et commencer à utiliser cet outil de différentes manières.
it: PDFMathTranslate è un potente strumento di traduzione di PDF. Puoi installare e iniziare a utilizzare questo strumento in vari modi.
pt: PDFMathTranslate é uma poderosa ferramenta de tradução de PDF. Você pode instalar e começar a usar esta ferramenta de várias maneiras.
ru: PDFMathTranslate — это мощный инструмент для перевода PDF. Вы можете установить и начать использовать этот инструмент различными способами.
