Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_854DF91F
source: | `--ui-lang` | UI language | `pdf2zh_next --gui --ui-lang zh` |
de: | ------------------------------- | -------------------------------------- | ----------------------------------------------- | | `--src-lang` | Source language | `pdf2zh_next --src-lang en` | | `--dst-lang` | Target language | `pdf2zh_next --dst-lang zh` | | `--translator` | Translator service | `pdf2zh_next --translator google` | | `--translator-config` | Translator configuration | `pdf2zh_next --translator-config '{"key": ""}'` | | `--translator-config-file` | Translator configuration file | `pdf2zh_next --translator-config-file config.json` | | `--translator-config-file-type` | Translator configuration file type | `pdf2zh_next --translator-config-file-type json` | --- ### TRANSLATION RESULT | `--ui-lang` | UI-Sprache | `pdf2zh_next --gui --ui-lang zh` | | ------------------------------- | -------------------------------------- | ----------------------------------------------- | | `--src-lang` | Quellsprache | `pdf2zh_next --src-lang en` | | `--dst-lang` | Zielsprache | `pdf2zh_next --dst-lang zh` | | `--translator` | Übersetzungsdienst | `pdf2zh_next --translator google` | | `--translator-config` | Übersetzerkonfiguration | `pdf2zh_next --translator-config '{"key": ""}'` | | `--translator-config-file` | Übersetzerkonfigurationsdatei | `pdf2zh_next --translator-config-file config.json` | | `--translator-config-file-type` | Übersetzerkonfigurationsdateityp | `pdf2zh_next --translator-config-file-type json` |
fr: | ------------------------------- | -------------------------------------- | ----------------------------------------------- | | `--target-lang` | Target language of the output document | `pdf2zh_next --gui --target-lang fr` | | `--model` | Model name | `pdf2zh_next --gui --model gpt-4o-mini` | | `--proxy` | Proxy URL | `pdf2zh_next --gui --proxy http://127.0.0.1:7890` | | `--no-proxy` | Disable proxy | `pdf2zh_next --gui --no-proxy` | | `--api-key` | API key | `pdf2zh_next --gui --api-key sk-xxxxx` | | `--api-base` | API base URL | `pdf2zh_next --gui --api-base https://api.example.com` | --- ### OUTPUT | `--ui-lang` | Langue de l'interface utilisateur | `pdf2zh_next --gui --ui-lang zh` | | ------------------------------- | -------------------------------------- | ----------------------------------------------- | | `--target-lang` | Langue cible du document de sortie | `pdf2zh_next --gui --target-lang fr` | | `--model` | Nom du modèle | `pdf2zh_next --gui --model gpt-4o-mini` | | `--proxy` | URL du proxy | `pdf2zh_next --gui --proxy http://127.0.0.1:7890` | | `--no-proxy` | Désactiver le proxy | `pdf2zh_next --gui --no-proxy` | | `--api-key` | Clé API | `pdf2zh_next --gui --api-key sk-xxxxx` | | `--api-base` | URL de base de l'API | `pdf2zh_next --gui --api-base https://api.example.com` |
it: | :------------------------------ | :------------------------------------- | :---------------------------------------------- | | `--translator` | Translation service | `pdf2zh_next --translator google` | | `--source-lang` | Source language code | `pdf2zh_next --source-lang en` | | `--target-lang` | Target language code | `pdf2zh_next --target-lang zh` | | `--model` | Model for openai/azure_openai | `pdf2zh_next --model gpt-4o-mini` | | `--api-key` | API key for openai/azure_openai | `pdf2zh_next --api-key sk-xxx...` | | `--api-base` | API base for azure_openai | `pdf2zh_next --api-base https://xxx.openai.azure.com/` | | `--api-version` | API version for azure_openai | `pdf2zh_next --api-version 2024-02-01` | | `--deployment-name` | Deployment name for azure_openai | `pdf2zh_next --deployment-name gpt-4o-mini` | | `--auth-token` | Auth token for huggingface | `pdf2zh_next --auth-token hf_xxx...` | | `--concurrency-limit` | Concurrency limit for async translation | `pdf2zh_next --concurrency-limit 5` | | `--formula-detection-engine` | Formula detection engine | `pdf2zh_next --formula-detection engine` | | `--formula-detection-sensitivity` | Formula detection sensitivity | `pdf2zh_next --formula-detection-sensitivity 0.5` | | `--mathpix-app-id` | Mathpix App ID | `pdf2zh_next --mathpix-app-id xxx` | | `--mathpix-app-key` | Mathpix App Key | `pdf2zh_next --mathpix-app-key xxx` | | `--proxy` | Proxy URL | `pdf2zh_next --proxy http://127.0.0.1:10809` | | `--request-timeout` | Request timeout (seconds) | `pdf2zh_next --request-timeout 30` | | `--max-retries` | Max retries for failed requests | `pdf2zh_next --max-retries 3` | | `--retry-delay` | Retry delay (seconds) | `pdf2zh_next --retry-delay 2` | | `--custom-glossary` | Custom glossary file | `pdf2zh_next --custom-glossary ./glossary.json` | | `--custom-glossary-weight` | Custom glossary weight | `pdf2zh_next --custom-glossary-weight 0.7` | | `--cache` | Cache translations | `pdf2zh_next --cache` | | `--cache-dir` | Cache directory | `pdf2zh_next --cache-dir ./cache` | | `--no-cache` | Disable cache | `pdf2zh_next --no-cache` | | `--open-browser` | Open browser after starting WebUI | `pdf2zh_next --open-browser` | | `--host` | WebUI host address | `pdf2zh_next --host 0.0.0.0` | | `--port` | WebUI port | `pdf2zh_next --port 8080` | | `--log-level` | Log level | `pdf2zh_next --log-level info` | | `--log-file` | Log file path | `pdf2zh_next --log-file ./logs/app.log` | | `--version` | Show version | `pdf2zh_next --version` | | `--help` | Show help | `pdf2zh_next --help` | --- ### TRANSLATED TEXT | `--ui-lang` | Lingua dell'interfaccia utente | `pdf2zh_next --gui --ui-lang zh` | | :------------------------------ | :------------------------------------- | :---------------------------------------------- | | `--translator` | Servizio di traduzione | `pdf2zh_next --translator google` | | `--source-lang` | Codice lingua di origine | `pdf2zh_next --source-lang en` | | `--target-lang` | Codice lingua di destinazione | `pdf2zh_next --target-lang zh` | | `--model` | Modello per openai/azure_openai | `pdf2zh_next --model gpt-4o-mini` | | `--api-key` | Chiave API per openai/azure_openai | `pdf2zh_next --api-key sk-xxx...` | | `--api-base` | Base API per azure_openai | `pdf2zh_next --api-base https://xxx.openai.azure.com/` | | `--api-version` | Versione API per azure_openai | `pdf2zh_next --api-version 2024-02-01` | | `--deployment-name` | Nome della distribuzione per azure_openai | `pdf2zh_next --deployment-name gpt-4o-mini` | | `--auth-token` | Token di autenticazione per huggingface | `pdf2zh_next --auth-token hf_xxx...` | | `--concurrency-limit` | Limite di concorrenza per la traduzione asincrona | `pdf2zh_next --concurrency-limit 5` | | `--formula-detection-engine` | Motore di rilevamento delle formule | `pdf2zh_next --formula-detection engine` | | `--formula-detection-sensitivity` | Sensibilità del rilevamento delle formule | `pdf2zh_next --formula-detection-sensitivity 0.5` | | `--mathpix-app-id` | ID app Mathpix | `pdf2zh_next --mathpix-app-id xxx` | | `--mathpix-app-key` | Chiave app Mathpix | `pdf2zh_next --mathpix-app-key xxx` | | `--proxy` | URL del proxy | `pdf2zh_next --proxy http://127.0.0.1:10809` | | `--request-timeout` | Timeout della richiesta (secondi) | `pdf2zh_next --request-timeout 30` | | `--max-retries` | Tentativi massimi per richieste fallite | `pdf2zh_next --max-retries 3` | | `--retry-delay` | Ritardo tra i tentativi (secondi) | `pdf2zh_next --retry-delay 2` | | `--custom-glossary` | File del glossario personalizzato | `pdf2zh_next --custom-glossary ./glossary.json` | | `--custom-glossary-weight` | Peso del glossario personalizzato | `pdf2zh_next --custom-glossary-weight 0.7` | | `--cache` | Memorizza nella cache le traduzioni | `pdf2zh_next --cache` | | `--cache-dir` | Directory della cache | `pdf2zh_next --cache-dir ./cache` | | `--no-cache` | Disabilita la cache | `pdf2zh_next --no-cache` | | `--open-browser` | Apri il browser dopo aver avviato WebUI | `pdf2zh_next --open-browser` | | `--host` | Indirizzo host WebUI | `pdf2zh_next --host 0.0.0.0` | | `--port` | Porta WebUI | `pdf2zh_next --port 8080` | | `--log-level` | Livello di log | `pdf2zh_next --log-level info` | | `--log-file` | Percorso del file di log | `pdf2zh_next --log-file ./logs/app.log` | | `--version` | Mostra la versione | `pdf2zh_next --version` | | `--help` | Mostra aiuto | `pdf2zh_next --help` |
pt: | ------------------------------- | -------------------------------------- | ----------------------------------------------- | | `--ui-lang` | Idioma da interface do usuário | `pdf2zh_next --gui --ui-lang pt` | --- ### OUTPUT | `--ui-lang` | Idioma da interface do usuário | `pdf2zh_next --gui --ui-lang pt` |
ru: | ------------------------------- | -------------------------------------- | ----------------------------------------------- | | `--model` | Model name | `pdf2zh_next --model gpt-4o-mini` | | `--api-key` | API key | `pdf2zh_next --api-key sk-...` | | `--api-base` | API base URL | `pdf2zh_next --api-base https://api.example.com` | | `--proxy` | Proxy URL | `pdf2zh_next --proxy http://127.0.0.1:7890` | | `--concurrent` | Concurrent requests | `pdf2zh_next --concurrent 5` | | `--timeout` | Request timeout (seconds) | `pdf2zh_next --timeout 60` | | `--retry` | Retry attempts | `pdf2zh_next --retry 3` | | `--retry-delay` | Retry delay (seconds) | `pdf2zh_next --retry-delay 5` | | `--max-tokens` | Max tokens per request | `pdf2zh_next --max-tokens 4096` | | `--temperature` | Temperature | `pdf2zh_next --temperature 0.7` | | `--top-p` | Top-p | `pdf2zh_next --top-p 0.95` | | `--frequency-penalty` | Frequency penalty | `pdf2zh_next --frequency-penalty 0` | | `--presence-penalty` | Presence penalty | `pdf2zh_next --presence-penalty 0` | | `--stop` | Stop sequences | `pdf2zh_next --stop "END" --stop "###"` | | `--batch-size` | Batch size | `pdf2zh_next --batch-size 10` | | `--batch-delay` | Batch delay (seconds) | `pdf2zh_next --batch-delay 1` | | `--output-dir` | Output directory | `pdf2zh_next --output-dir ./output` | | `--output-format` | Output format | `pdf2zh_next --output-format markdown` | | `--output-filename` | Output filename pattern | `pdf2zh_next --output-filename "{title}.md"` | | `--output-encoding` | Output encoding | `pdf2zh_next --output-encoding utf-8` | | `--output-overwrite` | Overwrite existing files | `pdf2zh_next --output-overwrite` | | `--output-keep-temp` | Keep temporary files | `pdf2zh_next --output-keep-temp` | | `--log-level` | Log level | `pdf2zh_next --log-level info` | | `--log-file` | Log file | `pdf2zh_next --log-file ./pdf2zh.log` | | `--config` | Config file | `pdf2zh_next --config ./config.toml` | | `--help` | Show help | `pdf2zh_next --help` | | `--version` | Show version | `pdf2zh_next --version` | --- ### OUTPUT | `--ui-lang` | Язык интерфейса | `pdf2zh_next --gui --ui-lang zh` | | ------------------------------- | -------------------------------------- | ----------------------------------------------- | | `--model` | Название модели | `pdf2zh_next --model gpt-4o-mini` | | `--api-key` | API-ключ | `pdf2zh_next --api-key sk-...` | | `--api-base` | Базовый URL API | `pdf2zh_next --api-base https://api.example.com` | | `--proxy` | URL прокси | `pdf2zh_next --proxy http://127.0.0.1:7890` | | `--concurrent` | Количество одновременных запросов | `pdf2zh_next --concurrent 5` | | `--timeout` | Таймаут запроса (секунды) | `pdf2zh_next --timeout 60` | | `--retry` | Количество попыток повтора | `pdf2zh_next --retry 3` | | `--retry-delay` | Задержка повтора (секунды) | `pdf2zh_next --retry-delay 5` | | `--max-tokens` | Максимальное количество токенов на запрос | `pdf2zh_next --max-tokens 4096` | | `--temperature` | Температура | `pdf2zh_next --temperature 0.7` | | `--top-p` | Top-p | `pdf2zh_next --top-p 0.95` | | `--frequency-penalty` | Штраф за частоту | `pdf2zh_next --frequency-penalty 0` | | `--presence-penalty` | Штраф за присутствие | `pdf2zh_next --presence-penalty 0` | | `--stop` | Стоп-последовательности | `pdf2zh_next --stop "END" --stop "###"` | | `--batch-size` | Размер пакета | `pdf2zh_next --batch-size 10` | | `--batch-delay` | Задержка пакета (секунды) | `pdf2zh_next --batch-delay 1` | | `--output-dir` | Выходная директория | `pdf2zh_next --output-dir ./output` | | `--output-format` | Формат вывода | `pdf2zh_next --output-format markdown` | | `--output-filename` | Шаблон имени выходного файла | `pdf2zh_next --output-filename "{title}.md"` | | `--output-encoding` | Кодировка вывода | `pdf2zh_next --output-encoding utf-8` | | `--output-overwrite` | Перезаписывать существующие файлы | `pdf2zh_next --output-overwrite` | | `--output-keep-temp` | Сохранять временные файлы | `pdf2zh_next --output-keep-temp` | | `--log-level` | Уровень логирования | `pdf2zh_next --log-level info` | | `--log-file` | Файл лога | `pdf2zh_next --log-file ./pdf2zh.log` | | `--config` | Файл конфигурации | `pdf2zh_next --config ./config.toml` | | `--help` | Показать справку | `pdf2zh_next --help` | | `--version` | Показать версию | `pdf2zh_next --version` |

# chunk_F1B6ECA2
source: [⬆️ Back to top](#toc)
de: [⬆️ Zurück zum Anfang](#toc)
fr: [⬆️ Retour en haut](#toc)
it: [⬆️ Torna all'inizio](#toc)
pt: [⬆️ Voltar ao topo](#toc)
ru: [⬆️ Наверх](#toc)

# chunk_E0DC0651
source: #### Rate Limiting Configuration Guide
de: #### Anleitung zur Ratenbegrenzungskonfiguration
fr: #### Guide de configuration des limites de débit
it: #### Guida alla configurazione del limite di velocità
pt: #### Guia de Configuração de Limitação de Taxa
ru: #### Руководство по настройке ограничения скорости

# chunk_23D405EC
source: When using translation services, proper rate limiting configuration is crucial to avoid API errors and optimize performance. This guide explains how to configure `--qps` and `--pool-max-worker` parameters based on different upstream service limitations.
de: Bei der Verwendung von Übersetzungsdiensten ist eine korrekte Ratenbegrenzungskonfiguration entscheidend, um API-Fehler zu vermeiden und die Leistung zu optimieren. Diese Anleitung erklärt, wie die Parameter `--qps` und `--pool-max-worker` basierend auf den verschiedenen Einschränkungen des Upstream-Dienstes konfiguriert werden.
fr: Lors de l'utilisation des services de traduction, une configuration appropriée des limites de débit est cruciale pour éviter les erreurs d'API et optimiser les performances. Ce guide explique comment configurer les paramètres `--qps` et `--pool-max-worker` en fonction des différentes limitations des services en amont.
it: Quando si utilizzano i servizi di traduzione, una corretta configurazione del limite di velocità è fondamentale per evitare errori API e ottimizzare le prestazioni. Questa guida spiega come configurare i parametri `--qps` e `--pool-max-worker` in base alle diverse limitazioni del servizio upstream.
pt: Ao utilizar serviços de tradução, a configuração adequada da limitação de taxa é crucial para evitar erros de API e otimizar o desempenho. Este guia explica como configurar os parâmetros `--qps` e `--pool-max-worker` com base nas diferentes limitações do serviço upstream.
ru: При использовании служб перевода правильная настройка ограничения скорости крайне важна для предотвращения ошибок API и оптимизации производительности. В этом руководстве объясняется, как настроить параметры `--qps` и `--pool-max-worker` в зависимости от ограничений различных вышестоящих служб.

# chunk_742CD289
source: > [!TIP] > > It is recommended that the pool_size does not exceed 1000. If the pool_size calculated by the following method exceeds 1000, please use 1000.
de: > [!TIP] > > Es wird empfohlen, dass die pool_size 1000 nicht überschreitet. Wenn die nach folgender Methode berechnete pool_size 1000 überschreitet, verwenden Sie bitte 1000.
fr: > [!TIP] > > Il est recommandé que le pool_size ne dépasse pas 1000. Si le pool_size calculé par la méthode suivante dépasse 1000, veuillez utiliser 1000.
it: > [!TIP] > > Si consiglia che il pool_size non superi 1000. Se il pool_size calcolato con il seguente metodo supera 1000, si prega di utilizzare 1000.
pt: > [!TIP] > > É recomendado que o `pool_size` não exceda 1000. Se o `pool_size` calculado pelo método a seguir exceder 1000, por favor, use 1000.
ru: > [!TIP] > > Рекомендуется, чтобы `pool_size` не превышал 1000. Если `pool_size`, рассчитанный следующим методом, превышает 1000, используйте 1000.

# chunk_F9E5B2E2
source: ##### RPM (Requests Per Minute) Rate Limiting
de: ##### RPM (Anfragen pro Minute) Ratenbegrenzung
fr: ##### Limitation du taux RPM (Requêtes Par Minute)
it: ##### Limitazione della velocità RPM (Richieste al minuto)
pt: ##### Limitação de Taxa RPM (Solicitações Por Minuto)
ru: ##### Ограничение скорости RPM (запросов в минуту)

# chunk_CDE1A5D3
source: When the upstream service has RPM limitations, use the following calculation: **Calculation Formula:**
de: Wenn der Upstream-Dienst RPM-Beschränkungen hat, verwenden Sie die folgende Berechnung: **Berechnungsformel:**
fr: Lorsque le service en amont a des limitations RPM, utilisez le calcul suivant : **Formule de calcul :**
it: Quando il servizio upstream ha limitazioni RPM, utilizza il seguente calcolo: **Formula di calcolo:**
pt: Quando o serviço upstream tem limitações de RPM, use o seguinte cálculo: **Fórmula de Cálculo:**
ru: Если вышестоящий сервис имеет ограничения RPM, используйте следующий расчет: **Формула расчета:**

# chunk_1C383BEE
source: > [!NOTE] > The factor of 10 is an empirical coefficient that generally works well for most scenarios.
de: > [!NOTE] > Der Faktor 10 ist ein empirischer Koeffizient, der in den meisten Szenarien gut funktioniert.
fr: > [!NOTE] > Le facteur de 10 est un coefficient empirique qui fonctionne généralement bien pour la plupart des scénarios.
it: > [!NOTE] > Il fattore 10 è un coefficiente empirico che generalmente funziona bene per la maggior parte degli scenari.
pt: > [!NOTE] > O fator de 10 é um coeficiente empírico que geralmente funciona bem para a maioria dos cenários.
ru: > [!NOTE] > Коэффициент 10 является эмпирическим и обычно хорошо работает в большинстве сценариев.

# chunk_AB49073F
source: **Example:** If your translation service has a limit of 600 RPM:
de: **Beispiel:** Wenn Ihr Übersetzungsdienst eine Begrenzung von 600 RPM hat:
fr: ### TEXTE ORIGINAL **Exemple :** Si votre service de traduction a une limite de 600 RPM :
it: **Esempio:** Se il tuo servizio di traduzione ha un limite di 600 RPM:
pt: **Exemplo:** Se o seu serviço de tradução tiver um limite de 600 RPM:
ru: **Пример:** Если ваша служба перевода имеет ограничение в 600 RPM:

# chunk_C7673CDB
source: ##### Concurrent Connection Limiting
de: ##### Begrenzung gleichzeitiger Verbindungen
fr: ##### Limitation des connexions simultanées
it: ##### Limitazione delle connessioni simultanee
pt: ##### Limitação de Conexões Simultâneas
ru: ##### Ограничение количества одновременных подключений

# chunk_62AE5A6C
source: When the upstream service has concurrent connection limitations (like GLM official service), use this approach: **Calculation Formula:**
de: Wenn der Upstream-Dienst Einschränkungen bei gleichzeitigen Verbindungen hat (wie der offizielle GLM-Dienst), verwenden Sie diesen Ansatz: **Berechnungsformel:**
fr: Lorsque le service en amont a des limitations de connexions simultanées (comme le service officiel GLM), utilisez cette approche : **Formule de calcul :**
it: Quando il servizio upstream ha limitazioni di connessione simultanea (come il servizio ufficiale GLM), utilizza questo approccio: **Formula di calcolo:**
pt: Quando o serviço upstream tem limitações de conexões simultâneas (como o serviço oficial GLM), use esta abordagem: **Fórmula de Cálculo:**
ru: Если вышестоящий сервис имеет ограничения на количество одновременных подключений (например, официальный сервис GLM), используйте этот подход: **Формула расчета:**

# chunk_1616A330
source: **Example:** If your translation service allows 50 concurrent connections:
de: **Beispiel:** Wenn Ihr Übersetzungsdienst 50 gleichzeitige Verbindungen zulässt:
fr: **Exemple :** Si votre service de traduction autorise 50 connexions simultanées :
it: **Esempio:** Se il tuo servizio di traduzione consente 50 connessioni simultanee:
pt: **Exemplo:** Se o seu serviço de tradução permitir 50 conexões simultâneas:
ru: **Пример:** Если ваша служба перевода позволяет 50 одновременных подключений:

# chunk_4C0D79DD
source: ##### Best Practices
fr: ##### Meilleures pratiques
pt: ##### Melhores práticas
ru: ##### Лучшие практики

# chunk_60A6D664
source: > [!TIP] > - Always start with conservative values and gradually increase if needed > - Monitor your service's response times and error rates > - Different services may require different optimization strategies > - Consider your specific use case and document size when setting these parameters
de: > [!TIP] > - Beginnen Sie immer mit konservativen Werten und erhöhen Sie diese schrittweise, falls erforderlich > - Überwachen Sie die Antwortzeiten und Fehlerraten Ihres Dienstes > - Unterschiedliche Dienste können unterschiedliche Optimierungsstrategien erfordern > - Berücksichtigen Sie Ihren spezifischen Anwendungsfall und die Dokumentgröße bei der Festlegung dieser Parameter
fr: > [!TIP] > - Commencez toujours avec des valeurs conservatrices et augmentez-les progressivement si nécessaire > - Surveillez les temps de réponse et les taux d'erreur de votre service > - Différents services peuvent nécessiter différentes stratégies d'optimisation > - Prenez en compte votre cas d'utilisation spécifique et la taille des documents lors de la configuration de ces paramètres
it: > [!TIP] > - Inizia sempre con valori conservativi e aumenta gradualmente se necessario > - Monitora i tempi di risposta del tuo servizio e i tassi di errore > - Servizi diversi possono richiedere strategie di ottimizzazione diverse > - Considera il tuo caso d'uso specifico e la dimensione del documento quando imposti questi parametri
pt: > [!TIP] > - Sempre comece com valores conservadores e aumente gradualmente, se necessário > - Monitore os tempos de resposta e as taxas de erro do seu serviço > - Diferentes serviços podem exigir diferentes estratégias de otimização > - Considere seu caso de uso específico e o tamanho do documento ao definir esses parâmetros
ru: > [!TIP] > - Всегда начинайте с консервативных значений и постепенно увеличивайте их при необходимости > - Мониторьте время отклика вашего сервиса и частоту ошибок > - Разные сервисы могут требовать разных стратегий оптимизации > - Учитывайте ваш конкретный случай использования и размер документа при настройке этих параметров

# chunk_ADC018D0
source: #### Partial translation
de: #### Teilweise Übersetzung
fr: #### Traduction partielle
it: #### Traduzione parziale
pt: #### Tradução parcial
ru: #### Частичный перевод

# chunk_A7D2451C
source: Use the `--pages` parameter to translate a portion of a document.
de: Verwenden Sie den `--pages`-Parameter, um einen Teil eines Dokuments zu übersetzen.
fr: Utilisez le paramètre `--pages` pour traduire une partie d'un document.
it: Utilizzare il parametro `--pages` per tradurre una parte di un documento.
pt: Use o parâmetro `--pages` para traduzir uma parte de um documento.
ru: Используйте параметр `--pages` для перевода части документа.

# chunk_C04AFE09
source: - If the page numbers are consecutive, you can write it like this:
de: - Wenn die Seitenzahlen aufeinanderfolgend sind, können Sie es so schreiben:
fr: - Si les numéros de page sont consécutifs, vous pouvez l'écrire comme ceci :
it: - Se i numeri di pagina sono consecutivi, puoi scriverlo così:
pt: - Se os números das páginas forem consecutivos, você pode escrever assim:
ru: - Если номера страниц идут подряд, можно записать это так:
