Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_FED1157F
source: For the following types of PRs, it is recommended to discuss with maintainers first before submission:
de: - Major feature additions - Architectural changes - Breaking changes - Dependency updates - Performance optimizations - UI/UX changes --- ### TRANSLATION RESULT Für die folgenden Arten von PRs wird empfohlen, sie vor der Einreichung zuerst mit den Maintainern zu besprechen: - Hauptfunktionserweiterungen - Architekturänderungen - Breaking Changes - Abhängigkeitsaktualisierungen - Leistungsoptimierungen - UI/UX-Änderungen
fr: ### 1. UI/UX changes - **Major UI/UX changes** (e.g., redesigning the entire interface or adding significant new features) - **Changes to existing workflows** that could affect user experience - **Addition of new dependencies** for UI components ### 2. Core functionality modifications - **Changes to the core translation engine** or algorithms - **Modifications to file handling** or processing logic - **Performance optimizations** that alter existing behavior ### 3. Architectural changes - **Refactoring large portions** of the codebase - **Changing the project structure** or build system - **Database schema changes** or migrations ### 4. New feature proposals - **Significant new features** that would expand the project's scope - **Integration with external services** or APIs - **Authentication/authorization systems** ### 5. Breaking changes - **Any changes** that break backward compatibility - **Deprecation of existing features** - **Changes to public APIs** or interfaces ### 6. Security-related changes - **Security patches** or vulnerability fixes - **Authentication/authorization improvements** - **Data privacy enhancements** ### 7. Documentation updates - **Major rewrites** of documentation - **Translation of documentation** into new languages - **Structural changes** to documentation
it: - **New feature or major changes** (e.g., adding a new translation service, changing the core architecture, etc.) - **Changes that may affect user experience** (e.g., modifying the default configuration, changing the UI/UX, etc.) - **Changes that may affect performance** (e.g., modifying the core algorithms, changing the caching strategy, etc.) - **Changes that may affect security** (e.g., modifying the authentication mechanism, changing the data storage method, etc.) - **Changes that may affect compatibility** (e.g., modifying the API, changing the data format, etc.) - **Changes that may affect the project's long-term maintenance** (e.g., modifying the project structure, changing the dependency management method, etc.) --- ### TRANSLATION Per i seguenti tipi di PR, si consiglia di discutere prima con i maintainer prima dell' invio: - **Nuove funzionalità o modifiche importanti** (ad esempio, aggiungere un nuovo servizio di traduzione, modificare l' architettura core, ecc.) - **Modifiche che potrebbero influenzare l' esperienza utente** (ad esempio, modificare la configurazione predefinita, cambiare l' UI/UX, ecc.) - **Modifiche che potrebbero influenzare le prestazioni** (ad esempio, modificare gli algoritmi core, cambiare la strategia di caching, ecc.) - **Modifiche che potrebbero influenzare la sicurezza** (ad esempio, modificare il meccanismo di autenticazione, cambiare il metodo di archiviazione dei dati, ecc.) - **Modifiche che potrebbero influenzare la compatibilità** (ad esempio, modificare l' API, cambiare il formato dei dati, ecc.) - **Modifiche che potrebbero influenzare la manutenzione a lungo termine del progetto** (ad esempio, modificare la struttura del progetto, cambiare il metodo di gestione delle dipendenze, ecc.)
pt: - [ ] Add new features - [ ] Add new translation services - [ ] Add new languages - [ ] Add new dependencies - [ ] Add new CLI options - [ ] Add new configuration options - [ ] Add new environment variables - [ ] Add new tests - [ ] Add new documentation - [ ] Add new examples - [ ] Add new CI/CD pipelines - [ ] Add new scripts - [ ] Add new tools - [ ] Add new dependencies - [ ] Add new files - [ ] Add new directories - [ ] Add new licenses - [ ] Add new code of conduct - [ ] Add new contributing guidelines - [ ] Add new issue templates - [ ] Add new pull request templates - [ ] Add new security policies - [ ] Add new support files - [ ] Add new assets - [ ] Add new data - [ ] Add new resources - [ ] Add new fonts - [ ] Add new images - [ ] Add new videos - [ ] Add new audio - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [极不推荐添加新的依赖，除非是必要的]
ru: - [ ] Any changes to the core functionality of pdf2zh (including, but not limited to, changes to the translation engine, changes to the translation process, etc.) - [ ] Any changes to the CLI interface - [ ] Any changes to the configuration file format - [ ] Any changes to the output file format - [ ] Any changes to the project structure --- ### OUTPUT Для следующих типов PR рекомендуется сначала обсудить их с сопровождающими перед отправкой: - [ ] Любые изменения в основной функциональности pdf2zh (включая, но не ограничиваясь, изменениями в механизме перевода, изменениями в процессе перевода и т.д.) - [ ] Любые изменения в интерфейсе CLI - [ ] Любые изменения в формате файла конфигурации - [ ] Любые изменения в формате выходного файла - [ ] Любые изменения в структуре проекта

# chunk_11EC28E1
source: 1. PRs related to multi-user sharing functionality. (This project is primarily designed for single-user use and does not intend to introduce a comprehensive multi-user system).
de: 2. PRs related to authentication, authorization, or user management systems. (The project does not plan to implement a complete user system). 3. PRs that introduce new major dependencies without sufficient justification. (We aim to keep the project lightweight and maintainable). 4. PRs that significantly change the project's core architecture without prior discussion. (Such changes require careful consideration and consensus). 5. PRs that are not aligned with the project's primary goal of providing a simple and efficient PDF translation tool. (We want to avoid feature creep and keep the project focused). --- ### TRANSLATION RESULT 1. PRs im Zusammenhang mit Multi-User-Sharing-Funktionalität. (Dieses Projekt ist in erster Linie für die Einzelnutzung konzipiert und beabsichtigt nicht, ein umfassendes Multi-User-System einzuführen). 2. PRs im Zusammenhang mit Authentifizierung, Autorisierung oder Benutzerverwaltungssystemen. (Das Projekt plant nicht, ein vollständiges Benutzersystem zu implementieren). 3. PRs, die neue Hauptabhängigkeiten ohne ausreichende Begründung einführen. (Wir streben danach, das Projekt leichtgewichtig und wartbar zu halten). 4. PRs, die die Kernarchitektur des Projekts erheblich ändern, ohne vorherige Diskussion. (Solche Änderungen erfordern sorgfältige Überlegung und Konsens). 5. PRs, die nicht mit dem Hauptziel des Projekts übereinstimmen, ein einfaches und effizientes PDF-Übersetzungstool bereitzustellen. (Wir möchten Funktionsüberladung vermeiden und das Projekt fokussiert halten).
fr: 2. PRs that involve integrating with third-party services (e.g., Dropbox, Google Drive) without a clear use case that benefits the core translation functionality. 3. PRs that add new file format support without sufficient justification or demand from the community. 4. PRs that significantly alter the project's scope or direction (e.g., turning it into a general-purpose document editor). 5. PRs that introduce new dependencies without a strong rationale or that conflict with the project's lightweight philosophy. 6. PRs that are purely cosmetic changes without functional improvements. 7. PRs that are not aligned with the project's goals of being a simple, efficient PDF translation tool. --- ### TRANSLATION RESULT 1. PR liés à la fonctionnalité de partage multi-utilisateur. (Ce projet est principalement conçu pour une utilisation mono-utilisateur et n'a pas l'intention d'introduire un système multi-utilisateur complet). 2. PR qui impliquent l'intégration avec des services tiers (par exemple, Dropbox, Google Drive) sans un cas d'utilisation clair qui bénéficie à la fonctionnalité de traduction principale. 3. PR qui ajoutent la prise en charge de nouveaux formats de fichiers sans justification suffisante ou demande de la communauté. 4. PR qui modifient considérablement la portée ou la direction du projet (par exemple, le transformer en un éditeur de documents à usage général). 5. PR qui introduisent de nouvelles dépendances sans justification solide ou qui entrent en conflit avec la philosophie légère du projet. 6. PR qui sont des changements purement cosmétiques sans améliorations fonctionnelles. 7. PR qui ne sont pas alignés avec les objectifs du projet d'être un outil de traduction PDF simple et efficace.
it: 2. PRs that involve modifying the project's core architecture or introducing new dependencies without sufficient justification. 3. PRs that involve modifying the project's license or introducing new license restrictions. 4. PRs that involve modifying the project's core functionality without sufficient testing or documentation. --- ### TRANSLATED TEXT 1. PR relativi alla funzionalità di condivisione multi-utente. (Questo progetto è progettato principalmente per l'uso da parte di un singolo utente e non intende introdurre un sistema multi-utente completo). 2. PR che coinvolgono la modifica dell'architettura core del progetto o l'introduzione di nuove dipendenze senza una giustificazione sufficiente. 3. PR che coinvolgono la modifica della licenza del progetto o l'introduzione di nuove restrizioni di licenza. 4. PR che coinvolgono la modifica della funzionalità core del progetto senza test o documentazione sufficienti.
pt: 2. PRs related to implementing a plugin system. 3. PRs related to implementing a marketplace for plugins. 4. PRs related to implementing a user system. 5. PRs related to implementing a payment system. 6. PRs related to implementing a subscription system. 7. PRs related to implementing a user authentication system. 8. PRs related to implementing a user authorization system. 9. PRs related to implementing a user management system. 10. PRs related to implementing a user profile system. 11. PRs related to implementing a user settings system. 12. PRs related to implementing a user notification system. 13. PRs related to implementing a user activity tracking system. 14. PRs related to implementing a user analytics system. 15. PRs related to implementing a user feedback system. 16. PRs related to implementing a user support system. 17. PRs related to implementing a user help system. 18. PRs related to implementing a user documentation system. 19. PRs related to implementing a user tutorial system. 20. PRs related to implementing a user guide system. 21. PRs related to implementing a user FAQ system. 22. PRs related to implementing a user community system. 23. PRs related to implementing a user forum system. 24. PRs related to implementing a user chat system. 25. PRs related to implementing a user messaging system. 26. PRs related to implementing a user email system. 27. PRs related to implementing a user SMS system. 28. PRs related to implementing a user push notification system. 29. PRs related to implementing a user social media integration system. 30. PRs related to implementing a user third-party integration system. 31. PRs related to implementing a user API system. 32. PRs related to implementing a user webhook system. 33. PRs related to implementing a user event system. 34. PRs related to implementing a user logging system. 35. PRs related to implementing a user monitoring system. 36. PRs related to implementing a user alerting system. 37. PRs related to implementing a user reporting system. 38. PRs related to implementing a user dashboard system. 39. PRs related to implementing a user admin system. 40. PRs related to implementing a user super admin system. 41. PRs related to implementing a user role system. 42. PRs related to implementing a user permission system. 43. PRs related to implementing a user group system. 44. PRs related to implementing a user team system. 45. PRs related to implementing a user organization system. 46. PRs related to implementing a user project system. 47. PRs related to implementing a user task system. 48. PRs related to implementing a user workflow system. 49. PRs related to implementing a user automation system. 50. PRs related to implementing a user scheduling system. 51. PRs related to implementing a user calendar system. 52. PRs related to implementing a user time tracking system. 53. PRs related to implementing a user billing system. 54. PRs related to implementing a user invoicing system. 55. PRs related to implementing a user accounting system. 56. PRs related to implementing a user tax system. 57. PRs related to implementing a user legal system. 58. PRs related to implementing a user compliance system. 59. PRs related to implementing a user security system. 60. PRs related to implementing a user privacy system. 61. PRs related to implementing a user data protection system. 62. PRs related to implementing a user data retention system. 63. PRs related to implementing a user data deletion system. 64. PRs related to implementing a user data export system. 65. PRs related to implementing a user data import system. 66. PRs related to implementing a user data migration system. 67. PRs related to implementing a user data backup system. 68. PRs related to implementing a user data restore system. 69. PRs related to implementing a user data sync system. 70. PRs related to implementing a user data replication system. 71. PRs related to implementing a user data sharding system. 72. PRs related to implementing a user data partitioning system. 73.极不推荐添加新的依赖，除非是必要的 --- ### OUTPUT 1. PRs relacionados à funcionalidade de compartilhamento multiutilizador. (Este projeto é principalmente projetado para uso de utilizador único e não pretende introduzir um sistema multiutilizador abrangente). 2. PRs relacionados à implementação de um sistema de plugins. 3. PRs relacionados à implementação de um mercado para plugins. 4. PRs relacionados à implementação de um sistema de utilizador. 5. PRs relacionados à implementação de um sistema de pagamento. 6. PRs relacionados à implementação de um sistema de subscrição. 7. PRs relacionados à implementação de um sistema de autenticação de utilizador. 8. PRs relacionados à implementação de um sistema de autorização de utilizador. 9. PRs relacionados à implementação de um sistema de gestão de utilizadores. 10. PRs relacionados à implementação de um sistema de perfil de utilizador. 11. PRs relacionados à implementação de um sistema de definições de utilizador. 12. PRs relacionados à implementação de um sistema de notificação de utilizador. 13. PRs relacionados à implementação de um sistema de rastreamento de atividade do utilizador. 14. PRs relacionados à implementação de um sistema de análise de utilizador. 15. PRs relacionados à implementação de um sistema de feedback do utilizador. 16.极不推荐添加新的依赖，除非是必要的
ru: 2. PRs related to the addition of new translation engines (especially those requiring API keys). (This project aims to provide open-source, free translation engines. If you wish to add a new translation engine, please ensure it is open-source and free. If you need to use paid engines, please fork the project and use it yourself). 3. PRs related to the addition of new file formats. (This project is focused on PDF to Markdown conversion. If you need to convert other file formats, please use other tools). 4. PRs that significantly alter the project's direction or add new features that are not aligned with the project's goals. --- ### OUTPUT 1. PR, связанные с функциональностью многопользовательского доступа. (Этот проект в первую очередь предназначен для использования одним пользователем и не планирует внедрять полноценную многопользовательскую систему). 2. PR, связанные с добавлением новых механизмов перевода (особенно тех, которые требуют API-ключи). (Этот проект нацелен на предоставление открытых и бесплатных механизмов перевода. Если вы хотите добавить новый механизм перевода, убедитесь, что он является открытым и бесплатным. Если вам необходимо использовать платные механизмы, пожалуйста, форкните проект и используйте его самостоятельно). 3. PR, связанные с добавлением новых форматов файлов. (Этот проект сфокусирован на конвертации из PDF в Markdown. Если вам необходимо конвертировать другие форматы файлов, пожалуйста, используйте другие инструменты). 4. PR, которые значительно изменяют направление проекта или добавляют новые функции, не соответствующие целям проекта.

# chunk_485712CB
source: ## Contribution Process
de: ## Beitragsprozess
fr: ## Processus de contribution
it: ## Processo di Contribuzione
pt: ## Processo de Contribuição
ru: ## Процесс внесения вклада

# chunk_4D698FBF
source: 1. Fork this repository and clone it locally. 2. Create a new branch: `git checkout -b feature/<feature-name>`. 3. Develop and ensure your code meets the requirements. 4. Commit your code: ```bash git add . git commit -m "<semantic commit message>" ``` 5. Push to your repository: `git push origin feature/<feature-name>`. 6. Create a PR on GitHub, provide a detailed description, and request a review from [@awwaawwa](https://github.com/awwaawwa). 7. Ensure all automated checks pass.
de: 1. Forken Sie dieses Repository und klonen Sie es lokal. 2. Erstellen Sie einen neuen Branch: `git checkout -b feature/<feature-name>`. 3. Entwickeln Sie und stellen Sie sicher, dass Ihr Code den Anforderungen entspricht. 4. Committen Sie Ihren Code: ```bash git add . git commit -m "<semantic commit message>" ``` 5. Pushen Sie zu Ihrem Repository: `git push origin feature/<feature-name>`. 6. Erstellen Sie einen PR auf GitHub, geben Sie eine detaillierte Beschreibung an und fordern Sie eine Überprüfung von [@awwaawwa](https://github.com/awwaawwa) an. 7. Stellen Sie sicher, dass alle automatisierten Prüfungen bestanden werden.
fr: 1. Forkez ce dépôt et clonez-le localement. 2. Créez une nouvelle branche : `git checkout -b feature/<feature-name>`. 3. Développez et assurez-vous que votre code répond aux exigences. 4. Validez votre code : ```bash git add . git commit -m "<semantic commit message>" ``` 5. Poussez vers votre dépôt : `git push origin feature/<feature-name>`. 6. Créez une PR sur GitHub, fournissez une description détaillée et demandez une revue à [@awwaawwa](https://github.com/awwaawwa). 7. Assurez-vous que toutes les vérifications automatisées passent.
it: 1. Forka questo repository e clonalo localmente. 2. Crea un nuovo branch: `git checkout -b feature/<feature-name>`. 3. Sviluppa e assicurati che il tuo codice soddisfi i requisiti. 4. Esegui il commit del tuo codice: ```bash git add . git commit -m "<semantic commit message>" ``` 5. Esegui il push sul tuo repository: `git push origin feature/<feature-name>`. 6. Crea una PR su GitHub, fornisci una descrizione dettagliata e richiedi una revisione da [@awwaawwa](https://github.com/awwaawwa). 7. Assicurati che tutti i controlli automatizzati siano superati.
pt: 1. Faça um fork deste repositório e clone-o localmente. 2. Crie uma nova branch: `git checkout -b feature/<feature-name>`. 3. Desenvolva e certifique-se de que seu código atenda aos requisitos. 4. Faça commit do seu código: ```bash git add . git commit -m "<semantic commit message>" ``` 5. Envie para o seu repositório: `git push origin feature/<feature-name>`. 6. Crie um PR no GitHub, forneça uma descrição detalhada e solicite uma revisão de [@awwaawwa](https://github.com/awwaawwa). 7. Certifique-se de que todas as verificações automatizadas sejam aprovadas.
ru: 1. Форкните этот репозиторий и клонируйте его локально. 2. Создайте новую ветку: `git checkout -b feature/<feature-name>`. 3. Разрабатывайте и убедитесь, что ваш код соответствует требованиям. 4. Зафиксируйте изменения: ```bash git add . git commit -m "<semantic commit message>" ``` 5. Отправьте изменения в ваш репозиторий: `git push origin feature/<feature-name>`. 6. Создайте PR на GitHub, предоставьте подробное описание и запросите проверку у [@awwaawwa](https://github.com/awwaawwa). 7. Убедитесь, что все автоматические проверки пройдены.
