Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_A9512419
source: | `--version` | Show version then exit | `pdf2zh_next --version` |
de: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `-h`, `--help` | Show help message then exit | `pdf2zh_next --help` | | `-v`, `--verbose` | Show more information | `pdf2zh_next -v` | | `--log-level` | Set log level, default is `INFO` | `pdf2zh_next --log-level DEBUG` | | `--log-file` | Set log file path, default is `pdf2zh_next.log` | `pdf2zh_next --log-file /path/to/log/file.log` | | `--log-format` | Set log format, default is `%(asctime)s - %(name)s - %(levelname)s - %(message)s` | `pdf2zh_next --log-format "%(asctime)s - %(name)s - %(levelname)s - %(message)s"` | | `--log-datefmt` | Set log date format, default is `%Y-%m-%d %H:%M:%S` | `pdf2zh_next --log-datefmt "%Y-%m-%d %H:%M:%S"` | | `--log-backup-count` | Set log backup count, default is `7` | `pdf2zh_next --log-backup-count 7` | | `--log-max-bytes` | Set log max bytes, default is `10485760` (10MB) | `pdf2zh_next --log-max-bytes 10485760` | | `--log-encoding` | Set log encoding, default is `utf-8` | `pdf2zh_next --log-encoding utf-8` | | `--log-mode` | Set log mode, default is `a` (append) | `pdf2zh_next --log-mode a` | | `--log-compress` | Set log compress, default is `False` | `pdf2zh_next --log-compress False` | | `--log-delay` | Set log delay, default is `False` | `pdf2zh_next --log-delay False` | | `--log-utc` | Set log utc, default is `False` | `pdf2zh_next --log-utc False` | | `--log-color` | Set log color, default is `False` | `pdf2zh_next --log-color False` | | `--log-colors` | Set log colors, default is `None` | `pdf2zh_next --log-colors None` | | `--log-style` | Set log style, default is `%` | `pdf2zh_next --log-style "%"` | | `--log-traceback` | Set log traceback, default is `True` | `pdf2zh_next --log-traceback True` | | `--log-traceback-limit` | Set log traceback limit, default is `100` | `pdf2zh_next --log-traceback-limit 100` | | `--log-traceback-format` | Set log traceback format, default is `None` | `pdf2zh_next --log-traceback-format None` | | `--log-traceback-locals` | Set log traceback locals, default is `False` | `pdf2zh_next --log-traceback-locals False` | | `--log-traceback-max-frames` | Set log traceback max frames, default is `100` | `pdf2zh_next --log-traceback-max-frames 100` | | `--log-traceback-show-locals` | Set log traceback show locals, default is `False` | `pdf2zh_next --log-traceback-show-locals False` | | `--log-traceback-show-vars` | Set log traceback show vars, default is `False` | `pdf2zh_next --log-traceback-show-vars False` | | `--log-traceback-show-ids` | Set log traceback show ids, default is `False` | `pdf2zh_next --log-traceback-show-ids False` | | `--log-traceback-show-values` | Set log traceback show values, default is `False` | `pdf2zh_next --log-traceback-show-values False` | | `--log-traceback-show-types` | Set log traceback show types, default is `False` | `pdf2zh_next --log-traceback-show-types False` | | `--log-traceback-show-lengths` | Set log traceback show lengths, default is `False` | `pdf2zh_next --log-traceback-show-lengths False` | | `--log-traceback-show-filenames`| Set log traceback show filenames, default is `False` | `pdf2zh_next --log-traceback-show-filenames False` | | `--log-traceback-show-linenos` | Set log traceback show linenos, default is `False` | `pdf2zh_next --log-traceback-show-linenos False` | | `--log-traceback-show-functions`| Set log traceback show functions, default is `False` | `pdf2zh_next --log-traceback-show-functions False` | | `--log-traceback-show-modules` | Set log traceback show modules, default is `False` | `pdf2zh_next --log-traceback-show-modules False` | | `--log-traceback-show-paths` | Set log traceback show paths, default is `False` | `pdf2zh_next --log-traceback-show-paths False` | | `--log-traceback-show-urls` | Set log traceback show urls, default is `False` | `pdf2zh_next --log-traceback-show-urls False` | | `--log-traceback-show-args` | Set log traceback show args, default is `False` | `pdf2zh_next --log-traceback-show-args False` | | `--log-traceback-show-kwargs` | Set log traceback show kwargs, default is `False` | `pdf2zh_next --log-traceback-show-kwargs False` | | `--log-traceback-show-varnames` | Set log traceback show varnames, default is `False` | `pdf2zh_next --log-traceback-show-varnames False` | | `--log-traceback-show-argnames` | Set log traceback show argnames, default is `False` | `pdf2zh_next --log-traceback-show-argnames False` | | `--log-traceback-show-kwnames` | Set log traceback show kwnames, default is `False` | `pdf2zh_next --log-traceback-show-kwnames False` | | `--log-traceback-show-exc-info` | Set log traceback show exc info, default is `False` | `pdf2zh_next --log-traceback-show-exc-info False` | | `--log-traceback-show-exc-cause`| Set log traceback show exc cause, default is `False` | `pdf2zh_next --log-traceback-show-exc-cause False` | | `--log-traceback-show-exc-context`| Set log traceback show exc context, default is `False` | `pdf2zh_next --log-traceback-show-exc-context False` | | `--log-traceback-show-exc-chain`| Set log traceback show exc chain, default is `False` | `pdf2zh_next --log-traceback-show-exc-chain False` | | `--log-traceback-show-exc-full` | Set log traceback show exc full, default is `False` | `pdf2zh_next --log-traceback-show-exc-full False` | | `--log-traceback-show-exc-limit`| Set log traceback show exc limit, default is `None` | `pdf2zh_next --log-traceback-show-exc-limit None` | | `--log-traceback-show-exc-tb` | Set log traceback show exc tb, default is `False` | `pdf2zh_next --log-traceback-show-exc-tb False` | | `--log-traceback-show-exc-value`| Set log traceback show exc value, default is `False` | `pdf2zh_next --log-traceback-show-exc-value False` | | `--log-traceback-show-exc-type` | Set log traceback show exc type, default is `False` | `pdf2zh_next --log-traceback-show-exc-type False` | | `--log-traceback-show-exc-msg` | Set log traceback show exc msg, default is `False` | `pdf2zh_next --log 极 traceback-show-exc-msg False` | --- ### OUTPUT | `--version` | Version anzeigen und beenden | `pdf2zh_next --version` | | ------------------------------- | -------------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `-h`, `--help` | Hilfenachricht anzeigen und beenden | `pdf2zh_next --help` | | `-v`, `--verbose` | Mehr Informationen anzeigen | `pdf2zh_next -v` | | `--log-level` | Protokollierungsstufe festlegen, Standard ist `INFO` | `pdf2zh_next --log-level DEBUG` | | `--log-file` | Pfad der Protokolldatei festlegen, Standard ist `pdf2zh_next.log` | `pdf2zh_next --log-file /path/to/log/file.log` | | `--log-format` | Protokollformat festlegen, Standard ist `%(asctime)s - %(name)s - %(levelname)s - %(message)s` | `pdf2zh_next --log-format "%(asctime)s - %(name)s - %(levelname)s - %(message)s"` | | `--log-datefmt` | Datumsformat für Protokoll festlegen, Standard ist `%Y-%m-%d %H:%M:%S` | `pdf 极 zh_next --log-datefmt "%Y-%m-%d %H:%M:%S"` | | `--log-backup-count` | Anzahl der Protokollsicherungen festlegen, Standard ist `7` | `pdf2zh_next --log-back 极 up-count 7` | | `--log-max-bytes` | Maximale Größe der Protokolldatei festlegen, Standard ist `10485760` (10MB) | `pdf2zh_next --log-max-bytes 10485760` | | `--log-encoding` | Kodierung der Protokolldatei festlegen, Standard ist `utf-8` | `pdf2zh_next --log-encoding utf-8` | | `--log-mode` | Modus der Protokolldatei festlegen, Standard ist `a` (Anhängen) | `pdf2zh_next --log-mode a` | | `--log-compress` | Komprimierung der Protokolldatei festlegen, Standard ist `False` | `pdf2zh_next --log-compress False` | | `--极 log-delay` | Verzögerung der Protokollierung festlegen, Standard ist `False` | `pdf2zh_next --log-delay False` | | `--log-utc` | UTC-Zeit für Protokollierung festlegen, Standard ist `False` | `pdf2zh_next --log-utc False` | | `--log-color` | Farbige Protokollausgabe festlegen, Standard ist `False` | `pdf2zh_next --log-color False` | | `--log-colors` | Farben für Protokollausgabe festlegen, Standard ist `None` | `pdf2zh_next --log-colors None` | | `--log-style` | Stil der Protokollausgabe festlegen, Standard ist `%` | `pdf2zh_next --log-style "%"` | | `--log-traceback` | Traceback-Protokollierung aktivieren, Standard ist `True` | `pdf2zh_next --log-traceback True` | | `--log-traceback-limit` | Limit für Traceback-Protokollierung festlegen, Standard ist `100` | `pdf2zh_next --log-traceback-limit 100` | | `--log-traceback-format` | Format für Traceback-Protokollierung festlegen, Standard ist `None` | `pdf2zh_next --log-traceback-format None` | | `--log-traceback-locals` | Lokale Variablen in Traceback anzeigen, Standard ist `False` | `pdf2zh_next --log-traceback-locals False` | | `--log-traceback-max-frames` | Maximale Anzahl von Frames im Traceback festlegen, Standard ist `极 100` | `pdf2zh_next --log-traceback-max-frames 100` | | `--log-traceback-show-locals` | Lokale Variablen im Traceback anzeigen, Standard ist `False` | `pdf2zh_next --log-traceback-show-locals False` | | `--log-traceback-show-vars` | Variablen im Traceback anzeigen, Standard ist `False` | `pdf2zh_next --log-traceback-show-vars False` | | `--log-traceback-show-ids` | IDs im Traceback anzeigen, Standard ist `False` | `pdf2zh_next --log-traceback-show-ids False` | | `--log-traceback-show-values` | Werte im Traceback anzeigen, Standard ist `False` | `pdf2zh_next --log-traceback-show-values False` | | `--log-traceback-show-types` | Typen im Traceback anzeigen, Standard ist `False` | `pdf2zh_next --log-traceback-show-types False` | | `--log-traceback-show-lengths` | Längen im Traceback anzeigen, Standard ist `False` | `pdf2zh_next --log-traceback-show-lengths False` | | `--log-traceback-show-filenames`| Dateinamen im Traceback anzeigen, Standard ist `False` | `pdf2zh_next --log-traceback-show-filenames False` | | `--log-traceback-show-linenos` | Zeilennummern im Traceback anzeigen, Standard ist `False` | `pdf2zh_next --log-traceback-show-linenos False` | | `--log-traceback-show-functions`| Funktionen im Traceback anzeigen, Standard ist `False` | `pdf2zh_next --log-traceback-show-functions False` | | `--log-traceback-show-modules` | Module im Traceback anzeigen, Standard ist `False` | `pdf2zh_next --log-traceback-show-modules False` | | `--log-traceback-show-paths` | Pfade im Traceback anzeigen, Standard ist `False` | `pdf2zh_next --log-traceback-show-paths False` | | `--log-traceback-show-urls` | URLs im Traceback anzeigen, Standard ist `False` | `pdf2zh_next --log-traceback-show-urls False` | | `--log-traceback-show-args` | Argumente im Traceback anzeigen, Standard ist `False` | `pdf2zh_next --log-traceback-show-args False` | | `--log-traceback-show-kwargs` | Keyword-Argumente im Traceback anzeigen, Standard ist `False` | `pdf2zh_next --log-traceback-show-kwargs False` | | `--log-traceback-show-varnames` | Variablennamen im Traceback anzeigen, Standard ist `False` | `pdf2zh_next --log-traceback-show-varnames False` | | `--log-traceback-show-argnames` | Argumentnamen im Traceback anzeigen, Standard ist `False` | `pdf2zh_next --log-traceback-show-argnames False` | | `--log-traceback-show-kwnames` | Keyword-Argumentnamen im Traceback anzeigen, Standard ist `False` | `pdf2zh_next --log-traceback-show-kwnames False` | | `--log-traceback-show-exc-info` | Ausnahmeinformationen im Traceback anzeigen, Standard ist `False` | `pdf2zh_next --log-traceback-show-exc-info False` | | `--log-traceback-show-exc-cause`| Ausnahmeursache im Traceback anzeigen, Standard ist `False` | `pdf2zh_next --log-traceback-show-exc-cause False` | | `--log-traceback-show-exc-context`| Ausnahmekontext im Traceback anzeigen, Standard ist `False` | `pdf2zh_next --log-traceback-show-exc-context False` | | `--log-traceback-show-exc-chain`| Ausnahmekette im Traceback anzeigen, Standard ist `False` | `pdf2zh_next --log-traceback-show-exc-chain False` | | `--log-traceback-show-exc-full` | Vollständige Ausnahme im Traceback anzeigen, Standard ist `False` | `pdf2zh_next --log-traceback-show-exc-full False` | | `--log-traceback-show 极-exc-limit`| Limit für Ausnahmeanzeige im Traceback festlegen, Standard ist `None` | `pdf2zh_next --log-traceback-show-exc-limit None` | | `--log-traceback-show-exc-tb` | Traceback der Ausnahme anzeigen, Standard ist `False` | `pdf2zh_next --log-traceback-show-exc-tb False` | | `--log-traceback-show-exc-value`| Ausnahmewert im Traceback anzeigen, Standard ist `False` | `pdf2zh_next --log-traceback-show-exc-value False` | | `--log-traceback-show-exc-type` | Ausnahmetyp im Traceback anzeigen, Standard ist `False` | `pdf2zh_next --log-traceback-show-exc-type False` | | `--log-traceback-show-exc-msg` | Ausnahmemeldung im Traceback anzeigen, Standard ist `False` | `pdf2zh_next --log-traceback-show-exc-msg False` |
fr: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--help` | Show help then exit | `pdf2zh_next --help` | | `-i`, `--input <input>` | Input PDF file path (required) | `pdf2zh_next -i input.pdf` | | `-o`, `--output <output>` | Output directory (required) | `pdf2zh_next -i input.pdf -o output_directory` | | `-l`, `--lang <lang>` | Target language code (required). <br>See [Supported Languages](./SUPPORTED_LANG.md) | `pdf2zh_next -i input.pdf -o out -l fr` | | `-s`, `--service <service>` | Translation service (required). <br>See [Documentation of Translation Services](./TRANSLATION_SERVICES.md) | `pdf2zh_next -i input.pdf -o out -l fr -s google` | | `--service-key <service_key>` | Translation service key (optional) | `pdf2zh_next -i input.pdf -o out -l fr -s google --service-key <your_key>` | | `--service-url <service_url>` | Translation service url (optional) | `pdf2zh_next -i input.pdf -o out -l fr -s google --service-url <your_url>` | | `--service-region <service_region>` | Translation service region (optional) | `pdf2zh_next -i input.pdf -o out -l fr -s azure --service-region <your_region>` | | `--model <model>` | Model for translation (optional) | `pdf2zh_next -i input.pdf -o out -l fr -s openai --model gpt-4` | | `--math-translator <translator>` | Math translator (optional). <br>Choose from: `PDFMathTranslate`, `simple` | `pdf2zh_next -i input.pdf -o out -l fr -s google --math-translator PDFMathTranslate` | | `--math-prompt <prompt>` | Math prompt (optional) | `pdf2zh_next -i input.pdf -o out -l fr -s google --math-prompt <your_prompt>` | | `--no-text` | Skip text translation (optional) | `pdf2zh_next -i input.pdf -o out -l fr -s google --no-text` | | `--no-math` | Skip math translation (optional) | `pdf2zh_next -i input.pdf -o out -l fr -s google --no-math` | | `--only-math` | Only translate math (optional) | `pdf2zh_next -i input.pdf -o out -l fr -s google --only-math` | | `--workers <workers>` | Number of workers for translation (optional) | `pdf2zh_next -i input.pdf -o out -l fr -s google --workers 4` | | `--timeout <timeout>` | Timeout for each translation request in seconds (optional) | `pdf2zh_next -i input.pdf -o out -l fr -s google --timeout 30` | | `--retry <retry>` | Number of retries for each translation request (optional) | `pdf2zh_next -i input.pdf -o out -l fr -s google --retry 3` | | `--retry-wait <retry_wait>` | Wait time between retries in seconds (optional) | `pdf2zh_next -i input.pdf -o out -l fr -s google --retry-wait 1` | | `--check` | Check translation service without translating (optional) | `pdf2zh_next -i input.pdf -o out -l fr -s google --check` | | `--verbose` | Show verbose output (optional) | `pdf2zh_next -i input.pdf -o out -l fr -s google --verbose` | | `--debug` | Show debug output (optional) | `pdf2zh_next -i input.pdf -o out -l fr -s google --debug` | --- ### TRANSLATED TEXT | `--version` | Afficher la version puis quitter | `pdf2zh_next --version` | | ------------------------------- | ---------------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--help` | Afficher l'aide puis quitter | `pdf2zh_next --help` | | `-i`, `--input <input>` | Chemin du fichier PDF d'entrée (obligatoire) | `pdf2zh_next -i input.pdf` | | `-o`, `--output <output>` | Répertoire de sortie (obligatoire) | `pdf2zh_next -i input.pdf -o output_directory` | | `-l`, `--lang <lang>` | Code de langue cible (obligatoire). <br>Voir [Langues supportées](./SUPPORTED_LANG.md) | `pdf2zh_next -i input.pdf -o out -l fr` | | `-s`, `--service <service>` | Service de traduction (obligatoire). <br>Voir [Documentation des services de traduction](./TRANSLATION_SERVICES.md) | `pdf2zh_next -i input.pdf -o out -l fr -s google` | | `--service-key <service_key>` | Clé du service de traduction (optionnel) | `pdf2zh_next -i input.pdf -o out -l fr -s google --service-key <your_key>` | | `--service-url <service_url>` | URL du service de traduction (optionnel) | `pdf2zh_next -i input.pdf -o out -l fr -s google --service-url <your_url>` | | `--service-region <service_region>` | Région du service de traduction (optionnel) | `pdf2zh_next -i input.pdf -o out -l fr -s azure --service-region <your_region>` | | `--model <model>` | Modèle pour la traduction (optionnel) | `pdf2zh_next -i input.pdf -o out -l fr -s openai --model gpt-4` | | `--math-translator <translator>` | Traducteur mathématique (optionnel). <br>Choix possibles : `PDFMathTranslate`, `simple` | `pdf2zh_next -i input.pdf -o out -l fr -s google --math-translator PDFMathTranslate` | | `--math-prompt <prompt>` | Invite pour les mathématiques (optionnel) | `pdf2zh_next -i input.pdf -o out -l fr -s google --math-prompt <your_prompt>` | | `--no-text` | Ignorer la traduction du texte (optionnel) | `pdf2zh_next -i input.pdf -o out -l fr -s google --no-text` | | `--no-math` | Ignorer la traduction des mathématiques (optionnel) | `pdf2zh_next -i input.pdf -o out -l fr -s google --no-math` | | `--only-math` | Traduire uniquement les mathématiques (optionnel) | `pdf2zh_next -i input.pdf -o out -l fr -s google --only-math` | | `--workers <workers>` | Nombre de workers pour la traduction (optionnel) | `pdf2zh_next -i input.pdf -o out -l fr -s google --workers 4` | | `--timeout <timeout>` | Délai d'attente pour chaque requête de traduction en secondes (optionnel) | `pdf2zh_next -i input.pdf -o out -l fr -s google --timeout 30` | | `--retry <retry>` | Nombre de tentatives pour chaque requête de traduction (optionnel) | `pdf2zh_next -i input.pdf -o out -l fr -s google --retry 3` | | `--retry-wait <retry_wait>` | Temps d'attente entre les tentatives en secondes (optionnel) | `pdf2zh_next -i input.pdf -o out -l fr -s google --retry-wait 1` | | `--check` | Vérifier le service de traduction sans traduire (optionnel) | `pdf2zh_next -i input.pdf -o out -l fr -s google --check` | | `--verbose` | Afficher une sortie détaillée (optionnel) | `pdf2zh_next -i input.pdf -o out -l fr -s google --verbose` | | `--debug` | Afficher une sortie de débogage (optionnel) | `pdf2zh_next -i input.pdf -o out -l fr -s google --debug` |
it: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `-h`, `--help` | Show help then exit | `pdf2zh_next --help` | | `--list-languages` | List all supported languages then exit | `pdf2zh_next --list-languages` | | `--list-services` | List all supported translation services then exit | `pdf2zh_next --list-services` | | `-i`, `--input` | Path to the input PDF file | `pdf2zh_next -i input.pdf` | | `-o`, `--output` | Path to the output PDF file | `pdf2zh_next -o output.pdf` | | `-l`, `--lang` | Target language code | `pdf2zh_next -l it` | | `-s`, `--service` | Translation service to use, default is `google` | `pdf2zh_next -s google` | | `-c`, `--concurrency` | Number of concurrent translation requests, default is `4` | `pdf2zh_next -c 8` | | `-t`, `--timeout` | Timeout for each translation request in seconds, default is `30` | `pdf2zh_next -t 60` | | `-r`, `--retry` | Number of retries for failed requests, default is `3` | `pdf2zh_next -r 5` | | `--no-progress` | Disable progress bar | `pdf2zh_next --no-progress` | | `--no-color` | Disable colored output | `pdf2zh_next --no-color` | | `--log-level` | Log level, one of `debug`, `info`, `warning`, `error`, `critical`, default is `info` | `pdf2zh_next --log-level debug` | | `--log-file` | Path to the log file | `pdf2zh_next --log-file log.txt` | | `--config` | Path to the configuration file | `pdf2zh_next --config config.json` | | `--service-config` | Path to the service configuration file | `pdf2zh_next --service-config service.json` | | `--dry-run` | Dry run without actual translation | `pdf2zh_next --dry-run` | | `--force` | Force overwrite output file | `pdf2zh_next --force` | | `--skip-translated` | Skip already translated pages | `pdf2zh_next --skip-translated` | | `--resume` | Resume from last interrupted translation | `pdf2zh_next --resume` | | `--cache-dir` | Directory to store translation cache | `pdf2zh_next --cache-dir cache` | | `--no-cache` | Disable translation cache | `pdf2zh_next --no-cache` | | `--max-pages` | Maximum number of pages to translate | `pdf2zh_next --max-pages 10` | | `--page-range` | Page range to translate, e.g. `1-5,8,10-15` | `pdf2zh_next --page-range 1-5,8,10-15` | | `--ocr` | Enable OCR for scanned PDFs | `pdf2zh_next --ocr` | | `--ocr-language` | Language for OCR, default is `en` | `pdf2zh_next --ocr-language it` | | `--ocr-dpi` | DPI for OCR, default is `300` | `pdf2zh_next --ocr-dpi 600` | | `--ocr-timeout` | Timeout for OCR in seconds, default is `60` | `pdf2zh_next --ocr-timeout 120` | | `--font` | Font family for the translated text | `pdf2zh_next --font "Times New Roman"` | | `--font-size` | Font size for the translated text | `pdf2zh_next --font-size 12` | | `--line-spacing` | Line spacing for the translated text | `pdf2zh_next --line-spacing 1.5` | | `--margin` | Margin for the translated text | `pdf2zh_next --margin 10` | | `--color` | Text color for the translated text | `pdf2zh_next --color "#000000"` | | `--background-color` | Background color for the translated text | `pdf2zh_next --background-color "#FFFFFF"` | | `--bold` | Use bold font for the translated text | `pdf2zh_next --bold` | | `--italic` | Use italic font for the translated text | `pdf2zh_next --italic` | | `--underline` | Use underline for the translated text | `pdf2zh_next --underline` | | `--strikethrough` | Use strikethrough for the translated text | `pdf2zh_next --strikethrough` | | `--highlight` | Use highlight for the translated text | `pdf2zh_next --highlight` | | `--highlight-color` | Highlight color for the translated text | `pdf2zh_next --highlight-color "#FFFF00"` | | `--align` | Text alignment for the translated text, one of `left`, `center`, `right`, `justify` | `pdf2zh_next --align justify` | | `--preserve-layout` | Preserve original layout as much as possible | `pdf2zh_next --preserve-layout` | | `--preserve-images` | Preserve images in the PDF | `pdf2zh_next --preserve-images` | | `--preserve-tables` | Preserve tables in the PDF | `pdf2zh_next --preserve-tables` | | `--preserve-formulas` | Preserve formulas in the PDF | `pdf2zh_next --preserve-formulas` | | `--preserve-links` | Preserve links in the PDF | `pdf2zh_next --preserve-links` | | `--preserve-annotations` | Preserve annotations in the PDF | `pdf2zh_next --preserve-annotations` | | `--remove-original` | Remove original text after translation | `pdf2zh_next --remove-original` | | `--keep-original` | Keep original text alongside translated text | `pdf2zh_next --keep-original` | | `--original-opacity` | Opacity of original text when kept, between `0` and `1` | `pdf2zh_next --original-opacity 0.5` | | `--translated-opacity` | Opacity of translated text, between `0` and `1` | `pdf2zh_next --translated-opacity 1.0` | | `--original-color` | Text color for original text when kept | `pdf2zh_next --original-color "#888888"` | | `--original-font` | Font family for original text when kept | `pdf2zh_next --original-font "Arial"` | | `--original-font-size` | Font size for original text when kept | `pdf2zh_next --original-font-size 10` | | `--original-line-spacing` | Line spacing for original text when kept | `pdf2zh_next --original-line-spacing 1.2` | | `--original-align` | Text alignment for original text when kept | `pdf2zh_next --original-align left` | | `--original-bold` | Use bold font for original text when kept | `pdf2zh_next --original-bold` | | `--original-italic` | Use italic font for original text when kept | `pdf2zh_next --original-italic` | | `--original-underline` | Use underline for original text when kept | `pdf2zh_next --original-underline` | | `--original-strikethrough` | Use strikethrough for original text when kept | `pdf2zh_next --original-strikethrough` | | `--original-highlight` | Use highlight for original text when kept | `pdf2zh_next --original-highlight` | | `--original-highlight-color` | Highlight color for original text when kept | `pdf2zh_next --original-highlight-color "#CCCCCC"` | | `--watermark` | Add watermark to the translated PDF | `pdf2zh_next --watermark "Translated by pdf2zh"` | | `--watermark-color` | Watermark color | `pdf2zh_next --watermark-color "#000000"` | | `--watermark-opacity` | Watermark opacity, between `0` and `1` | `pdf2zh_next --watermark-opacity 0.1` | | `--watermark-font` | Watermark font family | `pdf2zh_next --watermark-font "Arial"` | | `--watermark-font-size` | Watermark font size | `pdf2zh_next --watermark-font-size 48` | | `--watermark-rotation` | Watermark rotation in degrees | `pdf2zh_next --watermark-rotation 45` | | `--watermark-position` | Watermark position, one of `center`, `top-left`, `top-right`, `bottom-left`, `bottom-right` | `pdf2zh_next --watermark-position center` | | `--metadata` | Update PDF metadata with translation information | `pdf2zh_next --metadata` | | `--metadata-title` | Title for the translated PDF | `pdf2zh_next --metadata-title "Translated Document"` | | `--metadata-author` | Author for the translated PDF | `pdf2zh_next --metadata-author "pdf2zh"` | | `--metadata-subject` | Subject for the translated PDF | `pdf2zh_next --metadata-subject "Translated PDF"` | | `--metadata-keywords` | Keywords for the translated PDF | `pdf2zh_next --metadata-keywords "translation, pdf"` | | `--metadata-creator` | Creator for the translated PDF | `pdf2zh_next --metadata-creator "pdf2zh"` | | `--metadata-producer` | Producer for the translated PDF | `pdf2zh_next --metadata-producer "pdf2zh"` | | `--metadata-creation-date` | Creation date for the translated PDF | `pdf2zh_next --metadata-creation-date "2023-01-01"` | | `--metadata-modification-date` | Modification date for the translated PDF | `pdf2zh_next --metadata-modification-date "2023-01-01"` | | `--check-updates` | Check for updates then exit | `pdf2zh_next --check-updates` | | `--self-update` | Update to the latest version | `pdf2zh_next --self-update` | | `--clean` | Clean temporary files | `pdf2zh_next --clean` | | `--verbose` | Verbose output | `pdf2zh_next --verbose` | | `--quiet` | Quiet output | `pdf2zh_next --quiet` | | `--debug` | Debug output | `pdf2zh_next --debug` | | `--version` | Show version then exit | `pdf2zh_next --version` | | `-h`, `--help` | Show help then exit | `pdf2zh_next --help` | | `--list-languages` | List all supported languages then exit | `pdf2zh_next --list-languages` | | `--list-services` | List all supported translation services then exit | `pdf2zh_next --list-services` | | `-i`, `--input` | Path to the input PDF file | `pdf2zh_next -i input.pdf` | | `-o`, `--output` | Path to the output PDF file | `pdf2zh_next -o output.pdf` | | `-l`, `--lang` | Target language code | `pdf2zh_next -l it` | | `-s`, `--service` | Translation service to use, default is `google` | `pdf2zh_next -s google` | | `-c`, `--concurrency` | Number of concurrent translation requests, default is `4` | `pdf2zh_next -c 8` | | `-t`, `--timeout` | Timeout for each translation request in seconds, extreme is `30` | `pdf2zh_next -t 60` | | `-r`, `--retry` | Number of retries for failed requests, default is `3` | `pdf2zh_next -r 5` | | `--no-progress` | Disable progress bar | `pdf2zh_next --no-progress` | | `--no-color` | Disable colored output | `pdf2zh_next --no-color` | | `--log-level` | Log level, one of `debug`, `info`, `warning`, `error`, `critical`, default is `info` | `pdf2zh_next --log-level debug` | | `--log-file` | Path to the log file | `pdf2zh_next --log-file log.txt` | | `--config` | Path to the configuration file | `pdf2zh_next --config config.json` | | `--service-config` | Path to the service configuration file | `pdf2zh_next --service-config service.json` | | `--dry-run` | Dry run without actual translation | `pdf2zh_next --dry-run` | | `--force` | Force overwrite output file | `pdf2zh_next --force 极` | --- ### TRANSLATION RESULT | `--version` | Mostra la versione e poi esce | `pdf2zh_next --version` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `-h`, `--help` | Mostra l' aiuto e poi esce | `pdf2zh_next --help` | | `--list-languages` | Elenca tutte le lingue supportate e poi esce | `pdf2zh_next --list-languages` | | `--list-services` | Elenca tutti i servizi di traduzione supportati e poi esce | `pdf2zh_next --list-services` | | `-i`, `--input` | Percorso del file PDF di input | `pdf2zh_next -i input.pdf` | | `-o`, `--output` | Percorso del file PDF di output | `pdf2zh_next -o output.pdf` | | `-l`, `--lang` | Codice lingua di destinazione | `pdf2zh_next -l it` | | `-s`, `--service` | Servizio di traduzione da utilizzare, predefinito è `google` | `pdf2zh_next -s google` | | `-极`, `--concurrency` | Numero di richieste di traduzione concorrenti, predefinito è `4` | `pdf2zh_next -c 8` | | `-t`, `--timeout` | Timeout per ogni richiesta di traduzione in secondi, predefinito è `30` | `pdf2zh_next -t 60` | | `-r`, `--retry` | Numero di tentativi per le richieste fallite, predefinito è `3` | `pdf2zh_next -r 5` | | `--no-progress` | Disabilita la barra di progresso | `极 zh_next --no-progress` | | `--no-color` | Disabilita l' output colorato | `pdf2zh_next --no-color` | | `--log-level` | Livello di log, uno tra `debug`, `info`, `warning`, `error`, `critical`, predefinito è `info` | `pdf2zh_next --log-level debug` | | `--log-file` | Percorso del file di log | `pdf2zh_next --log-file log.txt` | | `--config` | Percorso del file di configurazione | `pdf2zh_next --config config.json` | | `--service-config` | Percorso del file di configurazione del servizio | `pdf2zh_next --service-config service.json` | | `--dry-run` | Esecuzione di prova senza traduzione effettiva | `pdf2zh_next --dry-run` | | `--force` | Forza la sovrascrittura del file di output | `pdf2zh_next --force` | | `--skip-translated` | Salta le pagine già tradotte | `pdf2zh_next --skip-translated` | | `--resume` | Riprende dall' ultima traduzione interrotta | `pdf2zh_next --resume` | | `--cache-dir` | Directory per memorizzare la cache di traduzione | `pdf2zh_next --cache-d 极 cache` | | `--no-cache` | Disabilita la cache di traduzione | `pdf2zh_next --no-cache` | | `--max-pages` | Numero massimo di pagine da tradurre | `pdf2zh_next --max-pages 10` | | `--page-range` | Intervallo di pagine da tradurre, es. `1-5,8,10-15` | `pdf2zh_next --page-range 1-5,8,10-15` | | `--ocr` | Abilita OCR per PDF scansionati | `pdf2zh_next --ocr` | | `--ocr-language` | Lingua per OCR, predefinito è `en` | `pdf2zh_next --ocr-language it` | | `--ocr-dpi` | DPI per OCR, predefinito è `300` | `pdf2zh_next --ocr-dpi 600` | | `--ocr-timeout` | Timeout per OCR in secondi, predefinito è `60` | `pdf2zh_next --ocr-timeout 120` | | `--font` | Famiglia di font per il testo tradotto | `pdf2zh_next --font "Times New Roman"` | | `--font-size` | Dimensione del font per il testo tradotto | `pdf2zh_next --font-size 12` | | `--line-spacing` | Interlinea per il testo tradotto | `pdf2zh_next --line-spacing 1.5` | | `--margin` | Margine per il testo tradotto | `pdf2zh_next --margin 10` | | `--color` | Colore del testo per il testo tradotto | `pdf 极 zh_next --color "#000000"` | | `--background-color` | Colore di sfondo per il testo tradotto | `pdf2zh_next --background-color "#FFFFFF"` | | `--bold` | Utilizza il font in grassetto per il testo tradotto | `pdf2zh_next --bold` | | `--italic` | Utilizza il font in corsivo per il testo tradotto | `pdf2zh_next --italic` | | `--underline` | Utilizza la sottolineatura per il testo tradotto | `pdf2zh_next --underline` | | `--strikethrough` | Utilizza la barratura per il testo tradotto | `pdf2zh_next --strikethrough` | | `--highlight` | Utilizza l' evidenziatura per il testo tradotto | `pdf2zh_next --highlight` | | `--highlight-color` | Colore di evidenziatura per il testo tradotto | `pdf2zh_next --highlight-color "#FFFF00"` | | `--align` | Allineamento del testo per il testo tradotto, uno tra `left`, `center`, `right`, `justify` | `pdf2zh_next --align justify` | | `--preserve-layout` | Preserva il layout originale il più possibile | `pdf2zh_next --preserve-layout` | | `--preserve-images` | Preserva le immagini nel PDF | `pdf2zh_next --preserve-images` | | `--preserve-tables` | Preserva le tabelle nel PDF | `pdf2zh_next --preserve-tables` | | `--preserve-formulas` | Preserva le formule nel PDF | `pdf2zh_next --preserve-formulas` | | `--preserve-links` | Preserva i link nel PDF | `pdf2zh_next --preserve-links` | | `--preserve-annotations` | Preserva le annotazioni nel PDF | `pdf2zh_next --preserve-annotations` | | `--remove-original` | Rimuove il testo originale dopo la traduzione | `pdf2zh_next --remove-original` | | `--keep-original` | Mantiene il testo originale accanto al testo tradotto | `pdf2zh_next --keep-original` | | `--original-opacity` | Opacità del testo originale quando mantenuto, tra `0` e `1` | `pdf2zh_next --original-opacity 0.5` | | `--translated-opacity` | Opacità del testo tradotto, tra `0` e `1` | `pdf2zh_next --translated-opacity 1.0` | | `--original-color` | Colore del testo per il testo originale quando mantenuto | `pdf2zh_next --original-color "#888888"` | | `--original-font` | Famiglia di font per il testo originale quando mantenuto | `pdf2zh_next --original-font "Arial"` | | `--original-font-size` | Dimensione del font per il testo originale quando mantenuto | `pdf2zh_next --original-font-size 10` | | `--original-line-spacing` | Interlinea per il testo originale quando mantenuto | `pdf2zh_next --original-line-spacing 1.2` | | `--original-align` | Allineamento del testo per il testo originale quando mantenuto | `pdf2zh_next --original-align left` | | `--original-bold` | Utilizza il font in grassetto per il testo originale quando mantenuto | `pdf2zh_next --original-bold` | | `--original-italic` | Utilizza il font in corsivo per il testo originale quando mantenuto | `pdf2zh_next --original-italic` | | `--original-underline` | Utilizza la sottolineatura per il testo originale quando mantenuto | `pdf2zh_next --original-underline 极` | | `--original-strikethrough` | Utilizza la barratura per il testo originale quando mantenuto | `pdf2zh_next --original-strikethrough` | | `--original-highlight` | Utilizza l' evidenziatura per il testo originale quando mantenuto | `pdf2zh_next --original-highlight` | | `--original-highlight-color` | Colore di evidenziatura per il testo originale quando mantenuto | `pdf2zh_next --original-highlight-color "#CCCCCC"` | | `--watermark` | Aggiunge un watermark al PDF tradotto | `pdf2zh_next --watermark "Translated by pdf2zh"` | | `--watermark-color` | Colore del watermark | `pdf2zh_next --watermark-color "#000000"` | | `--watermark-opacity` | Opacità del watermark, tra `0` e `1` | `pdf2zh_next --watermark-opacity 0.1` | | `--watermark-font` | Famiglia di font per il watermark | `pdf2zh_next --watermark-font "Arial"` | | `--watermark-font-size` | Dimensione del font per il watermark | `pdf2zh_next --watermark-font-size 48` | | `--watermark-rotation` | Rotazione del watermark in gradi | `pdf2zh_next --watermark-rotation 45` | | `--watermark-position` | Posizione del watermark, uno tra `center`, `top-left`, `top-right`, `bottom-left`, `bottom-right` | `pdf2zh_next --watermark-position center` | | `--metadata` | Aggiorna i metadati PDF con le informazioni di traduzione | `pdf2zh_next --metadata` | | `--metadata-title` | Titolo per il PDF tradotto | `pdf2zh_next --metadata-title "Translated Document"` | | `--metadata-author` | Autore per il PDF tradotto | `pdf2zh_next --metadata-author "pdf2zh"` | | `--metadata-subject` | Soggetto per il PDF tradotto | `pdf2zh_next --metadata-subject "Translated PDF"` | | `--metadata-keywords` | Parole chiave per il PDF tradotto | `pdf2zh_next --metadata-keywords "translation, pdf"` | | `--metadata-creator` | Creatore per il PDF tradotto | `pdf2zh_next --metadata-creator "pdf2zh 极"` | | `--metadata-producer` | Produttore per il PDF tradotto | `pdf2zh_next --metadata-producer "pdf2zh"` | | `--metadata-creation-date` | Data di creazione per il PDF tradotto | `pdf2zh_next --metadata-creation-date "2023-01-01"` | | `--metadata-modification-date` | Data di modifica per il PDF tradotto | `pdf2zh_next --metadata-modification-date "2023-01-01"` | | `--check-updates` | Controlla gli aggiornamenti e poi esce | `pdf2zh_next --check-updates` | | `--self-update` | Aggiorna all' ultima versione | `pdf2zh_next --self-update` | | `--clean` | Pulisce i file temporanei | `pdf2zh_next --clean` | | `--verbose` | Output dettagliato | `pdf2zh_next --verbose` | | `--quiet` | Output silenzioso | `pdf2zh_next --quiet` | | `--debug` | Output di debug | `pdf2zh_next --debug` | | `--version` | Mostra la versione e poi esce | `pdf2zh_next --version` | | `-h`, `--help` | Mostra l' aiuto e poi esce | `pdf2zh_next --help` | | `--极-languages` | Elenca tutte le lingue supportate e poi esce | `pdf2zh_next --list-languages` | | `--list-services` | Elenca tutti i servizi di traduzione supportati e poi esce | `pdf2zh_next --list-services` | | `-i`, `--input` | Percorso del file PDF di input | `pdf2zh_next -i input.pdf` | | `-o`, `--output` | Percorso del file PDF di output | `pdf2zh_next -o output.pdf` | | `-l`, `--lang` | Codice lingua di destinazione | `pdf2zh_next -l it` | | `-s`, `--service` | Servizio di traduzione da utilizzare, predefinito è `google` | `pdf2zh_next -s google` | | `-c`, `--concurrency` | Numero di richieste di traduzione concorrenti, predefinito è `4` | `pdf2zh_next -c 8` | | `-t`, `--timeout` | Timeout per ogni richiesta di traduzione in secondi, predefinito è `30` | `pdf2zh_next -t 60` | | `-r`, `--retry` | Numero di tentativi per le richieste fallite, predefinito è `3` | `pdf2zh_next -r 5` | | `--no-progress` | Disabilita la barra di progresso | `pdf2zh_next --no-progress` | | `--no-color` | Disabilita l' output colorato | `pdf2zh_next --no-color` | | `--log-level` | Livello di log, uno tra `debug`, `info`, `warning`, `error`, `critical`, predefinito è `极` | `pdf2zh_next --log-level debug` | | `--log-file` | Percorso del file di log | `pdf2zh_next --log-file log.txt` | | `--config 极 | Percorso del file di configurazione | `pdf2zh_next --config config.json` | | `--service-config` | Percorso del file di configurazione del servizio | `pdf2zh_next --service-config service.json` | | `--dry-run` | Esecuzione di prova senza traduzione effettiva | `pdf2zh_next --dry-run` | | `--force` | Forza la sovrascrittura del file di output | `pdf2zh_next --force` |
pt: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `-h`, `--help` | Show help message then exit | `pdf2zh_next -h` | | `-v`, `--verbose` | Set log level to verbose | `pdf2zh_next -v` | | `-vv`, `--very-verbose` | Set log level to very verbose | `pdf2zh_next -vv` | | `-q`, `--quiet` | Set log level to quiet | `pdf2zh_next -q` | | `-i`, `--input` | Input file or directory | `pdf2zh_next -i file.pdf` <br> `pdf2zh_next -i ./input_dir` | | `-o`, `--output` | Output file or directory | `pdf2zh_next -i file.pdf -o file_translated.pdf` <br> `pdf2zh_next -i ./input_dir -o ./output_dir` | | `-l`, `--lang` | Target language code (default: `zh-CN`) | `pdf2zh_next -i file.pdf -l en` | | `-m`, `--model` | Translation model (default: `gpt-3.5-turbo`) | `pdf2zh_next -i file.pdf -m gpt-4` | | `-p`, `--prompt` | Prompt file path | `pdf2zh_next -i file.pdf -p ./prompt.txt` | | `-k`, `--key` | API key for translation service | `pdf2zh_next -i file.pdf -k sk-xxx` | | `-c`, `--config` | Config file path | `pdf2zh_next -i file.pdf -c ./config.yaml` | | `--openai_base_url` | OpenAI API base URL | `pdf2zh_next -i file.pdf --openai_base_url https://api.openai.com/v1` | | `--translator` | Translation service (default: `openai`) | `pdf2zh_next -i file.pdf --translator azure` | | `-t`, `--threads` | Number of threads (default: `5`) | `pdf2zh_next -i file.pdf -t 10` | | `--timeout` | Request timeout (default: `60`) | `pdf2zh_next -i file.pdf --timeout 120` | | `-s`, `--skip` | Skip existing files | `pdf2zh_next -i ./input_dir -o ./output_dir -s` | | `--no-split` | Disable automatic splitting of large files | `pdf2zh_next -i file.pdf --no-split` | | `--split-size` | Split size in MB (default: `10`) | `pdf2zh_next -i file.pdf --split-size 20` | | `--split-pages` | Split by page count | `pdf2zh_next -i file.pdf --split-pages 50` | | `--ocr` | Enable OCR for image-based PDFs | `pdf2zh_next -i file.pdf --ocr` | | `--ocr-lang` | OCR language code (default: `eng`) | `pdf2zh_next -i file.pdf --ocr --ocr-lang chi_sim` | | `--ocr-engine` | OCR engine (default: `easyocr`) | `pdf2zh_next -i file.pdf --ocr --ocr-engine paddleocr` | | `--format` | Output format (default: `pdf`) | `pdf2zh_next -i file.pdf --format markdown` | | `--font` | Font file path for PDF output | `pdf2zh_next -i file.pdf --font ./font.ttf` | | `--font-size` | Font size for PDF output (default: `12`) | `pdf2zh_next -i file.pdf --font-size 14` | | `--line-spacing` | Line spacing for PDF output (default: `1.2`) | `pdf2zh_next -i file.pdf --line-spacing 1.5` | | `--margin` | Margin for PDF output (default: `72`) | `pdf2zh_next -i file.pdf --margin 100` | | `--page-size` | Page size for PDF output (default: `A4`) | `pdf2zh_next -i file.pdf --page-size Letter` | | `--dpi` | DPI for image processing (default: `300`) | `pdf2zh_next -i file.pdf --dpi 150` | | `--no-backup` | Disable backup of original files | `pdf2zh_next -i file.pdf --no-backup` | | `--backup-dir` | Backup directory (default: `./backup`) | `pdf2zh_next -i file.pdf --backup-dir ./my_backup` | | `--retry` | Number of retries on failure (default: `3`) | `pdf2zh_next -i file.pdf --retry 5` | | `--retry-delay` | Delay between retries in seconds (default: `5`) | `pdf2zh_next -i file.pdf --retry-delay 10` | | `--max-tokens` | Maximum tokens per request (default: `4096`) | `pdf2zh_next -i file.pdf --max-tokens 2048` | | `--temperature` | Temperature for translation (default: `0.1`) | `pdf2zh_next -i file.pdf --temperature 0.5` | | `--batch-size` | Batch size for translation (default: `10`) | `pdf2zh_next -i file.pdf --batch-size 20` | | `--no-cache` | Disable translation cache | `pdf2zh_next -i file.pdf --no-cache` | | `--cache-dir` | Cache directory (default: `./cache`) | `pdf2zh_next -i file.pdf --cache-dir ./my_cache` | | `--clean-cache` | Clean cache before translation | `pdf2zh_next -i file.pdf --clean-cache` | | `--log-file` | Log file path | `pdf2zh_next -i file.pdf --log-file ./translation.log` | | `--log-level` | Log level (default: `INFO`) | `pdf2zh_next -i file.pdf --log-level DEBUG` | | `--no-color` | Disable colored output | `pdf2zh_next -i file.pdf --no-color` | | `--dry-run` | Dry run without actual translation | `pdf2zh_next -i file.pdf --dry-run` | | `--version-check` | Check for updates | `pdf2zh_next --version-check` | | `--list-languages` | List supported languages | `pdf2zh_next --list-languages` | | `--list-models` | List available models | `pdf2zh_next --list-models` | | `--list-translators` | List available translation services | `pdf2zh_next --list-translators` | | `--list-formats` | List supported output formats | `pdf2zh_next --list-formats` | | `--list-ocr-languages` | List supported OCR languages | `pdf2zh_next --list-ocr-languages` | | `--list-ocr-engines` | List supported OCR engines | `pdf2zh_next --list-ocr-engines` | --- | `--version` | Mostrar versão e sair | `pdf2zh_next --version` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `-h`, `--help` | Mostrar mensagem de ajuda e sair | `pdf2zh_next -h` | | `-v`, `--verbose` | Definir nível de log para verboso | `pdf2zh_next -v` | | `-vv`, `--very-verbose` | Definir nível de log para muito verboso | `pdf2zh_next -vv` | | `-q`, `--quiet` | Definir nível de log para silencioso | `pdf2zh_next -q` | | `-i`, `--input` | Arquivo ou diretório de entrada | `pdf2zh_next -i file.pdf` <br> `pdf2zh_next -i ./input_dir` | | `-o`, `--output` | Arquivo ou diretório de saída | `pdf2zh_next -i file.pdf -o file_translated.pdf` <br> `pdf2zh_next -i ./input_dir -o ./output_dir` | | `-l`, `--lang` | Código do idioma de destino (padrão: `zh-CN`) | `pdf2zh_next -i file.pdf -l en` | | `-m`, `--model` | Modelo de tradução (padrão: `gpt-3.5-turbo`) | `pdf2zh_next -i file.pdf -m gpt-4` | | `-p`, `--prompt` | Caminho do arquivo de prompt | `pdf2zh_next -i file.pdf -p ./prompt.txt` | | `-k`, `--key` | Chave de API para o serviço de tradução | `pdf2zh_next -i file.pdf -k sk-xxx` | | `-c`, `--config` | Caminho do arquivo de configuração | `pdf2zh_next -i file.pdf -c ./config.yaml` | | `--openai_base_url` | URL base da API OpenAI | `pdf2zh_next -i file.pdf --openai_base_url https://api.openai.com/v1` | | `--translator` | Serviço de tradução (padrão: `openai`) | `pdf2zh_next -i file.pdf --translator azure` | | `-t`, `--threads` | Número de threads (padrão: `5`) | `pdf2zh_next -i file.pdf -t 10` | | `--timeout` | Tempo limite da requisição (padrão: `60`) | `pdf2zh_next -i file.pdf --timeout 120` | | `-s`, `--skip` | Pular arquivos existentes | `pdf2zh_next -i ./input_dir -o ./output_dir -s` | | `--no-split` | Desativar divisão automática de arquivos grandes | `pdf2zh_next -i file.pdf --no-split` | | `--split-size` | Tamanho da divisão em MB (padrão: `10`) | `pdf2zh_next -i file.pdf --split-size 20` | | `--split-pages` | Dividir por contagem de páginas | `pdf2zh_next -i file.pdf --split-pages 50` | | `--ocr` | Ativar OCR para PDFs baseados em imagem | `pdf2zh_next -i file.pdf --ocr` | | `--ocr-lang` | Código do idioma do OCR (padrão: `eng`) | `pdf2zh_next -i file.pdf --ocr --ocr-lang chi_sim` | | `--ocr-engine` | Motor de OCR (padrão: `easyocr`) | `pdf2zh_next -i file.pdf --ocr --ocr-engine paddleocr` | | `--format` | Formato de saída (padrão: `pdf`) | `pdf2zh_next -i file.pdf --format markdown` | | `--font` | Caminho do arquivo de fonte para saída PDF | `pdf2zh_next -i file.pdf --font ./font.ttf` | | `--font-size` | Tamanho da fonte para saída PDF (padrão: `12`) | `pdf2zh_next -i file.pdf --font-size 14` | | `--line-spacing` | Espaçamento entre linhas para saída PDF (padrão: `1.2`) | `pdf2zh_next -i file.pdf --line-spacing 1.5` | | `--margin` | Margem para saída PDF (padrão: `72`) | `pdf2zh_next -i file.pdf --margin 100` | | `--page-size` | Tamanho da página para saída PDF (padrão: `A4`) | `pdf2zh_next -i file.pdf --page-size Letter` | | `--dpi` | DPI para processamento de imagem (padrão: `300`) | `pdf2zh_next -i file.pdf --dpi 150` | | `--no-backup` | Desativar backup dos arquivos originais | `pdf2zh_next -i file.pdf --no-backup` | | `--backup-dir` | Diretório de backup (padrão: `./backup`) | `pdf2zh_next -i file.pdf --backup-dir ./my_backup` | | `--retry` | Número de tentativas em caso de falha (padrão: `3`) | `pdf2zh_next -i file.pdf --retry 5` | | `--retry-delay` | Atraso entre tentativas em segundos (padrão: `5`) | `pdf2zh_next -i file.pdf --retry-delay 10` | | `--max-tokens` | Tokens máximos por requisição (padrão: `4096`) | `pdf2zh_next -i file.pdf --max-tokens 2048` | | `--temperature` | Temperatura para tradução (padrão: `0.1`) | `pdf2zh_next -i file.pdf --temperature 0.5` | | `--batch-size` | Tamanho do lote para tradução (padrão: `10`) | `pdf2zh_next -i file.pdf --batch-size 20` | | `--no-cache` | Desativar cache de tradução | `pdf2zh_next -i file.pdf --no-cache` | | `--cache-dir` | Diretório de cache (padrão: `./cache`) | `pdf2zh_next -i file.pdf --cache-dir ./my_cache` | | `--clean-cache` | Limpar cache antes da tradução | `pdf2zh_next -i file.pdf --clean-cache` | | `--log-file` | Caminho do arquivo de log | `pdf2zh_next -i file.pdf --log-file ./translation.log` | | `--log-level` | Nível de log (padrão: `INFO`) | `pdf2zh_next -i file.pdf --log-level DEBUG` | | `--no-color` | Desativar saída colorida | `pdf2zh_next -i file.pdf --no-color` | | `--dry-run` | Execução de teste sem tradução real | `pdf2zh_next -i file.pdf --dry-run` | | `--version-check` | Verificar atualizações | `pdf2zh_next --version-check` | | `--list-languages` | Listar idiomas suportados | `pdf2zh_next --list-languages` | | `--list-models` | Listar modelos disponíveis | `pdf2zh_next --list-models` | | `--list-translators` | Listar serviços de tradução disponíveis | `pdf2zh_next --list-translators` | | `--list-formats` | Listar formatos de saída suportados | `pdf2zh_next --list-formats` | | `--list-ocr-languages` | Listar idiomas de OCR suportados | `pdf2zh_next --list-ocr-languages` | | `--list-ocr-engines` | Listar motores de OCR suportados | `pdf2zh_next --list-ocr-engines` |
ru: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--input <input>` | Path of input file or directory | `pdf2zh_next --input input.pdf` | | `--output <output>` | Path of output file or directory | `pdf2zh_next --output output.pdf` | | `--translator <translator>` | Name of translator to use | `pdf2zh_next --translator google` | | `--source-lang <source_lang>` | Source language code | `pdf2zh_next --source-lang en` | | `--target-lang <target_lang>` | Target language code | `pdf2zh_next --target-lang zh` | | `--pages <pages>` | Pages to translate (e.g. 1-5,8,11-13) | `pdf2zh_next --pages 1-5,8,11-13` | | `--ocr <ocr>` | OCR engine to use (auto, paddle, tesseract) | `pdf2zh_next --ocr paddle` | | `--ocr-lang <ocr_lang>` | Language for OCR engine | `pdf2zh_next --ocr-lang en` | | `--force-ocr` | Force OCR even if text can be extracted directly | `pdf2zh_next --force-ocr` | | `--single-thread` | Run in single thread mode | `pdf2zh_next --single-thread` | | `--config <config>` | Path to config file | `pdf2zh_next --config config.toml` | | `--api-key <api_key>` | API key for translator | `pdf2zh_next --api-key YOUR_API_KEY` | | `--model <model>` | Model name for translator | `pdf2zh_next --model gpt-3.5-turbo` | | `--concurrency-limit <limit>` | Max number of concurrent requests | `pdf2zh_next --concurrency-limit 5` | | `--request-interval <interval>` | Interval between requests in seconds | `pdf2zh_next --request-interval 1` | | `--help` | Print help | `pdf2zh_next --help` | --- ### TRANSLATION RESULT | `--version` | Показать версию и выйти | `pdf2zh_next --version` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--input <input>` | Путь к входному файлу или директории | `pdf2zh_next --input input.pdf` | | `--output <output>` | Путь к выходному файлу или директории | `pdf2zh_next --output output.pdf` | | `--translator <translator>` | Название используемого переводчика | `pdf2zh_next --translator google` | | `--source-lang <source_lang>` | Код языка оригинала | `pdf2zh_next --source-lang en` | | `--target-lang <target_lang>` | Код целевого языка | `pdf2zh_next --target-lang zh` | | `--pages <pages>` | Страницы для перевода (например, 1-5,8,11-13) | `pdf2zh_next --pages 1-5,8,11-13` | | `--ocr <ocr>` | Движок OCR для использования (auto, paddle, tesseract) | `pdf2zh_next --ocr paddle` | | `--ocr-lang <ocr_lang>` | Язык для движка OCR | `pdf2zh_next --ocr-lang en` | | `--force-ocr` | Принудительно использовать OCR, даже если текст можно извлечь напрямую | `pdf2zh_next --force-ocr` | | `--single-thread` | Запуск в однопоточном режиме | `pdf2zh_next --single-thread` | | `--config <config>` | Путь к файлу конфигурации | `pdf2zh_next --config config.toml` | | `--api-key <api_key>` | API-ключ для переводчика | `pdf2zh_next --api-key YOUR_API_KEY` | | `--model <model>` | Название модели для переводчика | `pdf2zh_next --model gpt-3.5-turbo` | | `--concurrency-limit <limit>` | Максимальное количество одновременных запросов | `pdf2zh_next --concurrency-limit 5` | | `--request-interval <interval>` | Интервал между запросами в секундах | `pdf2zh_next --request-interval 1` | | `--help` | Вывести справку | `pdf2zh_next --help` |
