Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_9855EBF1
source: | `--term-qps` | QPS limit for term extraction translation service. If not set, will follow qps. | `pdf2zh_next example.pdf --term-qps 20` |
de: | :------------------------------ | :-------------------------------------------------------------------------------------- | :--------------------------------------------------------------------------------------------------------------------- | | `--term-concurrency` | Maximum number of concurrent requests for term extraction translation service. | `pdf2zh_next example.pdf --term-concurrency 5` | | `--term-timeout` | Timeout for term extraction translation service (seconds). | `pdf2zh_next example.pdf --term-timeout 30` | | `--term-max-retries` | Maximum number of retries for term extraction translation service. | `pdf2zh_next example.pdf --term-max-retries 3` | --- ### OUTPUT | `--term-qps` | QPS-Limit für den Übersetzungsdienst zur Begriffsentnahme. Wenn nicht gesetzt, folgt es qps. | `pdf2zh_next example.pdf --term-qps 20` | | :------------------------------ | :------------------------------------------------------------------------------------------- | :--------------------------------------------------------------------------------------------------------------------- | | `--term-concurrency` | Maximale Anzahl gleichzeitiger Anfragen für den Übersetzungsdienst zur Begriffsentnahme. | `pdf2zh_next example.pdf --term-concurrency 5` | | `--term-timeout` | Zeitüberschreitung für den Übersetzungsdienst zur Begriffsentnahme (Sekunden). | `pdf2zh_next example.pdf --term-timeout 30` | | `--term-max-retries` | Maximale Anzahl von Wiederholungsversuchen für den Übersetzungsdienst zur Begriffsentnahme. | `pdf2zh_next example.pdf --term-max-retries 3` |
fr: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--term-api-key` | API key for term extraction translation service. If not set, will follow `--api-key`. | `pdf2zh_next example.pdf --term-api-key sk-xxxxxx` | | `--term-endpoint` | Endpoint for term extraction translation service. If not set, will follow `--endpoint`. | `pdf2zh_next example.pdf --term-endpoint https://api.openai.com/v1/chat/completions` | | `--term-model` | Model for term extraction translation service. If not set, will follow `--model`. | `pdf2zh_next example.pdf --term-model gpt-4o-mini` | | `--term-max-tokens` | Max tokens for term extraction translation service. If not set, will follow `--max-tokens`. | `pdf2zh_next example.pdf --term-max-tokens 1000` | | `--term-temperature` | Temperature for term extraction translation service. If not set, will follow `--temperature`. | `pdf2zh_next example.pdf --term-temperature 0.1` | | `--term-timeout` | Timeout for term extraction translation service. If not set, will follow `--timeout`. | `pdf2zh_next example.pdf --term-timeout 30` | | `--term-request-interval` | Request interval for term extraction translation service. If not set, will follow `--request-interval`. | `pdf2zh_next example.pdf --term-request-interval 0.2` | | `--term-max-retries` | Max retries for term extraction translation service. If not set, will follow `--max-retries`. | `pdf2zh_next example.pdf --term-max-retries 5` | | `--term-backoff-factor` | Backoff factor for term extraction translation service. If not set, will follow `--backoff-factor`. | `pdf2zh_next example.pdf --term-backoff-factor 0.5` | | `--term-proxy` | Proxy for term extraction translation service. If not set, will follow `--proxy`. | `pdf2zh_next example.pdf --term-proxy http://127.0.0.1:7890` | | `--term-extra-body` | Extra body for term extraction translation service. If not set, will follow `--extra-body`. | `pdf2zh_next example.pdf --term-extra-body '{"presence_penalty": 0, "frequency_penalty": 0}'` | | `--term-extra-headers` | Extra headers for term extraction translation service. If not set, will follow `--extra-headers`. | `pdf2zh_next example.pdf --term-extra-headers '{"X-Custom-Header": "value"}'` | | `--term-extra-query-parameters` | Extra query parameters for term extraction translation service. If not set, will follow `--extra-query-parameters`. | `pdf2zh_next example.pdf --term-extra-query-parameters '{"param": "value"}'` | --- ### OUTPUT LANGUAGE fr --- ### OUTPUT | `--term-qps` | Limite de QPS pour le service de traduction d'extraction de termes. Si non défini, suivra qps. | `pdf2zh_next example.pdf --term-qps 20` | | ------------------------------- | ------------------------------------------------------------------------------------------------------ | --------------------------------------------------------------------------------------------------------------------- | | `--term-api-key` | Clé API pour le service de traduction d'extraction de termes. Si non défini, suivra `--api-key`. | `pdf2zh_next example.pdf --term-api-key sk-xxxxxx` | | `--term-endpoint` | Point de terminaison pour le service de traduction d'extraction de termes. Si non défini, suivra `--endpoint`. | `pdf2zh_next example.pdf --term-endpoint https://api.openai.com/v1/chat/completions` | | `--term-model` | Modèle pour le service de traduction d'extraction de termes. Si non défini, suivra `--model`. | `pdf2zh_next example.pdf --term-model gpt-4o-mini` | | `--term-max-tokens` | Nombre maximum de tokens pour le service de traduction d'extraction de termes. Si non défini, suivra `--max-tokens`. | `pdf2zh_next example.pdf --term-max-tokens 1000` | | `--term-temperature` | Température pour le service de traduction d'extraction de termes. Si non défini, suivra `--temperature`. | `pdf2zh_next example.pdf --term-temperature 0.1` | | `--term-timeout` | Délai d'attente pour le service de traduction d'extraction de termes. Si non défini, suivra `--timeout`. | `pdf2zh_next example.pdf --term-timeout 30` | | `--term-request-interval` | Intervalle de requête pour le service de traduction d'extraction de termes. Si non défini, suivra `--request-interval`. | `pdf2zh_next example.pdf --term-request-interval 0.2` | | `--term-max-retries` | Nombre maximum de tentatives pour le service de traduction d'extraction de termes. Si non défini, suivra `--max-retries`. | `pdf2zh_next example.pdf --term-max-retries 5` | | `--term-backoff-factor` | Facteur de backoff pour le service de traduction d'extraction de termes. Si non défini, suivra `--backoff-factor`. | `pdf2zh_next example.pdf --term-backoff-factor 0.5` | | `--term-proxy` | Proxy pour le service de traduction d'extraction de termes. Si non défini, suivra `--proxy`. | `pdf2zh_next example.pdf --term-proxy http://127.0.0.1:7890` | | `--term-extra-body` | Corps supplémentaire pour le service de traduction d'extraction de termes. Si non défini, suivra `--extra-body`. | `pdf2zh_next example.pdf --term-extra-body '{"presence_penalty": 0, "frequency_penalty": 0}'` | | `--term-extra-headers` | En-têtes supplémentaires pour le service de traduction d'extraction de termes. Si non défini, suivra `--extra-headers`. | `pdf2zh_next example.pdf --term-extra-headers '{"X-Custom-Header": "value"}'` | | `--term-extra-query-parameters` | Paramètres de requête supplémentaires pour le service de traduction d'extraction de termes. Si non défini, suivra `--extra-query-parameters`. | `pdf2zh_next example.pdf --term-extra-query-parameters '{"param": "value"}'` |
it: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--term-max-request` | Maximum parallel requests for term extraction translation service. If not set, will follow max-request. | `pdf2zh_next example.pdf --term-max-request 5` | | `--term-timeout` | Timeout for term extraction translation service. If not set, will follow timeout. | `pdf2zh_next example.pdf --term-timeout 30` | | `--term-max-retries` | Maximum retries for term extraction translation service. If not set, will follow max-retries. | `pdf2zh_next example.pdf --term-max-retries 3` | --- ### TRANSLATION RESULT | `--term-qps` | Limite QPS per il servizio di traduzione dell'estrazione dei termini. Se non impostato, seguirà il valore di qps. | `pdf2zh_next example.pdf --term-qps 20` | | ------------------------------- | ------------------------------------------------------------------------------------------------------------------------ | --------------------------------------------------------------------------------------------------------------------- | | `--term-max-request` | Numero massimo di richieste parallele per il servizio di traduzione dell'estrazione dei termini. Se non impostato, seguirà il valore di max-request. | `pdf2zh_next example.pdf --term-max-request 5` | | `--term-timeout` | Timeout per il servizio di traduzione dell'estrazione dei termini. Se non impostato, seguirà il valore di timeout. | `pdf2zh_next example.pdf --term-timeout 30` | | `--term-max-retries` | Numero massimo di tentativi per il servizio di traduzione dell'estrazione dei termini. Se non impostato, seguirà il valore di max-retries. | `pdf2zh_next example.pdf --term-max-retries 3` |
pt: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--term-requests-per-minute` | RPM limit for term extraction translation service. If not set, will follow rpm. | `pdf2zh_next example.pdf --term-requests-per-minute 1000` | | `--term-max-requests` | Maximum number of requests for term extraction translation service. If not set, will follow max-requests. | `pdf2zh_next example.pdf --term-max-requests 100` | | `--term-timeout` | Timeout for term extraction translation service. If not set, will follow timeout. | `pdf2zh_next example.pdf --term-timeout 10` | | `--term-model` | Model for term extraction translation service. If not set, will follow model. | `pdf2zh_next example.pdf --term-model gpt-4o-mini` | | `--term-prompt` | Prompt for term extraction translation service. If not set, will follow prompt. | `pdf2zh_next example.pdf --term-prompt "You are a professional translator, please translate the following text."` | | `--term-context` | Context for term extraction translation service. If not set, will follow context. | `pdf2zh_next example.pdf --term-context "This is a research paper about machine learning."` | | `--term-role` | Role for term extraction translation service. If not set, will follow role. | `pdf2zh_next example.pdf --term-role "You are a professional translator, please translate the following text."` | | `--term-system-prompt` | System prompt for term extraction translation service. If not set, will follow system-prompt. | `pdf2zh_next example.pdf --term-system-prompt "You are a professional translator, please translate the following text."` | | `--term-temperature` | Temperature for term extraction translation service. If not set, will follow temperature. | `pdf2zh_next example.pdf --term-temperature 0.7` | | `--term-top-p` | Top-p for term extraction translation service. If not set, will follow top-p. | `pdf2zh_next example.pdf --term-top-p 0.9` | | `--term-frequency-penalty` | Frequency penalty for term extraction translation service. If not set, will follow frequency-penalty. | `pdf2zh_next example.pdf --term-frequency-penalty 0.5` | | `--term-presence-penalty` | Presence penalty for term extraction translation service. If not set, will follow presence-penalty. | `pdf2zh_next example.pdf --term-presence-penalty 0.5` | | `--term-stop` | Stop sequence for term extraction translation service. If not set, will follow stop. | `pdf2zh_next example.pdf --term-stop "STOP"` | --- ### OUTPUT | `--term-qps` | Limite de QPS para o serviço de tradução de extração de termos. Se não for definido, seguirá o qps. | `pdf2zh_next example.pdf --term-qps 20` | | ------------------------------- | ----------------------------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--term-requests-per-minute` | Limite de RPM para o serviço de tradução de extração de termos. Se não for definido, seguirá o rpm. | `pdf2zh_next example.pdf --term-requests-per-minute 1000` | | `--term-max-requests` | Número máximo de solicitações para o serviço de tradução de extração de termos. Se não for definido, seguirá max-requests. | `pdf2zh_next example.pdf --term-max-requests 100` | | `--term-timeout` | Tempo limite para o serviço de tradução de extração de termos. Se não for definido, seguirá timeout. | `pdf2zh_next example.pdf --term-timeout 10` | | `--term-model` | Modelo para o serviço de tradução de extração de termos. Se não for definido, seguirá model. | `pdf2zh_next example.pdf --term-model gpt-4o-mini` | | `--term-prompt` | Prompt para o serviço de tradução de extração de termos. Se não for definido, seguirá prompt. | `pdf2zh_next example.pdf --term-prompt "Você é um tradutor profissional, por favor, traduza o seguinte texto."` | | `--term-context` | Contexto para o serviço de tradução de extração de termos. Se não for definido, seguirá context. | `pdf2zh_next example.pdf --term-context "Este é um artigo de pesquisa sobre aprendizado de máquina."` | | `--term-role` | Função para o serviço de tradução de extração de termos. Se não for definido, seguirá role. | `pdf2zh_next example.pdf --term-role "Você é um tradutor profissional, por favor, traduza o seguinte texto."` | | `--term-system-prompt` | Prompt de sistema para o serviço de tradução de extração de termos. Se não for definido, seguirá system-prompt. | `pdf2zh_next example.pdf --term-system-prompt "Você é um tradutor profissional, por favor, traduza o seguinte texto."` | | `--term-temperature` | Temperatura para o serviço de tradução de extração de termos. Se não for definido, seguirá temperature. | `pdf2zh_next example.pdf --term-temperature 0.7` | | `--term-top-p` | Top-p para o serviço de tradução de extração de termos. Se não for definido, seguirá top-p. | `pdf2zh_next example.pdf --term-top-p 0.9` | | `--term-frequency-penalty` | Penalidade de frequência para o serviço de tradução de extração de termos. Se não for definido, seguirá frequency-penalty. | `pdf2zh_next example.pdf --term-frequency-penalty 0.5` | | `--term-presence-penalty` | Penalidade de presença para o serviço de tradução de extração de termos. Se não for definido, seguirá presence-penalty. | `pdf2zh_next example.pdf --term-presence-penalty 0.5` | | `--term-stop` | Sequência de parada para o serviço de tradução de extração de termos. Se não for definido, seguirá stop. | `pdf2zh_next example.pdf --term-stop "STOP"` |
ru: | ------------------------------- | ---------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--term-timeout` | Timeout for term extraction translation service. If not set, will follow timeout. | `pdf2zh_next example.pdf --term-timeout 60` | | `--term-retry` | Retry count for term extraction translation service. If not set, will follow retry. | `pdf2zh_next example.pdf --term-retry 3` | | `--term-fallback` | Fallback translation service for term extraction. If not set, will follow fallback. | `pdf2zh_next example.pdf --term-fallback google` | | `--term-fallback-languages` | Fallback languages for term extraction translation service. If not set, will follow fallback-languages. | `pdf2zh_next example.pdf --term-fallback-languages en,ja` | | `--term-fallback-qps` | QPS limit for term extraction fallback translation service. If not set, will follow fallback-qps. | `pdf2zh_next example.pdf --term-fallback-qps 20` | | `--term-fallback-timeout` | Timeout for term extraction fallback translation service. If not set, will follow fallback-timeout. | `pdf2zh_next example.pdf --term-fallback-timeout 60` | | `--term-fallback-retry` | Retry count for term extraction fallback translation service. If not set, will follow fallback-retry. | `pdf2zh_next example.pdf --term-fallback-retry 3` | | `--term-fallback-fallback` | Fallback translation service for term extraction fallback. If not set, will follow fallback-fallback. | `pdf2zh_next example.pdf --term-fallback-fallback google` | | `--term-fallback-fallback-languages` | Fallback languages for term extraction fallback translation service. If not set, will follow fallback-fallback-languages. | `pdf2zh_next example.pdf --term-fallback-fallback-languages en,ja` | | `--term-fallback-fallback-qps` | QPS limit for term extraction fallback fallback translation service. If not set, will follow fallback-fallback-qps. | `pdf2zh_next example.pdf --term-fallback-fallback-qps 20` | | `--term-fallback-fallback-timeout` | Timeout for term extraction fallback fallback translation service. If not set, will follow fallback-fallback-timeout. | `pdf2zh_next example.pdf --term-fallback-fallback-timeout 60` | | `--term-fallback-fallback-retry` | Retry count for term extraction fallback fallback translation service. If not set, will follow fallback-fallback-retry. | `pdf2zh_next example.pdf --term-fallback-fallback-retry 3` | --- ### OUTPUT LANGUAGE ru --- ### OUTPUT | `--term-qps` | Ограничение QPS для службы перевода извлечения терминов. Если не установлено, будет следовать qps. | `pdf2zh_next example.pdf --term-qps 20` | | ------------------------------- | ---------------------------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--term-timeout` | Таймаут для службы перевода извлечения терминов. Если не установлено, будет следовать timeout. | `pdf2zh_next example.pdf --term-timeout 60` | | `--term-retry` | Количество повторных попыток для службы перевода извлечения терминов. Если не установлено, будет следовать retry. | `pdf2zh_next example.pdf --term-retry 3` | | `--term-fallback` | Резервная служба перевода для извлечения терминов. Если не установлено, будет следовать fallback. | `pdf2zh_next example.pdf --term-fallback google` | | `--term-fallback-languages` | Резервные языки для службы перевода извлечения терминов. Если не установлено, будет следовать fallback-languages. | `pdf2zh_next example.pdf --term-fallback-languages en,ja` | | `--term-fallback-qps` | Ограничение QPS для резервной службы перевода извлечения терминов. Если не установлено, будет следовать fallback-qps. | `pdf2zh_next example.pdf --term-fallback-qps 20` | | `--term-fallback-timeout` | Таймаут для резервной службы перевода извлечения терминов. Если не установлено, будет следовать fallback-timeout. | `pdf2zh_next example.pdf --term-fallback-timeout 60` | | `--term-fallback-retry` | Количество повторных попыток для резервной службы перевода извлечения терминов. Если не установлено, будет следовать fallback-retry. | `pdf2zh_next example.pdf --term-fallback-retry 3` | | `--term-fallback-fallback` | Резервная служба перевода для резервного извлечения терминов. Если не установлено, будет следовать fallback-fallback. | `pdf2zh_next example.pdf --term-fallback-fallback google` | | `--term-fallback-fallback-languages` | Резервные языки для резервной службы перевода извлечения терминов. Если не установлено, будет следовать fallback-fallback-languages. | `pdf2zh_next example.pdf --term-fallback-fallback-languages en,ja` | | `--term-fallback-fallback-qps` | Ограничение QPS для резервной резервной службы перевода извлечения терминов. Если не установлено, будет следовать fallback-fallback-qps. | `pdf2zh_next example.pdf --term-fallback-fallback-qps 20` | | `--term-fallback-fallback-timeout` | Таймаут для резервной резервной службы перевода извлечения терминов. Если не установлено, будет следовать fallback-fallback-timeout. | `pdf2zh_next example.pdf --term-fallback-fallback-timeout 60` | | `--term-fallback-fallback-retry` | Количество повторных попыток для резервной резервной службы перевода извлечения терминов. Если не установлено, будет следовать fallback-fallback-retry. | `pdf2zh_next example.pdf --term-fallback-fallback-retry 3` |
