Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_D406105F
source: | `--server-port` | WebUI Port | `pdf2zh_next --gui --server-port 7860` |
de: `7860` | --- ### TRANSLATION RESULT | `--server-port` | WebUI Port | `pdf2zh_next --gui --server-port 7860` | `7860` |
fr: | ------------------------------- | -------------------------------------- | ----------------------------------------------- | | `--server-name` | WebUI Host | `pdf2zh_next --gui --server-name 0.0.0.0` | | `--no-gradio-queue` | Disable Gradio Queue | `pdf2zh_next --gui --no-gradio-queue` | | `--share` | Share the WebUI | `pdf2zh_next --gui --share` | | `--auth` | Set Gradio Authentication | `pdf2zh_next --gui --auth username:password` | | `--ssl-keyfile` | SSL Key File Path | `pdf2zh_next --gui --ssl-keyfile key.pem` | | `--ssl-certfile` | SSL Certificate File Path | `pdf2zh_next --gui --ssl-certfile cert.pem` | | `--concurrency-count` | Gradio Concurrency Count | `pdf2zh_next --gui --concurrency-count 10` | | `--max-file-size` | Gradio Max File Size (MB) | `pdf2zh_next --gui --max-file-size 100` | | `--max-files` | Gradio Max File Count | `pdf2zh_next --gui --max-files 20` | | `--allowed-path` | Gradio Allowed Upload Paths | `pdf2zh_next --gui --allowed-path /tmp` | | `--blocking-path` | Gradio Blocked Upload Paths | `pdf2zh_next --gui --blocking-path /root` | | `--show-error` | Show Error Details in WebUI | `pdf2zh_next --gui --show-error` | | `--theme` | Gradio Theme | `pdf2zh_next --gui --theme soft` | | `--dark-theme` | Use Dark Theme | `pdf2zh_next --gui --dark-theme` | | `--language` | WebUI Language | `pdf2zh_next --gui --language en` | | `--favicon-path` | WebUI Favicon Path | `pdf2zh_next --gui --favicon-path favicon.ico` | | `--title` | WebUI Title | `pdf2zh_next --gui --title "PDF Translate App"` | | `--width` | WebUI Width | `pdf2zh_next --gui --width 100%` | | `--height` | WebUI Height | `pdf2zh_next --gui --height 700px` | --- ### OUTPUT | `--server-port` | Port WebUI | `pdf2zh_next --gui --server-port 7860` | | ------------------------------- | -------------------------------------- | ----------------------------------------------- | | `--server-name` | Hôte WebUI | `pdf2zh_next --gui --server-name 0.0.0.0` | | `--no-gradio-queue` | Désactiver la file d'attente Gradio | `pdf2zh_next --gui --no-gradio-queue` | | `--share` | Partager l'interface WebUI | `pdf2zh_next --gui --share` | | `--auth` | Définir l'authentification Gradio | `pdf2zh_next --gui --auth username:password` | | `--ssl-keyfile` | Chemin du fichier clé SSL | `pdf2zh_next --gui --ssl-keyfile key.pem` | | `--ssl-certfile` | Chemin du certificat SSL | `pdf2zh_next --gui --ssl-certfile cert.pem` | | `--concurrency-count` | Nombre de concurrences Gradio | `pdf2zh_next --gui --concurrency-count 10` | | `--max-file-size` | Taille maximale de fichier Gradio (MB) | `pdf2zh_next --gui --max-file-size 100` | | `--max-files` | Nombre maximal de fichiers Gradio | `pdf2zh_next --gui --max-files 20` | | `--allowed-path` | Chemins de téléchargement autorisés Gradio | `pdf2zh_next --gui --allowed-path /tmp` | | `--blocking-path` | Chemins de téléchargement bloqués Gradio | `pdf2zh_next --gui --blocking-path /root` | | `--show-error` | Afficher les détails d'erreur dans WebUI | `pdf2zh_next --gui --show-error` | | `--theme` | Thème Gradio | `pdf2zh_next --gui --theme soft` | | `--dark-theme` | Utiliser le thème sombre | `pdf2zh_next --gui --dark-theme` | | `--language` | Langue de l'interface WebUI | `pdf2zh_next --gui --language en` | | `--favicon-path` | Chemin du favicon WebUI | `pdf2zh_next --gui --favicon-path favicon.ico` | | `--title` | Titre de l'interface WebUI | `pdf2zh_next --gui --title "PDF Translate App"` | | `--width` | Largeur de l'interface WebUI | `pdf2zh_next --gui --width 100%` | | `--height` | Hauteur de l'interface WebUI | `pdf2zh_next --gui --height 700px` |
it: `7860` | | ------------------------------- | -------------------------------------- | ----------------------------------------------- | ------------------ | | `--server-name` | WebUI Host | `pdf2zh_next --gui --server-name 0.0.0.0` | `0.0.0.0` | | `--share` | Create a public URL | `pdf2zh_next --gui --share` | `False` | | `--server-cert` | Path to certificate file | `pdf2zh_next --gui --server-cert cert.pem` | `None` | | `--server-key` | Path to certificate key file | `pdf2zh_next --gui --server-key key.pem` | `None` | | `--auth` | Set username and password | `pdf2zh_next --gui --auth user pass` | `None` | | `--auth-message` | Custom auth message | `pdf2zh_next --gui --auth-message "Welcome!"` | `None` | | `--root-path` | Root path for the server | `pdf2zh_next --gui --root-path /pdf2zh` | `None` | | `--ssl-keyfile` | SSL keyfile | `pdf2zh_next --gui --ssl-keyfile key.pem` | `None` | | `--ssl-certfile` | SSL certificate file | `pdf2zh_next --gui --ssl-certfile cert.pem` | `None` | | `--ssl-keyfile-password` | SSL keyfile password | `pdf2zh_next --gui --ssl-keyfile-password pass` | `None` | | `--concurrency-count` | Number of concurrent threads | `pdf2zh_next --gui --concurrency-count 10` | `None` | | `--queue-enabled` | Enable queue | `pdf2zh_next --gui --queue-enabled` | `False` | | `--queue-concurrency-count` | Queue concurrency count | `pdf2zh_next --gui --queue-concurrency-count 1` | `None` | | `--default-queue` | Enables the queue | `pdf2zh_next --gui --default-queue` | `False` | | `--max-file-size` | Maximum file size in MB | `pdf2zh_next --gui --max-file-size 100` | `None` | | `--max-files` | Maximum number of files | `pdf2zh_next --gui --max-files 20` | `None` | | `--allowed-paths` | List of allowed paths | `pdf2zh_next --gui --allowed-paths /tmp` | `None` | | `--blocked-paths` | List of blocked paths | `pdf2zh_next --gui --blocked-paths /etc` | `None` | | `--favicon-path` | Path to a custom favicon | `pdf2zh_next --gui --favicon-path favicon.ico` | `None` | | `--show-error` | Show error in the UI | `pdf2zh_next --gui --show-error` | `False` | | `--show-api` | Show API documentation | `pdf2zh_next --gui --show-api` | `False` | | `--prevent-thread-lock` | Prevent thread lock | `pdf2zh_next --gui --prevent-thread-lock` | `False` | | `--allow-flagging` | Allow flagging | `pdf2zh_next --gui --allow-flagging` | `False` | | `--flagging-options` | Options for flagging | `pdf2zh_next --gui --flagging-options a b c` | `None` | | `--flagging-dir` | Directory for flagging | `pdf2zh_next --gui --flagging-dir flagged` | `flagged` | | `--analytics` | Enable analytics | `pdf2zh_next --gui --analytics` | `False` | | `--cache` | Enable cache | `pdf2zh_next --gui --cache` | `False` | | `--cache-size` | Cache size | `pdf2zh_next --gui --cache-size 100` | `None` | | `--cache-ttl` | Cache TTL in seconds | `pdf2zh_next --gui --cache-ttl 3600` | `None` | | `--log-level` | Log level | `pdf2zh_next --gui --log-level info` | `None` | | `--debug` | Enable debug mode | `pdf2zh_next --gui --debug` | `False` | | `--quiet` | Disable logging | `pdf2zh_next --gui --quiet` | `False` | | `--theme` | Theme | `pdf2zh_next --gui --theme default` | `default` | | `--theme-mode` | Theme mode | `pdf2zh_next --gui --theme-mode dark` | `default` | | `--dark-theme` | Dark theme | `pdf2zh_next --gui --dark-theme dark` | `None` | | `--light-theme` | Light theme | `pdf2zh_next --gui --light-theme light` | `None` | | `--translator` | Translator | `pdf2zh_next --gui --translator google` | `google` | | `--translator-options` | Translator options | `pdf2zh_next --gui --translator-options a b c` | `None` | | `--no-translator-cache` | Disable translator cache | `pdf2zh_next --gui --no-translator-cache` | `False` | | `--translator-cache-size` | Translator cache size | `pdf2zh_next --gui --translator-cache-size 100` | `None` | | `--translator-cache-ttl` | Translator cache TTL in seconds | `pdf2zh_next --gui --translator-cache-ttl 3600` | `None` | | `--translator-timeout` | Translator timeout in seconds | `pdf2zh_next --gui --translator-timeout 30` | `None` | | `--translator-retries` | Translator retries | `pdf2zh_next --gui --translator-retries 3` | `None` | | `--translator-retry-delay` | Translator retry delay in seconds | `pdf2zh_next --gui --translator-retry-delay 1` | `None` | | `--translator-proxy` | Translator proxy | `pdf2zh_next --gui --translator-proxy http://` | `None` | | `--translator-proxy-auth` | Translator proxy auth | `pdf2zh_next --gui --translator-proxy-auth u p` | `None` | | `--translator-proxy-ssl-verify` | Translator proxy SSL verify | `pdf2zh_next --gui --translator-proxy-ssl-verify` | `True` | | `--translator-proxy-timeout` | Translator proxy timeout in seconds | `pdf2zh_next --gui --translator-proxy-timeout 5` | `None` | | `--translator-proxy-retries` | Translator proxy retries | `pdf2zh_next --gui --translator-proxy-retries 3` | `None` | | `--translator-proxy-retry-delay`| Translator proxy retry delay in seconds| `pdf2zh_next --gui --translator-proxy-retry-delay 1` | `None` | | `--translator-proxy-ca-cert` | Translator proxy CA certificate | `pdf2zh_next --gui --translator-proxy-ca-cert ca.pem` | `None` | | `--translator-proxy-client-cert`| Translator proxy client certificate | `pdf2zh_next --gui --translator-proxy-client-cert client.pem` | `None` | | `--translator-proxy-client-key` | Translator proxy client key | `pdf2zh_next --gui --translator-proxy-client-key key.pem` | `None` | | `--translator-proxy-no-proxy` | Translator proxy no proxy | `pdf2zh_next --gui --translator-proxy-no-proxy localhost` | `None` | | `--translator-proxy-http-proxy` | Translator proxy HTTP proxy | `pdf2zh_next --gui --translator-proxy-http-proxy http://` | `None` | | `--translator-proxy-https-proxy`| Translator proxy HTTPS proxy | `pdf2zh_next --gui --translator-proxy-https-proxy https://` | `None` | | `--translator-proxy-ftp-proxy` | Translator proxy FTP proxy | `pdf2zh_next --gui --translator-proxy-ftp-proxy ftp://` | `None` | | `--translator-proxy-socks-proxy`| Translator proxy SOCKS proxy | `pdf2zh_next --gui --translator-proxy-socks-proxy socks://` | `None` | | `--translator-proxy-no-proxy` | Translator proxy no proxy | `pdf2zh_next --gui --translator-proxy-no-proxy localhost` | `None` | | `--translator-proxy-bypass` | Translator proxy bypass | `pdf2zh_next --gui --translator-proxy-bypass localhost` | `None` | | `--translator-proxy-username` | Translator proxy username | `pdf2zh_next --gui --translator-proxy-username user` | `None` | | `--translator-proxy-password` | Translator proxy password | `pdf2zh_next --gui --translator-proxy-password pass` | `None` | | `--translator-proxy-domain` | Translator proxy domain | `pdf2zh_next --gui --translator-proxy-domain example.com` | `None` | | `--translator-proxy-workstation`| Translator proxy workstation | `pdf2zh_next --gui --translator-proxy-workstation ws` | `None` | | `--translator-proxy-auth-type` | Translator proxy auth type | `pdf2zh_next --gui --translator-proxy-auth-type basic` | `None` | | `--translator-proxy-auth-realm` | Translator proxy auth realm | `pdf2zh_next --gui --translator-proxy-auth-realm realm` | `None` | | `--translator-proxy-auth-host` | Translator proxy auth host | `pdf2zh_next --gui --translator-proxy-auth-host host` | `None` | | `--translator-proxy-auth-port` | Translator proxy auth port | `pdf2zh_next --gui --translator-proxy-auth-port 8080` | `None` | | `--translator-proxy-auth-method`| Translator proxy auth method | `pdf2zh_next --gui --translator-proxy-auth-method digest` | `None` | | `--translator-proxy-auth-url` | Translator proxy auth URL | `pdf2zh_next --gui --translator-proxy-auth-url http://` | `None` | | `--translator-proxy-auth-ntlm` | Translator proxy auth NTLM | `pdf2zh_next --gui --translator-proxy-auth-ntlm` | `False` | | `--translator-proxy-auth-negotiate`| Translator proxy auth negotiate | `pdf2zh_next --gui --translator-proxy-auth-negotiate` | `False` | | `--translator-proxy-auth-gssapi`| Translator proxy auth GSSAPI | `pdf2zh_next --gui --translator-proxy-auth-gssapi` | `False` | | `--translator-proxy-auth-kerberos`| Translator proxy auth Kerberos | `pdf2zh_next --gui --translator-proxy-auth-kerberos` | `False` | | `--translator-proxy-auth-oauth2`| Translator proxy auth OAuth2 | `pdf2zh_next --gui --translator-proxy-auth-oauth2` | `False` | | `--translator-proxy-auth-bearer`| Translator proxy auth bearer | `pdf2zh_next --gui --translator-proxy-auth-bearer` | `False` | | `--translator-proxy-auth-token` | Translator proxy auth token | `pdf2zh_next --gui --translator-proxy-auth-token token` | `None` | | `--translator-proxy-auth-token-type`| Translator proxy auth token type | `pdf2zh_next --gui --translator-proxy-auth-token-type bearer` | `None` | | `--translator-proxy-auth-token-url`| Translator proxy auth token URL | `pdf2zh_next --gui --translator-proxy-auth-token-url http://` | `None` | | `--translator-proxy-auth-token-scope`| Translator proxy auth token scope | `pdf2zh_next --gui --translator-proxy-auth-token-scope scope` | `None` | | `--translator-proxy-auth-token-client-id`| Translator proxy auth token client ID | `pdf2zh_next --gui --translator-proxy-auth-token-client-id id` | `None` | | `--translator-proxy-auth-token-client-secret`| Translator proxy auth token client secret | `pdf2zh_next --gui --translator-proxy-auth-token-client-secret secret` | `None` | | `--translator-proxy-auth-token-username`| Translator proxy auth token username | `pdf2zh_next --gui --translator-proxy-auth-token-username user` | `None` | | `--translator-proxy-auth-token-password`| Translator proxy auth token password | `pdf2zh_next --gui --translator-proxy-auth-token-password pass` | `None` | | `--translator-proxy-auth-token-grant-type`| Translator proxy auth token grant type | `pdf2zh_next --gui --translator-proxy-auth-token-grant-type password` | `None` | | `--translator-proxy-auth-token-audience`| Translator proxy auth token audience | `pdf2zh_next --gui --translator-proxy-auth-token-audience audience` | `None` | | `--translator-proxy-auth-token-issuer`| Translator proxy auth token issuer | `pdf2zh_next --gui --translator-proxy-auth-token-issuer issuer` | `None` | | `--translator-proxy-auth-token-subject`| Translator proxy auth token subject | `pdf2zh_next --gui --translator-proxy-auth-token-subject subject` | `None` | | `--translator-proxy-auth-token-expires-in`| Translator proxy auth token expires in | `pdf2zh_next --gui --translator-proxy-auth-token-expires-in 3600` | `None` | | `--translator-proxy-auth-token-not-before`| Translator proxy auth token not before | `pdf2zh_next --gui --translator-proxy-auth-token-not-before 0` | `None` | | `--translator-proxy-auth-token-issued-at`| Translator proxy auth token issued at | `pdf2zh_next --gui --translator-proxy-auth-token-issued-at 0` | `None` | | `--translator-proxy-auth-token-jwt-id`| Translator proxy auth token JWT ID | `pdf2zh_next --gui --translator-proxy-auth-token-jwt-id id` | `None` | | `--translator-proxy-auth-token-headers`| Translator proxy auth token headers | `pdf2zh_next --gui --translator-proxy-auth-token-headers a b` | `None` | | `--translator-proxy-auth-token-claims`| Translator proxy auth token claims | `pdf2zh_next --gui --translator-proxy-auth-token-claims a b` | `None` | | `--translator-proxy-auth-token-algorithm`| Translator proxy auth token algorithm | `pdf2zh_next --gui --translator-proxy-auth-token-algorithm HS256` | `None` | | `--translator-proxy-auth-token-key`| Translator proxy auth token key | `pdf2zh_next --gui --translator-proxy-auth-token-key key` | `None` | | `--translator-proxy-auth-token-key-file`| Translator proxy auth token key file | `pdf2zh_next --gui --translator-proxy-auth-token-key-file key.pem` | `None` | | `--translator-proxy-auth-token-cert-file`| Translator proxy auth token cert file | `pdf2zh_next --gui --translator-proxy-auth-token-cert-file cert.pem` | `None` | | `--translator-proxy-auth-token-ca-cert-file`| Translator proxy auth token CA cert file | `pdf2zh_next --gui --translator-proxy-auth-token-ca-cert-file ca.pem` | `None` | | `--translator-proxy-auth-token-verify`| Translator proxy auth token verify | `pdf2zh_next --gui --translator-proxy-auth-token-verify` | `True` | | `--translator-proxy-auth-token-verify-issuer`| Translator proxy auth token verify issuer | `pdf2zh_next --gui --translator-proxy-auth-token-verify-issuer` | `True` | | `--translator-proxy-auth-token-verify-audience`| Translator proxy auth token verify audience | `pdf2zh_next --gui --translator-proxy-auth-token-verify-audience` | `True` | | `--translator-proxy-auth-token-verify-expiration`| Translator proxy auth token verify expiration | `pdf2zh_next --gui --translator-proxy-auth-token-verify-expiration` | `True` | | `--translator-proxy-auth-token-verify-not-before`| Translator proxy auth token verify not before | `pdf2zh_next --gui --translator-proxy-auth-token-verify-not-before` | `True` | | `--translator-proxy-auth-token-verify-issuer-signing-key`| Translator proxy auth token verify issuer signing key | `pdf2zh_next --gui --translator-proxy-auth-token-verify-issuer-signing-key` | `True` | | `--translator-proxy-auth-token-verify-claims`| Translator proxy auth token verify claims | `pdf2zh_next --gui --translator-proxy-auth-token-verify-claims` | `True` | | `--translator-proxy-auth-token-verify-token-type`| Translator proxy auth token verify token type | `pdf2zh_next --gui --translator-proxy-auth-token-verify-token-type` | `True` | | `--translator-proxy-auth-token-verify-token-use`| Translator proxy auth token verify token use | `pdf2zh_next --gui --translator-proxy-auth-token-verify-token-use` | `True` | | `--translator-proxy-auth-token-verify-algorithm`| Translator proxy auth token verify algorithm | `pdf2zh_next --gui --translator-proxy-auth-token-verify-algorithm` | `True` | | `--translator-proxy-auth-token-verify-key`| Translator proxy auth token verify key | `pdf2zh_next --gui --translator-proxy-auth-token-verify-key` | `True` | | `--translator-proxy-auth-token-verify-key-file`| Translator proxy auth token verify key file | `pdf2zh_next --gui --translator-proxy-auth-token-verify-key-file` | `True` | | `--translator-proxy-auth-token-verify-cert-file`| Translator proxy auth token verify cert file | `pdf2zh_next --gui --translator-proxy-auth-token-verify-cert-file` | `True` | | `--translator-proxy-auth-token-verify-ca-cert-file`| Translator proxy auth token verify CA cert file | `pdf2zh_next --gui --translator-proxy-auth-token-verify-ca-cert-file` | `True` | | `--translator-proxy-auth-token-verify-issuer-signing-key`| Translator proxy auth token verify issuer signing key | `pdf2zh_next --gui --translator-proxy-auth-token-verify-issuer-signing-key` | `True` | | `--translator-proxy-auth-token-verify-claims`| Translator proxy auth token verify claims | `pdf2zh_next --gui --translator-proxy-auth-token-verify-claims` | `True` | | `--translator-proxy-auth-token-verify-token-type`| Translator proxy auth token verify token type | `pdf2zh_next --gui --translator-proxy-auth-token-verify-token-type` | `True` | | `--translator-proxy-auth-token-verify-token-use`| Translator proxy auth token verify token use | `pdf2zh_next --gui --translator-proxy-auth-token-verify-token-use` | `True` | | `--translator-proxy-auth-token-verify-algorithm`| Translator proxy auth token verify algorithm | `pdf2zh_next --gui --translator-proxy-auth-token-verify-algorithm` | `True` | | `--translator-proxy-auth-token-verify-key`| Translator proxy auth token verify key | `pdf2zh_next --gui --translator-proxy-auth-token-verify-key` | `True` | | `--translator-proxy-auth-token-verify-key-file`| Translator proxy auth token verify key file | `pdf2zh_next --gui --translator-proxy-auth-token-verify-key-file` | `True` | | `--translator-proxy-auth-token-verify-cert-file`| Translator proxy auth token verify cert file | `pdf2zh_next --gui --translator-proxy-auth-token-verify-cert-file` | `True` | | `--transl 极简的翻译，只翻译描述部分，其他保持不变，包括表格格式。
pt: | ------------------------------- | -------------------------------------- | ----------------------------------------------- | | `--server-name` | WebUI Server Address | `pdf2zh_next --gui --server-name 127.0.0.1` | | `--no-browser` | Disable automatic browser opening | `pdf2zh_next --gui --no-browser` | --- ### OUTPUT | `--server-port` | Porta do WebUI | `pdf2zh_next --gui --server-port 7860` | | ------------------------------- | -------------------------------------- | ----------------------------------------------- | | `--server-name` | Endereço do servidor WebUI | `pdf2zh_next --gui --server-name 127.0.0.1` | | `--no-browser` | Desativar abertura automática do navegador | `pdf2zh_next --gui --no-browser` |
ru: `7860` | | ------------------------------- | -------------------------------------- | ----------------------------------------------- | -------------- | | `--server-name` | WebUI Host | `pdf2zh_next --gui --server-name 127.0.0.1` | `127.0.0.1` | | `--share` | Share WebUI via public link | `pdf2zh_next --gui --share` | `False` | | `--server-certfile` | Certificate file path for HTTPS server | `pdf2zh_next --gui --server-certfile cert.pem` | `None` | | `--server-keyfile` | Key file path for HTTPS server | `pdf2zh_next --gui --server-keyfile key.pem` | `None` | --- ### OUTPUT | `--server-port` | Порт WebUI | `pdf2zh_next --gui --server-port 7860` | `7860` | | ------------------------------- | -------------------------------------- | ----------------------------------------------- | -------------- | | `--server-name` | Хост WebUI | `pdf2zh_next --gui --server-name 127.0.0.1` | `127.0.0.1` | | `--share` | Поделиться WebUI через публичную ссылку| `pdf2zh_next --gui --share` | `False` | | `--server-certfile` | Путь к файлу сертификата для HTTPS сервера | `pdf2zh_next --gui --server-certfile cert.pem` | `None` | | `--server-keyfile` | Путь к файлу ключа для HTTPS сервера | `pdf2zh_next --gui --server-keyfile key.pem` | `None` |
