Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_760A6888
source: #### What is docker?
de: #### Was ist Docker?
fr: #### Qu'est-ce que docker ?
it: #### Cos'è Docker?
pt: #### O que é docker?
ru: #### Что такое Docker?

# chunk_41775DAE
source: [Docker](https://docs.docker.com/get-started/docker-overview/) is an open platform for developing, shipping, and running applications. Docker enables you to separate your applications from your infrastructure so you can deliver software quickly. With Docker, you can manage your infrastructure in the same ways you manage your applications. By taking advantage of Docker's methodologies for shipping, testing, and deploying code, you can significantly reduce the delay between writing code and running it in production.
de: [Docker](https://docs.docker.com/get-started/docker-overview/) ist eine offene Plattform für die Entwicklung, den Versand und die Ausführung von Anwendungen. Docker ermöglicht es Ihnen, Ihre Anwendungen von Ihrer Infrastruktur zu trennen, sodass Sie Software schnell bereitstellen können. Mit Docker können Sie Ihre Infrastruktur auf die gleiche Weise verwalten wie Ihre Anwendungen. Durch die Nutzung der Methoden von Docker für den Versand, die Tests und die Bereitstellung von Code können Sie die Verzögerung zwischen dem Schreiben von Code und dessen Ausführung in der Produktion erheblich reduzieren.
fr: [Docker](https://docs.docker.com/get-started/docker-overview/) est une plateforme open source pour développer, expédier et exécuter des applications. Docker vous permet de séparer vos applications de votre infrastructure afin de livrer des logiciels rapidement. Avec Docker, vous pouvez gérer votre infrastructure de la même manière que vous gérez vos applications. En tirant parti des méthodologies de Docker pour l'expédition, les tests et le déploiement de code, vous pouvez réduire considérablement le délai entre l'écriture du code et son exécution en production.
it: [Docker](https://docs.docker.com/get-started/docker-overview/) è una piattaforma open per lo sviluppo, la spedizione e l'esecuzione di applicazioni. Docker ti consente di separare le tue applicazioni dalla tua infrastruttura in modo da poter fornire software rapidamente. Con Docker, puoi gestire la tua infrastruttura nello stesso modo in cui gestisci le tue applicazioni. Sfruttando le metodologie di Docker per la spedizione, il test e la distribuzione del codice, puoi ridurre significativamente il ritardo tra la scrittura del codice e la sua esecuzione in produzione.
pt: [Docker](https://docs.docker.com/get-started/docker-overview/) é uma plataforma aberta para desenvolver, enviar e executar aplicações. O Docker permite que você separe suas aplicações de sua infraestrutura para que você possa entregar software rapidamente. Com o Docker, você pode gerenciar sua infraestrutura da mesma forma que gerencia suas aplicações. Ao aproveitar as metodologias do Docker para enviar, testar e implantar código, você pode reduzir significativamente o atraso entre escrever o código e executá-lo em produção.
ru: [Docker](https://docs.docker.com/get-started/docker-overview/) — это открытая платформа для разработки, доставки и запуска приложений. Docker позволяет отделить ваши приложения от инфраструктуры, чтобы вы могли быстро доставлять программное обеспечение. С Docker вы можете управлять своей инфраструктурой так же, как и приложениями. Используя преимущества методологий Docker для доставки, тестирования и развертывания кода, вы можете значительно сократить задержку между написанием кода и его запуском в производственной среде.

# chunk_6EBC627B
source: #### Installation
it: #### Installazione
pt: #### Instalação
ru: #### Установка

# chunk_BA8550C2
source: <h4>1. Pull and run:</h4>
de: <h4>1. Pullen und ausführen:</h4>
fr: <h4>1. Tirez et exécutez :</h4>
it: <h4>1. Esegui il pull e avvia:</h4>
pt: <h4>1. Puxe e execute:</h4>
ru: <h4>1. Загрузка и запуск:</h4>

# chunk_B1F3E7B5
source: > [!NOTE] > > - If you cannot access Docker Hub, please try the image on [GitHub Container Registry](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/pkgs/container/pdfmathtranslate). > > ```bash > docker pull ghcr.io/pdfmathtranslate-next/pdfmathtranslate-next > docker run -d -p 7860:7860 ghcr.io/pdfmathtranslate-next/pdfmathtranslate-next > ```
de: > [!NOTE] > > - Wenn Sie nicht auf Docker Hub zugreifen können, versuchen Sie bitte das Image auf [GitHub Container Registry](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/pkgs/container/pdfmathtranslate). > > ```bash > docker pull ghcr.io/pdfmathtranslate-next/pdfmathtranslate-next > docker run -d -p 7860:7860 ghcr.io/pdfmathtranslate-next/pdfmathtranslate-next > ```
fr: > [!NOTE] > > - Si vous ne pouvez pas accéder à Docker Hub, essayez l'image sur [GitHub Container Registry](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/pkgs/container/pdfmathtranslate). > > ```bash > docker pull ghcr.io/pdfmathtranslate-next/pdfmathtranslate-next > docker run -d -p 7860:7860 ghcr.io/pdfmathtranslate-next/pdfmathtranslate-next > ```
it: > [!NOTE] > > - Se non riesci ad accedere a Docker Hub, prova l'immagine su [GitHub Container Registry](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/pkgs/container/pdfmathtranslate). > > ```bash > docker pull ghcr.io/pdfmathtranslate-next/pdfmathtranslate-next > docker run -d -p 7860:7860 ghcr.io/pdfmathtranslate-next/pdfmathtranslate-next > ```
pt: > [!NOTE] > > - Se você não conseguir acessar o Docker Hub, tente a imagem no [GitHub Container Registry](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/pkgs/container/pdfmathtranslate). > > ```bash > docker pull ghcr.io/pdfmathtranslate-next/pdfmathtranslate-next > docker run -d -p 7860:7860 ghcr.io/pdfmathtranslate-next/pdfmathtranslate-next > ```
ru: > [!NOTE] > > - Если у вас нет доступа к Docker Hub, попробуйте использовать образ на [GitHub Container Registry](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/pkgs/container/pdfmathtranslate). > > ```bash > docker pull ghcr.io/pdfmathtranslate-next/pdfmathtranslate-next > docker run -d -p 7860:7860 ghcr.io/pdfmathtranslate-next/pdfmathtranslate-next > ```

# chunk_0222B95B
source: <h4>2. Enter this URL in your default browser to open the WebUI page:</h4>
de: <h4>2. Geben Sie diese URL in Ihrem Standardbrowser ein, um die WebUI-Seite zu öffnen:</h4>
fr: <h4>2. Entrez cette URL dans votre navigateur par défaut pour ouvrir la page WebUI :</h4>
it: <h4>2. Inserisci questo URL nel tuo browser predefinito per aprire la pagina WebUI:</h4>
pt: <h4>2. Insira este URL no seu navegador padrão para abrir a página WebUI:</h4>
ru: <h4>2. Введите этот URL в вашем браузере по умолчанию, чтобы открыть страницу WebUI:</h4>

# chunk_B5C49A1E
source: > [!NOTE] > If you encounter any issues during use WebUI, please refer to [Usage --> WebUI](./USAGE_webui.md). > [!NOTE] > If you encounter any issues during use command line, please refer to [Usage --> Command Line](./USAGE_commandline.md).
de: > [!NOTE] > Wenn Sie Probleme bei der Verwendung von WebUI haben, lesen Sie bitte [Verwendung --> WebUI](./USAGE_webui.md). > [!NOTE] > Wenn Sie Probleme bei der Verwendung der Kommandozeile haben, lesen Sie bitte [Verwendung --> Kommandozeile](./USAGE_commandline.md).
fr: > [!NOTE] > Si vous rencontrez des problèmes lors de l'utilisation de WebUI, veuillez consulter [Utilisation --> WebUI](./USAGE_webui.md). > [!NOTE] > Si vous rencontrez des problèmes lors de l'utilisation de la ligne de commande, veuillez consulter [Utilisation --> Ligne de commande](./USAGE_commandline.md).
it: > [!NOTE] > Se riscontri problemi durante l'utilizzo di WebUI, consulta [Utilizzo --> WebUI](./USAGE_webui.md). > [!NOTE] > Se riscontri problemi durante l'utilizzo della riga di comando, consulta [Utilizzo --> Riga di comando](./USAGE_commandline.md).
pt: > [!NOTE] > Se você encontrar qualquer problema durante o uso do WebUI, consulte [Uso --> WebUI](./USAGE_webui.md). > [!NOTE] > Se você encontrar qualquer problema durante o uso da Linha de comando, consulte [Uso --> Linha de comando](./USAGE_commandline.md).
ru: > [!NOTE] > Если у вас возникли проблемы при использовании WebUI, обратитесь к разделу [Использование --> WebUI](./USAGE_webui.md). > [!NOTE] > Если у вас возникли проблемы при использовании командной строки, обратитесь к разделу [Использование --> Командная строка](./USAGE_commandline.md).

# chunk_23005398
source: [**Getting Started**](./getting-started.md) > **Installation** > **uv** _(current)_
de: [**Erste Schritte**](./getting-started.md) > **Installation** > **uv** _(aktuell)_
fr: [**Commencer**](./getting-started.md) > **Installation** > **uv** _(actuel)_
it: [**Iniziare**](./getting-started.md) > **Installazione** > **uv** _(current)_
pt: [**Começar**](./getting-started.md) > **Instalação** > **uv** _(atual)_
ru: [**Начало работы**](./getting-started.md) > **Установка** > **uv** _(текущая)_

# chunk_D43EE31C
source: ### Install PDFMathTranslate via uv
de: ### Installieren Sie PDFMathTranslate über uv
fr: ### Installer PDFMathTranslate via uv
it: ### Installa PDFMathTranslate tramite uv
pt: ### Instalar PDFMathTranslate via uv
ru: ### Установка PDFMathTranslate через uv

# chunk_1BF9C99B
source: #### What is uv? How to install it?
de: #### Was ist uv? Wie installiert man es?
fr: #### Qu'est-ce que uv ? Comment l'installer ?
it: #### Cos'è uv? Come installarlo?
pt: #### O que é uv? Como instalá-lo?
ru: #### Что такое uv? Как его установить?

# chunk_8963BEA0
source: uv is an extremely fast Python package and project manager, written in Rust. <br> To install uv on your computer, please refer to [this article](https://docs.astral.sh/uv/getting-started/installation/).
de: uv ist ein extrem schneller Python-Paket- und Projektmanager, geschrieben in Rust. <br> Um uv auf Ihrem Computer zu installieren, lesen Sie bitte [diesen Artikel](https://docs.astral.sh/uv/getting-started/installation/).
fr: uv est un gestionnaire de paquets et de projets Python extrêmement rapide, écrit en Rust. <br> Pour installer uv sur votre ordinateur, veuillez consulter [cet article](https://docs.astral.sh/uv/getting-started/installation/).
it: uv è un gestore di pacchetti e progetti Python estremamente veloce, scritto in Rust. <br> Per installare uv sul tuo computer, consulta [questo articolo](https://docs.astral.sh/uv/getting-started/installation/).
pt: uv é um gerenciador de pacotes e projetos Python extremamente rápido, escrito em Rust. <br> Para instalar o uv no seu computador, consulte [este artigo](https://docs.astral.sh/uv/getting-started/installation/).
ru: uv — это чрезвычайно быстрый менеджер пакетов и проектов Python, написанный на Rust. <br> Чтобы установить uv на ваш компьютер, обратитесь к [этой статье](https://docs.astral.sh/uv/getting-started/installation/).

# chunk_05BD0E93
source: 1. Python installed (3.10 <= version <= 3.12); 2. Use the following command to use our package: ```bash pip install uv uv tool install --python 3.12 pdf2zh-next ```
de: 1. Python installiert (3.10 <= Version <= 3.12); 2. Verwenden Sie den folgenden Befehl, um unser Paket zu nutzen: ```bash pip install uv uv tool install --python 3.12 pdf2zh-next ```
fr: 1. Python installé (version 3.10 <= version <= 3.12) ; 2. Utilisez la commande suivante pour utiliser notre package : ```bash pip install uv uv tool install --python 3.12 pdf2zh-next ```
it: 1. Python installato (3.10 <= versione <= 3.12); 2. Utilizza il seguente comando per usare il nostro pacchetto: ```bash pip install uv uv tool install --python 3.12 pdf2zh-next ```
pt: 1. Python instalado (versão >= 3.10 e <= 3.12); 2. Use o seguinte comando para utilizar nosso pacote: ```bash pip install uv uv tool install --python 3.12 pdf2zh-next ```
ru: 1. Установленный Python (версия от 3.10 до 3.12); 2. Используйте следующую команду для установки нашего пакета: ```bash pip install uv uv tool install --python 3.12 pdf2zh-next ```

# chunk_74F9EC5E
source: After installation, you can start translation via the **command line** or **WebUI**.
de: Nach der Installation können Sie mit der Übersetzung über die **Kommandozeile** oder **WebUI** beginnen.
fr: Après l'installation, vous pouvez commencer la traduction via la **ligne de commande** ou le **WebUI**.
it: Dopo l'installazione, puoi iniziare la traduzione tramite la **riga di comando** o **WebUI**.
pt: Após a instalação, você pode começar a tradução via **linha de comando** ou **WebUI**.
ru: После установки вы можете начать перевод через **командную строку** или **WebUI**.

# chunk_747DC3A8
source: !!! Warning If you see the error `command not found: pdf2zh_next` when running, please configure the environment variables as follows and try again: === "macOS and Linux" Add the following to your ~/.zshrc: ```console export PATH="$PATH:/Users/Username/.local/bin" ``` Then restart your terminal === "Windows" Enter the following in PowerShell: ```powershell $env:Path = "C:\Users\Username\.local\bin;$env:Path" ``` Then restart your terminal
de: !!! Warning Wenn Sie beim Ausführen den Fehler `command not found: pdf2zh_next` sehen, konfigurieren Sie bitte die Umgebungsvariablen wie folgt und versuchen Sie es erneut: === "macOS und Linux" Fügen Sie Folgendes zu Ihrer ~/.zshrc hinzu: ```console export PATH="$PATH:/Users/Username/.local/bin" ``` Starten Sie dann Ihr Terminal neu === "Windows" Geben Sie Folgendes in PowerShell ein: ```powershell $env:Path = "C:\Users\Username\.local\bin;$env:Path" ``` Starten Sie dann Ihr Terminal neu
fr: !!! Warning Si vous voyez l'erreur `command not found: pdf2zh_next` lors de l'exécution, veuillez configurer les variables d'environnement comme suit et réessayer : === "macOS et Linux" Ajoutez ce qui suit à votre ~/.zshrc : ```console export PATH="$PATH:/Users/Username/.local/bin" ``` Puis redémarrez votre terminal === "Windows" Entrez ce qui suit dans PowerShell : ```powershell $env:Path = "C:\Users\Username\.local\bin;$env:Path" ``` Puis redémarrez votre terminal
it: !!! Warning Se vedi l'errore `command not found: pdf2zh_next` durante l'esecuzione, configura le variabili d'ambiente come segue e riprova: === "macOS e Linux" Aggiungi quanto segue al tuo ~/.zshrc: ```console export PATH="$PATH:/Users/Username/.local/bin" ``` Quindi riavvia il terminale === "Windows" Inserisci quanto segue in PowerShell: ```powershell $env:Path = "C:\Users\Username\.local\bin;$env:Path" ``` Quindi riavvia il terminale
pt: !!! Warning Se você vir o erro `command not found: pdf2zh_next` ao executar, configure as variáveis de ambiente da seguinte forma e tente novamente: === "macOS e Linux" Adicione o seguinte ao seu ~/.zshrc: ```console export PATH="$PATH:/Users/Username/.local/bin" ``` Em seguida, reinicie seu terminal === "Windows" Digite o seguinte no PowerShell: ```powershell $env:Path = "C:\Users\Username\.local\bin;$env:Path" ``` Em seguida, reinicie seu terminal
ru: !!! Warning Если при запуске вы видите ошибку `command not found: pdf2zh_next`, настройте переменные окружения следующим образом и попробуйте снова: === "macOS и Linux" Добавьте следующее в ваш ~/.zshrc: ```console export PATH="$PATH:/Users/Username/.local/bin" ``` Затем перезапустите терминал === "Windows" Введите следующее в PowerShell: ```powershell $env:Path = "C:\Users\Username\.local\bin;$env:Path" ``` Затем перезапустите терминал

# chunk_C86DFF6A
source: > [!NOTE] > If you encounter any issues during use WebUI, please refer to [Usage --> WebUI](./USAGE_webui.md). > [!NOTE] > If you encounter any issues during use command line, please refer to [Usage --> Command Line](./USAGE_commandline.md).
de: > [!NOTE] > Wenn Sie während der Verwendung der WebUI auf Probleme stoßen, lesen Sie bitte [Verwendung --> WebUI](./USAGE_webui.md). > [!NOTE] > Wenn Sie während der Verwendung der Kommandozeile auf Probleme stoßen, lesen Sie bitte [Verwendung --> Kommandozeile](./USAGE_commandline.md).
fr: > [!NOTE] > Si vous rencontrez des problèmes lors de l'utilisation de WebUI, veuillez consulter [Utilisation --> WebUI](./USAGE_webui.md). > [!NOTE] > Si vous rencontrez des problèmes lors de l'utilisation de la ligne de commande, veuillez consulter [Utilisation --> Ligne de commande](./USAGE_commandline.md).
it: > [!NOTE] > Se riscontri problemi durante l'utilizzo di WebUI, consulta [Utilizzo --> WebUI](./USAGE_webui.md). > [!NOTE] > Se riscontri problemi durante l'utilizzo della riga di comando, consulta [Utilizzo --> Riga di comando](./USAGE_commandline.md).
pt: > [!NOTE] > Se você encontrar qualquer problema ao usar o WebUI, consulte [Uso --> WebUI](./USAGE_webui.md). > [!NOTE] > Se você encontrar qualquer problema ao usar a linha de comando, consulte [Uso --> Linha de comando](./USAGE_commandline.md).
ru: > [!NOTE] > Если у вас возникли проблемы при использовании WebUI, обратитесь к разделу [Использование --> WebUI](./USAGE_webui.md). > [!NOTE] > Если у вас возникли проблемы при использовании командной строки, обратитесь к разделу [Использование --> Командная строка](./USAGE_commandline.md).

# chunk_E5616440
source: [**Getting Started**](./getting-started.md) > **Installation** > **Windows EXE** _(current)_
de: [**Erste Schritte**](./getting-started.md) > **Installation** > **Windows EXE** _(aktuell)_
fr: [**Commencer**](./getting-started.md) > **Installation** > **Windows EXE** _(current)_
it: [**Iniziare**](./getting-started.md) > **Installazione** > **Windows EXE** _(current)_
pt: [**Começar**](./getting-started.md) > **Instalação** > **Windows EXE** _(atual)_
ru: [**Начало работы**](./getting-started.md) > **Установка** > **Windows EXE** _(текущая)_

# chunk_F372470F
source: ### Install PDFMathTranslate via .exe file
de: ### Installieren Sie PDFMathTranslate über eine .exe-Datei
fr: ### Installer PDFMathTranslate via fichier .exe
it: ### Installa PDFMathTranslate tramite file .exe
pt: ### Instalar PDFMathTranslate via arquivo .exe
ru: ### Установка PDFMathTranslate через файл .exe

# chunk_D3A98932
source: ***Step 1*** | Download `pdf2zh-<version>-with-assets-win64.zip` from [release page](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/releases).
de: ***Schritt 1*** | Laden Sie `pdf2zh-<version>-with-assets-win64.zip` von der [release page](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/releases) herunter.
fr: ***Étape 1*** | Téléchargez `pdf2zh-<version>-with-assets-win64.zip` depuis la [page des versions](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/releases).
it: ***Passo 1*** | Scarica `pdf2zh-<version>-with-assets-win64.zip` dalla [pagina delle release](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/releases).
pt: ***Passo 1*** | Baixe `pdf2zh-<version>-with-assets-win64.zip` da [página de lançamentos](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/releases).
ru: ***Шаг 1*** | Загрузите `pdf2zh-<version>-with-assets-win64.zip` со [страницы релизов](https://github.com/PDFMathTranslate-next/PDFMathTranslate-next/releases).

# chunk_29FE8C1D
source: > [!TIP] > **What is the difference between `pdf2zh-<version>-with-assets-win64.zip` and `pdf2zh-<version>-win64.zip`?** > > - If you are downloading and using PDFMathTranslate for the first time, it is recommended to download `pdf2zh-<version>-with-assets-win64.zip`. > - The `pdf2zh-<version>-with-assets-win64.zip` includes resource files (such as fonts and models) compared to `pdf2zh-<version>-win64.zip`. > - The version without assets will also dynamically download resources when running, but the download may fail due to network issues.
de: > [!TIP] > **Was ist der Unterschied zwischen `pdf2zh-<version>-with-assets-win64.zip` und `pdf2zh-<version>-win64.zip`?** > > - Wenn Sie PDFMathTranslate zum ersten Mal herunterladen und verwenden, wird empfohlen, `pdf2zh-<version>-with-assets-win64.zip` herunterzuladen. > - Die `pdf2zh-<version>-with-assets-win64.zip` enthält im Vergleich zu `pdf2zh-<version>-win64.zip` zusätzliche Ressourcendateien (wie Schriftarten und Modelle). > - Die Version ohne Assets lädt die Ressourcen beim Ausführen dynamisch nach, aber der Download kann aufgrund von Netzwerkproblemen fehlschlagen.
fr: > [!TIP] > **Quelle est la différence entre `pdf2zh-<version>-with-assets-win64.zip` et `pdf2zh-<version>-win64.zip` ?** > > - Si vous téléchargez et utilisez PDFMathTranslate pour la première fois, il est recommandé de télécharger `pdf2zh-<version>-with-assets-win64.zip`. > - Le fichier `pdf2zh-<version>-with-assets-win64.zip` inclut les fichiers de ressources (tels que les polices et les modèles) contrairement à `pdf2zh-<version>-win64.zip`. > - La version sans ressources téléchargera également les ressources dynamiquement lors de l'exécution, mais le téléchargement peut échouer en raison de problèmes de réseau.
it: > [!TIP] > **Qual è la differenza tra `pdf2zh-<version>-with-assets-win64.zip` e `pdf2zh-<version>-win64.zip`?** > > - Se stai scaricando e utilizzando PDFMathTranslate per la prima volta, si consiglia di scaricare `pdf2zh-<version>-with-assets-win64.zip`. > - Il file `pdf2zh-<version>-with-assets-win64.zip` include file di risorse (come font e modelli) rispetto a `pdf2zh-<version>-win64.zip`. > - La versione senza risorse scaricherà anche dinamicamente le risorse durante l'esecuzione, ma il download potrebbe fallire a causa di problemi di rete.
pt: > [!TIP] > **Qual é a diferença entre `pdf2zh-<version>-with-assets-win64.zip` e `pdf2zh-<version>-win64.zip`?** > > - Se você está baixando e usando o PDFMathTranslate pela primeira vez, é recomendado baixar `pdf2zh-<version>-with-assets-win64.zip`. > - O `pdf2zh-<version>-with-assets-win64.zip` inclui arquivos de recursos (como fontes e modelos) em comparação com `pdf2zh-<version>-win64.zip`. > - A versão sem recursos também irá baixar os recursos dinamicamente durante a execução, mas o download pode falhar devido a problemas de rede.
ru: > [!TIP] > **В чем разница между `pdf2zh-<version>-with-assets-win64.zip` и `pdf2zh-<version>-win64.zip`?** > > - Если вы скачиваете и используете PDFMathTranslate впервые, рекомендуется загрузить `pdf2zh-<version>-with-assets-win64.zip`. > - В `pdf2zh-<version>-with-assets-win64.zip` включены файлы ресурсов (например, шрифты и модели) по сравнению с `pdf2zh-<version>-win64.zip`. > - Версия без ресурсов также будет динамически загружать ресурсы при запуске, но загрузка может завершиться неудачно из-за проблем с сетью.

# chunk_17427D5A
source: ***Step 2*** | Unzip `pdf2zh-<version>-with-assets-win64.zip` and navigate `pdf2zh` folder. It takes a while to decompress, please be patient. ***Step 3*** | Navigate `pdf2zh` folder, then Double-click `pdf2zh.exe`.
de: ***Schritt 2*** | Entpacken Sie `pdf2zh-<version>-with-assets-win64.zip` und navigieren Sie zum Ordner `pdf2zh`. Das Entpacken dauert eine Weile, bitte haben Sie Geduld. ***Schritt 3*** | Navigieren Sie zum Ordner `pdf2zh` und doppelklicken Sie dann auf `pdf2zh.exe`.
fr: ***Étape 2*** | Décompressez `pdf2zh-<version>-with-assets-win64.zip` et accédez au dossier `pdf2zh`. La décompression prend un certain temps, soyez patient. ***Étape 3*** | Accédez au dossier `pdf2zh`, puis double-cliquez sur `pdf2zh.exe`.
it: ***Passo 2*** | Decomprimi `pdf2zh-<version>-with-assets-win64.zip` e accedi alla cartella `pdf2zh`. La decompressione richiede del tempo, sii paziente. ***Passo 3*** | Accedi alla cartella `pdf2zh`, quindi fai doppio clic su `pdf2zh.exe`.
pt: ***Passo 2*** | Descompacte `pdf2zh-<version>-with-assets-win64.zip` e navegue até a pasta `pdf2zh`. Leva um tempo para descompactar, por favor, seja paciente. ***Passo 3*** | Navegue até a pasta `pdf2zh`, depois clique duas vezes em `pdf2zh.exe`.
ru: ***Шаг 2*** | Распакуйте `pdf2zh-<version>-with-assets-win64.zip` и перейдите в папку `pdf2zh`. Распаковка может занять некоторое время, пожалуйста, подождите. ***Шаг 3*** | Перейдите в папку `pdf2zh`, затем дважды щелкните по файлу `pdf2zh.exe`.
