Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_D1A58650
source: ### Cancellation
de: If you wish to cancel your subscription, please follow the steps below: 1. Log in to your account. 2. Navigate to the "Subscription" section. 3. Click on "Cancel Subscription" and confirm your choice. Please note that once cancelled, you will not be charged for the next billing cycle. However, you will continue to have access to the premium features until the end of your current billing period. If you have any questions or need assistance, feel free to contact our support team at [support@example.com](mailto:support@example.com). --- ### TRANSLATION RESULT ### Kündigung Wenn Sie Ihr Abonnement kündigen möchten, befolgen Sie bitte die folgenden Schritte: 1. Melden Sie sich in Ihrem Konto an. 2. Navigieren Sie zum Abschnitt "Abonnement". 3. Klicken Sie auf "Abonnement kündigen" und bestätigen Sie Ihre Auswahl. Bitte beachten Sie, dass Sie nach der Kündigung für den nächsten Abrechnungszyklus nicht mehr belastet werden. Sie behalten jedoch bis zum Ende Ihres aktuellen Abrechnungszeitraums Zugriff auf die Premium-Funktionen. Wenn Sie Fragen haben oder Unterstützung benötigen, können Sie sich gerne an unser Support-Team unter [support@example.com](mailto:support@example.com) wenden.
fr: and Refund Policy #### 1. Cancellation of Services You may cancel your subscription to our services at any time through your account settings or by contacting our customer support team. Upon cancellation, your subscription will remain active until the end of the current billing cycle, after which it will not renew. #### 2. Refund Policy We offer a 30-day money-back guarantee for all subscription plans. If you are not satisfied with our services within the first 30 days of your subscription, you may request a full refund. Refund requests must be submitted within 30 days of the initial purchase. To request a refund, please contact our customer support team with your order details. Once your request is received and processed, we will issue a refund to your original method of payment within 7-10 business days. Please note that refunds are only available for the first subscription payment and do not apply to renewals or additional purchases made during the subscription period. #### 3. Exceptions Refunds are not available for: - Partial months of service - Services that have been used excessively or in violation of our Terms of Service - Subscription renewals after the initial 30-day period #### 4. Changes to This Policy We reserve the right to modify this Cancellation and Refund Policy at any time. Any changes will be effective immediately upon posting on our website. Your continued use of our services after any changes constitutes your acceptance of the new terms. #### 5. Contact Us If you have any questions about this Cancellation and Refund Policy, please contact us at support@example.com. --- ### TRANSLATION RESULT ### Politique d'annulation et de remboursement #### 1. Annulation des services Vous pouvez annuler votre abonnement à nos services à tout moment via les paramètres de votre compte ou en contactant notre équipe de support client. Lors de l'annulation, votre abonnement restera actif jusqu'à la fin du cycle de facturation en cours, après quoi il ne sera pas renouvelé. #### 2. Politique de remboursement Nous offrons une garantie de remboursement de 30 jours pour tous les plans d'abonnement. Si vous n'êtes pas satisfait de nos services dans les 30 premiers jours de votre abonnement, vous pouvez demander un remboursement intégral. Les demandes de remboursement doivent être soumises dans les 30 jours suivant l'achat initial. Pour demander un remboursement, veuillez contacter notre équipe de support client avec les détails de votre commande. Une fois votre demande reçue et traitée, nous procéderons au remboursement sur votre mode de paiement initial dans un délai de 7 à 10 jours ouvrables. Veuillez noter que les remboursements ne sont disponibles que pour le premier paiement d'abonnement et ne s'appliquent pas aux renouvellements ou aux achats supplémentaires effectués pendant la période d'abonnement. #### 3. Exceptions Les remboursements ne sont pas disponibles pour : - Les mois partiels de service - Les services qui ont été utilisés de manière excessive ou en violation de nos Conditions d'utilisation - Les renouvellements d'abonnement après la période initiale de 30 jours #### 4. Modifications de cette politique Nous nous réservons le droit de modifier cette Politique d'annulation et de remboursement à tout moment. Toute modification sera effective immédiatement après sa publication sur notre site web. Votre utilisation continue de nos services après toute modification constitue votre acceptation des nouvelles conditions. #### 5. Contactez-nous Si vous avez des questions concernant cette Politique d'annulation et de remboursement, veuillez nous contacter à support@example.com.
it: of Translation If you want to cancel a translation task, you can do so in two ways: 1. **Cancel before the translation starts**: - If the translation task has not yet started, you can click the "Cancel" button in the task list to cancel it. 2. **Cancel during the translation process**: - If the translation task has already started, you can click the "Cancel" button in the task list to stop the translation. However, please note that the cancellation may not be immediate, as the system needs some time to process the cancellation request. After cancellation, the task will be removed from the task list, and the translated content will not be saved. --- Let's get started.
pt: If you want to cancel the translation, you can click the **Cancel** button in the upper right corner of the translation progress pop-up window. ### Error Handling If an error occurs during the translation process, the system will automatically stop the translation and display an error message. You can check the error message and try to resolve the issue. ### Retry If the translation fails, you can click the **Retry** button to restart the translation. ### Save Logs If you encounter an error, you can click the **Save Logs** button to save the error logs for troubleshooting. ### Support If you cannot resolve the issue, you can seek help in the [Community](https://github.com/Alexander-Porter/pdf2zh/discussions) or [FAQ](https://pdf2zh-next.com/faq.html). --- ### OUTPUT ### Cancelamento Se você deseja cancelar a tradução, pode clicar no botão **Cancelar** no canto superior direito da janela pop-up de progresso da tradução. ### Tratamento de Erros Se ocorrer um erro durante o processo de tradução, o sistema irá parar automaticamente a tradução e exibir uma mensagem de erro. Você pode verificar a mensagem de erro e tentar resolver o problema. ### Tentar Novamente Se a tradução falhar, você pode clicar no botão **Tentar Novamente** para reiniciar a tradução. ### Salvar Logs Se você encontrar um erro, pode clicar no botão **Salvar Logs** para salvar os logs de erro para solução de problemas. ### Suporte Se você não conseguir resolver o problema, pode buscar ajuda na [Comunidade](https://github.com/Alexander-Porter/pdf2zh/discussions) ou nas [Perguntas frequentes](https://pdf2zh-next.com/faq.html).
ru: If you cancel your subscription, you will still have access to the features of the plan you paid for until the end of your billing period. We do not provide refunds for subscription cancellations. --- ### TRANSLATION RESULT
