Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_6BBAD367
source: | `--glossaries` | Glossary file list. | `pdf2zh_next example.pdf --glossaries "glossary1.csv,glossary2.csv,glossary3.csv"` |
de: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--glossary` | Glossary file. | `pdf2zh_next example.pdf --glossary "glossary.csv"` | | `--disable-glossary` | Disable glossary. | `pdf2zh_next example.pdf --disable-glossary` | | `--glossary-fallback` | Fallback mode for glossary. Options: "keep", "ignore", "use" | `pdf2zh_next example.pdf --glossary-fallback "keep"` | | `--glossary-case-sensitive` | Case sensitive for glossary. | `pdf2zh_next example.pdf --glossary-case-sensitive` | | `--glossary-merge-strategy` | Merge strategy for multiple glossaries. Options: "first", "merge", "overwrite" | `pdf2zh_next example.pdf --glossaries "glossary1.csv,glossary2.csv" --glossary-merge-strategy "merge"` | | `--glossary-min-length` | Minimum length of glossary terms. | `pdf2zh_next example.pdf --glossary-min-length 2` | | `--glossary-max-length` | Maximum length of glossary terms. | `pdf2zh_next example.pdf --glossary-max-length 20` | | `--glossary-min-occurrence` | Minimum occurrence of glossary terms. | `pdf2zh_next example.pdf --glossary-min-occurrence 2` | | `--glossary-max-occurrence` | Maximum occurrence of glossary terms. | `pdf2zh_next example.pdf --glossary-max-occurrence 100` | | `--glossary-min-confidence` | Minimum confidence of glossary terms. | `pdf2zh_next example.pdf --glossary-min-confidence 0.5` | | `--glossary-max-confidence` | Maximum confidence of glossary terms. | `pdf2zh_next example.pdf --glossary-max-confidence 1.0` | | `--glossary-min-precision` | Minimum precision of glossary terms. | `pdf2zh_next example.pdf --glossary-min-precision 0.5` | | `--glossary-max-precision` | Maximum precision of glossary terms. | `pdf2zh_next example.pdf --glossary-max-precision 1.0` | | `--glossary-min-recall` | Minimum recall of glossary terms. | `pdf2zh_next example.pdf --glossary-min-recall 0.5` | | `--glossary-max-recall` | Maximum recall of glossary terms. | `pdf2zh_next example.pdf --glossary-max-recall 1.0` | | `--glossary-min-f1` | Minimum F1 score of glossary terms. | `pdf2zh_next example.pdf --glossary-min-f1 0.5` | | `--glossary-max-f1` | Maximum F1 score of glossary terms. | `pdf2zh_next example.pdf --glossary-max-f1 1.0` | | `--glossary-min-support` | Minimum support of glossary terms. | `pdf2zh_next example.pdf --glossary-min-support 2` | | `--glossary-max-support` | Maximum support of glossary terms. | `pdf2zh_next example.pdf --glossary-max-support 100` | | `--glossary-min-coverage` | Minimum coverage of glossary terms. | `pdf2zh_next example.pdf --glossary-min-coverage 0.5` | | `--glossary-max-coverage` | Maximum coverage of glossary terms. | `pdf2zh_next example.pdf --glossary-max-coverage 1.0` | | `--glossary-min-density` | Minimum density of glossary terms. | `pdf2zh_next example.pdf --glossary-min-density 0.5` | | `--glossary-max-density` | Maximum density of glossary terms. | `pdf2zh_next example.pdf --glossary-max-density 1.0` | | `--glossary-min-entropy` | Minimum entropy of glossary terms. | `pdf2zh_next example.pdf --glossary-min-entropy 0.5` | | `--glossary-max-entropy` | Maximum entropy of glossary terms. | `pdf2zh_next example.pdf --glossary-max-entropy 1.0` | | `--glossary-min-specificity` | Minimum specificity of glossary terms. | `pdf2zh_next example.pdf --glossary-min-specificity 0.5` | | `--glossary-max-specificity` | Maximum specificity of glossary terms. | `pdf2zh_next example.pdf --glossary-max-specificity 1.0` | | `--glossary-min-accuracy` | Minimum accuracy of glossary terms. | `pdf2zh_next example.pdf --glossary-min-accuracy 0.5` | | `--glossary-max-accuracy` | Maximum accuracy of glossary terms. | `pdf2zh_next example.pdf --glossary-max-accuracy 1.0` | | `--glossary-min-balanced-accuracy` | Minimum balanced accuracy of glossary terms. | `pdf2zh_next example.pdf --glossary-min-balanced-accuracy 0.5` | | `--glossary-max-balanced-accuracy` | Maximum balanced accuracy of glossary terms. | `pdf2zh_next example.pdf --glossary-max-balanced-accuracy 1.0` | | `--glossary-min-matthews-correlation` | Minimum Matthews correlation coefficient of glossary terms. | `pdf2zh_next example.pdf --glossary-min-matthews-correlation 0.5` | | `--glossary-max-matthews-correlation` | Maximum Matthews correlation coefficient of glossary terms. | `pdf2zh_next example.pdf --glossary-max-matthews-correlation 1.0` | | `--glossary-min-informedness` | Minimum informedness of glossary terms. | `pdf2zh_next example.pdf --glossary-min-informedness 0.5` | | `--glossary-max-informedness` | Maximum informedness of glossary terms. | `pdf2zh_next example.pdf --glossary-max-informedness 1.0` | | `--glossary-min-markedness` | Minimum markedness of glossary terms. | `pdf2zh_next example.pdf --glossary-min-markedness 0.5` | | `--glossary-max-markedness` | Maximum markedness of glossary terms. | `pdf2zh_next example.pdf --glossary-max-markedness 1.0` | | `--glossary-min-prevalence` | Minimum prevalence of glossary terms. | `pdf2zh_next example.pdf --glossary-min-prevalence 0.5` | | `--glossary-max-prevalence` | Maximum prevalence of glossary terms. | `pdf2zh_next example.pdf --glossary-max-prevalence 1.0` | | `--glossary-min-bias` | Minimum bias of glossary terms. | `pdf2zh_next example.pdf --glossary-min-bias 0.5` | | `--glossary-max-bias` | Maximum bias of glossary terms. | `pdf2zh_next example.pdf --glossary-max-bias 1.0` | | `--glossary-min-prevalence-ratio` | Minimum prevalence ratio of glossary terms. | `pdf2zh_next example.pdf --glossary-min-prevalence-ratio 0.5` | | `--glossary-max-prevalence-ratio` | Maximum prevalence ratio of glossary terms. | `pdf2zh_next example.pdf --glossary-max-prevalence-ratio 1.0` | | `--glossary-min-prevalence-difference` | Minimum prevalence difference of glossary terms. | `pdf2zh_next example.pdf --glossary-min-prevalence-difference 0.5` | | `--glossary-max-prevalence-difference` | Maximum prevalence difference of glossary terms. | `pdf2zh_next example.pdf --glossary-max-prevalence-difference 1.0` | | `--glossary-min-prevalence-ratio-difference` | Minimum prevalence ratio difference of glossary terms. | `pdf2zh_next example.pdf --glossary-min-prevalence-ratio-difference 0.5` | | `--glossary-max-prevalence-ratio-difference` | Maximum prevalence ratio difference of glossary terms. | `pdf2zh_next example.pdf --glossary-max-prevalence-ratio-difference 1.极` | --- ### OUTPUT | `--glossaries` | Liste der Glossardateien. | `pdf2zh_next example.pdf --glossaries "glossary1.csv,glossary2.csv,glossary3.csv"` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--glossary` | Glossardatei. | `pdf2zh_next example.pdf --glossary "glossary.csv"` | | `--disable-glossary` | Glossar deaktivieren. | `pdf2zh_next example.pdf --disable-glossary` | | `--glossary-fallback` | Fallback-Modus für das Glossar. Optionen: "keep", "ignore", "use" | `pdf2zh_next example.pdf --glossary-fallback "keep"` | | `--glossary-case-sensitive` | Groß-/Kleinschreibung für das Glossar beachten. | `pdf2zh_next example.pdf --glossary-case-sensitive` | | `--glossary-merge-strategy` | Zusammenführungsstrategie für mehrere Glossare. Optionen: "first", "merge", "overwrite" | `pdf2zh_next example.pdf --glossaries "glossary1.csv,glossary2.csv" --glossary-merge-strategy "merge"` | | `--glossary-min-length` | Minimale Länge der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-min-length 2` | | `--glossary-max-length` | Maximale Länge der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-max-length 20` | | `--glossary-min-occurrence` | Minimale Häufigkeit der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-min-occurrence 极` | | `--glossary-max-occurrence` | Maximale Häufigkeit der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-max-occurrence 100` | | `--glossary-min-confidence` | Minimale Konfidenz der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-min-confidence 0.5` | | `--glossary-max-confidence` | Maximale Konfidenz der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-max-confidence 1.0` | | `--glossary-min-precision` | Minimale Präzision der Glossarbegriffe. | `pdf 极 zh_next example.pdf --glossary-min-precision 0.5` | | `--glossary-max-precision` | Maximale Präzision der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-max-precision 1.0` | | `--glossary-min-recall` | Minimale Recall der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-min-recall 0.5` | | `--glossary 极 max-recall` | Maximale Recall der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-max-recall 1.0` | | `--glossary-min-f1` | Minimaler F1-Score der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-min-f1 0.5` | | `--glossary-max-f1` | Maximaler F1-Score der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-max-f1 1.0` | | `--glossary-min-support` | Minimale Unterstützung der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-min-support 2` | | `--glossary-max-support` | Maximale Unterstützung der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-max-support 100` | | `--glossary-min-coverage` | Minimale Abdeckung der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-min-coverage 0.5` | | `--glossary-max-coverage` | Maximale Abdeckung der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-max-coverage 1.0` | | `--glossary-min-density` | Minimale Dichte der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-min-density 0.5` | | `--glossary-max-density` | Maximale Dichte der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-max-density 1.0` | | `--glossary-min-entropy` | Minimale Entropie der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-min-entropy 0.5` | | `--glossary-max-entropy` | Maximale Entropie der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-max-entropy 1.0` | | `--glossary-min-specificity` | Minimale Spezifität der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-min-specificity 0.5` | | `--glossary-max-specificity` | Maximale Spezifität der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-max-specificity 1.0` | | `--glossary-min-accuracy` | Minimale Genauigkeit der Glossarb 极 egriffe. | `pdf2zh_next example.pdf --glossary-min-accuracy 0.5` | | `--glossary-max-accuracy` | Maximale Genauigkeit der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-max-accuracy 1.0` | | `--glossary-min-balanced-accuracy` | Minimale ausbalancierte Genauigkeit der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-min-balanced-accuracy 0.5` | | `--glossary-max-balanced-accuracy` | Maximale ausbalancierte Genauigkeit der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-max-balanced-accuracy 1.0` | | `--glossary-min-matthews-correlation` | Minimaler Matthews-Korrelationskoeffizient der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-min-matthews-correlation 0.5` | | `--glossary-max-matthews-correlation` | Maximaler Matthews-Korrelationskoeffizient der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-max-matthews-correlation 1.0` | | `--glossary-min-informedness` | Minimale Informiertheit der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-min-informedness 0.5` | | `--glossary-max-informedness` | Maximale Informiertheit der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-max-informedness 1.0` | | `--glossary-min-markedness` | Minimale Markiertheit der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-min-markedness 0.5` | | `--glossary-max-markedness` | Maximale Markiertheit der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-max-markedness 1.0` | | `--glossary-min-prevalence` | Minimale Prävalenz der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-min-prevalence 0.5` | | `--glossary-max-prevalence` | Maximale Prävalenz der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-max-prevalence 1.0` | | `--glossary-min-bias` | Minimale Verzerrung der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-min-bias 0.5` | | `--glossary-max-bias` | Maximale Verzerrung der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-max-bias 1.0` | | `--glossary-min-prevalence-ratio` | Minimales Prävalenzverhältnis der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-min-prevalence-ratio 0.5` | | `--glossary-max-prevalence-ratio` | Maximales Prävalenzverhältnis der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-max-prevalence-ratio 1.0` | | `--glossary-min-prevalence-difference` | Minimale Prävalenzdifferenz der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-min-prevalence-difference 0.5` | | `--glossary-max-prevalence-difference` | Maximale Prävalenzdifferenz der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-max-prevalence-difference 1.0` | | `--glossary-min-prevalence-ratio-difference` | Minimale Prävalenzverhältnisdifferenz der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-min-prevalence-ratio-difference 0.5` | | `--glossary-max-prevalence-ratio-difference` | Maximale Prävalenzverhältnisdifferenz der Glossarbegriffe. | `pdf2zh_next example.pdf --glossary-max-prevalence-ratio-difference 1.0` |
fr: | :------------------------------ | :-------------------------------------------------------------------------------------- | :-------------------------------------------------------------------------------------------------------------------- | | `--glossary_delimiter` | The delimiter used in the glossary file. The default is `,`. | `pdf2zh_next example.pdf --glossaries "glossary1.csv,glossary2.csv" --glossary_delimiter ";"` | | `--glossary_format` | The format of the glossary file. The default is `csv`. | `pdf2zh_next example.pdf --glossaries "glossary1.txt,glossary2.txt" --glossary_format "txt" --glossary_delimiter " "` | | `--glossary_src_lang` | The source language of the glossary. The default is `en`. | `pdf2zh_next example.pdf --glossaries "glossary1.csv,glossary2.csv" --glossary_src_lang "en"` | | `--glossary_tgt_lang` | The target language of the glossary. The default is `zh`. | `pdf2zh_next example.pdf --glossaries "glossary1.csv,glossary2.csv" --glossary_tgt_lang "fr"` | | `--glossary_case_sensitive` | Whether the glossary is case sensitive. The default is `false`. | `pdf2zh_next example.pdf --glossaries "glossary1.csv,glossary2.csv" --glossary_case_sensitive` | | `--glossary_match_boundaries` | Whether to match word boundaries when using the glossary. The default is `false`. | `pdf2zh_next example.pdf --glossaries "glossary1.csv,glossary2.csv" --glossary_match_boundaries` | | `--glossary_ignore_terms_regex` | Regular expression to ignore certain terms in the glossary. The default is `None`. | `pdf2zh_next example.pdf --glossaries "glossary1.csv,glossary2.csv" --glossary_ignore_terms_regex ".*test.*"` | | `--glossary_merge` | How to merge multiple glossaries. The default is `union`. Options: `union`, `intersect` | `pdf2zh_next example.pdf --glossaries "glossary1.csv,glossary2.csv" --glossary_merge "intersect"` | --- ### TRANSLATED TEXT | `--glossaires` | Liste des fichiers de glossaire. | `pdf2zh_next example.pdf --glossaires "glossaire1.csv,glossaire2.csv,glossaire3.csv"` | | :------------------------------ | :------------------------------------------------------------------------------------------------ | :----------------------------------------------------------------------------------------------------------------------- | | `--glossaire_delimiteur` | Le délimiteur utilisé dans le fichier de glossaire. Par défaut : `,`. | `pdf2zh_next example.pdf --glossaires "glossaire1.csv,glossaire2.csv" --glossaire_delimiteur ";"` | | `--glossaire_format` | Le format du fichier de glossaire. Par défaut : `csv`. | `pdf2zh_next example.pdf --glossaires "glossaire1.txt,glossaire2.txt" --glossaire_format "txt" --glossaire_delimiteur " "` | | `--glossaire_lang_src` | La langue source du glossaire. Par défaut : `en`. | `pdf2zh_next example.pdf --glossaires "glossaire1.csv,glossaire2.csv" --glossaire_lang_src "en"` | | `--glossaire_lang_cible` | La langue cible du glossaire. Par défaut : `zh`. | `pdf2zh_next example.pdf --glossaires "glossaire1.csv,glossaire2.csv" --glossaire_lang_cible "fr"` | | `--glossaire_sensible_casse` | Indique si le glossaire est sensible à la casse. Par défaut : `false`. | `pdf2zh_next example.pdf --glossaires "glossaire1.csv,glossaire2.csv" --glossaire_sensible_casse` | | `--glossaire_limites_mots` | Indique s'il faut respecter les limites des mots lors de l'utilisation du glossaire. Par défaut : `false`. | `pdf2zh_next example.pdf --glossaires "glossaire1.csv,glossaire2.csv" --glossaire_limites_mots` | | `--glossaire_ignorer_termes_regex` | Expression régulière pour ignorer certains termes dans le glossaire. Par défaut : `None`. | `pdf2zh_next example.pdf --glossaires "glossaire1.csv,glossaire2.csv" --glossaire_ignorer_termes_regex ".*test.*"` | | `--glossaire_fusion` | Comment fusionner plusieurs glossaires. Par défaut : `union`. Options : `union`, `intersect` | `pdf2zh_next example.pdf --glossaires "glossaire1.csv,glossaire2.csv" --glossaire_fusion "intersect"` |
it: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--glossary_encoding` | The encoding of the glossary file. | `pdf2zh_next example.pdf --glossaries "glossary1.csv" --glossary_encoding "utf-8-sig"` | | `--glossary_merge` | Merge multiple glossary files into one. | `pdf2zh_next example.pdf --glossaries "glossary1.csv,glossary2.csv,glossary3.csv" --glossary_merge` | | `--glossary_merge_strategy` | Strategy for merging glossaries. Options: `union`, `intersection`, `overwrite`, `error` | `pdf2zh_next example.pdf --glossaries "glossary1.csv,glossary2.csv" --glossary_merge --glossary_merge_strategy union` | | `--glossary_merge_deduplicate` | Deduplicate entries when merging glossaries. | `pdf2zh_next example.pdf --glossaries "glossary1.csv,glossary2.csv" --glossary_merge --glossary_merge_deduplicate` | | `--glossary_merge_sort` | Sort the merged glossary. | `pdf2zh_next example.pdf --glossaries "glossary1.csv,glossary2.csv" --glossary_merge --glossary_merge_sort` | | `--glossary_merge_sort_reverse` | Reverse the sort order. | `pdf2zh_next example.pdf --glossaries "glossary1.csv,glossary2.csv" --glossary_merge --glossary_merge_sort_reverse` | --- ### TRANSLATION RESULT | `--glossaries` | Elenco dei file del glossario. | `pdf2zh_next example.pdf --glossaries "glossary1.csv,glossary2.csv,glossary3.csv"` | | ------------------------------- | ----------------------------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--glossary_encoding` | La codifica del file del glossario. | `pdf2zh_next example.pdf --glossaries "glossary1.csv" --glossary_encoding "utf-8-sig"` | | `--glossary_merge` | Unisci più file del glossario in uno. | `pdf2zh_next example.pdf --glossaries "glossary1.csv,glossary2.csv,glossary3.csv" --glossary_merge` | | `--glossary_merge_strategy` | Strategia per l'unione dei glossari. Opzioni: `union`, `intersection`, `overwrite`, `error` | `pdf2zh_next example.pdf --glossaries "glossary1.csv,glossary2.csv" --glossary_merge --glossary_merge_strategy union` | | `--glossary_merge_deduplicate` | Rimuovi i duplicati durante l'unione dei glossari. | `pdf2zh_next example.pdf --glossaries "glossary1.csv,glossary2.csv" --glossary_merge --glossary_merge_deduplicate` | | `--glossary_merge_sort` | Ordina il glossario unito. | `pdf2zh_next example.pdf --glossaries "glossary1.csv,glossary2.csv" --glossary_merge --glossary_merge_sort` | | `--glossary_merge_sort_reverse` | Inverti l'ordine di ordinamento. | `pdf2zh_next example.pdf --glossaries "glossary1.csv,glossary2.csv" --glossary_merge --glossary_merge_sort_reverse` |
pt: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--glossary-fallback` | Fallback to the next glossary if the current one does not contain the word. | `pdf2zh_next example.pdf --glossaries "glossary1.csv,glossary2.csv" --glossary-fallback` | | `--glossary-case-sensitive` | Enable case sensitivity for glossary matching. | `pdf2zh_next example.pdf --glossaries "glossary.csv" --glossary-case-sensitive` | | `--glossary-full-match` | Enable full match for glossary matching. | `pdf2zh_next example.pdf --glossaries "glossary.csv" --glossary-full-match` | | `--glossary-source-lang` | Source language of the glossary. | `pdf2zh_next example.pdf --glossaries "glossary.csv" --glossary-source-lang "en"` | | `--glossary-target-lang` | Target language of the glossary. | `pdf2zh_next example.pdf --glossaries "glossary.csv" --glossary-target-lang "zh"` | | `--glossary-merge` | Merge the glossary into one and use it for translation. | `pdf2zh_next example.pdf --glossaries "glossary1.csv,glossary2.csv" --glossary-merge` | | `--glossary-merge-separator` | Separator for merging glossaries. | `pdf2zh_next example.pdf --glossaries "glossary1.csv,glossary2.csv" --glossary-merge --glossary-merge-separator "||"` | --- ### OUTPUT | `--glossaries` | Lista de arquivos de glossário. | `pdf2zh_next example.pdf --glossaries "glossary1.csv,glossary2.csv,glossary3.csv"` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--glossary-fallback` | Recurso para o próximo glossário se o atual não contiver a palavra. | `pdf2zh_next example.pdf --glossaries "glossary1.csv,glossary2.csv" --glossary-fallback` | | `--glossary-case-sensitive` | Ativar sensibilidade a maiúsculas e minúsculas para correspondência de glossário. | `pdf2zh_next example.pdf --glossaries "glossary.csv" --glossary-case-sensitive` | | `--glossary-full-match` | Ativar correspondência completa para correspondência de glossário. | `pdf2zh_next example.pdf --glossaries "glossary.csv" --glossary-full-match` | | `--glossary-source-lang` | Idioma de origem do glossário. | `pdf2zh_next example.pdf --glossaries "glossary.csv" --glossary-source-lang "en"` | | `--glossary-target-lang` | Idioma de destino do glossário. | `pdf2zh_next example.pdf --glossaries "glossary.csv" --glossary-target-lang "zh"` | | `--glossary-merge` | Mesclar o glossário em um e usá-lo para tradução. | `pdf2zh_next example.pdf --glossaries "glossary1.csv,glossary2.csv" --glossary-merge` | | `--glossary-merge-separator` | Separador para mesclar glossários. | `pdf2zh_next example.pdf --glossaries "glossary1.csv,glossary2.csv" --glossary-merge --glossary-merge-separator "||"` |
ru: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--glossary_dir` | Glossary directory. | `pdf2zh_next example.pdf --glossary_dir "path/to/glossaries"` | | `--glossary_dir_recursive` | Whether to recursively search for glossary files in the glossary directory. Default is `false`. | `pdf2zh_next example.pdf --glossary_dir "path/to/glossaries" --glossary_dir_recursive true` | | `--glossary_file_extensions` | Glossary file extensions to search for. Default is `csv,txt,tsv`. | `pdf2zh_next example.pdf --glossary_dir "path/to/glossaries" --glossary_file_extensions "csv,txt,tsv,xlsx"` | --- ### OUTPUT | `--glossaries` | Список файлов глоссария. | `pdf2zh_next example.pdf --glossaries "glossary1.csv,glossary2.csv,glossary3.csv"` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--glossary_dir` | Директория глоссария. | `pdf2zh_next example.pdf --glossary_dir "path/to/glossaries"` | | `--glossary_dir_recursive` | Следует ли рекурсивно искать файлы глоссария в директории глоссария. По умолчанию `false`. | `pdf2zh_next example.pdf --glossary_dir "path/to/glossaries" --glossary_dir_recursive true` | | `--glossary_file_extensions` | Расширения файлов глоссария для поиска. По умолчанию `csv,txt,tsv`. | `pdf2zh_next example.pdf --glossary_dir "path/to/glossaries" --glossary_file_extensions "csv,txt,tsv,xlsx"` |
