Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_C0AB99E6
source: - [Immersive Translation](https://immersivetranslate.com) sponsors monthly Pro membership redemption codes for active contributors to this project, see details at: [CONTRIBUTOR_REWARD.md](https://github.com/funstory-ai/BabelDOC/blob/main/docs/CONTRIBUTOR_REWARD.md) - [SiliconFlow](https://siliconflow.cn) provides a free translation service for this project, powered by large language models (LLMs). - 1.x version: [Byaidu/PDFMathTranslate](https://github.com/Byaidu/PDFMathTranslate) - backend: [BabelDOC](https://github.com/funstory-ai/BabelDOC) - PDF Library: [PyMuPDF](https://github.com/pymupdf/PyMuPDF) - PDF Parsing: [Pdfminer.six](https://github.com/pdfminer/pdfminer.six) - PDF Preview: [Gradio PDF](https://github.com/freddyaboulton/gradio-pdf) - Layout Parsing: [DocLayout-YOLO](https://github.com/opendatalab/DocLayout-YOLO) - PDF Standards: [PDF Explained](https://zxyle.github.io/PDF-Explained/), [PDF Cheat Sheets](https://pdfa.org/resource/pdf-cheat-sheets/) - Multilingual Font: see [BabelDOC-Assets](https://github.com/funstory-ai/BabelDOC-Assets) - [Asynchronize](https://github.com/multimeric/Asynchronize/tree/master?tab=readme-ov-file) - [Rich logging with multiprocessing](https://github.com/SebastianGrans/Rich-multiprocess-logging/tree/main) - Documentation i18n using [Weblate](https://hosted.weblate.org/projects/pdfmathtranslate-next/)
de: - [Immersive Translation](https://immersivetranslate.com) sponsert monatliche Pro-Mitgliedschafts-Einlösecodes für aktive Mitwirkende an diesem Projekt. Einzelheiten finden Sie unter: [CONTRIBUTOR_REWARD.md](https://github.com/funstory-ai/BabelDOC/blob/main/docs/CONTRIBUTOR_REWARD.md) - [SiliconFlow](https://siliconflow.cn) stellt für dieses Projekt einen kostenlosen Übersetzungsdienst bereit, der von großen Sprachmodellen (LLMs) unterstützt wird. - 1.x Version: [Byaidu/PDFMathTranslate](https://github.com/Byaidu/PDFMathTranslate) - Backend: [BabelDOC](https://github.com/funstory-ai/BabelDOC) - PDF-Bibliothek: [PyMuPDF](https://github.com/pymupdf/PyMuPDF) - PDF-Parsing: [Pdfminer.six](https://github.com/pdfminer/pdfminer.six) - PDF-Vorschau: [Gradio PDF](https://github.com/freddyaboulton/gradio-pdf) - Layout-Parsing: [DocLayout-YOLO](https://github.com/opendatalab/DocLayout-YOLO) - PDF-Standards: [PDF Explained](https://zxyle.github.io/PDF-Explained/), [PDF Cheat Sheets](https://pdfa.org/resource/pdf-cheat-sheets/) - Mehrsprachige Schriftart: siehe [BabelDOC-Assets](https://github.com/funstory-ai/BabelDOC-Assets) - [Asynchronize](https://github.com/multimeric/Asynchronize/tree/master?tab=readme-ov-file) - [Rich logging with multiprocessing](https://github.com/SebastianGrans/Rich-multiprocess-logging/tree/main) - Dokumentations-i18n mit [Weblate](https://hosted.weblate.org/projects/pdfmathtranslate-next/)
fr: - [Immersive Translation](https://immersivetranslate.com) sponsorise des codes de rédemption d'abonnement Pro mensuels pour les contributeurs actifs de ce projet, voir les détails à : [CONTRIBUTOR_REWARD.md](https://github.com/funstory-ai/BabelDOC/blob/main/docs/CONTRIBUTOR_REWARD.md) - [SiliconFlow](https://siliconflow.cn) fournit un service de traduction gratuit pour ce projet, alimenté par de grands modèles de langage (LLM). - Version 1.x : [Byaidu/PDFMathTranslate](https://github.com/Byaidu/PDFMathTranslate) - backend : [BabelDOC](https://github.com/funstory-ai/BabelDOC) - Bibliothèque PDF : [PyMuPDF](https://github.com/pymupdf/PyMuPDF) - Analyse PDF : [Pdfminer.six](https://github.com/pdfminer/pdfminer.six) - Aperçu PDF : [Gradio PDF](https://github.com/freddyaboulton/gradio-pdf) - Analyse de mise en page : [DocLayout-YOLO](https://github.com/opendatalab/DocLayout-YOLO) - Normes PDF : [PDF Explained](https://zxyle.github.io/PDF-Explained/), [PDF Cheat Sheets](https://pdfa.org/resource/pdf-cheat-sheets/) - Police multilingue : voir [BabelDOC-Assets](https://github.com/funstory-ai/BabelDOC-Assets) - [Asynchronize](https://github.com/multimeric/Asynchronize/tree/master?tab=readme-ov-file) - [Journalisation Rich avec multiprocessing](https://github.com/SebastianGrans/Rich-multiprocess-logging/tree/main) - Documentation i18n utilisant [Weblate](https://hosted.weblate.org/projects/pdfmathtranslate-next/)
it: - [Immersive Translation](https://immersivetranslate.com) sponsorizza codici di riscatto mensili per l'abbonamento Pro per i contributori attivi a questo progetto, vedi i dettagli su: [CONTRIBUTOR_REWARD.md](https://github.com/funstory-ai/BabelDOC/blob/main/docs/CONTRIBUTOR_REWARD.md) - [SiliconFlow](https://siliconflow.cn) fornisce un servizio di traduzione gratuito per questo progetto, alimentato da grandi modelli linguistici (LLM). - Versione 1.x: [Byaidu/PDFMathTranslate](https://github.com/Byaidu/PDFMathTranslate) - backend: [BabelDOC](https://github.com/funstory-ai/BabelDOC) - Libreria PDF: [PyMuPDF](https://github.com/pymupdf/PyMuPDF) - Analisi PDF: [Pdfminer.six](https://github.com/pdfminer/pdfminer.six) - Anteprima PDF: [Gradio PDF](https://github.com/freddyaboulton/gradio-pdf) - Analisi layout: [DocLayout-YOLO](https://github.com/opendatalab/DocLayout-YOLO) - Standard PDF: [PDF Explained](https://zxyle.github.io/PDF-Explained/), [PDF Cheat Sheets](https://pdfa.org/resource/pdf-cheat-sheets/) - Carattere multilingue: vedi [BabelDOC-Assets](https://github.com/funstory-ai/BabelDOC-Assets) - [Asynchronize](https://github.com/multimeric/Asynchronize/tree/master?tab=readme-ov-file) - [Registrazione avanzata con multiprocessing](https://github.com/SebastianGrans/Rich-multiprocess-logging/tree/main) - Documentazione i18n utilizzando [Weblate](https://hosted.weblate.org/projects/pdfmathtranslate-next/)
pt: - [Immersive Translation](https://immersivetranslate.com) patrocina códigos de resgate de assinatura Pro mensal para colaboradores ativos deste projeto, veja os detalhes em: [CONTRIBUTOR_REWARD.md](https://github.com/funstory-ai/BabelDOC/blob/main/docs/CONTRIBUTOR_REWARD.md) - [SiliconFlow](https://siliconflow.cn) fornece um serviço de tradução gratuito para este projeto, alimentado por grandes modelos de linguagem (LLMs). - Versão 1.x: [Byaidu/PDFMathTranslate](https://github.com/Byaidu/PDFMathTranslate) - backend: [BabelDOC](https://github.com/funstory-ai/BabelDOC) - Biblioteca PDF: [PyMuPDF](https://github.com/pymupdf/PyMuPDF) - Análise de PDF: [Pdfminer.six](https://github.com/pdfminer/pdfminer.six) - Visualização de PDF: [Gradio PDF](https://github.com/freddyaboulton/gradio-pdf) - Análise de Layout: [DocLayout-YOLO](https://github.com/opendatalab/DocLayout-YOLO) - Padrões PDF: [PDF Explained](https://zxyle.github.io/PDF-Explained/), [PDF Cheat Sheets](https://pdfa.org/resource/pdf-cheat-sheets/) - Fonte Multilíngue: veja [BabelDOC-Assets](https://github.com/funstory-ai/BabelDOC-Assets) - [Asynchronize](https://github.com/multimeric/Asynchronize/tree/master?tab=readme-ov-file) - [Registro rico com multiprocessamento](https://github.com/SebastianGrans/Rich-multiprocess-logging/tree/main) - Documentação i18n usando [Weblate](https://hosted.weblate.org/projects/pdfmathtranslate-next/)
ru: - [Immersive Translation](https://immersivetranslate.com) спонсирует ежемесячные коды для активации Pro-подписки для активных участников этого проекта, подробности см. в: [CONTRIBUTOR_REWARD.md](https://github.com/funstory-ai/BabelDOC/blob/main/docs/CONTRIBUTOR_REWARD.md) - [SiliconFlow](https://siliconflow.cn) предоставляет бесплатный сервис перевода для этого проекта, работающий на основе больших языковых моделей (LLM). - Версия 1.x: [Byaidu/PDFMathTranslate](https://github.com/Byaidu/PDFMathTranslate) - Бэкенд: [BabelDOC](https://github.com/funstory-ai/BabelDOC) - Библиотека для работы с PDF: [PyMuPDF](https://github.com/pymupdf/PyMuPDF) - Парсинг PDF: [Pdfminer.six](https://github.com/pdfminer/pdfminer.six) - Предпросмотр PDF: [Gradio PDF](https://github.com/freddyaboulton/gradio-pdf) - Анализ макета: [DocLayout-YOLO](https://github.com/opendatalab/DocLayout-YOLO) - Стандарты PDF: [PDF Explained](https://zxyle.github.io/PDF-Explained/), [PDF Cheat Sheets](https://pdfa.org/resource/pdf-cheat-sheets/) - Многоязычные шрифты: см. [BabelDOC-Assets](https://github.com/funstory-ai/BabelDOC-Assets) - [Asynchronize](https://github.com/multimeric/Asynchronize/tree/master?tab=readme-ov-file) - [Расширенное логирование с использованием многопроцессорности](https://github.com/SebastianGrans/Rich-multiprocess-logging/tree/main) - Интернационализация документации с использованием [Weblate](https://hosted.weblate.org/projects/pdfmathtranslate-next/)

# chunk_1E68B134
source: <h2 id="conduct">Before submit your code</h2> We welcome the active participation of contributors to make pdf2zh better. Before you are ready to submit your code, please refer to our [Code of Conduct](https://pdf2zh-next.com/community/CODE_OF_CONDUCT.html) and [Contribution Guide](https://pdf2zh-next.com/community/Contribution-Guide.html). <h2 id="contrib">Contributors</h2>
de: <h2 id="verhalten">Bevor Sie Ihren Code einreichen</h2> Wir begrüßen die aktive Teilnahme von Mitwirkenden, um pdf2zh besser zu machen. Bevor Sie bereit sind, Ihren Code einzureichen, lesen Sie bitte unseren [Verhaltenskodex](https://pdf2zh-next.com/community/CODE_OF_CONDUCT.html) und unseren [Leitfaden für Beiträge](https://pdf2zh-next.com/community/Contribution-Guide.html). <h2 id="mitwirkende">Mitwirkende</h2>
fr: <h2 id="conduite">Avant de soumettre votre code</h2> Nous accueillons favorablement la participation active des contributeurs pour améliorer pdf2zh. Avant de soumettre votre code, veuillez consulter notre [Code de Conduite](https://pdf2zh-next.com/community/CODE_OF_CONDUCT.html) et notre [Guide de Contribution](https://pdf2zh-next.com/community/Contribution-Guide.html). <h2 id="contributeurs">Contributeurs</h2>
it: <h2 id="condotta">Prima di inviare il tuo codice</h2> Accogliamo con favore la partecipazione attiva dei contributori per rendere pdf2zh migliore. Prima di essere pronto a inviare il tuo codice, consulta il nostro [Codice di Condotta](https://pdf2zh-next.com/community/CODE_OF_CONDUCT.html) e la [Guida al Contributo](https://pdf2zh-next.com/community/Contribution-Guide.html). <h2 id="contributori">Contributori</h2>
pt: <h2 id="conduta">Antes de enviar seu código</h2> Agradecemos a participação ativa dos colaboradores para tornar o pdf2zh melhor. Antes de estar pronto para enviar seu código, consulte nosso [Código de Conduta](https://pdf2zh-next.com/community/CODE_OF_CONDUCT.html) e [Guia de Contribuição](https://pdf2zh-next.com/community/Contribution-Guide.html). <h2 id="contribuidores">Colaboradores</h2>
ru: <h2 id="conduct">Перед отправкой кода</h2> Мы приветствуем активное участие участников, чтобы сделать pdf2zh лучше. Прежде чем вы будете готовы отправить свой код, пожалуйста, ознакомьтесь с нашим [Кодексом поведения](https://pdf2zh-next.com/community/CODE_OF_CONDUCT.html) и [Руководством по внесению вклада](https://pdf2zh-next.com/community/Contribution-Guide.html). <h2 id="contrib">Участники</h2>

# chunk_3B6B90E0
source: <h2 id="star_hist">Star History</h2> <a href="https://star-history.com/#PDFMathTranslate-next/PDFMathTranslate-next&Date"> <picture> <source media="(prefers-color-scheme: dark)" srcset="https://api.star-history.com/svg?repos=PDFMathTranslate-next/PDFMathTranslate-next&type=Date&theme=dark" /> <source media="(prefers-color-scheme: light)" srcset="https://api.star-history.com/svg?repos=PDFMathTranslate-next/PDFMathTranslate-next&type=Date" />
fr: <h2 id="historique_étoiles">Historique des étoiles</h2> <a href="https://star-history.com/#PDFMathTranslate-next/PDFMathTranslate-next&Date"> <picture> <source media="(prefers-color-scheme: dark)" srcset="https://api.star-history.com/svg?repos=PDFMathTranslate-next/PDFMathTranslate-next&type=Date&theme=dark" /> <source media="(prefers-color-scheme: light)" srcset="https://api.star-history.com/svg?repos=PDFMathTranslate-next/PDFMathTranslate-next&type=Date" />
it: <h2 id="cronologia_stelle">Cronologia Stelle</h2> <a href="https://star-history.com/#PDFMathTranslate-next/PDFMathTranslate-next&Date"> <picture> <source media="(prefers-color-scheme: dark)" srcset="https://api.star-history.com/svg?repos=PDFMathTranslate-next/PDFMathTranslate-next&type=Date&theme=dark" /> <source media="(prefers-color-scheme: light)" srcset="https://api.star-history.com/svg?repos=PDFMathTranslate-next/PDFMathTranslate-next&type=Date" />
pt: <h2 id="histórico_de_estrelas">Star History</h2> <a href="https://star-history.com/#PDFMathTranslate-next/PDFMathTranslate-next&Date"> <picture> <source media="(prefers-color-scheme: dark)" srcset="https://api.star-history.com/svg?repos=PDFMathTranslate-next/PDFMathTranslate-next&type=Date&theme=dark" /> <source media="(prefers-color-scheme: light)" srcset="https://api.star-history.com/svg?repos=PDFMathTranslate-next/PDFMathTranslate-next&type=Date" />
ru: <h2 id="star_hist">История звезд</h2> <a href="https://star-history.com/#PDFMathTranslate-next/PDFMathTranslate-next&Date"> <picture> <source media="(prefers-color-scheme: dark)" srcset="https://api.star-history.com/svg?repos=PDFMathTranslate-next/PDFMathTranslate-next&type=Date&theme=dark" /> <source media="(prefers-color-scheme: light)" srcset="https://api.star-history.com/svg?repos=PDFMathTranslate-next/PDFMathTranslate-next&type=Date" />

# chunk_D4E24BCF
source: # Contributor Covenant Code of Conduct
de: # Verhaltenskodex für Mitwirkende
fr: # Code de conduite du Contributeur Covenant
it: # Codice di Condotta del Patto del Collaboratore
pt: # Código de Conduta do Pacto do Contribuidor
ru: # Кодекс поведения Contributor Covenant

# chunk_18B00C61
source: ## Our Pledge
de: ## Unser Versprechen
fr: ## Notre Engagement
it: ## Il nostro impegno
pt: ## Nosso Compromisso
ru: ## Наше обязательство

# chunk_49BBC232
source: We as members, contributors, and leaders pledge to make participation in our community a harassment-free experience for everyone, regardless of age, body size, visible or invisible disability, ethnicity, sex characteristics, gender identity and expression, level of experience, education, socio-economic status, nationality, personal appearance, race, religion, or sexual identity and orientation. We pledge to act and interact in ways that contribute to an open, welcoming, diverse, inclusive, and healthy community.
de: Wir als Mitglieder, Mitwirkende und Führungskräfte verpflichten uns, die Teilnahme an unserer Gemeinschaft zu einer belästigungsfreien Erfahrung für alle zu machen, unabhängig von Alter, Körpergröße, sichtbarer oder unsichtbarer Behinderung, ethnischer Zugehörigkeit, Geschlechtsmerkmalen, Geschlechtsidentität und -ausdruck, Erfahrungsniveau, Bildung, sozioökonomischem Status, Nationalität, persönlichem Aussehen, Rasse, Religion oder sexueller Identität und Orientierung. Wir verpflichten uns, auf eine Weise zu handeln und zu interagieren, die zu einer offenen, einladenden, vielfältigen, inklusiven und gesunden Gemeinschaft beiträgt.
fr: En tant que membres, contributeurs et leaders, nous nous engageons à faire de la participation à notre communauté une expérience sans harcèlement pour tous, quel que soit l'âge, la taille du corps, le handicap visible ou invisible, l'origine ethnique, les caractéristiques sexuelles, l'identité et l'expression de genre, le niveau d'expérience, l'éducation, le statut socio-économique, la nationalité, l'apparence personnelle, la race, la religion ou l'identité et l'orientation sexuelles. Nous nous engageons à agir et à interagir de manière à contribuer à une communauté ouverte, accueillante, diverse, inclusive et saine.
it: Noi, in qualità di membri, contributori e leader, ci impegniamo a rendere la partecipazione nella nostra comunità un'esperienza libera da molestie per tutti, indipendentemente dall'età, dalle dimensioni del corpo, da disabilità visibili o invisibili, dall'etnia, dalle caratteristiche sessuali, dall'identità e dall'espressione di genere, dal livello di esperienza, dall'istruzione, dallo status socio-economico, dalla nazionalità, dall'aspetto personale, dalla razza, dalla religione o dall'identità e dall'orientamento sessuale. Ci impegniamo ad agire e interagire in modi che contribuiscono a una comunità aperta, accogliente, diversificata, inclusiva e sana.
pt: Nós, como membros, colaboradores e líderes, nos comprometemos a tornar a participação em nossa comunidade uma experiência livre de assédio para todos, independentemente de idade, tamanho do corpo, deficiência visível ou invisível, etnia, características sexuais, identidade e expressão de gênero, nível de experiência, educação, status socioeconômico, nacionalidade, aparência pessoal, raça, religião ou identidade e orientação sexual. Nos comprometemos a agir e interagir de maneiras que contribuam para uma comunidade aberta, acolhedora, diversa, inclusiva e saudável.
ru: Мы, как участники, авторы и лидеры, обязуемся сделать участие в нашем сообществе свободным от преследований для всех, независимо от возраста, размера тела, видимых или невидимых ограничений, этнической принадлежности, половых характеристик, гендерной идентичности и самовыражения, уровня опыта, образования, социально-экономического статуса, национальности, внешнего вида, расы, религии, сексуальной идентичности и ориентации. Мы обязуемся действовать и взаимодействовать таким образом, чтобы способствовать созданию открытого, гостеприимного, разнообразного, инклюзивного и здорового сообщества.

# chunk_45AD4A2F
source: ## Our Standards
de: ## Unsere Standards
fr: ## Nos normes
it: ## I nostri standard
pt: ## Nossos Padrões
ru: ## Наши стандарты

# chunk_131B12AA
source: Examples of behavior that contributes to a positive environment for our community include:
de: Beispiele für Verhaltensweisen, die zu einer positiven Umgebung für unsere Gemeinschaft beitragen, sind:
fr: Exemples de comportements qui contribuent à un environnement positif pour notre communauté incluent :
it: Esempi di comportamento che contribuiscono a un ambiente positivo per la nostra comunità includono:
pt: Exemplos de comportamentos que contribuem para um ambiente positivo em nossa comunidade incluem:
ru: Примеры поведения, способствующего созданию благоприятной среды для нашего сообщества, включают:

# chunk_8C8AA428
source: * Demonstrating empathy and kindness toward other people * Being respectful of differing opinions, viewpoints, and experiences * Giving and gracefully accepting constructive feedback * Accepting responsibility and apologizing to those affected by our mistakes, and learning from the experience * Focusing on what is best not just for us as individuals, but for the overall community
de: * Empathie und Freundlichkeit gegenüber anderen Menschen zeigen * Respekt vor unterschiedlichen Meinungen, Ansichten und Erfahrungen haben * Konstruktives Feedback geben und annehmen * Verantwortung übernehmen und sich bei denjenigen entschuldigen, die von unseren Fehlern betroffen sind, und aus den Erfahrungen lernen * Sich darauf konzentrieren, was nicht nur für uns als Einzelne, sondern für die gesamte Gemeinschaft am besten ist
fr: * Faire preuve d'empathie et de gentillesse envers les autres * Respecter les opinions, points de vue et expériences différents * Donner et accepter avec grâce les retours constructifs * Assumer la responsabilité et s'excuser auprès des personnes affectées par nos erreurs, et apprendre de l'expérience * Se concentrer sur ce qui est le mieux, non seulement pour nous en tant qu'individus, mais aussi pour l'ensemble de la communauté
it: * Dimostrare empatia e gentilezza verso gli altri * Essere rispettosi delle opinioni, dei punti di vista e delle esperienze diverse * Dare e accettare con grazia feedback costruttivi * Accettare la responsabilità e scusarsi con coloro che sono stati influenzati dai nostri errori, imparando dall'esperienza * Concentrarsi su ciò che è meglio non solo per noi come individui, ma per l'intera comunità
pt: * Demonstrar empatia e gentileza em relação às outras pessoas * Ser respeitoso com opiniões, pontos de vista e experiências diferentes * Dar e aceitar com elegância feedbacks construtivos * Assumir responsabilidade e pedir desculpas àqueles afetados por nossos erros, e aprender com a experiência * Focar no que é melhor não apenas para nós como indivíduos, mas para toda a comunidade
ru: * Проявление эмпатии и доброты по отношению к другим людям * Уважение к различным мнениям, точкам зрения и опыту * Предоставление и достойное принятие конструктивной обратной связи * Принятие ответственности и извинение перед теми, кого затронули наши ошибки, а также извлечение уроков из этого опыта * Фокусирование на том, что лучше не только для нас как индивидуумов, но и для всего сообщества в целом

# chunk_9D3CC4B6
source: Examples of unacceptable behavior include:
de: Beispiele für inakzeptables Verhalten sind:
fr: Exemples de comportements inacceptables incluent :
it: Esempi di comportamenti inaccettabili includono:
pt: Exemplos de comportamentos inaceitáveis incluem:
ru: Примеры неприемлемого поведения включают:

# chunk_06867E28
source: * The use of sexualized language or imagery, and sexual attention or advances of any kind * Trolling, insulting or derogatory comments, and personal or political attacks * Public or private harassment * Publishing others' private information, such as a physical or email address, without their explicit permission * Other conduct which could reasonably be considered inappropriate in a professional setting
de: * Die Verwendung sexualisierter Sprache oder Bilder sowie sexuelle Aufmerksamkeit oder Annäherungsversuche jeglicher Art * Trollen, beleidigende oder abfällige Kommentare sowie persönliche oder politische Angriffe * Belästigung in der Öffentlichkeit oder im Privaten * Das Veröffentlichen privater Informationen anderer, wie einer physischen Adresse oder E-Mail-Adresse, ohne deren ausdrückliche Erlaubnis * Anderes Verhalten, das vernünftigerweise als unangemessen in einem professionellen Umfeld betrachtet werden könnte
fr: * L'utilisation d'un langage ou d'imagerie sexualisés, et toute attention ou avance de nature sexuelle * Le trollage, les commentaires insultants ou désobligeants, et les attaques personnelles ou politiques * Le harcèlement, public ou privé * La publication d'informations privées d'autrui, telles qu'une adresse physique ou électronique, sans leur permission explicite * Tout autre comportement qui pourrait raisonnablement être considéré comme inapproprié dans un cadre professionnel
it: * L'uso di linguaggio o immagini sessualizzati, e attenzioni o avances sessuali di qualsiasi tipo * Trollaggio, commenti insultanti o denigratori, e attacchi personali o politici * Molestie pubbliche o private * La pubblicazione di informazioni private altrui, come un indirizzo fisico o email, senza il loro esplicito permesso * Altri comportamenti che potrebbero ragionevolmente essere considerati inappropriati in un contesto professionale
pt: * O uso de linguagem ou imagens sexualizadas, e atenção ou avanços sexuais de qualquer tipo * Trollagem, comentários insultuosos ou depreciativos, e ataques pessoais ou políticos * Assédio público ou privado * Publicar informações privadas de outras pessoas, como endereço físico ou de e-mail, sem sua permissão explícita * Outros comportamentos que possam razoavelmente ser considerados inadequados em um ambiente profissional
ru: * Использование сексуализированного языка или образов, а также сексуальное внимание или домогательства любого рода * Троллинг, оскорбительные или уничижительные комментарии, а также личные или политические нападки * Публичное или частное преследование * Публикация личной информации других лиц, такой как физический или электронный адрес, без их явного разрешения * Другое поведение, которое может быть разумно сочтено неуместным в профессиональной обстановке
