Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_FDB3A2AC
source: | `--restore-offline-assets` | Restore offline assets package from the specified directory | `pdf2zh_next example.pdf --restore-offline-assets /path` |
de: | ------------------------------- | ---------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--use-offline-assets` | Use offline assets package from the specified directory | `pdf2zh_next example.pdf --use-offline-assets /path` | | `--clear-offline-assets` | Clear the offline assets package in the default directory | `pdf2zh_next example.pdf --clear-offline-assets` | | `--check-offline-assets` | Check the offline assets package in the default directory | `pdf2zh_next example.pdf --check-offline-assets` | | `--download-offline-assets` | Download offline assets package to the default directory | `pdf2zh_next example.pdf --download-offline-assets` | | `--download-offline-assets-url` | Download offline assets package from the specified URL | `pdf2zh_next example.pdf --download-offline-assets-url https://example.com/offline-assets.zip` | | `--download-offline-assets-dir` | Download offline assets package to the specified directory | `pdf2zh_next example.pdf --download-offline-assets-dir /path` | | `--offline-assets-dir` | Set the directory to store the offline assets package (default: `~/.pdf2zh/offline-assets`) | `pdf2zh_next example.pdf --offline-assets-dir /path` | | `--offline-assets-url` | Set the URL to download the offline assets package | `pdf2zh_next example.pdf --offline-assets-url https://example.com/offline-assets.zip` | | `--offline-assets-force` | Force download the offline assets package even if it exists | `pdf2zh_next example.pdf --offline-assets-force` | | `--offline-assets-skip-download`| Skip downloading the offline assets package | `pdf2zh_next example.pdf --offline-assets-skip-download` | | `--offline-assets-skip-extract` | Skip extracting the offline assets package | `pdf2zh_next example.pdf --offline-assets-skip-extract` | | `--offline-assets-skip-check` | Skip checking the offline assets package | `pdf2zh_next example.pdf --offline-assets-skip-check` | | `--offline-assets-skip-clear` | Skip clearing the offline assets package | `pdf2zh_next example.pdf --offline-assets-skip-clear` | | `--offline-assets-skip-restore` | Skip restoring the offline assets package | `pdf2zh_next example.pdf --offline-assets-skip-restore` | | `--offline-assets-skip-use` | Skip using the offline assets package | `pdf2zh_next example.pdf --offline-assets-skip-use` | --- ### TRANSLATION | `--restore-offline-assets` | Stellt das Offline-Assets-Paket aus dem angegebenen Verzeichnis wieder her | `pdf2zh_next example.pdf --restore-offline-assets /pfad` | | ------------------------------- | ------------------------------------------------------------------------------------------------------ | ---------------------------------------------------------------------------------------------------------------------- | | `--use-offline-assets` | Verwendet das Offline-Assets-Paket aus dem angegebenen Verzeichnis | `pdf2zh_next example.pdf --use-offline-assets /pfad` | | `--clear-offline-assets` | Löscht das Offline-Assets-Paket im Standardverzeichnis | `pdf2zh_next example.pdf --clear-offline-assets` | | `--check-offline-assets` | Überprüft das Offline-Assets-Paket im Standardverzeichnis | `pdf2zh_next example.pdf --check-offline-assets` | | `--download-offline-assets` | Lädt das Offline-Assets-Paket in das Standardverzeichnis herunter | `pdf2zh_next example.pdf --download-offline-assets` | | `--download-offline-assets-url` | Lädt das Offline-Assets-Paket von der angegebenen URL herunter | `pdf2zh_next example.pdf --download-offline-assets-url https://example.com/offline-assets.zip` | | `--download-offline-assets-dir` | Lädt das Offline-Assets-Paket in das angegebene Verzeichnis herunter | `pdf2zh_next example.pdf --download-offline-assets-dir /pfad` | | `--offline-assets-dir` | Legt das Verzeichnis fest, in dem das Offline-Assets-Paket gespeichert werden soll (Standard: `~/.pdf2zh/offline-assets`) | `pdf2zh_next example.pdf --offline-assets-dir /pfad` | | `--offline-assets-url` | Legt die URL fest, von der das Offline-Assets-Paket heruntergeladen werden soll | `pdf2zh_next example.pdf --offline-assets-url https://example.com/offline-assets.zip` | | `--offline-assets-force` | Erzwingt den Download des Offline-Assets-Pakets, auch wenn es bereits vorhanden ist | `pdf2zh_next example.pdf --offline-assets-force` | | `--offline-assets-skip-download`| Überspringt den Download des Offline-Assets-Pakets | `pdf2zh_next example.pdf --offline-assets-skip-download` | | `--offline-assets-skip-extract` | Überspringt das Entpacken des Offline-Assets-Pakets | `pdf2zh_next example.pdf --offline-assets-skip-extract` | | `--offline-assets-skip-check` | Überspringt die Überprüfung des Offline-Assets-Pakets | `pdf2zh_next example.pdf --offline-assets-skip-check` | | `--offline-assets-skip-clear` | Überspringt das Löschen des Offline-Assets-Pakets | `pdf2zh_next example.pdf --offline-assets-skip-clear` | | `--offline-assets-skip-restore` | Überspringt das Wiederherstellen des Offline-Assets-Pakets | `pdf2zh_next example.pdf --offline-assets-skip-restore` | | `--offline-assets-skip-use` | Überspringt die Verwendung des Offline-Assets-Pakets | `pdf2zh_next example.pdf --offline-assets-skip-use` |
fr: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--restore-offline-assets-dir` | The directory to restore offline assets from, default is `./assets` | `pdf2zh_next example.pdf --restore-offline-assets-dir /path/to/assets` | | `--restore-offline-assets-file` | The offline assets file to restore, default is `assets.zip` | `pdf2zh_next example.pdf --restore-offline-assets-file /path/to/assets.zip` | | `-s`<br>`--source-language` | The source language of the document. Default is `auto`. | `pdf2zh_next example.pdf -s en`<br>`pdf2zh_next example.pdf --source-language en` | | `-t`<br>`--target-language` | The target language to translate to. Default is `zh`. | `pdf2zh_next example.pdf -t ja`<br>`pdf2zh_next example.pdf --target-language ja` | | `-l`<br>`--language` | The language of the document. Equivalent to setting both `-s` and `-t` to the same value. | `pdf2zh_next example.pdf -l ja`<br>`pdf2zh_next example.pdf --language ja` | | `-o`<br>`--output` | The output file path. Default is `[original_name]_translated.pdf` | `pdf2zh_next example.pdf -o translated.pdf`<br>`pdf2zh_next example.pdf --output translated.pdf` | | `-f`<br>`--format` | The output format. Default is `pdf`. | `pdf2zh_next example.pdf -f docx`<br>`pdf2zh_next example.pdf --format docx` | | `-v`<br>`--verbose` | Enable verbose output. | `pdf2zh_next example.pdf -v`<br>`pdf2zh_next example.pdf --verbose` | | `-h`<br>`--help` | Show help message and exit. | `pdf2zh_next example.pdf -h`<br>`pdf2zh_next example.pdf --help` | --- ### TRANSLATED TEXT | `--restore-offline-assets` | Restaurer le package d'actifs hors ligne à partir du répertoire spécifié | `pdf2zh_next example.pdf --restore-offline-assets /chemin` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--restore-offline-assets-dir` | Le répertoire à partir duquel restaurer les actifs hors ligne, par défaut `./assets` | `pdf2zh_next example.pdf --restore-offline-assets-dir /chemin/vers/assets` | | `--restore-offline-assets-file` | Le fichier d'actifs hors ligne à restaurer, par défaut `assets.zip` | `pdf2zh_next example.pdf --restore-offline-assets-file /chemin/vers/assets.zip` | | `-s`<br>`--source-language` | La langue source du document. Par défaut `auto`. | `pdf2zh_next example.pdf -s en`<br>`pdf2zh_next example.pdf --source-language en` | | `-t`<br>`--target-language` | La langue cible vers laquelle traduire. Par défaut `zh`. | `pdf2zh_next example.pdf -t ja`<br>`pdf2zh_next example.pdf --target-language ja` | | `-l`<br>`--language` | La langue du document. Équivalent à définir `-s` et `-t` à la même valeur. | `pdf2zh_next example.pdf -l ja`<br>`pdf2zh_next example.pdf --language ja` | | `-o`<br>`--output` | Le chemin du fichier de sortie. Par défaut `[nom_original]_translated.pdf` | `pdf2zh_next example.pdf -o translated.pdf`<br>`pdf2zh_next example.pdf --output translated.pdf` | | `-f`<br>`--format` | Le format de sortie. Par défaut `pdf`. | `pdf2zh_next example.pdf -f docx`<br>`pdf2zh_next example.pdf --format docx` | | `-v`<br>`--verbose` | Activer la sortie détaillée. | `pdf2zh_next example.pdf -v`<br>`pdf2zh_next example.pdf --verbose` | | `-h`<br>`--help` | Afficher le message d'aide et quitter. | `pdf2zh_next example.pdf -h`<br>`pdf2zh_next example.pdf --help` |
it: `false` | | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | ----------- | | `--restore-offline-assets-path` | The path to restore offline assets package from | `pdf2zh_next example.pdf --restore-offline-assets-path /path/to/restore` | `false` | | `--save-offline-assets` | Save offline assets package to the specified directory | `pdf2zh_next example.pdf --save-offline-assets /path` | `false` | | `--save-offline-assets-path` | The path to save offline assets package to | `pdf2zh_next example.pdf --save-offline-assets-path /path/to/save` | `false` | | `--skip-offline-assets` | Skip downloading offline assets package | `pdf2zh_next example.pdf --skip-offline-assets` | `false` | | `--skip-offline-assets-download`| Skip downloading offline assets package | `pdf2zh_next example.pdf --skip-offline-assets-download` | `false` | --- ### TRANSLATION RESULT | `--restore-offline-assets` | Ripristina il pacchetto di risorse offline dalla directory specificata | `pdf2zh_next example.pdf --restore-offline-assets /percorso` | `false` | | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | ----------- | | `--restore-offline-assets-path` | Il percorso da cui ripristinare il pacchetto di risorse offline | `pdf2zh_next example.pdf --restore-offline-assets-path /percorso/da/ripristinare` | `false` | | `--save-offline-assets` | Salva il pacchetto di risorse offline nella directory specificata | `pdf2zh_next example.pdf --save-offline-assets /percorso` | `false` | | `--save-offline-assets-path` | Il percorso in cui salvare il pacchetto di risorse offline | `pdf2zh_next example.pdf --save-offline-assets-path /percorso/da/salvare` | `false` | | `--skip-offline-assets` | Salta il download del pacchetto di risorse offline | `pdf2zh_next example.pdf --skip-offline-assets` | `false` | | `--skip-offline-assets-download`| Salta il download del pacchetto di risorse offline | `pdf2zh_next example.pdf --skip-offline-assets-download` | `false` |
pt: | ------------------------------- | ---------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--offline-assets-dir` | Directory for storing offline assets | `pdf2zh_next example.pdf --offline-assets-dir /path` | | `--offline-assets-package-name` | Package name for downloading offline assets (e.g., `zh-en`, `en-zh`) | `pdf2zh_next example.pdf --offline-assets-package-name zh-en` | | `--offline-assets-package-url` | Package URL for downloading offline assets (e.g., `https://example.com/zh-en.zip`) | `pdf2zh_next example.pdf --offline-assets-package-url https://example.com/zh-en.zip` | | `--offline-assets-package-md5` | MD5 hash of the offline assets package for integrity verification | `pdf2zh_next example.pdf --offline-assets-package-md5 5d41402abc4b2a76b9719d911017c592` | | `--offline-assets-package-size` | Size of the offline assets package in bytes for integrity verification | `pdf2zh_next example.pdf --offline-assets-package-size 10240000` | | `--offline-assets-package-download-timeout` | Timeout for downloading the offline assets package in seconds (default: 300) | `pdf2zh_next example.pdf --offline-assets-package-download-timeout 600` | --- ### OUTPUT | `--restore-offline-assets` | Restaurar o pacote de ativos offline do diretório especificado | `pdf2zh_next example.pdf --restore-offline-assets /path` | | ------------------------------- | ---------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--offline-assets-dir` | Diretório para armazenar ativos offline | `pdf2zh_next example.pdf --offline-assets-dir /path` | | `--offline-assets-package-name` | Nome do pacote para baixar ativos offline (por exemplo, `zh-en`, `en-zh`) | `pdf2zh_next example.pdf --offline-assets-package-name zh-en` | | `--offline-assets-package-url` | URL do pacote para baixar ativos offline (por exemplo, `https://example.com/zh-en.zip`) | `pdf2zh_next example.pdf --offline-assets-package-url https://example.com/zh-en.zip` | | `--offline-assets-package-md5` | Hash MD5 do pacote de ativos offline para verificação de integridade | `pdf2zh_next example.pdf --offline-assets-package-md5 5d41402abc4b2a76b9719d911017c592` | | `--offline-assets-package-size` | Tamanho do pacote de ativos offline em bytes para verificação de integridade | `pdf2zh_next example.pdf --offline-assets-package-size 10240000` | | `--offline-assets-package-download-timeout` | Tempo limite para baixar o pacote de ativos offline em segundos (padrão: 300) | `pdf2zh_next example.pdf --offline-assets-package-download-timeout 600` |
ru: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--disable-offline-assets` | Disable the offline assets package, use online API instead | `pdf2zh_next example.pdf --disable-offline-assets` | | `--no-progress-bar` | Disable the progress bar | `pdf2zh_next example.pdf --no-progress-bar` | | `--no-color` | Disable color output | `pdf2zh_next example.pdf --no-color` | | `--version` | Show the version of pdf2zh | `pdf2zh_next --version` | | `--help` | Show the help message | `pdf2zh_next --help` | --- ### TRANSLATION | `--restore-offline-assets` | Восстановить пакет офлайн-ресурсов из указанной директории | `pdf2zh_next example.pdf --restore-offline-assets /path` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--disable-offline-assets` | Отключить пакет офлайн-ресурсов, использовать онлайн-API вместо него | `pdf2zh_next example.pdf --disable-offline-assets` | | `--no-progress-bar` | Отключить индикатор выполнения | `pdf2zh_next example.pdf --no-progress-bar` | | `--no-color` | Отключить цветной вывод | `pdf2zh_next example.pdf --no-color` | | `--version` | Показать версию pdf2zh | `pdf2zh_next --version` | | `--help` | Показать справочное сообщение | `pdf2zh_next --help` |
