Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_F59B12F3
source: | `--no-merge-alternating-line-numbers` | Disable merging of alternating line numbers and text paragraphs in documents with line numbers | `pdf2zh_next example.pdf --no-merge-alternating-line-numbers` |
de: | :------------------------------------ | :--------------------------------------------------------------------------------------------- | :---------------------------------------------------------------------------------------------------------- | | `--no-merge-alternating-text` | Disable merging of alternating text and image paragraphs | `pdf2zh_next example.pdf --no-merge-alternating-text` | | `--no-merge-alternating-text-images` | Disable merging of alternating text and image paragraphs | `pdf2zh_next example.pdf --no-merge-alternating-text-images` | | `--no-merge-alternating-text-pattern` | Disable merging of alternating text and image paragraphs based on pattern matching | `pdf2zh_next example.pdf --no-merge-alternating-text-pattern` | --- ### TRANSLATION RESULT | `--no-merge-alternating-line-numbers` | Deaktiviert das Zusammenführen von abwechselnden Zeilennummern und Textabsätzen in Dokumenten mit Zeilennummern | `pdf2zh_next example.pdf --no-merge-alternating-line-numbers` | | :------------------------------------ | :-------------------------------------------------------------------------------------------------------------- | :---------------------------------------------------------------------------------------------------------- | | `--no-merge-alternating-text` | Deaktiviert das Zusammenführen von abwechselnden Text- und Bildabsätzen | `pdf2zh_next example.pdf --no-merge-alternating-text` | | `--no-merge-alternating-text-images` | Deaktiviert das Zusammenführen von abwechselnden Text- und Bildabsätzen | `pdf2zh_next example.pdf --no-merge-alternating-text-images` | | `--no-merge-alternating-text-pattern` | Deaktiviert das Zusammenführen von abwechselnden Text- und Bildabsätzen basierend auf Mustervergleich | `pdf2zh_next example.pdf --no-merge-alternating-text-pattern` |
fr: | :------------------------------------ | :---------------------------------------------------------------------------------------------- | :----------------------------------------------------------------------------------------------------------- | | `--no-merge-same-font-size` | Disable merging of text blocks with the same font size | `pdf2zh_next example.pdf --no-merge-same-font-size` | | `--no-merge-vertically-overlapped` | Disable merging of vertically overlapping text blocks | `pdf2zh_next example.pdf --no-merge-vertically-overlapped` | | `--no-merge-horizontally-overlapped` | Disable merging of horizontally overlapping text blocks | `pdf2zh_next example.pdf --no-merge-horizontally-overlapped` | --- ### TRANSLATED TEXT | `--no-merge-alternating-line-numbers` | Désactiver la fusion des numéros de ligne alternés et des paragraphes de texte dans les documents avec des numéros de ligne | `pdf2zh_next example.pdf --no-merge-alternating-line-numbers` | | :------------------------------------ | :-------------------------------------------------------------------------------------------------------------------------- | :----------------------------------------------------------------------------------------------------------- | | `--no-merge-same-font-size` | Désactiver la fusion des blocs de texte avec la même taille de police | `pdf2zh_next example.pdf --no-merge-same-font-size` | | `--no-merge-vertically-overlapped` | Désactiver la fusion des blocs de texte qui se chevauchent verticalement | `pdf2zh_next example.pdf --no-merge-vertically-overlapped` | | `--no-merge-horizontally-overlapped` | Désactiver la fusion des blocs de texte qui se chevauchent horizontalement | `pdf2zh_next example.pdf --no-merge-horizontally-overlapped` |
it: `false` | | ------------------------------------- | --------------------------------------------------------------------------------------------- | ------------------------------------------------------------------------------------------------------------ | ------- | | `--no-merge-lines` | Disable merging of lines within the same paragraph | `pdf2zh_next example.pdf --no-merge-lines` | `false` | | `--no-merge-paragraphs` | Disable merging of paragraphs that are likely split across columns or pages | `pdf2zh_next example.pdf --no-merge-paragraphs` | `false` | | `--no-merge-tables` | Disable merging of paragraphs inside tables | `pdf2zh_next example.pdf --no-merge-tables` | `false` | | `--no-merge-tables-text` | Disable merging of text paragraphs inside tables | `pdf2zh_next example.pdf --no-merge-tables-text` | `false` | --- ### TRANSLATION RESULT | `--no-merge-alternating-line-numbers` | Disabilita l'unione dei numeri di riga alternati e dei paragrafi di testo nei documenti con numeri di riga | `pdf2zh_next example.pdf --no-merge-alternating-line-numbers` | `false` | | ------------------------------------- | ---------------------------------------------------------------------------------------------------------- | ------------------------------------------------------------------------------------------------------------ | ------- | | `--no-merge-lines` | Disabilita l'unione delle righe all'interno dello stesso paragrafo | `pdf2zh_next example.pdf --no-merge-lines` | `false` | | `--no-merge-paragraphs` | Disabilita l'unione dei paragrafi che potrebbero essere divisi tra colonne o pagine | `pdf2zh_next example.pdf --no-merge-paragraphs` | `false` | | `--no-merge-tables` | Disabilita l'unione dei paragrafi all'interno delle tabelle | `pdf2zh_next example.pdf --no-merge-tables` | `false` | | `--no-merge-tables-text` | Disabilita l'unione dei paragrafi di testo all'interno delle tabelle | `pdf2zh_next example.pdf --no-merge-tables-text` | `false` |
pt: | `--no-merge-alternating-line-numbers` | Desativar a fusão de números de linha alternados e parágrafos de texto em documentos com numeração de linhas | `pdf2zh_next example.pdf --no-merge-alternating-line-numbers` |
ru: | ------------------------------------- | ---------------------------------------------------------------------------------------------- | ------------------------------------------------------------------------------------------------------------ | | `--no-merge-identical-parenthesis` | Disable merging of identical parentheses at the beginning and end of a paragraph | `pdf2zh_next example.pdf --no-merge-identical-parenthesis` | | `--no-merge-identical-brackets` | Disable merging of identical brackets at the beginning and end of a paragraph | `pdf2zh_next example.pdf --no-merge-identical-brackets` | | `--no-merge-identical-quotation` | Disable merging of identical quotation marks at the beginning and end of a paragraph | `pdf2zh_next example.pdf --no-merge-identical-quotation` | | `--no-merge-identical-punctuation` | Disable merging of identical punctuation marks at the beginning and end of a paragraph | `pdf2zh_next example.pdf --no-merge-identical-punctuation` | | `--no-merge-identical-parenthesis` | Disable merging of identical parentheses at the beginning and end of a paragraph | `pdf2zh_next example.pdf --no-merge-identical-parenthesis` | | `--no-merge-identical-brackets` | Disable merging of identical brackets at the beginning and end of a paragraph | `pdf2zh_next example.pdf --no-merge-identical-brackets` | | `--no-merge-identical-quotation` | Disable merging of identical quotation marks at the beginning and end of a paragraph | `pdf2zh_next example.pdf --no-merge-identical-quotation` | | `--no-merge-identical-punctuation` | Disable merging of identical punctuation marks at the beginning and end of a paragraph | `pdf2zh_next example.pdf --no-merge-identical-punctuation` | | `--no-merge-identical-parenthesis` | Disable merging of identical parentheses at the beginning and end of a paragraph | `pdf2zh_next example.pdf --no-merge-identical-parenthesis` | | `--no-merge-identical-brackets` | Disable merging of identical brackets at the beginning and end of a paragraph | `pdf2zh_next example.pdf --no-merge-identical-brackets` | | `--no-merge-identical-quotation` | Disable merging of identical quotation marks at the beginning and end of a paragraph | `pdf2zh_next example.pdf --no-merge-identical-quotation` | | `--no-merge-identical-punctuation` | Disable merging of identical punctuation marks at the beginning and end of a paragraph | `pdf2zh_next example.pdf --no-merge-identical-punctuation` | | `--no-merge-identical-parenthesis` | Disable merging of identical parentheses at the beginning and end of a paragraph | `pdf2zh_next example.pdf --no-merge-identical-parenthesis` | | `--no-merge-identical-brackets` | Disable merging of identical brackets at the beginning and end of a paragraph | `pdf2zh_next example.pdf --no-merge-identical-brackets` | | `--no-merge-identical-quotation` | Disable merging of identical quotation marks at the beginning and end of a paragraph | `pdf2zh_next example.pdf --no-merge-identical-quotation` | | `--no-merge-identical-punctuation` | Disable merging of identical punctuation marks at the beginning and end of a paragraph | `pdf2zh_next example.pdf --no-merge-identical-punctuation` | | `--no-merge-identical-parenthesis` | Disable merging of identical parentheses at the beginning and end of a paragraph | `pdf2zh_next example.pdf --no-merge-identical-parenthesis` | | `--no-merge-identical-brackets` | Disable merging of identical brackets at the beginning and end of a paragraph | `pdf2zh_next example.pdf --no-merge-identical-brackets` | | `--no-merge-identical-quotation` | Disable merging of identical quotation marks at the beginning and end of a paragraph | `pdf2zh_next example.pdf --no-merge-identical-quotation` | | `--no-merge-identical-punctuation` | Disable merging of identical punctuation marks at the beginning and end of a paragraph | `pdf2zh_next example.pdf --no-merge-identical-punctuation` | | `--no-merge-identical-parenthesis` | Disable merging of identical parentheses at the beginning and end of a paragraph | `pdf2zh_next example.pdf --no-merge-identical-parenthesis` | | `--no-merge-identical-brackets` | Disable merging of identical brackets at the beginning and end of a paragraph | `pdf2zh_next example.pdf --no-merge-identical-brackets` | | `--no-merge-identical-quotation` | Disable merging of identical quotation marks at the beginning and end of a paragraph | `pdf2zh_next example.pdf --no-merge-identical-quotation` | | `--no-merge-identical-punctuation` | Disable merging of identical punctuation marks at the beginning and end of a paragraph | `pdf 极速翻译 example.pdf --no-merge-identical-punctuation` | | `--no-merge-identical-parenthesis` | Disable merging of identical parentheses at the beginning and end of a paragraph | `pdf 极速翻译 example.pdf --no-merge-identical-parenthesis` | | `--no-merge-identical-brackets` | Disable merging of identical brackets at the beginning and end of a paragraph | `pdf 极速翻译 example.pdf --no-merge-identical-brackets` | | `--no-merge-identical-quotation` | Disable merging of identical quotation marks at the beginning and end of a paragraph | `pdf 极速翻译 example.pdf --no-merge-identical-quotation` | | `--no-merge-identical-punctuation` | Disable merging of identical punctuation marks at the beginning and end of a paragraph | `pdf 极速翻译 example.pdf --no-merge-极速翻译-punctuation` | | `--no-merge-identical-parenthesis` | Disable merging of identical parentheses at the beginning and end of a paragraph | `pdf 极速翻译 example.pdf --no-merge-identical-parenthesis` | | `--no-merge-identical-brackets` | Disable merging of identical brackets at the beginning and end of a paragraph | `pdf 极速翻译 example.pdf --no-merge-identical-brackets` | | `极速翻译` | Disable merging of identical quotation marks at the beginning and end of a paragraph | `pdf 极速翻译 example.pdf --no-merge-identical-quotation` | | `--no-merge-identical-punctuation` | Disable merging of identical punctuation marks at the beginning and end of a paragraph | `pdf 极速翻译 example.pdf --no-merge-identical-punctuation` | --- ### TRANSLATION | `--no-merge-alternating-line-numbers` | Отключает объединение чередующихся номеров строк и текстовых абзацев в документах с номерами строк | `pdf2zh_next example.pdf --no-merge-alternating-line-numbers` | | ------------------------------------- | ---------------------------------------------------------------------------------------------- | ------------------------------------------------------------------------------------------------------------ | | `--no-merge-identical-parenthesis` | Отключает объединение одинаковых скобок в начале и конце абзаца | `pdf2zh_next example.pdf --no-merge-identical-parenthesis` | | `--no-merge-identical-brackets` | Отключает объединение одинаковых квадратных скобок в начале и конце абзаца | `pdf 极速翻译 example.pdf --no-merge-identical-brackets` | | `--no-merge-identical-quotation` | Отключает объединение одинаковых кавычек в начале и конце абзаца | `pdf 极速翻译 example.pdf --no-merge-identical-quotation` | | `--no-merge-identical-punctuation` | Отключает объединение одинаковых знаков пунктуации в начале и конце абзаца | `pdf 极速翻译 example.pdf --no-merge-identical-punctuation` | | `--no-merge-identical-parenthesis` | Отключает объединение одинаковых скобок в начале и конце абзаца | `pdf 极速翻译 example.pdf --no-merge-identical-parenthesis` | | `--no-merge-identical-brackets` | Отключает объединение одинаковых квадратных скобок в начале и конце абзаца | `pdf 极速翻译 example.pdf --no-极速翻译-identical-brackets` | | `--no-merge-identical-quotation` | Отключает объединение одинаковых кавычек в начале и конце абзаца | `pdf 极速翻译 example.pdf --no-merge-identical-quotation` | | `--no-merge-identical-punctuation` | Отключает объединение одинаковых знаков пунктуации в начале и конце абзаца | `pdf 极速翻译 example.pdf --no-merge-identical-punctuation` | | `--no-merge-identical-parenthesis` | Отключает объединение одинаковых скобок в начале и конце абзаца | `pdf 极速翻译 example.pdf --no-merge-identical-parenthesis` | | `--no-merge-identical-brackets` | Отключает объединение одинаковых квадратных скобок в начале и конце абзаца | `pdf 极速翻译 example.pdf --no-merge-identical-brackets` | | `--no-merge-identical-quotation` | Отключает объединение одинаковых кавычек в начале и конце абзаца | `pdf 极速翻译 example.pdf --no-merge-identical-quotation` | | `--no-merge-identical-punctuation` | Отключает объединение одинаковых знаков пунктуации в начале и конце абзаца | `pdf 极速翻译 example.pdf --no-merge-identical-punctuation` | | `--no-merge-identical-parenthesis` | Отключает объединение одинаковых скобок в начале и конце абзаца | `pdf 极速翻译 example 极速翻译 --no-merge-identical-parenthesis` | | `--no-merge-identical-brackets` | Отключает объединение одинаковых квадратных скобок в начале и конце абзаца | `pdf 极速翻译 example 极速翻译 --no-merge-identical-brackets` | | `--no-merge-identical-quotation` | Отключает объединение одинаковых кавычек в начале и конце абзаца | `pdf 极速翻译 example 极速翻译 --no-merge-identical-quotation` | | `--no-merge-identical-punctuation` | Отключает объединение одинаковых знаков пунктуации в начале и конце абзаца | `pdf 极速翻译 example 极速翻译 --no-merge-identical-punctuation` | | `--no-merge-identical-parenthesis` | Отключает объединение одинаковых скобок в начале и конце абзаца | `pdf 极速翻译 example 极速翻译 --no-merge-identical-parenthesis` | | `--no-merge-identical-b 极速翻译` | Отключает объединение одинаковых квадратных скобок в начале и конце абзаца | `pdf 极速翻译 example 极速翻译 --no-merge-identical-brackets` | | `--no-merge-identical-quotation` | Отключает объединение одинаковых кавычек в начале и конце абзаца | `pdf 极速翻译 example 极速翻译 --no-merge-identical-quotation` | | `--no-merge-identical-punctuation` | Отключает объединение одинаковых знаков пунктуации в начале и конце абзаца | `pdf 极速翻译 example 极速翻译 --no-merge-identical-punctuation` | | `--no-merge-identical-parenthesis` | Отключает объединение одинаковых скобок в начале и конце абзаца | `pdf 极速翻译 example 极速翻译 --no-merge-identical-parenthesis` | | `--no-merge-identical-brackets` | Отключает объединение одинаковых квадратных скобок в начале и конце абзаца | `pdf 极速翻译 example 极速翻译 --no-merge-identical-brackets` | | `--no-merge-identical-quotation` | Отключает объединение одинаковых кавычек в начале и конце абзаца | `pdf 极速翻译 example 极速翻译 --no-merge-identical-quotation` | | `--no-merge-identical-punctuation` | Отключает объединение одинаковых знаков пунктуации в начале и конце абзаца | `pdf 极速翻译 example.pdf --no-merge-identical-punctuation` | | `--no-merge-identical-parenthesis` | Отключает объединение одинаковых скобок в начале и конце абзаца | `pdf 极速翻译 example.pdf --no-merge-identical-parenthesis` | | `--no-merge-identical-brackets` | Отключает объединение одинаковых квадратных скобок в начале и конце абзаца | `pdf 极速翻译 example.pdf --no-merge-identical-brackets` | | `--no-merge-identical-quotation` | Отключает объединение одинаковых кавычек в начале и конце абзаца | `pdf 极速翻译 example.pdf --no-merge-identical-quotation` | | `--no-merge-identical-punctuation` | Отключает объединение одинаковых знаков пунктуации в начале и конце абзаца | `pdf 极速翻译 example.pdf --no-merge-identical-punctuation` | | `--no-merge-identical-parenthesis` | Отключает объединение одинаковых скобок в начале и конце абзаца | `pdf 极速翻译 example.pdf --no-merge-identical-parenthesis` | | `--no-merge-identical-brackets` | Отключает объединение одинаковых квадратных скобок в начале и конце абзаца | `pdf 极速翻译 example.pdf --no-merge-identical-brackets` | | `极速翻译` | Отключает объединение одинаковых кавычек в начале и конце абзаца | `pdf 极速翻译 example.pdf --no-merge-identical-quotation` | | `--no-merge-identical-punctuation` | Отключает объединение одинаковых знаков пунктуации в начале и конце абзаца | `pdf 极速翻译 example.pdf --no-merge-identical-punctuation` |
