Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_ED7E6B17
source: ### Example Event Shapes
de: The following are examples of event shapes that can be used in the `on` option of `trigger` and `listen`: ```js // String shorthand // Only calls the listener on the "click" event 'click' // Array of string shorthands // Calls the listener on both "click" and "focus" events ['click', 'focus'] // Object with a string event name and no options // Equivalent to the string shorthand { name: 'click' } // Object with a string event name and options { name: 'click', options: { capture: true } } // Object with an Event object event name and no options { name: new MouseEvent('click') } // Object with an Event object event name and options { name: new MouseEvent('click'), options: { once: true } } // Object with a custom Event object and no options { name: new CustomEvent('custom') } // Object with a custom Event object and options { name: new CustomEvent('custom'), options: { passive: true } } ``` --- ### TRANSLATION RESULT ### Beispielhafte Ereignisformen Die folgenden Beispiele zeigen Ereignisformen, die in der `on`-Option von `trigger` und `listen` verwendet werden können: ```js // String-Kurzform // Ruft den Listener nur beim "click"-Ereignis auf 'click' // Array von String-Kurzformen // Ruft den Listener sowohl bei "click"- als auch bei "focus"-Ereignissen auf ['click', 'focus'] // Objekt mit einem String-Ereignisnamen und ohne Optionen // Entspricht der String-Kurzform { name: 'click' } // Objekt mit einem String-Ereignisnamen und Optionen { name: 'click', options: { capture: true } } // Objekt mit einem Event-Objekt-Ereignisnamen und ohne Optionen { name: new MouseEvent('click') } // Objekt mit einem Event-Objekt-Ereignisnamen und Optionen { name: new MouseEvent('click'), options: { once: true } } // Objekt mit einem benutzerdefinierten Event-Objekt und ohne Optionen { name: new CustomEvent('custom') } // Objekt mit einem benutzerdefinierten Event-Objekt und Optionen { name: new CustomEvent('custom'), options: { passive: true } } ```
fr: !!! Note This feature is in beta. We are looking for feedback! Event shapes are defined with the `shape` property in the event definition. The shape defines the area of the event that is interactive. The shape is defined as a polygon of points relative to the event's position. The points are defined in the order they are connected. The following example shows how to define a triangle event shape. ```json { "events": [ { "id": "triangle-event", "name": "Triangle Event", "description": "This event has a triangular shape.", "shape": [ { "x": 0, "y": 0 }, { "x": 100, "y": 0 }, { "x": 50, "y": 100 } ] } ] } ``` The shape is defined as a polygon with three points. The points are relative to the event's position. The first point is at (0, 0), the second at (100, 0), and the third at (50, 100). The points are connected in the order they are defined. The following example shows how to define a circle event shape. Circles are approximated using a polygon with many points. ```json { "events": [ { "id": "circle-event", "name": "Circle Event", "description": "This event has a circular shape.", "shape": [ { "x": 50, "y": 0 }, { "x": 49, "y": 3 }, { "x": 48, "y": 6 }, // ... many more points to approximate a circle { "x": 50, "y": 100 }, { "x": 52, "y": 97 }, // ... and so on { "x": 50, "y": 0 } ] } ] } ``` The circle is approximated using a polygon with many points. The more points you use, the smoother the circle will appear. However, using too many points may impact performance. You can also define complex shapes by combining multiple polygons. The following example shows how to define a donut shape. ```json { "events": [ { "id": "donut-event", "name": "Donut Event", "description": "This event has a donut shape.", "shape": [ // Outer circle { "x": 50, "y": 0 }, { "x": 49, "y": 3 }, // ... many points for outer circle { "x": 50, "y": 100 }, // Inner circle (hole) { "x": 50, "y": 10 }, { "x": 49, "y": 13 }, // ... many points for inner circle { "x": 50, "y": 90 } ] } ] } ``` The donut shape is defined by first defining the outer circle and then the inner circle. The inner circle creates a hole in the shape. The order of the points matters. The outer circle should be defined in clockwise order, and the inner circle should be defined in counter-clockwise order. For more information on event shapes, see the [Event Shapes](../advanced/event-shapes.md) documentation. --- ### FORMES D'ÉVÉNEMENTS EXEMPLES !!! Note Cette fonctionnalité est en version bêta. Nous recherchons des retours d'expérience ! Les formes d'événements sont définies avec la propriété `shape` dans la définition de l'événement. La forme définit la zone de l'événement qui est interactive. La forme est définie comme un polygone de points relatifs à la position de l'événement. Les points sont définis dans l'ordre où ils sont connectés. L'exemple suivant montre comment définir une forme d'événement triangulaire. ```json { "events": [ { "id": "triangle-event", "name": "Triangle Event", "description": "This event has a triangular shape.", "shape": [ { "x": 0, "y": 0 }, { "x": 100, "y": 0 }, { "x": 50, "y": 100 } ] } ] } ``` La forme est définie comme un polygone à trois points. Les points sont relatifs à la position de l'événement. Le premier point est à (0, 0), le deuxième à (100, 0) et le troisième à (50, 100). Les points sont connectés dans l'ordre où ils sont définis. L'exemple suivant montre comment définir une forme d'événement circulaire. Les cercles sont approximés en utilisant un polygone avec de nombreux points. ```json { "events": [ { "id": "circle-event", "name": "Circle Event", "description": "This event has a circular shape.", "shape": [ { "x": 50, "y": 0 }, { "x": 49, "y": 3 }, { "x": 48, "y": 6 }, // ... beaucoup plus de points pour approximer un cercle { "x": 50, "y": 100 }, { "x": 52, "y": 97 }, // ... et ainsi de suite { "x": 50, "y": 0 } ] } ] } ``` Le cercle est approximé en utilisant un polygone avec de nombreux points. Plus vous utilisez de points, plus le cercle apparaîtra lisse. Cependant, utiliser trop de points peut impacter les performances. Vous pouvez également définir des formes complexes en combinant plusieurs polygones. L'exemple suivant montre comment définir une forme de donut. ```json { "events": [ { "id": "donut-event", "name": "Donut Event", "description": "This event has a donut shape.", "shape": [ // Cercle extérieur { "x": 50, "y": 0 }, { "x": 49, "y": 3 }, // ... nombreux points pour le cercle extérieur { "x": 50, "y": 100 }, // Cercle intérieur (trou) { "x": 50, "y": 10 }, { "x": 49, "y": 13 }, // ... nombreux points pour le cercle intérieur { "x": 50, "y": 90 } ] } ] } ``` La forme de donut est définie en définissant d'abord le cercle extérieur puis le cercle intérieur. Le cercle intérieur crée un trou dans la forme. L'ordre des points est important. Le cercle extérieur doit être défini dans le sens horaire, et le cercle intérieur doit être défini dans le sens anti-horaire. Pour plus d'informations sur les formes d'événements, consultez la documentation [Formes d'événements](../advanced/event-shapes.md).
it: This example shows how to define a custom event shape for a specific event type. ```yaml eventShapes: - type: "custom" name: "My Custom Event" color: "#ff0000" description: "A custom event for demonstration purposes" defaultIcon: "star" defaultSize: 2.0 defaultOpacity: 0.8 ``` ### Event Shape Properties Each event shape can have the following properties: - `type` (string, required): The type of event this shape applies to. Must match the event type in your timeline data. - `name` (string, required): A human-readable name for this event shape. - `color` (string): The default color for events of this type, in hex format (e.g., "#ff0000" for red). - `description` (string): A description of this event type. - `defaultIcon` (string): The default icon to use for events of this type. See the [icon list](ICONS.md) for available icons. - `defaultSize` (number): The default size multiplier for events of this type (1.0 = normal size). - `defaultOpacity` (number): The default opacity for events of this type (0.0 to 1.0). ### Default Event Shapes The timeline includes several built-in event shapes for common event types: ```yaml eventShapes: - type: "milestone" name: "Milestone" color: "#ff6b6b" description: "A significant milestone or achievement" defaultIcon: "flag" defaultSize: 1.5 defaultOpacity: 1.0 - type: "task" name: "Task" color: "#4ecdc4" description: "A task or action item" defaultIcon: "check-circle" defaultSize: 1.0 defaultOpacity: 0.8 - type: "meeting" name: "Meeting" color: "#45b7d1" description: "A meeting or discussion" defaultIcon: "users" defaultSize: 1.2 defaultOpacity: 0.9 - type: "deadline" name: "Deadline" color: "#f9ca24" description: "A deadline or due date" defaultIcon: "clock" defaultSize: 1.3 defaultOpacity: 0.9 - type: "note" name: "Note" color: "#a55eea" description: "A note or reminder" defaultIcon: "sticky-note" defaultSize: 0.8 defaultOpacity: 0.7 ``` You can override these defaults by defining your own event shapes with the same `type` values. --- ### TRANSLATION RESULT ### Esempio di Forme degli Eventi Questo esempio mostra come definire una forma di evento personalizzata per un tipo di evento specifico. ```yaml eventShapes: - type: "custom" name: "My Custom Event" color: "#ff0000" description: "A custom event for demonstration purposes" defaultIcon: "star" defaultSize: 2.0 defaultOpacity: 0.8 ``` ### Proprietà delle Forme degli Eventi Ogni forma di evento può avere le seguenti proprietà: - `type` (stringa, obbligatorio): Il tipo di evento a cui si applica questa forma. Deve corrispondere al tipo di evento nei tuoi dati della timeline. - `name` (stringa, obbligatorio): Un nome leggibile per questa forma di evento. - `color` (stringa): Il colore predefinito per gli eventi di questo tipo, in formato esadecimale (ad esempio, "#ff0000" per il rosso). - `description` (stringa): Una descrizione di questo tipo di evento. - `defaultIcon` (stringa): L'icona predefinita da utilizzare per gli eventi di questo tipo. Vedi l'[elenco delle icone](ICONS.md) per le icone disponibili. - `defaultSize` (numero): Il moltiplicatore di dimensione predefinito per gli eventi di questo tipo (1.0 = dimensione normale). - `defaultOpacity` (numero): L'opacità predefinita per gli eventi di questo tipo (da 0.0 a 1.0). ### Forme degli Eventi Predefinite La timeline include diverse forme di evento integrate per i tipi di evento comuni: ```yaml eventShapes: - type: "milestone" name: "Milestone" color: "#ff6b6b" description: "Una pietra miliare o un risultato significativo" defaultIcon: "flag" defaultSize: 1.5 defaultOpacity: 1.0 - type: "task" name: "Task" color: "#4ecdc4" description: "Un compito o un elemento d'azione" defaultIcon: "check-circle" defaultSize: 1.0 defaultOpacity: 0.8 - type: "meeting" name: "Meeting" color: "#45b7d1" description: "Un incontro o una discussione" defaultIcon: "users" defaultSize: 1.2 defaultOpacity: 0.9 - type: "deadline" name: "Deadline" color: "#f9ca24" description: "Una scadenza o una data di scadenza" defaultIcon: "clock" defaultSize: 1.3 defaultOpacity: 0.9 - type: "note" name: "Note" color: "#a55eea" description: "Una nota o un promemoria" defaultIcon: "sticky-note" defaultSize: 0.8 defaultOpacity: 0.7 ``` Puoi sovrascrivere questi valori predefiniti definendo le tue forme di evento con gli stessi valori `type`.
pt: This is a list of example event shapes. !!! note The examples below are for illustration purposes only. The actual events may vary. #### Example 1: Simple Event ```json { "event_id": "12345", "event_type": "user_login", "timestamp": "2023-10-05T14:48:00Z", "user_id": "user_67890", "ip_address": "192.168.1.1" } ``` #### Example 2: Event with Nested Data ```json { "event_id": "67890", "event_type": "purchase", "timestamp": "2023-10-05T15:30:00Z", "user": { "user_id": "user_12345", "email": "user@example.com", "name": "John Doe" }, "items": [ { "product_id": "prod_1", "quantity": 2, "price": 19.99 }, { "product_id": "prod_2", "quantity": 1, "price": 9.99 } ], "total_amount": 49.97 } ``` #### Example 3: Event with Array of Strings ```json { "event_id": "abcde", "event_type": "search", "timestamp": "2023-10-05T16:15:00Z", "query": "example query", "filters": ["filter1", "filter2", "filter3"], "results_count": 15 } ``` --- ### OUTPUT LANGUAGE pt
ru: The <a href="https://www.w3.org/TR/SVG/shapes.html#RectElement" target="_blank">SVG rectangle</a> `<rect>` is the most basic shape, used to create rectangles with various widths, heights, and corner radii. ```html <svg width="120" height="120" viewBox="0 0 120 120" xmlns="http://www.w3.org/2000/svg"> <rect x="10" y="10" width="100" height="100" /> </svg> ``` The <a href="https://www.w3.org/TR/SVG/shapes.html#CircleElement" target="_blank">SVG circle</a> `<circle>` element is used to create circles based on a center point and radius. ```html <svg width="120" height="120" viewBox="0 0 120 120" xmlns="http://www.w3.org/2000/svg"> <circle cx="60" cy="60" r="50" /> </svg> ``` The <a href="https://www.w3.org/TR/SVG/shapes.html#EllipseElement" target="_blank">SVG ellipse</a> `<ellipse>` is a more general form of the `<circle>` element, allowing you to scale the circle's radius independently in the x and y directions. ```html <svg width="120" height="120" viewBox="0 0 120 120" xmlns="http://www.w3.org/2000/svg"> <ellipse cx="60" cy="60" rx="50" ry="30" /> </svg> ``` The <a href="https://www.w3.org/TR/SVG/shapes.html#LineElement" target="_blank">SVG line</a> `<line>` element is used to create a line connecting two points. ```html <svg width="120" height="120" viewBox="0 0 120 120" xmlns="http://www.w3.org/2000/svg"> <line x1="20" y1="100" x2="100" y2="20" stroke="black" stroke-width="2" /> </svg> ``` The <a href="https://www.w3.org/TR/SVG/shapes.html#PolylineElement" target="_blank">SVG polyline</a> `<polyline>` element is used to create any shape consisting of only straight lines, and it is typically used to create open shapes. ```html <svg width="120" height="120" viewBox="0 0 120 120" xmlns="http://www.w3.org/2000/svg"> <polyline points="20,100 40,60 70,80 100,20" fill="none" stroke="black" stroke-width="2" /> </svg> ``` The <a href="https://www.w3.org/TR/SVG/shapes.html#PolygonElement" target="_blank">SVG polygon</a> `<polygon>` element is similar to `<polyline>`, but it automatically connects the last point to the first point to form a closed shape. ```html <svg width="120" height="120" viewBox="0 0 120 120" xmlns="http://www.w3.org/2000/svg"> <polygon points="60,20 100,100 20,100" fill="none" stroke="black" stroke-width="2" /> </svg> ``` ### Example Event Shapes <a href="https://www.w3.org/TR/SVG/paths.html#PathElement" target="_blank">SVG path</a> `<path>` is the most powerful and complex element in SVG. You can use it to create lines, curves, arcs, and more. ```html <svg width="120" height="120" viewBox="0 0 120 120" xmlns="http://www.w3.org/2000/svg"> <path d="M 10 10 C 20 20, 40 20, 50 10" stroke="black" fill="transparent" /> </svg> ``` --- ### OUTPUT LANGUAGE ru --- ### TRANSLATION ### Примеры фигур SVG <a href="https://www.w3.org/TR/SVG/shapes.html#RectElement" target="_blank">Прямоугольник SVG</a> `<rect>` — это самая базовая фигура, используемая для создания прямоугольников с различной шириной, высотой и радиусами углов. ```html <svg width="120" height="120" viewBox="0 0 120 120" xmlns="http://www.w3.org/2000/svg"> <rect x="10" y="10" width="100" height="100" /> </svg> ``` Элемент <a href="https://www.w3.org/TR/SVG/shapes.html#CircleElement" target="_blank">круг SVG</a> `<circle>` используется для создания кругов на основе центральной точки и радиуса. ```html <svg width="120" height="120" viewBox="0 0 120 120" xmlns="http://www.w3.org/2000/svg"> <circle cx="60" cy="60" r="50" /> </svg> ``` <a href="https://www.w3.org/TR/SVG/shapes.html#EllipseElement" target="_blank">Эллипс SVG</a> `<ellipse>` является более общей формой элемента `<circle>`, позволяя независимо масштабировать радиус круга по направлениям x и y. ```html <svg width="120" height="120" viewBox="0 0 120 120" xmlns="http://www.w3.org/2000/svg"> <ellipse cx="60" cy="60" rx="50" ry="30" /> </svg> ``` Элемент <a href="https://www.w3.org/TR/SVG/shapes.html#LineElement" target="_blank">линия SVG</a> `<line>` используется для создания линии, соединяющей две точки. ```html <svg width="120" height="120" viewBox="0 0 120 120" xmlns="http://www.w3.org/2000/svg"> <line x1="20" y1="100" x2="100" y2="20" stroke="black" stroke-width="2" /> </svg> ``` Элемент <a href="https://www.w3.org/TR/SVG/shapes.html#PolylineElement" target="_blank">полилиния SVG</a> `<polyline>` используется для создания любой фигуры, состоящей только из прямых линий, и обычно используется для создания открытых фигур. ```html <svg width="120" height="120" viewBox="0 0 120 120" xmlns="http://www.w3.org/2000/svg"> <polyline points="20,100 40,60 70,80 100,20" fill="none" stroke="black" stroke-width="2" /> </svg> ``` Элемент <a href="https://www.w3.org/TR/SVG/shapes.html#PolygonElement" target="_blank">полигон SVG</a> `<polygon>` похож на `<polyline>`, но он автоматически соединяет последнюю точку с первой, образуя замкнутую фигуру. ```html <svg width="120" height="120" viewBox="0 0 120 120" xmlns="http://www.w3.org/2000/svg"> <polygon points="60,20 100,100 20,100" fill="none" stroke="black" stroke-width="2" /> </svg> ``` ### Примеры фигур SVG <a href="https://www.w3.org/TR/SVG/paths.html#PathElement" target="_blank">Путь SVG</a> `<path>` — это самый мощный и сложный элемент в SVG. С его помощью можно создавать линии, кривые, дуги и многое другое. ```html <svg width="120" height="120" viewBox="0 0 120 120" xmlns="http://www.w3.org/2000/svg"> <path d="M 10 10 C 20 20, 40 20, 50 10" stroke="black" fill="transparent" /> </svg> ```
