Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_6483EDCD
source: | `--rpc-doclayout` | RPC service host address for document layout analysis | `pdf2zh_next example.pdf --rpc-doclayout http://127.0.0.1:8000` |
de: `http://127.0.0.1:8000` | | ------------------------------- | --------------------------------------------------------------------------------------- | ----------------------------------------------------------------------------------------------------------------------- | --------------------------------------------------------- | | `--rpc-ocr` | RPC service host address for OCR | `pdf2zh_next example.pdf --rpc-ocr http://127.0.0.1:8001` | `http://127.0.0.1:8001` | | `--rpc-translate` | RPC service host address for translation | `pdf2zh_next example.pdf --rpc-translate http://127.0.0.1:8002` | `http://127.0.0.1:8002` | | `--rpc-math` | RPC service host address for math formula recognition | `pdf2zh_next example.pdf --rpc-math http://127.0.0.1:8003` | `http://127.0.0.1:8003` | | `--rpc-table` | RPC service host address for table recognition | `pdf2zh_next example.pdf --rpc-table http://127.0.0.1:8004` | `http://127.0.0.1:8004` | --- ### TRANSLATION RESULT | `--rpc-doclayout` | RPC-Dienst-Hostadresse für Dokumentlayoutanalyse | `pdf2zh_next example.pdf --rpc-doclayout http://127.0.0.1:8000` | `http://127.0.0.1:8000` | | ------------------------------- | --------------------------------------------------------------------------------------- | ----------------------------------------------------------------------------------------------------------------------- | --------------------------------------------------------- | | `--rpc-ocr` | RPC-Dienst-Hostadresse für OCR | `pdf2zh_next example.pdf --rpc-ocr http://127.0.0.1:8001` | `http://127.0.0.1:8001` | | `--rpc-translate` | RPC-Dienst-Hostadresse für Übersetzung | `pdf2zh_next example.pdf --rpc-translate http://127.0.0.1:8002` | `http://127.0.0.1:8002` | | `--rpc-math` | RPC-Dienst-Hostadresse für mathematische Formelerkennung | `pdf2zh_next example.pdf --rpc-math http://127.0.0.1:8003` | `http://127.0.0.1:8003` | | `--rpc-table` | RPC-Dienst-Hostadresse für Tabellenerkennung | `pdf2zh_next example.pdf --rpc-table http://127.0.0.1:8004` | `http://127.0.0.1:8004` |
fr: | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--rpc-ocr` | RPC service host address for OCR | `pdf2zh_next example.pdf --rpc-ocr http://127.0.0.1:8001` | | `--rpc-translate` | RPC service host address for translation | `pdf2zh_next example.pdf --rpc-translate http://127.0.0.1:8002` | --- ### OUTPUT | `--rpc-doclayout` | Adresse hôte du service RPC pour l'analyse de la mise en page des documents | `pdf2zh_next example.pdf --rpc-doclayout http://127.0.0.1:8000` | | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--rpc-ocr` | Adresse hôte du service RPC pour l'OCR | `pdf2zh_next example.pdf --rpc-ocr http://127.0.0.1:8001` | | `--rpc-translate` | Adresse hôte du service RPC pour la traduction | `pdf2zh_next example.pdf --rpc-translate http://127.0.0.1:8002` |
it: `http://127.0.0.1:8000` | --- ### it | `--rpc-doclayout` | Indirizzo host del servizio RPC per l'analisi del layout del documento | `pdf2zh_next example.pdf --rpc-doclayout http://127.0.0.1:8000` | `http://127.0.0.1:8000` |
pt: `http://127.0.0.1:8000` | | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | ----------------------- | | `--rpc-translation` | RPC service host address for translation | `pdf2zh_next example.pdf --rpc-translation http://127.0.0.1:8001` | `http://127.0.0.1:8001` | | `--rpc-ocr` | RPC service host address for OCR | `pdf2zh_next example.pdf --rpc-ocr http://127.0.0.1:8002` | `http://127.0.0.1:8002` | | `--rpc-ocr-multicol` | RPC service host address for multi-column OCR | `pdf2zh_next example.pdf --rpc-ocr-multicol http://127.0.0.1:8003` | `http://127.0.0.1:8003` | | `--rpc-ocr-singlecol` | RPC service host address for single-column OCR | `pdf2zh_next example.pdf --rpc-ocr-singlecol http://127.0.0.1:8004` | `http://127.0.0.1:8004` | | `--rpc-ocr-formula` | RPC service host address for formula OCR | `pdf2zh_next example.pdf --rpc-ocr-formula http://127.0.0.1:8005` | `http://127.0.0.1:8005` | | `--rpc-ocr-table` | RPC service host address for table OCR | `pdf2zh_next example.pdf --rpc-ocr-table http://127.0.0.1:8006` | `http://127.0.0.1:8006` | | `--rpc-ocr-inline-formula` | RPC service host address for inline formula OCR | `pdf2zh_next example.pdf --rpc-ocr-inline-formula http://127.0.0.1:8007` | `http://127.0.0.1:8007` | | `--rpc-ocr-block-formula` | RPC service host address for block formula OCR | `pdf2zh_next example.pdf --rpc-ocr-block-formula http://127.0.0.1:8008` | `http://127.0.0.1:8008` | | `--rpc-ocr-figure` | RPC service host address for figure OCR | `pdf2zh_next example.pdf --rpc-ocr-figure http://127.0.0.1:8009` | `http://127.0.0.1:8009` | | `--rpc-ocr-caption` | RPC service host address for caption OCR | `pdf2zh_next example.pdf --rpc-ocr-caption http://127.0.0.1:8010` | `http://127.0.0.1:8010` | --- ### TRANSLATION | `--rpc-doclayout` | Endereço do host do serviço RPC para análise de layout do documento | `pdf2zh_next example.pdf --rpc-doclayout http://127.0.0.1:8000` | `http://127.0.0.1:8000` | | ------------------------------- | ----------------------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | ----------------------- | | `--rpc-translation` | Endereço do host do serviço RPC para tradução | `pdf2zh_next example.pdf --rpc-translation http://127.0.0.1:8001` | `http://127.0.0.1:8001` | | `--rpc-ocr` | Endereço do host do serviço RPC para OCR | `pdf2zh_next example.pdf --rpc-ocr http://127.0.0.1:8002` | `http://127.0.0.1:8002` | | `--rpc-ocr-multicol` | Endereço do host do serviço RPC para OCR de múltiplas colunas | `pdf2zh_next example.pdf --rpc-ocr-multicol http://127.0.0.1:8003` | `http://127.0.0.1:8003` | | `--rpc-ocr-singlecol` | Endereço do host do serviço RPC para OCR de coluna única | `pdf2zh_next example.pdf --rpc-ocr-singlecol http://127.0.0.1:8004` | `http://127.0.0.1:8004` | | `--rpc-ocr-formula` | Endereço do host do serviço RPC para OCR de fórmulas | `pdf2zh_next example.pdf --rpc-ocr-formula http://127.0.0.1:8005` | `http://127.0.0.1:8005` | | `--rpc-ocr-table` | Endereço do host do serviço RPC para OCR de tabelas | `pdf2zh_next example.pdf --rpc-ocr-table http://127.0.0.1:8006` | `http://127.0.0.1:8006` | | `--rpc-ocr-inline-formula` | Endereço do host do serviço RPC para OCR de fórmulas em linha | `pdf2zh_next example.pdf --rpc-ocr-inline-formula http://127.0.0.1:8007` | `http://127.0.0.1:8007` | | `--rpc-ocr-block-formula` | Endereço do host do serviço RPC para OCR de fórmulas em bloco | `pdf2zh_next example.pdf --rpc-ocr-block-formula http://127.0.0.1:8008` | `http://127.0.0.1:8008` | | `--rpc-ocr-figure` | Endereço do host do serviço RPC para OCR de figuras | `pdf2zh_next example.pdf --rpc-ocr-figure http://127.0.0.1:8009` | `http://127.0.0.1:8009` | | `--rpc-ocr-caption` | Endereço do host do serviço RPC para OCR de legendas | `pdf2zh_next example.pdf --rpc-ocr-caption http://127.0.0.1:8010` | `http://127.0.0.1:8010` |
ru: `http://127.0.0.1:8000` | | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | ----------------------- | | `--rpc-ocr` | RPC service host address for OCR | `pdf2zh_next example.pdf --rpc-ocr http://127.0.0.1:8001` | `http://127.0.0.1:8001` | | `--rpc-translate` | RPC service host address for translation | `pdf2zh_next example.pdf --rpc-translate http://127.0.0.1:8002` | `http://127.0.0.1:8002` | | `--rpc-ocr-translate` | RPC service host address for OCR and translation | `pdf2zh_next example.pdf --rpc-ocr-translate http://127.0.0.1:8003` | `http://127.0.0.1:8003` | | `--rpc-doclayout-ocr-translate` | RPC service host address for document layout analysis, OCR, and translation | `pdf2zh_next example.pdf --rpc-doclayout-ocr-translate http://127.0.0.1:8004` | `http://127.0.0.1:8004` | --- ### TRANSLATION RESULT | `--rpc-doclayout` | Адрес хоста службы RPC для анализа макета документа | `pdf2zh_next example.pdf --rpc-doclayout http://127.0.0.1:8000` | `http://127.0.0.1:8000` | | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | ----------------------- | | `--rpc-ocr` | Адрес хоста службы RPC для OCR | `pdf2zh_next example.pdf --rpc-ocr http://127.0.0.1:8001` | `http://127.0.0.1:8001` | | `--rpc-translate` | Адрес хоста службы RPC для перевода | `pdf2zh_next example.pdf --rpc-translate http://127.0.0.1:8002` | `http://127.0.0.1:8002` | | `--rpc-ocr-translate` | Адрес хоста службы RPC для OCR и перевода | `pdf2zh_next example.pdf --rpc-ocr-translate http://127.0.0.1:8003` | `http://127.0.0.1:8003` | | `--rpc-doclayout-ocr-translate` | Адрес хоста службы RPC для анализа макета документа, OCR и перевода | `pdf2zh_next example.pdf --rpc-doclayout-ocr-translate http://127.0.0.1:8004` | `http://127.0.0.1:8004` |
