Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_AEAB36FD
source: | `--primary-font-family` | Override primary font family for translated text. Choices: 'serif' for serif fonts, 'sans-serif' for sans-serif fonts, 'script' for script/italic fonts. If not specified, uses automatic font selection based on original text properties. | `pdf2zh_next example.pdf --primary-font-family serif` |
de: |---------------------------------|-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|-------------------------------------------------------| | `--secondary-font-family` | Override secondary font family for auxiliary text (like page numbers). Same choices as `--primary-font-family`. | `pdf2zh_next example.pdf --secondary-font-family serif` | | `--font-size-multiplier` | Scale factor for font sizes (0.8-1.2). Useful for adjusting text density. | `pdf2zh_next example.pdf --font-size-multiplier 1.1` | | `--line-height-multiplier` | Scale factor for line spacing (0.8-1.2). | `pdf2zh_next example.pdf --line-height-multiplier 0.9` | | `--char-spacing-multiplier` | Scale factor for character spacing (0.8-1.2). | `pdf2zh_next example.pdf --char-spacing-multiplier 1.0`| | `--word-spacing-multiplier` | Scale factor for word spacing (0.8-1.2). | `pdf2zh_next example.pdf --word-spacing-multiplier 1.0`| --- ### TRANSLATION RESULT | `--primary-font-family` | Überschreibt die primäre Schriftfamilie für den übersetzten Text. Optionen: 'serif' für Serifenschriften, 'sans-serif' für serifenlose Schriften, 'script' für Schreibschrift/kursive Schriften. Wenn nicht angegeben, wird eine automatische Schriftauswahl basierend auf den Eigenschaften des Originaltextes verwendet. | `pdf2zh_next example.pdf --primary-font-family serif` | |---------------------------------|-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|-------------------------------------------------------| | `--secondary-font-family` | Überschreibt die sekundäre Schriftfamilie für Hilfstext (wie Seitenzahlen). Gleiche Optionen wie `--primary-font-family`. | `pdf2zh_next example.pdf --secondary-font-family serif` | | `--font-size-multiplier` | Skalierungsfaktor für Schriftgrößen (0.8-1.2). Nützlich zum Anpassen der Textdichte. | `pdf2zh_next example.pdf --font-size-multiplier 1.1` | | `--line-height-multiplier` | Skalierungsfaktor für den Zeilenabstand (0.8-1.2). | `pdf2zh_next example.pdf --line-height-multiplier 0.9` | | `--char-spacing-multiplier` | Skalierungsfaktor für den Zeichenabstand (0.8-1.2). | `pdf2zh_next example.pdf --char-spacing-multiplier 1.0`| | `--word-spacing-multiplier` | Skalierungsfaktor für den Wortabstand (0.8-1.2). | `pdf2zh_next example.pdf --word-spacing-multiplier 1.0`|
fr: | `--primary-font-family` | Remplace la famille de police principale pour le texte traduit. Choix : 'serif' pour les polices à empattements, 'sans-serif' pour les polices sans empattements, 'script' pour les polices script/italiques. Si non spécifié, utilise la sélection automatique de police basée sur les propriétés du texte original. | `pdf2zh_next example.pdf --primary-font-family serif` |
it: |---------------------------------|---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|-------------------------------------------------------| | `--secondary-font-family` | Override secondary font family for translated text. Choices same as `--primary-font-family`. If not specified, uses automatic font selection based on original text properties. | `pdf2zh_next example.pdf --secondary-font-family serif` | | `--font-size-multiplier` | Scale factor for font sizes. 1.0 means original size, 1.1 means 10% larger, etc. | `pdf2zh_next example.pdf --font-size-multiplier 1.1` | | `--line-height-multiplier` | Scale factor for line heights. 1.0 means original line height, 1.1 means 10% taller, etc. | `pdf2zh_next example.pdf --line-height-multiplier 1.1` | | `--char-spacing-multiplier` | Scale factor for character spacing. 1.0 means original spacing, 1.1 means 10% wider spacing, etc. | `pdf2zh_next example.pdf --char-spacing-multiplier 1.1` | | `--word-spacing-multiplier` | Scale factor for word spacing. 1.0 means original spacing, 1.1 means 10% wider spacing, etc. | `pdf2zh_next example.pdf --word-spacing-multiplier 1.1` | | `--horizontal-scale-multiplier` | Scale factor for horizontal scaling (text width). 1.0 means original width, 1.1 means 10% wider, etc. | `pdf2zh_next example.pdf --horizontal-scale-multiplier 1.1` | | `--vertical-scale-multiplier` | Scale factor for vertical scaling (text height). 1.0 means original height, 1.1 means 10% taller, etc. | `pdf2zh_next example.pdf --vertical-scale-multiplier 1.1` | --- ### it(ISO 639-1 code) | `--primary-font-family` | Sostituisce la famiglia di font principale per il testo tradotto. Scelte: 'serif' per font serif, 'sans-serif' per font sans-serif, 'script' per font script/corsivo. Se non specificato, utilizza la selezione automatica del font in base alle proprietà del testo originale. | `pdf2zh_next example.pdf --primary-font-family serif` | |---------------------------------|--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|-------------------------------------------------------| | `--secondary-font-family` | Sostituisce la famiglia di font secondaria per il testo tradotto. Scelte uguali a `--primary-font-family`. Se non specificato, utilizza la selezione automatica del font in base alle proprietà del testo originale. | `pdf2zh_next example.pdf --secondary-font-family serif` | | `--font-size-multiplier` | Fattore di scala per le dimensioni del font. 1.0 significa dimensione originale, 1.1 significa 10% più grande, ecc. | `pdf2zh_next example.pdf --font-size-multiplier 1.1` | | `--line-height-multiplier` | Fattore di scala per l'altezza delle righe. 1.0 significa altezza riga originale, 1.1 significa 10% più alta, ecc. | `pdf2zh_next example.pdf --line-height-multiplier 1.1` | | `--char-spacing-multiplier` | Fattore di scala per la spaziatura dei caratteri. 1.0 significa spaziatura originale, 1.1 significa spaziatura 10% più ampia, ecc. | `pdf2zh_next example.pdf --char-spacing-multiplier 1.1` | | `--word-spacing-multiplier` | Fattore di scala per la spaziatura delle parole. 1.0 significa spaziatura originale, 1.1 significa spaziatura 10% più ampia, ecc. | `pdf2zh_next example.pdf --word-spacing-multiplier 1.1` | | `--horizontal-scale-multiplier` | Fattore di scala per la scalatura orizzontale (larghezza del testo). 1.0 significa larghezza originale, 1.1 significa 10% più ampia, ecc. | `pdf2zh_next example.pdf --horizontal-scale-multiplier 1.1` | | `--vertical-scale-multiplier` | Fattore di scala per la scalatura verticale (altezza del testo). 1.0 significa altezza originale, 1.1 significa 10% più alta, ecc. | `pdf2zh_next example.pdf --vertical-scale-multiplier 1.1` |
pt: --- ### OUTPUT | `--primary-font-family` | Substitui a família de fontes primária para o texto traduzido. Opções: 'serif' para fontes serifadas, 'sans-serif' para fontes sem serifas, 'script' para fontes de script/itálicas. Se não especificado, utiliza a seleção automática de fontes baseada nas propriedades do texto original. | `pdf2zh_next example.pdf --primary-font-family serif` |
ru: | `--primary-font-family` | Переопределяет основное семейство шрифтов для переведенного текста. Варианты: 'serif' для шрифтов с засечками, 'sans-serif' для рубленых шрифтов, 'script' для рукописных/курсивных шрифтов. Если не указано, используется автоматический выбор шрифта на основе свойств исходного текста. | `pdf2zh_next example.pdf --primary-font-family serif` |

# chunk_313C0250
source: | `--no-dual` | Do not output bilingual PDF files | `pdf2zh_next example.pdf --no-dual` |
de: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--no-image` | Do not output images | `pdf2zh_next example.pdf --no-image` | | `--no-text` | Do not output text | `pdf2zh_next example.pdf --no-text` | | `--no-table` | Do not output tables | `pdf2zh_next example.pdf --no-table` | | `--no-math` | Do not output mathematical formulas | `pdf2zh_next example.pdf --no-math` | | `--no-graphics` | Do not output graphics | `pdf2zh_next example.pdf --no-graphics` | | `--no-code` | Do not output code blocks | `pdf2zh_next example.pdf --no-code` | | `--no-list` | Do not output lists | `pdf2zh_next example.pdf --no-list` | | `--no-quote` | Do not output quotes | `pdf2zh_next example.pdf --no-quote` | | `--no-footnote` | Do not output footnotes | `pdf2zh_next example.pdf --no-footnote` | --- ### OUTPUT | `--no-dual` | Keine zweisprachigen PDF-Dateien ausgeben | `pdf2zh_next example.pdf --no-dual` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--no-image` | Keine Bilder ausgeben | `pdf2zh_next example.pdf --no-image` | | `--no-text` | Keinen Text ausgeben | `pdf2zh_next example.pdf --no-text` | | `--no-table` | Keine Tabellen ausgeben | `pdf2zh_next example.pdf --no-table` | | `--no-math` | Keine mathematischen Formeln ausgeben | `pdf2zh_next example.pdf --no-math` | | `--no-graphics` | Keine Grafiken ausgeben | `pdf2zh_next example.pdf --no-graphics` | | `--no-code` | Keine Codeblöcke ausgeben | `pdf2zh_next example.pdf --no-code` | | `--no-list` | Keine Listen ausgeben | `pdf2zh_next example.pdf --no-list` | | `--no-quote` | Keine Zitate ausgeben | `pdf2zh_next example.pdf --no-quote` | | `--no-footnote` | Keine Fußnoten ausgeben | `pdf2zh_next example.pdf --no-footnote` |
fr: |---------------------------------|-----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------| | `-v`, `--version` | Display the version information | `pdf2zh_next --version` | | `-h`, `--help` | Show help information | `pdf2zh_next -h` | --- ### OUTPUT | `--no-dual` | Ne pas générer de fichiers PDF bilingues | `pdf2zh_next example.pdf --no-dual` | |---------------------------------|-----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------| | `-v`, `--version` | Afficher les informations de version | `pdf2zh_next --version` | | `-h`, `--help` | Afficher l'aide | `pdf2zh_next -h` |
it: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--no-translate` | Do not perform translation, only perform OCR and layout analysis | `pdf2zh_next example.pdf --no-translate` | | `--no-ocr` | Do not perform OCR, only translate existing text | `pdf2zh_next example.pdf --no-ocr` | | `--only-ocr` | Only perform OCR, do not translate or perform layout analysis | `pdf2zh_next example.pdf --only-ocr` | | `--only-translate` | Only translate, do not perform OCR or layout analysis | `pdf2zh_next example.pdf --only-translate` | | `--only-layout` | Only perform layout analysis, do not perform OCR or translation | `pdf2zh_next example.pdf --only-layout` | --- ### OUTPUT LANGUAGE it
pt: | :------------------------------ | :-------------------------------------------------------------------------------------- | :-------------------------------------------------------------------------------------------------------------------- | | `--no-dual` | Não gera arquivos PDF bilíngues | `pdf2zh_next example.pdf --no-dual` | | `--output-dir <output_dir>` | Specify the output directory for the translated files | `pdf2zh_next example.pdf --output-dir ./output` | | `--output-dir <output_dir>` | Especifica o diretório de saída para os arquivos traduzidos | `pdf2zh_next example.pdf --output-dir ./output` | | `--output-name <output_name>` | Specify the output file name for the translated files | `pdf2zh_next example.pdf --output-name translated.pdf` | | `--output-name <output_name>` | Especifica o nome do arquivo de saída para os arquivos traduzidos | `pdf2zh_next example.pdf --output-name translated.pdf` | | `--single-column` | Force single-column layout for the translated PDF | `pdf2zh_next example.pdf --single-column` | | `--single-column` | Força o layout de coluna única para o PDF traduzido | `pdf2zh_next example.pdf --single-column` | | `--target-lang <target_lang>` | Specify the target language for translation (default: `zh`) | `pdf2zh_next example.pdf --target-lang en` | | `--target-lang <target_lang>` | Especifica o idioma de destino para a tradução (padrão: `zh`) | `pdf2zh_next example.pdf --target-lang en` | | `--translation-service <service>` | Specify the translation service to use (default: `google`) | `pdf2zh_next example.pdf --translation-service deepl` | | `--translation-service <service>` | Especifica o serviço de tradução a ser utilizado (padrão: `google`) | `pdf2zh_next example.pdf --translation-service deepl` | | `--skip-translated` | Skip pages that have already been translated (based on the output file) | `pdf2zh_next example.pdf --skip-translated` | | `--skip-translated` | Pula páginas que já foram traduzidas (com base no arquivo de saída) | `pdf2zh_next example.pdf --skip-translated` | | `-v`, `--version` | Show version information | `pdf2zh_next --version` | | `-v`, `--version` | Mostra informações da versão | `pdf2zh_next --version` | | `-h`, `--help` | Show help message | `pdf2zh_next --help` | | `-h`, `--help` | Mostra a mensagem de ajuda | `pdf2zh_next --help` | --- ### TRANSLATION RESULT | `--no-dual` | Não gera arquivos PDF bilíngues | `pdf2zh_next example.pdf --no-dual` | | :------------------------------ | :-------------------------------------------------------------------------------------- | :-------------------------------------------------------------------------------------------------------------------- | | `--output-dir <output_dir>` | Especifica o diretório de saída para os arquivos traduzidos | `pdf2zh_next example.pdf --output-dir ./output` | | `--output-name <output_name>` | Especifica o nome do arquivo de saída para os arquivos traduzidos | `pdf2zh_next example.pdf --output-name translated.pdf` | | `--single-column` | Força o layout de coluna única para o PDF traduzido | `pdf2zh_next example.pdf --single-column` | | `--target-lang <target_lang>` | Especifica o idioma de destino para a tradução (padrão: `zh`) | `pdf2zh_next example.pdf --target-lang en` | | `--translation-service <service>` | Especifica o serviço de tradução a ser utilizado (padrão: `google`) | `pdf2zh_next example.pdf --translation-service deepl` | | `--skip-translated` | Pula páginas que já foram traduzidas (com base no arquivo de saída) | `pdf2zh_next example.pdf --skip-translated` | | `-v`, `--version` | Mostra informações da versão | `pdf2zh_next --version` | | `-h`, `--help` | Mostra a mensagem de ajuda | `pdf2zh_next --help` |
ru: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--no-cover` | Do not output cover pages for bilingual PDF files | `pdf2zh_next example.pdf --no-cover` | | `--cover-logo <path>` | Set logo for cover pages (default: `logo.png` in the same directory as the PDF file) | `pdf2zh_next example.pdf --cover-logo ./logo.png` | | `--cover-title <title>` | Set title for cover pages (default: same as the PDF file name) | `pdf2zh_next example.pdf --cover-title "My Report"` | | `--cover-subtitle <subtitle>` | Set subtitle for cover pages (default: empty) | `pdf2zh_next example.pdf --cover-subtitle "Translated Version"` | | `--cover-footer <footer>` | Set footer for cover pages (default: empty) | `pdf2zh_next example.pdf --cover-footer "Confidential"` | | `--cover-background <path>` | Set background image for cover pages (default: empty) | `pdf2zh_next example.pdf --cover-background ./background.png` | | `--cover-date <date>` | Set date for cover pages (default: current date) | `pdf2zh_next example.pdf --cover-date "2024-01-01"` | | `--cover-author <author>` | Set author for cover pages (default: empty) | `pdf2zh_next example.pdf --cover-author "John Doe"` | | `--cover-organization <org>` | Set organization for cover pages (default: empty) | `pdf2zh_next example.pdf --cover-organization "My Company"` | | `--cover-language <lang>` | Set language for cover pages (default: `en`) | `pdf2zh_next example.pdf --cover-language zh` | | `--cover-template <path>` | Set custom cover template (default: built-in template) | `pdf2zh_next example.pdf --cover-template ./custom_template.html` | | `--cover-css <path>` | Set custom CSS for cover pages (default: built-in CSS) | `pdf2zh_next example.pdf --cover-css ./custom_style.css` | | `--cover-ignore-missing-logo` | Ignore missing logo file and proceed without logo | `pdf2zh_next example.pdf --cover-ignore-missing-logo` | | `--cover-ignore-missing-bg` | Ignore missing background image and proceed without background | `pdf2zh_next example.pdf --cover-ignore-missing-bg` | | `--cover-force` | Force regenerate cover pages even if they already exist | `pdf2zh_next example.pdf --cover-force` | --- ### OUTPUT LANGUAGE ru --- | `--no-dual` | Не выводить двуязычные PDF-файлы | `pdf2zh_next example.pdf --no-dual` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--no-cover` | Не выводить титульные страницы для двуязычных PDF-файлов | `pdf2zh_next example.pdf --no-cover` | | `--cover-logo <path>` | Установить логотип для титульных страниц (по умолчанию: `logo.png` в той же директории, что и PDF-файл) | `pdf2zh_next example.pdf --cover-logo ./logo.png` | | `--cover-title <title>` | Установить заголовок для титульных страниц (по умолчанию: то же, что и имя PDF-файла) | `pdf2zh_next example.pdf --cover-title "My Report"` | | `--cover-subtitle <subtitle>` | Установить подзаголовок для титульных страниц (по умолчанию: пусто) | `pdf2zh_next example.pdf --cover-subtitle "Translated Version"` | | `--cover-footer <footer>` | Установить нижний колонтитул для титульных страниц (по умолчанию: пусто) | `pdf2zh_next example.pdf --cover-footer "Confidential"` | | `--cover-background <path>` | Установить фоновое изображение для титульных страниц (по умолчанию: пусто) | `pdf2zh_next example.pdf --cover-background ./background.png` | | `--cover-date <date>` | Установить дату для титульных страниц (по умолчанию: текущая дата) | `pdf2zh_next example.pdf --cover-date "2024-01-01"` | | `--cover-author <author>` | Установить автора для титульных страниц (по умолчанию: пусто) | `pdf2zh_next example.pdf --cover-author "John Doe"` | | `--cover-organization <org>` | Установить организацию для титульных страниц (по умолчанию: пусто) | `pdf2zh_next example.pdf --cover-organization "My Company"` | | `--cover-language <lang>` | Установить язык для титульных страниц (по умолчанию: `en`) | `pdf2zh_next example.pdf --cover-language zh` | | `--cover-template <path>` | Установить пользовательский шаблон титульной страницы (по умолчанию: встроенный шаблон) | `pdf2zh_next example.pdf --cover-template ./custom_template.html` | | `--cover-css <path>` | Установить пользовательский CSS для титульных страниц (по умолчанию: встроенный CSS) | `pdf2zh_next example.pdf --cover-css ./custom_style.css` | | `--cover-ignore-missing-logo` | Игнорировать отсутствующий файл логотипа и продолжить без логотипа | `pdf2zh_next example.pdf --cover-ignore-missing-logo` | | `--cover-ignore-missing-bg` | Игнорировать отсутствующее фоновое изображение и продолжить без фона | `pdf2zh_next example.pdf --cover-ignore-missing-bg` | | `--cover-force` | Принудительно перегенерировать титульные страницы, даже если они уже существуют | `pdf2zh_next example.pdf --cover-force` |
