Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_52F525D9
source: | `--config-file` | Path to the configuration file | `pdf2zh_next --config-file /path/to/config/config.toml` |
de: | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--proxy` | Proxy settings, such as `http://127.0.0.1:7890` or `socks5://127.0.0.1:7890` | `pdf2zh_next --proxy http://127.0.0.1:7890` | | `--api-key` | API key for the translation service | `pdf2zh_next --api-key sk-xxxxx` | | `--api-base` | Base URL for the translation service, such as `https://api.openai.com` | `pdf2zh_next --api-base https://api.openai.com` | | `--model` | Model to use for translation, such as `gpt-4o-mini` or `gpt-4o` | `pdf2zh_next --model gpt-4o-mini` | | `--target-language` | Target language for translation, such as `zh` or `en` | `pdf2zh_next --target-language zh` | | `--source-language` | Source language of the document, such as `en` or `ja` | `pdf2zh_next --source-language en` | | `--concurrency-limit` | Maximum number of concurrent translation requests | `pdf2zh_next --concurrency-limit 5` | | `--request-timeout` | Timeout for each translation request in seconds | `pdf2zh_next --request-timeout 30` | | `--max-retries` | Maximum number of retries for failed translation requests | `pdf2zh_next --max-retries 3` | | `--retry-delay` | Delay between retries in seconds | `pdf2zh_next --retry-delay 5` | | `--batch-size` | Number of text segments to process in each batch | `pdf2zh_next --batch-size 10` | | `--temperature` | Temperature for the translation model, between 0 and 2 | `pdf2zh_next --temperature 0.7` | | `--top-p` | Top-p sampling for the translation model, between 0 and 1 | `pdf2zh_next --top-p 0.9` | | `--presence-penalty` | Presence penalty for the translation model, between -2 and 2 | `pdf2zh_next --presence-penalty 0` | | `--frequency-penalty` | Frequency penalty for the translation model, between -2 and 2 | `pdf2zh_next --frequency-penalty 0` | | `--max-tokens` | Maximum number of tokens to generate in each translation request | `pdf2zh_next --max-tokens 4096` | | `--log-level` | Log level, such as `debug`, `info`, `warning`, `error` | `pdf2zh_next --log-level info` | | `--log-file` | Path to the log file | `pdf2zh_next --log-file /path/to/log/file.log` | | `--no-cache` | Disable caching of translation results | `pdf2zh_next --no-cache` | | `--cache-dir` | Directory to store cache files | `pdf2zh_next --cache-dir /path/to/cache` | | `--clean-cache` | Clean the cache directory before starting | `pdf2zh_next --clean-cache` | | `--output-dir` | Directory to save the translated document | `pdf2zh_next --output-dir /path/to/output` | | `--output-format` | Format of the output document, such as `pdf`, `docx`, `txt`, `markdown` | `pdf2zh_next --output-format pdf` | | `--keep-original-format` | Keep the original document format | `pdf2zh_next --keep-original-format` | | `--no-translate` | Only extract text without translation | `pdf2zh_next --no-translate` | | `--translate-only` | Only translate without extracting text (requires pre-extracted text) | `pdf2zh_next --translate-only` | | `--extract-only` | Only extract text without translation | `pdf2zh_next --extract-only` | | `--resume` | Resume from the last interrupted translation | `pdf2zh_next --resume` | | `--overwrite` | Overwrite existing output files | `pdf2zh_next --overwrite` | | `--dry-run` | Perform a dry run without actually translating | `pdf2zh_next --dry-run` | | `--version` | Show version information | `pdf2zh_next --version` | | `--help` | Show help message | `pdf2zh_next --help` | | `--list-languages` | List all supported languages | `pdf2zh_next --list-languages` | | `--list-models` | List all available models for the translation service | `pdf2zh_next --list-models` | | `--list-output-formats` | List all supported output formats | `pdf2zh_next --list-output-formats` | | `--list-translation-services` | List all available translation services | `pdf2zh_next --list-translation-services` | --- ### TRANSLATION | `--config-file` | Pfad zur Konfigurationsdatei | `pdf2zh_next --config-file /path/to/config/config.toml` | | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--proxy` | Proxy-Einstellungen, z. B. `http://127.0.0.1:7890` oder `socks5://127.0.0.1:7890` | `pdf2zh_next --proxy http://127.0.0.1:7890` | | `--api-key` | API-Schlüssel für den Übersetzungsdienst | `pdf2zh_next --api-key sk-xxxxx` | | `--api-base` | Basis-URL für den Übersetzungsdienst, z. B. `https://api.openai.com` | `pdf2zh_next --api-base https://api.openai.com` | | `--model` | Modell für die Übersetzung, z. B. `gpt-4o-mini` oder `gpt-4o` | `pdf2zh_next --model gpt-4o-mini` | | `--target-language` | Zielsprache für die Übersetzung, z. B. `zh` oder `en` | `pdf2zh_next --target-language zh` | | `--source-language` | Ausgangssprache des Dokuments, z. B. `en` oder `ja` | `pdf2zh_next --source-language en` | | `--concurrency-limit` | Maximale Anzahl gleichzeitiger Übersetzungsanfragen | `pdf2zh_next --concurrency-limit 5` | | `--request-timeout` | Timeout für jede Übersetzungsanfrage in Sekunden | `pdf2zh_next --request-timeout 30` | | `--max-retries` | Maximale Anzahl von Wiederholungsversuchen für fehlgeschlagene Übersetzungsanfragen | `pdf2zh_next --max-retries 3` | | `--retry-delay` | Verzögerung zwischen Wiederholungsversuchen in Sekunden | `pdf2zh_next --retry-delay 5` | | `--batch-size` | Anzahl der Textsegmente, die in jedem Batch verarbeitet werden | `pdf2zh_next --batch-size 10` | | `--temperature` | Temperatur für das Übersetzungsmodell, zwischen 0 und 2 | `pdf2zh_next --temperature 0.7` | | `--top-p` | Top-p-Sampling für das Übersetzungsmodell, zwischen 0 und 1 | `pdf2zh_next --top-p 0.9` | | `--presence-penalty` | Presence-Penalty für das Übersetzungsmodell, zwischen -2 und 2 | `pdf2zh_next --presence-penalty 0` | | `--frequency-penalty` | Frequency-Penalty für das Übersetzungsmodell, zwischen -2 und 2 | `pdf2zh_next --frequency-penalty 0` | | `--max-tokens` | Maximale Anzahl von Tokens, die in jeder Übersetzungsanfrage generiert werden | `pdf2zh_next --max-tokens 4096` | | `--log-level` | Protokollierungsstufe, z. B. `debug`, `info`, `warning`, `error` | `pdf2zh_next --log-level info` | | `--log-file` | Pfad zur Protokolldatei | `pdf2zh_next --log-file /path/to/log/file.log` | | `--no-cache` | Deaktiviert das Zwischenspeichern von Übersetzungsergebnissen | `pdf2zh_next --no-cache` | | `--cache-dir` | Verzeichnis zum Speichern von Cache-Dateien | `pdf2zh_next --cache-dir /path/to/cache` | | `--clean-cache` | Bereinigt das Cache-Verzeichnis vor dem Start | `pdf2zh_next --clean-cache` | | `--output-dir` | Verzeichnis zum Speichern des übersetzten Dokuments | `pdf2zh_next --output-dir /path/to/output` | | `--output-format` | Format des Ausgabedokuments, z. B. `pdf`, `docx`, `txt`, `markdown` | `pdf2zh_next --output-format pdf` | | `--keep-original-format` | Behält das ursprüngliche Dokumentformat bei | `pdf2zh_next --keep-original-format` | | `--no-translate` | Extrahiert nur Text ohne Übersetzung | `pdf2zh_next --no-translate` | | `--translate-only` | Übersetzt nur ohne Textextraktion (erfordert vorab extrahierten Text) | `pdf2zh_next --translate-only` | | `--extract-only` | Extrahiert nur Text ohne Übersetzung | `pdf2zh_next --extract-only` | | `--resume` | Setzt die letzte unterbrochene Übersetzung fort | `pdf2zh_next --resume` | | `--overwrite` | Überschreibt vorhandene Ausgabedateien | `pdf2zh_next --overwrite` | | `--dry-run` | Führt einen Probelauf ohne tatsächliche Übersetzung durch | `pdf2zh_next --dry-run` | | `--version` | Zeigt Versionsinformationen an | `pdf2zh_next --version` | | `--help` | Zeigt eine Hilfenachricht an | `pdf2zh_next --help` | | `--list-languages` | Listet alle unterstützten Sprachen auf | `pdf2zh_next --list-languages` | | `--list-models` | Listet alle verfügbaren Modelle für den Übersetzungsdienst auf | `pdf2zh_next --list-models` | | `--list-output-formats` | Listet alle unterstützten Ausgabeformate auf | `pdf2zh_next --list-output-formats` | | `--list-translation-services` | Listet alle verfügbaren Übersetzungsdienste auf | `pdf2zh_next --list-translation-services` |
fr: | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--config-file` | Chemin vers le fichier de configuration | `pdf2zh_next --config-file /path/to/config/config.toml` | | `--lang-source` | Source language code | `pdf2zh_next --lang-source en` | | `--lang-target` | Target language code | `pdf2zh_next --lang-target fr` | | `--output-dir` | Output directory | `pdf2zh_next --output-dir /path/to/output/dir` | | `--output-format` | Output format, `pdf` or `html` | `pdf2zh_next --output-format html` | | `--output-prefix` | Prefix for the output filename | `pdf2zh_next --output-prefix "translated_"` | | `--output-suffix` | Suffix for the output filename | `pdf2zh_next --output-suffix "_fr"` | | `--api-key` | API key for translation service | `pdf2zh_next --api-key "your-api-key"` | | `--api-base` | API base URL for translation service | `pdf2zh_next --api-base "https://api.example.com"` | | `--api-model` | API model for translation service | `pdf2zh_next --api-model "gpt-4"` | | `--api-temperature` | API temperature for translation service | `pdf2zh_next --api-temperature 0.7` | | `--api-max-tokens` | API max tokens for translation service | `pdf2zh_next --api-max-tokens 2000` | | `--retry-attempts` | Number of retry attempts for API calls | `pdf2zh_next --retry-attempts 3` | | `--retry-delay` | Delay between retry attempts in milliseconds | `pdf2zh_next --retry-delay 1000` | | `--timeout` | Timeout for API calls in milliseconds | `pdf2zh_next --timeout 30000` | | `--concurrency` | Number of concurrent API requests | `pdf2zh_next --concurrency 5` | | `--batch-size` | Number of text segments to process in each API request | `pdf2zh_next --batch-size 10` | | `--log-level` | Log level, `debug`, `info`, `warning`, `error`, or `critical` | `pdf2zh_next --log-level info` | | `--log-file` | Path to the log file | `pdf2zh_next --log-file /path/to/log/file.log` | | `--cache-dir` | Directory for caching translations | `pdf2zh_next --cache-dir /path/to/cache/dir` | | `--no-cache` | Disable caching | `pdf2zh_next --no-cache` | | `--force-retranslate` | Force retranslation even if cached | `pdf2zh_next --force-retranslate` | | `--dry-run` | Perform a dry run without actual translation | `pdf2zh_next --dry-run` | | `--help` | Show help message | `pdf2zh_next --help` | | `--version` | Show version information | `pdf2zh_next --version` | --- ### TRANSLATION RESULT | `--config-file` | Chemin vers le fichier de configuration | `pdf2zh_next --config-file /path/to/config/config.toml` | | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--lang-source` | Code de langue source | `pdf2zh_next --lang-source en` | | `--lang-target` | Code de langue cible | `pdf2zh_next --lang-target fr` | | `--output-dir` | Répertoire de sortie | `pdf2zh_next --output-dir /path/to/output/dir` | | `--output-format` | Format de sortie, `pdf` ou `html` | `pdf2zh_next --output-format html` | | `--output-prefix` | Préfixe pour le nom de fichier de sortie | `pdf2zh_next --output-prefix "translated_"` | | `--output-suffix` | Suffixe pour le nom de fichier de sortie | `pdf2zh_next --output-suffix "_fr"` | | `--api-key` | Clé API pour le service de traduction | `pdf2zh_next --api-key "your-api-key"` | | `--api-base` | URL de base de l'API pour le service de traduction | `pdf2zh_next --api-base "https://api.example.com"` | | `--api-model` | Modèle d'API pour le service de traduction | `pdf2zh_next --api-model "gpt-4"` | | `--api-temperature` | Température de l'API pour le service de traduction | `pdf2zh_next --api-temperature 0.7` | | `--api-max-tokens` | Nombre maximum de jetons de l'API pour le service de traduction | `pdf2zh_next --api-max-tokens 2000` | | `--retry-attempts` | Nombre de tentatives de réessai pour les appels API | `pdf2zh_next --retry-attempts 3` | | `--retry-delay` | Délai entre les tentatives de réessai en millisecondes | `pdf2zh_next --retry-delay 1000` | | `--timeout` | Délai d'expiration pour les appels API en millisecondes | `pdf2zh_next --timeout 30000` | | `--concurrency` | Nombre de requêtes API concurrentes | `pdf2zh_next --concurrency 5` | | `--batch-size` | Nombre de segments de texte à traiter dans chaque requête API | `pdf2zh_next --batch-size 10` | | `--log-level` | Niveau de journalisation, `debug`, `info`, `warning`, `error`, ou `critical` | `pdf2zh_next --log-level info` | | `--log-file` | Chemin vers le fichier de journalisation | `pdf2zh_next --log-file /path/to/log/file.log` | | `--cache-dir` | Répertoire pour la mise en cache des traductions | `pdf2zh_next --cache-dir /path/to/cache/dir` | | `--no-cache` | Désactiver la mise en cache | `pdf2zh_next --no-cache` | | `--force-retranslate` | Forcer la retraduction même si mise en cache | `pdf2zh_next --force-retranslate` | | `--dry-run` | Effectuer une simulation sans traduction réelle | `pdf2zh_next --dry-run` | | `--help` | Afficher le message d'aide | `pdf2zh_next --help` | | `--version` | Afficher les informations de version | `pdf2zh_next --version` |
it: `pdf2zh_next` | | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | --------------- | | `-h`, `--help` | Show help | `pdf2zh_next --help` | `pdf2zh_next` | | `-V`, `--version` | Show version info | `pdf2zh_next --version` | `pdf2zh_next` | --- ### LANGUAGE it
pt: No | --- ### OUTPUT | `--config-file` | Caminho para o arquivo de configuração | `pdf2zh_next --config-file /path/to/config/config.toml` | Não |
ru: `config.toml` | | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | ----------------------------------------------------------------------------- | | `--config-file` | Path to the configuration file | `pdf2zh_next --config-file /path/to/config/config.toml` | `config.toml` | | `--config-file` | Path to the configuration file | `pdf2zh_next --config-file /path/to/config/config.toml` | `config.toml` | --- ### OUTPUT | `--config-file` | Путь к файлу конфигурации | `pdf2zh_next --config-file /path/to/config/config.toml` | `config.toml` | | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | ----------------------------------------------------------------------------- | | `--config-file` | Путь к файлу конфигурации | `pdf2zh_next --config-file /path/to/config/config.toml` | `config.toml` | | `--config-file` | Путь к файлу конфигурации | `pdf2zh_next --config-file /path/to/config/config.toml` | `config.toml` |
