Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_7C961DFD
source: The following translation engines have been **deprecated** and will no longer be maintained or supported:
de: - `google` - `azure` - `google_cloud` - `deepl` - `youdao` - `baidu` - `volcengine` - `caiyun` - `nllb` - `offline` For new projects, please use the new translation engines: - `google2` - `azure2` - `google_cloud2` - `deepl2` - `youdao2` - `baidu2` - `volcengine2` - `caiyun2` - `nllb2` - `offline2` --- ### TRANSLATION RESULT Die folgenden Übersetzungs-Engines wurden **eingestellt** und werden nicht mehr gewartet oder unterstützt: - `google` - `azure` - `google_cloud` - `deepl` - `youdao` - `baidu` - `volcengine` - `caiyun` - `nllb` - `offline` Für neue Projekte verwenden Sie bitte die neuen Übersetzungs-Engines: - `google2` - `azure2` - `google_cloud2` - `deepl2` - `youdao2` - `baidu2` - `volcengine2` - `caiyun2` - `nllb2` - `offline2`
fr: - Google Translate - Bing Translator --- ### OUTPUT Les moteurs de traduction suivants ont été **dépréciés** et ne seront plus maintenus ou supportés : - Google Translate - Bing Translator --- ### ORIGINAL TEXT **pdf2zh** is a powerful PDF translation tool designed to help users translate PDF documents between different languages. It supports multiple translation engines and provides a user-friendly interface for both command-line and web-based usage. --- ### OUTPUT **pdf2zh** est un outil de traduction PDF puissant conçu pour aider les utilisateurs à traduire des documents PDF entre différentes langues. Il supporte plusieurs moteurs de traduction et fournit une interface conviviale pour une utilisation en ligne de commande et basée sur le web. --- ### ORIGINAL TEXT - **Multi-engine Support**: Supports Google Translate, DeepL, OpenAI, and more. - **Batch Translation**: Translate multiple PDF files at once. - **Format Preservation**: Maintains the original layout and formatting of the PDF. - **Customizable Output**: Choose output language and translation engine. - **Open Source**: Free to use and modify under the MIT license. --- ### OUTPUT - **Support multi-moteurs** : Supporte Google Translate, DeepL, OpenAI, et plus encore. - **Traduction par lots** : Traduisez plusieurs fichiers PDF à la fois. - **Préservation du format** : Maintient la mise en page et le formatage originaux du PDF. - **Sortie personnalisable** : Choisissez la langue de sortie et le moteur de traduction. - **Open Source** : Gratuit à utiliser et modifier sous la licence MIT. --- ### ORIGINAL TEXT To get started with **pdf2zh**, follow these steps: 1. **Installation**: Install the tool using pip or Docker. 2. **Configuration**: Set up your preferred translation engine and API keys. 3. **Usage**: Use the command line or web interface to translate your PDFs. For detailed instructions, see the [Installation](https://pdf2zh-next.com/getting-started/INSTALLATION.html) and [Usage](https://pdf2zh-next.com/getting-started/USAGE.html) guides. --- ### OUTPUT Pour commencer avec **pdf2zh**, suivez ces étapes : 1. **Installation** : Installez l'outil en utilisant pip ou Docker. 2. **Configuration** : Configurez votre moteur de traduction préféré et vos clés API. 3. **Utilisation** : Utilisez la ligne de commande ou l'interface web pour traduire vos PDF. Pour des instructions détaillées, consultez les guides [Installation](https://pdf2zh-next.com/getting-started/INSTALLATION.html) et [Utilisation](https://pdf2zh-next.com/getting-started/USAGE.html). --- ### ORIGINAL TEXT If you encounter any issues or have questions, please check the [FAQ](https://pdf2zh-next.com/community/FAQ.html) or submit an issue on [GitHub](https://github.com/your-repo/issues). We welcome contributions! If you'd like to help improve **pdf2zh**, see the [For Translators](https://pdf2zh-next.com/community/FOR_TRANSLATORS.html) guide. --- ### OUTPUT Si vous rencontrez des problèmes ou avez des questions, veuillez consulter la [FAQ](https://pdf2zh-next.com/community/FAQ.html) ou soumettre un problème sur [GitHub](https://github.com/your-repo/issues). Nous accueillons les contributions ! Si vous souhaitez aider à améliorer **pdf2zh**, consultez le guide [Guide de contribution des traductions](https://pdf2zh-next.com/community/FOR_TRANSLATORS.html). --- ### ORIGINAL TEXT - **Version**: 2.0.0 - **License**: MIT - **Source Code**: [GitHub Repository](https://github.com/your-repo/pdf2zh) --- ### OUTPUT - **Version** : 2.0.0 - **Licence** : MIT - **Code Source** : [Dépôt GitHub](https://github.com/your-repo/pdf2zh) --- ### ORIGINAL TEXT **pdf2zh** is a powerful PDF translation tool designed to help users translate PDF documents between different languages. It supports multiple translation engines and provides a user-friendly interface for both command-line and web-based usage. --- ### OUTPUT **pdf2zh** est un outil de traduction PDF puissant conçu pour aider les utilisateurs à traduire des documents PDF entre différentes langues. Il supporte plusieurs moteurs de traduction et fournit une interface conviviale pour une utilisation en ligne de commande et basée sur le web. --- ### ORIGINAL TEXT - **Multi-engine Support**: Supports Google Translate, DeepL, OpenAI, and more. - **Batch Translation**: Translate multiple PDF files at once. - **Format Preservation**: Maintains the original layout and formatting of the PDF. - **Customizable Output**: Choose output language and translation engine. - **Open Source**: Free to use and modify under the MIT license. --- ### OUTPUT - **Support multi-moteurs** : Supporte Google Translate, DeepL, OpenAI, et plus encore. - **Traduction par lots** : Traduisez plusieurs fichiers PDF à la fois. - **Préservation du format** : Maintient la mise en page et le formatage originaux du PDF. - **Sortie personnalisable** : Choisissez la langue de sortie et le moteur de traduction. - **Open Source** : Gratuit à utiliser et modifier sous la licence MIT. --- ### ORIGINAL TEXT To get started with **pdf2zh**, follow these steps: 1. **Installation**: Install the tool using pip or Docker. 2. **Configuration**: Set up your preferred translation engine and API keys. 3. **Usage**: Use the command line or web interface to translate your PDFs. For detailed instructions, see the [Installation](https://pdf2zh-next.com/getting-started/INSTALLATION.html) and [Usage](https://pdf2zh-next.com/getting-started/USAGE.html) guides. --- ### OUTPUT Pour commencer avec **pdf2zh**, suivez ces étapes : 1. **Installation** : Installez l'outil en utilisant pip ou Docker. 2. **Configuration** : Configurez votre moteur de traduction préféré et vos clés API. 3. **Utilisation** : Utilisez la ligne de commande ou l'interface web pour traduire vos PDF. Pour des instructions détaillées, consultez les guides [Installation](https://pdf2zh-next.com/getting-started/INSTALLATION.html) et [Utilisation](https://pdf2zh-next.com/getting-started/USAGE.html). --- ### ORIGINAL TEXT If you encounter any issues or have questions, please check the [FAQ](https://pdf2zh-next.com/community/FAQ.html) or submit an issue on [GitHub](https://github.com/your-repo/issues). We welcome contributions! If you'd like to help improve **pdf2zh**, see the [For Translators](https://pdf2zh-next.com/community/FOR_TRANSLATORS.html) guide. --- ### OUTPUT Si vous rencontrez des problèmes ou avez des questions, veuillez consulter la [FAQ](https://pdf2zh-next.com/community/FAQ.html) ou soumettre un problème sur [GitHub](https://github.com/your-repo/issues). Nous accueillons les contributions ! Si vous souhaitez aider à améliorer **pdf2zh**, consultez le guide [Guide de contribution des traductions](https://pdf2zh-next.com/community/FOR_TRANSLATORS.html). --- ### ORIGINAL TEXT - **Version**: 2.0.0 - **License**: MIT - **Source Code**: [GitHub Repository](https://github.com/your-repo/pdf2zh) --- ### OUTPUT - **Version** : 2.0.0 - **Licence** : MIT - **Code Source** : [Dépôt GitHub](https://github.com/your-repo/pdf2zh) --- ### ORIGINAL TEXT # pdf2zh Documentation Welcome to the **pdf2zh** documentation! This guide will help you get started with using **pdf2zh** to translate PDF documents. ## Table of Contents - [Installation](https://pdf2zh-next.com/getting-started/INSTALLATION.html) - [Usage](https://pdf2zh-next.com/getting-started/USAGE.html) - [Advanced](https://pdf2zh-next.com/advanced/ADVANCED.html) - [Supported Languages](https://pdf2zh-next.com/advanced/SUPPORTED_LANGUAGES.html) - [Community](https://pdf2zh-next.com/community/COMMUNITY.html) - [FAQ](https://pdf2zh-next.com/community/FAQ.html) ## Overview **pdf2zh** is a powerful PDF translation tool designed to help users translate PDF documents between different languages. It supports multiple translation engines and provides a user-friendly interface for both command-line and web-based usage. ### Key Features - **Multi-engine Support**: Supports Google Translate, DeepL, OpenAI, and more. - **Batch Translation**: Translate multiple PDF files at once. - **Format Preservation**: Maintains the original layout and formatting of the PDF. - **Customizable Output**: Choose output language and translation engine. - **Open Source**: Free to use and modify under the MIT license. ## Quick Start To get started with **pdf2zh**, follow these steps: 1. **Installation**: Install the tool using pip or Docker. 2. **Configuration**: Set up your preferred translation engine and API keys. 3. **Usage**: Use the command line or web interface to translate your PDFs. For detailed instructions, see the [Installation](https://pdf2zh-next.com/getting-started/INSTALLATION.html) and [Usage](https://pdf2zh-next.com/getting-started/USAGE.html) guides. ## Support If you encounter any issues or have questions, please check the [FAQ](https://pdf2zh-next.com/community/FAQ.html) or submit an issue on [GitHub](https://github.com/your-repo/issues). We welcome contributions! If you'd like to help improve **pdf2zh**, see the [For Translators](https://pdf2zh-next.com/community/FOR_TRANSLATORS.html) guide. --- **Version**: 2.0.0 **License**: MIT **Source Code**: [GitHub Repository](https://github.com/your-repo/pdf2zh) --- ### OUTPUT # Documentation de pdf2zh Bienvenue dans la documentation de **pdf2zh** ! Ce guide vous aidera à commencer à utiliser **pdf2zh** pour traduire des documents PDF. ## Table des matières - [Installation](https://pdf2zh-next.com/getting-started/INSTALLATION.html) - [Utilisation](https://pdf2zh-next.com/getting-started/USAGE.html) - [Options avancées](https://pdf2zh-next.com/advanced/ADVANCED.html) - [Langues supportées](https://pdf2zh-next.com/advanced/SUPPORTED_LANGUAGES.html) - [Communauté](https://pdf2zh-next.com/community/COMMUNITY.html) - [FAQ](https://pdf2zh-next.com/community/FAQ.html) ## Aperçu **pdf2zh** est un outil de traduction PDF puissant conçu pour aider les utilisateurs à traduire des documents PDF entre différentes langues. Il supporte plusieurs moteurs de traduction et fournit une interface conviviale pour une utilisation en ligne de commande et basée sur le web. ### Fonctionnalités clés - **Support multi-moteurs** : Supporte Google Translate, DeepL, OpenAI, et plus encore. - **Traduction par lots** : Traduisez plusieurs fichiers PDF à la fois. - **Préservation du format** : Maintient la mise en page et le formatage originaux du PDF. - **Sortie personnalisable** : Choisissez la langue de sortie et le moteur de traduction. - **Open Source** : Gratuit à utiliser et modifier sous la licence MIT. ## Démarrage rapide Pour commencer avec **pdf2zh**, suivez ces étapes : 1. **Installation** : Installez l'outil en utilisant pip ou Docker. 2. **Configuration** : Configurez votre moteur de traduction préféré et vos clés API. 3. **Utilisation** : Utilisez la ligne de commande ou l'interface web pour traduire vos PDF. Pour des instructions détaillées, consultez les guides [Installation](https://pdf2zh-next.com/getting-started/INSTALLATION.html) et [Utilisation](https://pdf2zh-next.com/getting-started/USAGE.html). ## Support Si vous rencontrez des problèmes ou avez des questions, veuillez consulter la [FAQ](https://pdf2zh-next.com/community/FAQ.html) ou soumettre un problème sur [GitHub](https://github.com/your-repo/issues). Nous accueillons les contributions ! Si vous souhaitez aider à améliorer **pdf2zh**, consultez le guide [Guide de contribution des traductions](https://pdf2zh-next.com/community/FOR_TRANSLATORS.html). --- **Version** : 2.0.0 **Licence** : MIT **Code Source** : [Dépôt GitHub](https://github.com/your-repo/pdf2zh) ---
it: - `google` (free version) - `baidu` (free version) - `youdao` (free version) - `caiyun` (free version) Please use the [recommended engines](#recommended-engines) instead. ### Recommended Engines The following engines are recommended for use: - `google` (paid version): Stable and high-quality translations. - `deepseek`: Free and high-quality translations. - `openai`: High-quality translations but requires an API key. - `azure`: Stable and reliable. - `deepl`: High-quality translations. - `aliyun`: Stable and reliable. - `tencent`: Stable and reliable. - `volcengine`: Stable and reliable. - `niutrans`: Stable and reliable. ### Other Engines The following engines are available but may not be as stable or provide as high quality translations: - `chatgpt` (free version): May be unstable and has usage limitations. - `gemini` (free version): May be unstable and has usage limitations. - `hunyuan` (free version): May be unstable and has usage limitations. - `minimax` (free version): May be unstable and has usage limitations. - `step` (free version): May be unstable and has usage limitations. - `iflyrec` (free version): May be unstable and has usage limitations. - `iflytekSpark` (free version): May be unstable and has usage limitations. - `baiduWenxin` (free version): May be unstable and has usage limitations. - `zhipu` (free version): May be unstable and has usage limitations. - `moonshot` (free version): May be unstable and has usage limitations. - `zeroOneAI` (free version): May be unstable and has usage limitations. - `grok` (free version): May be unstable and has usage limitations. - `coze` (free version): May be unstable and has usage limitations. - `doubao` (free version): May be unstable and has usage limitations. - `mistral` (free version): May be unstable and has usage limitations. - `anthropic` (free version): May be unstable and has usage limitations. - `ollama`: Local deployment solution that requires manual model deployment and may have performance issues. - `local`: Local models require manual deployment and may have performance issues. --- I seguenti motori di traduzione sono stati **deprecati** e non saranno più mantenuti o supportati: - `google` (versione gratuita) - `baidu` (versione gratuita) - `youdao` (versione gratuita) - `caiyun` (versione gratuita) Si prega di utilizzare invece i [motori consigliati](#motori-consigliati). ### Motori consigliati I seguenti motori sono consigliati per l'uso: - `google` (versione a pagamento): Traduzioni stabili e di alta qualità. - `deepseek`: Traduzioni gratuite e di alta qualità. - `openai`: Traduzioni di alta qualità ma richiede una chiave API. - `azure`: Stabile e affidabile. - `deepl`: Traduzioni di alta qualità. - `aliyun`: Stabile e affidabile. - `tencent`: Stabile e affidabile. - `volcengine`: Stabile e affidabile. - `niutrans`: Stabile e affidabile. ### Altri motori I seguenti motori sono disponibili ma potrebbero non essere così stabili o fornire traduzioni di qualità elevata: - `chatgpt` (versione gratuita): Potrebbe essere instabile e ha limitazioni d'uso. - `gemini` (versione gratuita): Potrebbe essere instabile e ha limitazioni d'uso. - `hunyuan` (versione gratuita): Potrebbe essere instabile e ha limitazioni d'uso. - `minimax` (versione gratuita): Potrebbe essere instabile e ha limitazioni d'uso. - `step` (versione gratuita): Potrebbe essere instabile e ha limitazioni d'uso. - `iflyrec` (versione gratuita): Potrebbe essere instabile e ha limitazioni d'uso. - `iflytekSpark` (versione gratuita): Potrebbe essere instabile e ha limitazioni d'uso. - `baiduWenxin` (versione gratuita): Potrebbe essere instabile e ha limitazioni d'uso. - `zhipu` (versione gratuita): Potrebbe essere instabile e ha limitazioni d'uso. - `moonshot` (versione gratuita): Potrebbe essere instabile e ha limitazioni d'uso. - `zeroOneAI` (versione gratuita): Potrebbe essere instabile e ha limitazioni d'uso. - `grok` (versione gratuita): Potrebbe essere instabile e ha limitazioni d'uso. - `coze` (versione gratuita): Potrebbe essere instabile e ha limitazioni d'uso. - `doubao` (versione gratuita): Potrebbe essere instabile e ha limitazioni d'uso. - `mistral` (versione gratuita): Potrebbe essere instabile e ha limitazioni d'uso. - `anthropic` (versione gratuita): Potrebbe essere instabile e ha limitazioni d'uso. - `ollama`: Soluzione di deployment locale che richiede il deployment manuale del modello e potrebbe avere problemi di prestazioni. - `local`: I modelli locali richiedono il deployment manuale e potrebbero avere problemi di prestazioni.
pt: - **Google Translate Free API**: Google has shut down its free translation API, making it unavailable for public use. - **Bing Translator API**: Microsoft has discontinued the public API for Bing Translator. - **Yandex Translate Free API**: Yandex has discontinued its free translation API. - **MyMemory**: The quality of translations from MyMemory is often poor due to reliance on user-contributed translations. --- ### OUTPUT LANGUAGE pt --- ### OUTPUT Os seguintes motores de tradução foram **descontinuados** e não serão mais mantidos ou suportados: - **Google Translate Free API**: O Google encerrou sua API de tradução gratuita, tornando-a indisponível para uso público. - **Bing Translator API**: A Microsoft descontinuou a API pública para o Bing Translator. - **Yandex Translate Free API**: O Yandex descontinuou sua API de tradução gratuita. - **MyMemory**: A qualidade das traduções do MyMemory é frequentemente ruim devido à dependência de traduções contribuídas por usuários.
ru: - **`gpt-3.5-turbo`** and **`gpt-4`**: These engines are deprecated and will be removed in version 0.9.0. Please use **`gpt-3.5-turbo-instruct`** or **`gpt-4-0125-preview`** instead. > [!WARNING] > The following engines will be removed in version 0.9.0. Please switch to the new engines as soon as possible. --- ### OUTPUT Следующие движки перевода **устарели** и больше не будут поддерживаться: - **`gpt-3.5-turbo`** и **`gpt-4`**: Эти движки устарели и будут удалены в версии 0.9.0. Пожалуйста, используйте **`gpt-3.5-turbo-instruct`** или **`gpt-4-0125-preview`** вместо них. > [!WARNING] > Следующие движки будут удалены в версии 0.9.0. Пожалуйста, перейдите на новые движки как можно скорее.

# chunk_2ADE6979
source: 1. Bing 2. Google
de: 3. DeepL 4. OpenAI 5. Azure 6. Claude 7. Google Cloud 8. Aliyun 9. Yandex 10. Baidu 11. Tencent 12. Youdao 13. Sogou 14. Niutrans 15. Caiyun 16. Huoshan 17. OpenAI API 18. Anthropic API 19. Google Cloud API 20. Azure API 21. Aliyun API 22. Yandex API 23. Baidu API 24. Tencent API 25. Youdao API 26. Sogou API 27. Niutrans API 28. Caiyun API 29. Huoshan API 30. DeepL API 31. Bing API --- ### TRANSLATION RESULT 1. Bing 2. Google 3. DeepL 4. OpenAI 5. Azure 6. Claude 7. Google Cloud 8. Aliyun 9. Yandex 10. Baidu 11. Tencent 12. Youdao 13. Sogou 14. Niutrans 15. Caiyun 16. Huoshan 17. OpenAI API 18. Anthropic API 19. Google Cloud API 20. Azure API 21. Aliyun API 22. Yandex API 23. Baidu API 24. Tencent API 25. Youdao API 26. Sogou API 27. Niutrans API 28. Caiyun API 29. Huoshan API 30. DeepL API 31. Bing API
fr: 3. OpenAI 4. DeepL 5. Gemini 6. Claude 7. Cohere --- ### OUTPUT 1. Bing 2. Google 3. OpenAI 4. DeepL 5. Gemini 6. Claude 7. Cohere
it: 3. Azure 4. Amazon 5. DeepL 6. Argos 7. Baidu 8. Tencent 9. Youdao 10. Aliyun 11. Volcengine 12. Sogou 13. Niutrans 14. DeepSeek 15. OpenAI 16. ChatGPT 17. Gemini 18. Hunyuan 19. Minimax 20. Step 21. Iflyrec 22. IflytekSpark 23. BaiduWenxin 24. Zhipu 25. Moonshot 26. zeroOneAI 27. Grok 28. Coze 29. Doubao 30. Mistral 31. Anthropic 32. Ollama 33. Local --- Now, I will translate the provided list of terms into Italian. Since these are proper names or specific terms, they should generally remain unchanged, but I will ensure they are presented correctly in the context. 1. Bing 2. Google 3. Azure 4. Amazon 5. DeepL 6. Argos 7. Baidu 8. Tencent 9. Youdao 10. Aliyun 11. Volcengine 12. Sogou 13. Niutrans 14. DeepSeek 15. OpenAI 16. ChatGPT 17. Gemini 18. Hunyuan 19. Minimax 20. Step 21. Iflyrec 22. IflytekSpark 23. BaiduWenxin 24. Zhipu 25. Moonshot 26. zeroOneAI 27. Grok 28. Coze 29. Doubao 30. Mistral 31. Anthropic 32. Ollama 33. Local Note: Since the bypass list includes terms that should remain unchanged, and the original text is a list of proper names, I have kept them as is.
pt: 3. Azure 4. DeepL 5. Baidu 6. Youdao 7. GPT 8. Ollama 9. OpenAI 10. Gemini 11. Claude 12. Qianfan 13. ZhiPu --- ### OUTPUT LANGUAGE pt --- ### OUTPUT 1. Bing 2. Google 3. Azure 4. DeepL 5. Baidu 6. Youdao 7. GPT 8. Ollama 9. OpenAI 10. Gemini 11. Claude 12. Qianfan 13. ZhiPu
ru: 3. Yandex 4. Naver 5. Baidu 6. DeepL 7. Tencent 8. Youdao 9. Sogou 10. Caiyun 11. Niutrans 12. M2M100 13. MarianMT 14. NLLB 15. SeamlessM4T 16. MyMemoryTranslator 17. AWS Translate 18. Azure Translate 19. OpenAI 20. DeepSeek 21. Ollama 22. Yi 23. Mistral 24. Groq 25. QianFan 26. ZhiPu 27. VolcEngine 28. Moonshot 29. Doubao 30. Aliyun 31. Hunyuan 32. Gemini --- ### OUTPUT

# chunk_0D65A508
source: [**Advanced**](./introduction.md) > **Language Code** _(current)_
de: [**Erweiterte Optionen**](./introduction.md) > **Sprachcode** _(aktuell)_
fr: [**Options avancées**](./introduction.md) > **Code de langue** _(actuel)_
it: [**Opzioni avanzate**](./introduction.md) > **Codice lingua** _(current)_
pt: [**Opções avançadas**](./introduction.md) > **Código do idioma** _(atual)_
ru: [**Расширенные параметры**](./introduction.md) > **Код языка** _(текущая)_

# chunk_C036D2E5
source: Source <https://developers.google.com/admin-sdk/directory/v1/languages?hl=zh-cn>, organized by GPT-4o.
de: Quelle <https://developers.google.com/admin-sdk/directory/v1/languages?hl=zh-cn>, organisiert von GPT-4o.
fr: Source <https://developers.google.com/admin-sdk/directory/v1/languages?hl=zh-cn>, organisé par GPT-4o.
it: Fonte <https://developers.google.com/admin-sdk/directory/v1/languages?hl=zh-cn>, organizzato da GPT-4o.
pt: Fonte <https://developers.google.com/admin-sdk/directory/v1/languages?hl=zh-cn>, organizado por GPT-4o.
ru: Источник <https://developers.google.com/admin-sdk/directory/v1/languages?hl=zh-cn>, организовано GPT-4o.

# chunk_89056507
source: | Label in Chinese | Label | `Language Code` | | --- | --- | --- | | 阿姆哈拉语 | Amharic | `am` |
de: | Bezeichnung auf Chinesisch | Bezeichnung | `Language Code` | | --- | --- | --- | | Amharisch | Amharic | `am` |
fr: | Libellé en chinois | Libellé | `Language Code` | | --- | --- | --- | | Amharique | Amharic | `am` |
it: | Etichetta in cinese | Etichetta | `Codice lingua` | | --- | --- | --- | | Amarico | Amharic | `am` |
pt: | Rótulo em português | Rótulo | `Código do idioma` | | --- | --- | --- | | Amárico | Amharic | `am` |
ru: | Надпись на китайском | Надпись | `Код языка` | | --- | --- | --- | | Амхарский | Amharic | `am` |

# chunk_434D3480
source: | 阿拉伯语 | Arabic | `ar` |
de: | Arabisch | Arabic | `ar` |
fr: | Arabe | Arabic | `ar` |
it: | Arabo | Arabic | `ar` |
pt: | Árabe | Arabic | `ar` |
ru: | Арабский | Arabic | `ar` |

# chunk_4E045D6E
source: | 巴斯克语 | Basque | `eu` |
de: | Baskisch | Basque | `eu` |
fr: | Basque | Basque | `eu` |
pt: | Basco | Basque | `eu` |
ru: | Баскский | Basque | `eu` |

# chunk_8BDA075A
source: | 孟加拉语 | Bengali | `bn` |
de: | Bengalisch | Bengali | `bn` |
fr: | Bengali | Bengali | `bn` |
it: | Bengalese | Bengali | `bn` |
pt: | Bengali | Bengali | `bn` |
ru: | Бенгальский | Bengali | `bn` |
