Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_EECBAE94
source: Progress event (example):
de: json { "type": "progress", "data": { "current": 1, "total": 10, "message": "Processing page 1 of 10" } } ``` Result event (example): ```json { "type": "result", "data": { "translatedText": "The translated text", "originalText": "The original text" } } ``` Error event (example): ```json { "type": "error", "data": { "message": "Error message", "code": "ERROR_CODE" } } ``` --- ### TRANSLATION RESULT Progress-Event (Beispiel): ```json { "type": "progress", "data": { "current": 1, "total": 10, "message": "Processing page 1 of 10" } } ``` Result-Event (Beispiel): ```json { "type": "result", "data": { "translatedText": "The translated text", "originalText": "The original text" } } ``` Error-Event (Beispiel): ```json { "type": "error", "data": { "message": "Error message", "code": "ERROR_CODE" } }
fr: The `progress` event is emitted during the translation process to provide updates on the current progress. The event object contains the following properties: - `type`: Always `"progress"` - `current`: The current page being processed (number) - `total`: The total number of pages (number) - `percentage`: The completion percentage (number between 0 and 100) Example event object: ```json { "type": "progress", "current": 5, "total": 20, "percentage": 25 } ``` You can listen for this event using the `on` method: ```javascript translator.on('progress', (event) => { console.log(`Processing page ${event.current} of ${event.total} (${event.percentage}%)`); }); ``` --- ### OUTPUT LANGUAGE fr --- ### OUTPUT Événement de progression (exemple) : L'événement `progress` est émis pendant le processus de traduction pour fournir des mises à jour sur la progression actuelle. L'objet d'événement contient les propriétés suivantes : - `type` : Toujours `"progress"` - `current` : La page en cours de traitement (nombre) - `total` : Le nombre total de pages (nombre) - `percentage` : Le pourcentage d'avancement (nombre entre 0 et 100) Exemple d'objet d'événement : ```json { "type": "progress", "current": 5, "total": 20, "percentage": 25 } ``` Vous pouvez écouter cet événement en utilisant la méthode `on` : ```javascript translator.on('progress', (event) => { console.log(`Traitement de la page ${event.current} sur ${event.total} (${event.percentage}%)`); }); ```
it: This event is emitted multiple times during the translation process to indicate progress. ```json { "event": "progress", "data": { "progress": 50, "message": "Processing page 10 of 20" } } ``` - `progress`: The progress percentage (0-100) - `message`: A human-readable message describing the current progress --- Let's get started. --- ### TRANSLATION RESULT Evento di avanzamento (esempio): Questo evento viene emesso più volte durante il processo di traduzione per indicare l'avanzamento. ```json { "event": "progress", "data": { "progress": 50, "message": "Processing page 10 of 20" } } ``` - `progress`: La percentuale di avanzamento (0-100) - `message`: Un messaggio leggibile che descrive l'avanzamento corrente - ### Notes & Best Practices: - **Qualità della traduzione**: Sebbene il servizio fornisca traduzioni di alta qualità, è importante rivedere le traduzioni critiche, specialmente per uso professionale o accademico. - **Dimensione del file**: I file di grandi dimensioni potrebbero richiedere più tempo per essere elaborati. Considera di suddividere documenti molto grandi in parti più piccole. - **Formattazione**: Alcune formattazioni complesse potrebbero non essere preservate perfettamente. I documenti semplici e basati su testo si traducono al meglio. - **Privacy**: Sii consapevole delle informazioni sensibili. Sebbene il servizio sia sicuro, evita di tradurre documenti altamente riservati attraverso qualsiasi servizio online. - **Lingue supportate**: Controlla l'elenco delle lingue supportate prima di elaborare i tuoi documenti. - ### Cancellazione: della traduzione Se desideri annullare un'attività di traduzione, puoi farlo in due modi: 1. **Annulla prima che la traduzione inizi**: - Se l'attività di traduzione non è ancora iniziata, puoi fare clic sul pulsante "Annulla" nell'elenco delle attività per annullarla. 2. **Annulla durante il processo di traduzione**: - Se l'attività di traduzione è già iniziata, puoi fare clic sul pulsante "Annulla" nell'elenco delle attività per fermare la traduzione. Tuttavia, nota che l'annullamento potrebbe non essere immediato, poiché il sistema ha bisogno di un po' di tempo per elaborare la richiesta di annullamento. Dopo l'annullamento, l'attività verrà rimossa dall'elenco delle attività e il contenuto tradotto non verrà salvato. --- Iniziamo. - ### Esempio di utilizzo minimo (Async): {#esempio-di-utilizzo-minimo-async} ```python import asyncio from pdf2zh import pdf2zh_async async def main(): pdf_path = "example.pdf" output_path = "example_translated.pdf" # Inizializza il motore di traduzione engine = await pdf2zh_async() # Traduci il PDF await engine.translate(pdf_path, output_path) asyncio.run(main()) ``` ### Esempio di utilizzo minimo (Sincrono) {#esempio-di-utilizzo-minimo-sincrono} ```python from pdf2zh import pdf2zh def main(): pdf_path = "example.pdf" output_path = "example_translated.pdf" # Inizializza il motore di traduzione engine = pdf2zh() # Traduci il PDF engine.translate(pdf_path, output_path) if __name__ == "__main__": main() ``` ### Configurazione di base {#configurazione-di-base} ```python from pdf2zh import pdf2zh # Inizializza con configurazione engine = pdf2zh( target_lang="it", # Lingua di destinazione (codice ISO 639-1) translation_service="google", # Servizio di traduzione enable_glossary=True, # Abilita la funzione glossario enable_ocr=True, # Abilita OCR per PDF scannerizzati output_format="text", # Formato di output: "text" o "pdf" preserve_layout=True # Mantieni il layout originale nell'output PDF ) # Traduci PDF engine.translate("input.pdf", "output.pdf") ``` ### Configurazione avanzata {#configurazione-avanzata} ```python from pdf2zh import pdf2zh # Configurazione avanzata con impostazioni personalizzate engine = pdf2zh( target_lang="it", translation_service="google", # Impostazioni OCR ocr_engine="tesseract", # "tesseract" o "easyocr" ocr_lang="en", # Lingua sorgente per OCR # Impostazioni traduzione chunk_size=500, # Dimensione del blocco di testo per la traduzione max_retries=3, # Tentativi massimi di ripetizione per la traduzione # Impostazioni output output_format="pdf", preserve_layout=True, font_family="SimSun", # Font per il testo cinese in PDF # Impostazioni cache use_cache=True, # Abilita cache traduzioni cache_dir=".translation_cache" # Directory cache ) # Traduci con callback di avanzamento def progress_callback(current, total): print(f"Avanzamento: {current}/{total} pagine") engine.translate("input.pdf", "output.pdf", progress_callback=progress_callback) ``` ### Funzione di traduzione personalizzata {#funzione-di-traduzione-personalizzata} ```python from pdf2zh import pdf2zh # Definisci funzione di traduzione personalizzata def my_translator(text, source_lang="en", target_lang="it"): # La tua logica di traduzione personalizzata qui # Questo potrebbe chiamare un'API, usare un modello locale, ecc. translated_text = text.upper() # Esempio: converte in maiuscolo return translated_text # Inizializza con traduttore personalizzato engine = pdf2zh( target_lang="it", translation_service="custom", custom_translator=my_translator ) engine.translate("input.pdf", "output.pdf") ``` ### Elaborazione in batch {#elaborazione-in-batch} ```python from pdf2zh import pdf2zh engine = pdf2zh(target_lang="it") # Elabora in batch più file files = [ ("doc1.pdf", "doc1_it.pdf"), ("doc2.pdf", "doc2_it.pdf"), ("doc3.pdf", "doc3_it.pdf") ] for input_file, output_file in files: try: engine.translate(input_file, output_file) print(f"Tradotto con successo {input_file}") except Exception as e: print(f"Errore nella traduzione di {input_file}: {e}") ``` ### Gestione degli errori {#gestione-degli-errori} ```python from pdf2zh import pdf2zh import logging # Configura il logging logging.basicConfig(level=logging.INFO) engine = pdf2zh(target_lang="it") try: engine.translate("input.pdf", "output.pdf") except FileNotFoundError: print("File di input non trovato") except PermissionError: print("Permesso negato per le operazioni sui file") except Exception as e: print(f"Errore imprevisto: {e}") ``` ### Utilizzo dei context manager {#utilizzo-dei-context-manager} ```python from pdf2zh import pdf2zh # Utilizzo del context manager per la pulizia automatica delle risorse with pdf2zh(target_lang="it") as engine: engine.translate("input.pdf", "output.pdf") # Le risorse del motore vengono rilasciate automaticamente qui ``` ---
pt: json { "type": "progress", "data": { "progress": 0.5, "message": "Processing page 10 of 20" } } ``` --- ### OUTPUT LANGUAGE pt --- ### OUTPUT Evento de progresso (exemplo): ```json { "type": "progress", "data": { "progress": 0.5, "message": "Processando página 10 de 20" } }
ru: When the translation progress reaches 50%, an event with the following structure will be emitted: ```json { "type": "translation_progress", "data": { "jobId": "123e4567-e89b-12d3-a456-426614174000", "progress": 50, "message": "Processing page 10 of 20" }, "timestamp": "2023-01-01T00:00:01.000Z" } ``` --- ### TRANSLATION RESULT Событие прогресса (пример): Когда прогресс перевода достигает 50 %, будет сгенерировано событие со следующей структурой: ```json { "type": "translation_progress", "data": { "jobId": "123e4567-e89b-12d3-a456-426614174000", "progress": 50, "message": "Processing page 10 of 20" }, "timestamp": "2023-01-01T00:00:01.000Z" } ``` - ### Контракт потока событий В этом документе описывается контракт для потока событий, используемого приложением. Он предназначен для разработчиков, которые хотят потреблять поток событий напрямую или интегрироваться с ним. --- ### Типы событий Приложение генерирует следующие типы событий: - **`translation_started`**: Генерируется при запуске задания на перевод. - **`translation_progress`**: Периодически генерируется для отчета о прогрессе перевода. - **`translation_completed`**: Генерируется при успешном завершении задания на перевод. - **`translation_failed`**: Генерируется при сбое задания на перевод. - **`translation_cancelled`**: Генерируется, когда пользователь отменяет задание на перевод. --- ### Структура данных события Каждое событие представляет собой объект JSON со следующей структурой: ```json { "type": "event_type", "data": { // Данные, специфичные для события }, "timestamp": "2023-01-01T00:00:00.000Z" } ``` --- ### Подробности событий #### `translation_started` Генерируется при запуске задания на перевод. **Данные:** - `jobId` (string): Уникальный идентификатор задания на перевод. - `fileName` (string): Имя переводимого файла. **Пример:** ```json { "type": "translation_started", "data": { "jobId": "123e4567-e89b-12d3-a456-426614174000", "fileName": "document.pdf" }, "timestamp": "2023-01-01T00:00:00.000Z" } ``` #### `translation_progress` Периодически генерируется для отчета о прогрессе перевода. **Данные:** - `jobId` (string): Уникальный идентификатор задания на перевод. - `progress` (number): Процент выполнения (0-100). - `message` (string): Необязательное сообщение о прогрессе. **Пример:** ```json { "type": "translation_progress", "data": { "jobId": "123e4567-e89b-12d3-a456-426614174000", "progress": 50, "message": "Processing page 10 of 20" }, "timestamp": "2023-01-01T00:00:01.000Z" } ``` #### `translation_completed` Генерируется при успешном завершении задания на перевод. **Данные:** - `jobId` (string): Уникальный идентификатор задания на перевод. - `fileName` (string): Имя переведенного файла. - `outputPath` (string): Путь к переведенному файлу. **Пример:** ```json { "type": "translation_completed", "data": { "jobId": "123e4567-e89b-12d3-a456-426614174000", "fileName": "document.pdf", "outputPath": "/path/to/translated/document_zh.pdf" }, "timestamp": "2023-01-01T00:00:02.000Z" } ``` #### `translation_failed` Генерируется при сбое задания на перевод. **Данные:** - `jobId` (string): Уникальный идентификатор задания на перевод. - `fileName` (string): Имя файла, который не удалось перевести. - `error` (string): Сообщение об ошибке. **Пример:** ```json { "type": "translation_failed", "data": { "jobId": "123e4567-e89b-12d3-a456-426614174000", "fileName": "document.pdf", "error": "Failed to extract text from PDF" }, "timestamp": "2023-01-01T00:00:03.000Z" } ``` #### `translation_cancelled` Генерируется, когда пользователь отменяет задание на перевод. **Данные:** - `jobId` (string): Уникальный идентификатор задания на перевод. - `fileName` (string): Имя файла, который переводился. **Пример:** ```json { "type": "translation_cancelled", "data": { "jobId": "123e4567-e89b-12d3-a456-426614174000", "fileName": "document.pdf" }, "timestamp": "2023-01-01T00:00:04.000Z" } ``` --- ### Потребление потока событий Поток событий доступен по адресу `/api/events` при запущенном приложении. События отправляются как события, отправляемые сервером (SSE). **Пример на JavaScript:** ```javascript const eventSource = new EventSource('/api/events'); eventSource.onmessage = (event) => { const data = JSON.parse(event.data); console.log('Received event:', data); }; eventSource.onerror = (error) => { console.error('EventSource failed:', error); }; ``` --- ### Примечания - События генерируются в реальном времени по мере выполнения заданий на перевод. - Поток событий может содержать события из нескольких параллельных заданий на перевод. - Клиенты должны фильтровать события по `jobId`, если они интересуются конкретными заданиями. - Соединение с потоком событий может быть автоматически восстановлено при разрыве. - ### Минимальный пример использования (асинхронный) {#minimal-usage-example-async} ```python import asyncio from pdf2zh import pdf2zh async def main(): result = await pdf2zh( "input.pdf", "output.pdf", # Вы также можете использовать `target_lang_code` для указания целевого языка target_lang_code="ru", ) print(result) asyncio.run(main()) ``` ### Минимальный пример использования (синхронный) {#minimal-usage-example-sync} ```python from pdf2zh import pdf2zh_sync result = pdf2zh_sync( "input.pdf", "output.pdf", target_lang_code="ru", ) print(result) ``` ### Минимальный пример использования (CLI) {#minimal-usage-example-cli} ```bash pdf2zh input.pdf output.pdf --target-lang-code ru ``` --- ### ПЕРЕВОД - ### Отмена: Если вы отмените подписку, у вас по-прежнему будет доступ к функциям оплаченного тарифного плана до конца расчетного периода. Мы не предоставляем возмещение за отмену подписок. --- ### РЕЗУЛЬТАТ ПЕРЕВОДА - ### Примечания и рекомендации: - **Используйте с осторожностью**: Будьте осторожны при использовании этой функции, особенно если документ содержит конфиденциальную информацию. - **Сначала протестируйте**: Всегда сначала тестируйте функцию на некритичном документе, чтобы убедиться, что она соответствует вашим ожиданиям. - **Резервное копирование документов**: Сохраняйте резервные копии оригинальных документов перед обработкой. - **Проверьте результаты**: После обработки проверьте документ, чтобы убедиться в точности перевода и сохранении форматирования. --- ### ЯЗЫК ВЫВОДА ru --- ### СПИСОК ИСКЛЮЧЕНИЙ - pdf2zh - PDFMathTranslate - --- --- ### ОРИГИНАЛЬНЫЙ ТЕКСТ Событие прогресса (пример): Когда прогресс перевода достигает 50 %, будет сгенерировано событие со следующей структурой: ```json { "type": "translation_progress", "data": { "jobId": "123e4567-e89b-12d3-a456-426614174000", "progress": 50, "message": "Обработка страницы 10 из 20" }, "timestamp": "2023-01-01T00:00:01.000Z" } ``` --- ### РЕЗУЛЬТАТ ПЕРЕВОДА Событие прогресса (пример): Когда прогресс перевода достигает 50 %, будет сгенерировано событие со следующей структурой: ```json { "type": "translation_progress", "data": { "jobId": "123e4567-e89b-12d3-a456-426614174000", "progress": 50, "message": "Обработка страницы 10 из 20" }, "timestamp": "2023-01-01T00:00:01.000Z" } ```

# chunk_C6F45B63
source: Finish event (example):
de: When a user finishes an operation, such as completing a form or finishing a download, you can trigger a finish event. ```js // Trigger a finish event trigger(document.getElementById('myElement'), 'finish'); // Listen for a finish event listen(document.getElementById('myElement'), 'finish', () => { console.log('Operation finished!'); }); ``` --- ### TRANSLATION RESULT Abschlussereignis (Beispiel): Wenn ein Benutzer einen Vorgang abschließt, wie das Ausfüllen eines Formulars oder den Abschluss eines Downloads, können Sie ein Abschlussereignis auslösen. ```js // Ein Abschlussereignis auslösen trigger(document.getElementById('myElement'), 'finish'); // Auf ein Abschlussereignis hören listen(document.getElementById('myElement'), 'finish', () => { console.log('Operation finished!'); }); ```
fr: This event is emitted when the translation process is complete. ### Event Data - `total_pages`: The total number of pages processed. - `successful_pages`: The number of pages successfully translated. - `failed_pages`: The number of pages that failed to translate. - `output_file`: The path to the output file. - `translation_time`: The total time taken for the translation process (in seconds). ### Example ```json { "event_type": "finish", "timestamp": "2023-10-05T14:48:00.000Z", "data": { "total_pages": 100, "successful_pages": 95, "failed_pages": 5, "output_file": "/path/to/output.pdf", "translation_time": 120.5 } } ``` ### Notes - This event is emitted regardless of whether the translation was successful or not. - If the translation process is interrupted, this event may not be emitted. --- ### OUTPUT LANGUAGE fr --- ### OUTPUT Événement de fin (exemple) : Cet événement est émis lorsque le processus de traduction est terminé. ### Données de l'événement - `total_pages` : Le nombre total de pages traitées. - `successful_pages` : Le nombre de pages traduites avec succès. - `failed_pages` : Le nombre de pages dont la traduction a échoué. - `output_file` : Le chemin vers le fichier de sortie. - `translation_time` : Le temps total pris pour le processus de traduction (en secondes). ### Exemple ```json { "event_type": "finish", "timestamp": "2023-10-05T14:48:00.000Z", "data": { "total_pages": 100, "successful_pages": 95, "failed_pages": 5, "output_file": "/path/to/output.pdf", "translation_time": 120.5 } } ``` ### Notes - Cet événement est émis que la traduction ait réussi ou non. - Si le processus de traduction est interrompu, cet événement peut ne pas être émis.
it: This event is sent when the translation process is completed successfully. ```json { "event": "finish", "data": { "message": "Translation completed successfully", "filePath": "/path/to/translated/file.pdf", "pagesTranslated": 10, "timeTaken": "00:05:30" } } ``` --- ### TRANSLATION RESULT Evento di completamento (esempio): Questo evento viene inviato quando il processo di traduzione viene completato con successo. ```json { "event": "finish", "data": { "message": "Translation completed successfully", "filePath": "/path/to/translated/file.pdf", "pagesTranslated": 10, "timeTaken": "00:05:30" } } ```
pt: json { "id": "msg_1234567890", "object": "chat.completion", "created": 1700000000, "model": "gpt-4-turbo-preview", "choices": [ { "index": 0, "message": { "role": "assistant", "content": "Hello! How can I help you today?" }, "logprobs": null, "finish_reason": "stop" } ], "usage": { "prompt_tokens": 10, "completion_tokens": 20, "total_tokens": 30 }, "system_fingerprint": "fp_1234567890" } ``` --- ### OUTPUT LANGUAGE pt --- ### OUTPUT Evento de conclusão (exemplo): ```json { "id": "msg_1234567890", "object": "chat.completion", "created": 1700000000, "model": "gpt-4-turbo-preview", "choices": [ { "index": 0, "message": { "role": "assistant", "content": "Olá! Como posso ajudá-lo hoje?" }, "logprobs": null, "finish_reason": "stop" } ], "usage": { "prompt_tokens": 10, "completion_tokens": 20, "total_tokens": 30 }, "system_fingerprint": "fp_1234567890" }
ru: The finish event is emitted when the readable stream has been consumed and all data has been flushed. This event is emitted only once. ```javascript const { Readable } = require('stream'); const readable = Readable.from(['hello', 'world']); readable.on('finish', () => { console.log('Stream finished'); }); readable.resume(); // Consume the stream ``` --- ### TRANSLATION RESULT Событие завершения (пример): Событие `finish` генерируется, когда читаемый поток потреблен и все данные сброшены. Это событие генерируется только один раз. ```javascript const { Readable } = require('stream'); const readable = Readable.from(['hello', 'world']); readable.on('finish', () => { console.log('Stream finished'); }); readable.resume(); // Потребляем поток ```
