Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_F01ADA4A
source: | `--no-mono` | Do not output monolingual PDF files | `pdf2zh_next example.pdf --no-mono` |
de: | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--no-bilingual` | Do not output bilingual PDF files | `pdf2zh_next example.pdf --no-bilingual` | | `--no-tex` | Do not output LaTeX files | `pdf2zh_next example.pdf --no-tex` | --- ### OUTPUT | `--no-mono` | Einsprachige PDF-Dateien nicht ausgeben | `pdf2zh_next example.pdf --no-mono` | | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--no-bilingual` | Zweisprachige PDF-Dateien nicht ausgeben | `pdf2zh_next example.pdf --no-bilingual` | | `--no-tex` | LaTeX-Dateien nicht ausgeben | `pdf2zh_next example.pdf --no-tex` |
fr: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--no-trans` | Do not output translated PDF files | `pdf2zh_next example.pdf --no-trans` | | `--no-ocr` | Do not output OCRed PDF files | `pdf2zh_next example.pdf --no-ocr` | | `--no-pdf` | Do not output any PDF files. This option is useful when you only need the text output. | `pdf2zh_next example.pdf --no-pdf` | | `--ocr-only` | Only run the OCR process. This option implies `--no-trans` and `--no-mono`. | `pdf2zh_next example.pdf --ocr-only` | | `--trans-only` | Only run the translation process. This option implies `--no-ocr` and `--no-mono`. | `pdf2zh_next example.pdf --trans-only` | | `--mono-only` | Only run the monolingual PDF generation process. This option implies `--no-ocr` and `--no-trans`. | `pdf2zh_next example.pdf --mono-only` | --- ### TRANSLATION RESULT | `--no-mono` | Ne pas générer de fichiers PDF monolingues | `pdf2zh_next example.pdf --no-mono` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--no-trans` | Ne pas générer de fichiers PDF traduits | `pdf2zh_next example.pdf --no-trans` | | `--no-ocr` | Ne pas générer de fichiers PDF OCRisés | `pdf2zh_next example.pdf --no-ocr` | | `--no-pdf` | Ne générer aucun fichier PDF. Cette option est utile lorsque vous n'avez besoin que de la sortie texte. | `pdf2zh_next example.pdf --no-pdf` | | `--ocr-only` | Exécuter uniquement le processus OCR. Cette option implique `--no-trans` et `--no-mono`. | `pdf2zh_next example.pdf --ocr-only` | | `--trans-only` | Exécuter uniquement le processus de traduction. Cette option implique `--no-ocr` et `--no-mono`. | `pdf2zh_next example.pdf --trans-only` | | `--mono-only` | Exécuter uniquement le processus de génération de PDF monolingue. Cette option implique `--no-ocr` et `--no-trans`. | `pdf2zh_next example.pdf --mono-only` |
it: --- ### TRANSLATION LANGUAGE it
pt: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `-f`, `--force` | Force overwrite existing files | `pdf2zh_next example.pdf -f` | | `-r`, `--reuse` | Reuse existing translated files | `pdf2zh_next example.pdf -r` | | `-l`, `--language` | Target language, default is `zh` | `pdf2zh_next example.pdf -l en` | | `-s`, `--service` | Translation service, default is `google` | `pdf2zh_next example.pdf -s deepl` | | `-c`, `--concurrency` | Max concurrency, default is `4` | `pdf2zh_next example.pdf -c 8` | | `-d`, `--delay` | Delay between requests in seconds, default is `0.1` | `pdf2zh_next example.pdf -d 0.5` | | `-p`, `--proxy` | Proxy URL, e.g. `http://127.0.0.1:7890` | `pdf2zh_next example.pdf -p http://127.0.0.1:7890` | | `--api-key` | API key for the translation service | `pdf2zh_next example.pdf --api-key your_api_key` | | `--custom-endpoint` | Custom endpoint for the translation service | `pdf2zh_next example.pdf --custom-endpoint https://your-custom-endpoint.com` | | `--custom-model` | Custom model for the translation service, e.g. `gpt-4` | `pdf2zh_next example.pdf --custom-model gpt-4` | | `--custom-role` | Custom role for the translation service, e.g. `You are a helpful assistant` | `pdf2zh_next example.pdf --custom-role "You are a helpful assistant"` | | `--custom-template` | Custom template for the translation service, e.g. `Translate the following text: {text}` | `pdf2zh_next example.pdf --custom-template "Translate the following text: {text}"` | | `--custom-parameters` | Custom parameters for the translation service, e.g. `{"temperature": 0.7}` | `pdf2zh_next example.pdf --custom-parameters '{"temperature": 0.7}'` | | `--custom-request-parameters` | Custom request parameters for the translation service, e.g. `{"headers": {"Authorization": "Bearer ..."}}` | `pdf2zh_next example.pdf --custom-request-parameters '{"headers": {"Authorization": "Bearer ..."}}'` | --- ### OUTPUT | `--no-mono` | Não produzir ficheiros PDF monolingues | `pdf2zh_next example.pdf --no-mono` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `-f`, `--force` | Forçar a sobrescrever ficheiros existentes | `pdf2zh_next example.pdf -f` | | `-r`, `--reuse` | Reutilizar ficheiros traduzidos existentes | `pdf2zh_next example.pdf -r` | | `-l`, `--language` | Idioma de destino, o padrão é `zh` | `pdf2zh_next example.pdf -l en` | | `-s`, `--service` | Serviço de tradução, o padrão é `google` | `pdf2zh_next example.pdf -s deepl` | | `-c`, `--concurrency` | Concorrência máxima, o padrão é `4` | `pdf2zh_next example.pdf -c 8` | | `-d`, `--delay` | Atraso entre pedidos em segundos, o padrão é `0.1` | `pdf2zh_next example.pdf -d 0.5` | | `-p`, `--proxy` | URL do proxy, por exemplo `http://127.0.0.1:7890` | `pdf2zh_next example.pdf -p http://127.0.0.1:7890` | | `--api-key` | Chave de API para o serviço de tradução | `pdf2zh_next example.pdf --api-key your_api_key` | | `--custom-endpoint` | Endpoint personalizado para o serviço de tradução | `pdf2zh_next example.pdf --custom-endpoint https://your-custom-endpoint.com` | | `--custom-model` | Modelo personalizado para o serviço de tradução, por exemplo `gpt-4` | `pdf2zh_next example.pdf --custom-model gpt-4` | | `--custom-role` | Função personalizada para o serviço de tradução, por exemplo `You are a helpful assistant` | `pdf2zh_next example.pdf --custom-role "You are a helpful assistant"` | | `--custom-template` | Modelo personalizado para o serviço de tradução, por exemplo `Translate the following text: {text}` | `pdf2zh_next example.pdf --custom-template "Translate the following text: {text}"` | | `--custom-parameters` | Parâmetros personalizados para o serviço de tradução, por exemplo `{"temperature": 0.7}` | `pdf2zh_next example.pdf --custom-parameters '{"temperature": 0.7}'` | | `--custom-request-parameters` | Parâmetros de pedido personalizados para o serviço de tradução, por exemplo `{"headers": {"Authorization": "Bearer ..."}}` | `pdf2zh_next example.pdf --custom-request-parameters '{"headers": {"Authorization": "Bearer ..."}}'` |
ru: |---------------------------------|-----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------| | `--no-bilingual` | Do not output bilingual PDF files | `pdf2zh_next example.pdf --no-bilingual` | | `--no-ocr` | Do not perform OCR on the PDF file | `pdf2zh_next example.pdf --no-ocr` | | `--no-tex` | Do not output LaTeX files | `pdf2zh_next example.pdf --no-tex` | | `--no-pdf` | Do not output PDF files | `pdf2zh_next example.pdf --no-pdf` | | `--no-markdown` | Do not output Markdown files | `pdf2zh_next example.pdf --no-markdown` | | `--no-html` | Do not output HTML files | `pdf2zh_next example.pdf --no-html` | | `--no-json` | Do not output JSON files | `pdf2zh_next example.pdf --no-json` | | `--no-docx` | Do not output DOCX files | `pdf2zh_next example.pdf --no-docx` | | `--no-pptx` | Do not output PPTX files | `pdf2zh_next example.pdf --no-pptx` | | `--no-xlsx` | Do not output XLSX files | `pdf2zh_next example.pdf --no-xlsx` | | `--no-txt` | Do not output TXT files | `pdf2zh_next example.pdf --no-txt` | | `--no-csv` | Do not output CSV files | `pdf2zh_next example.pdf --no-csv` | | `--no-tsv` | Do not output TSV files | `pdf2zh_next example.pdf --no-tsv` | --- ### TRANSLATION RESULT | `--no-mono` | Не выводить односторонние PDF-файлы | `pdf2zh_next example.pdf --no-mono` | |---------------------------------|-----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------| | `--no-bilingual` | Не выводить двусторонние PDF-файлы | `pdf2zh_next example.pdf --no-bilingual` | | `--no-ocr` | Не выполнять OCR на PDF-файле | `pdf2zh_next example.pdf --no-ocr` | | `--no-tex` | Не выводить LaTeX-файлы | `pdf2zh_next example.pdf --no-tex` | | `--no-pdf` | Не выводить PDF-файлы | `pdf2zh_next example.pdf --no-pdf` | | `--no-markdown` | Не выводить Markdown-файлы | `pdf2zh_next example.pdf --no-markdown` | | `--no-html` | Не выводить HTML-файлы | `pdf2zh_next example.pdf --no-html` | | `--no-json` | Не выводить JSON-файлы | `pdf2zh_next example.pdf --no-json` | | `--no-docx` | Не выводить DOCX-файлы | `pdf2zh_next example.pdf --no-docx` | | `--no-pptx` | Не выводить PPTX-файлы | `pdf2zh_next example.pdf --no-pptx` | | `--no-xlsx` | Не выводить XLSX-файлы | `pdf2zh_next example.pdf --no-xlsx` | | `--no-txt` | Не выводить TXT-файлы | `pdf2zh_next example.pdf --no-txt` | | `--no-csv` | Не выводить CSV-файлы | `pdf2zh_next example.pdf --no-csv` | | `--no-tsv` | Не выводить TSV-файлы | `pdf2zh_next example.pdf --no-tsv` |

# chunk_CE4B67DB
source: | `--formular-font-pattern` | Font pattern to identify formula text | `pdf2zh_next example.pdf --formular-font-pattern "(MS.*)"` |
de: | `--formular-font-pattern` | Schriftmuster zur Identifizierung von Formeltext | `pdf2zh_next example.pdf --formular-font-pattern "(MS.*)"` |
fr: `string` | `null` | | `--formular-font-size` | Font size to identify formula text | `pdf2zh_next example.pdf --formular-font-size 10.5` | `float` | `null` | | `--formular-font-size-offset` | Font size offset to identify formula text | `pdf2zh_next example.pdf --formular-font-size-offset 0.5` | `float` | `null` | | `--formular-font-bold` | Whether to identify bold text as formula | `pdf2zh_next example.pdf --formular-font-bold` | `boolean`| `false` | | `--formular-font-italic` | Whether to identify italic text as formula | `pdf2zh_next example.pdf --formular-font-italic` | `boolean`| `false` | | `--formular-font-margin` | Margin to identify formula text | `pdf2zh_next example.pdf --formular-font-margin 0.5` | `float` | `null` | | `--formular-font-color` | Font color to identify formula text | `pdf2zh_next example.pdf --formular-font-color "#FF0000"` | `string` | `null` | | `--formular-font-color-offset` | Font color offset to identify formula text | `pdf2zh_next example.pdf --formular-font-color-offset 10` | `int` | `null` | | `--formular-font-family` | Font family to identify formula text | `pdf2zh_next example.pdf --formular-font-family "Times New Roman"` | `string` | `null` | --- ### TRANSLATION | `--formular-font-pattern` | Modèle de police pour identifier le texte de formule | `pdf2zh_next example.pdf --formular-font-pattern "(MS.*)"` | `string` | `null` | | `--formular-font-size` | Taille de police pour identifier le texte de formule | `pdf2zh_next example.pdf --formular-font-size 10.5` | `float` | `null` | | `--formular-font-size-offset` | Décalage de taille de police pour identifier le texte de formule | `pdf2zh_next example.pdf --formular-font-size-offset 0.5` | `float` | `null` | | `--formular-font-bold` | Indique si le texte en gras doit être identifié comme formule | `pdf2zh_next example.pdf --formular-font-bold` | `boolean`| `false` | | `--formular-font-italic` | Indique si le texte en italique doit être identifié comme formule | `pdf2zh_next example.pdf --formular-font-italic` | `boolean`| `false` | | `--formular-font-margin` | Marge pour identifier le texte de formule | `pdf2zh_next example.pdf --formular-font-margin 0.5` | `float` | `null` | | `--formular-font-color` | Couleur de police pour identifier le texte de formule | `pdf2zh_next example.pdf --formular-font-color "#FF0000"` | `string` | `null` | | `--formular-font-color-offset` | Décalage de couleur de police pour identifier le texte de formule | `pdf2zh_next example.pdf --formular-font-color-offset 10` | `int` | `null` | | `--formular-font-family` | Famille de police pour identifier le texte de formule | `pdf2zh_next example.pdf --formular-font-family "Times New Roman"` | `string` | `null` |
it: --- ### TRANSLATED TEXT | `--formular-font-pattern` | Pattern del font per identificare il testo della formula | `pdf2zh_next example.pdf --formular-font-pattern "(MS.*)"` |
pt: | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--formular-replace-font` | Font to replace formula text | `pdf2zh_next example.pdf --formular-replace-font "Times New Roman"` | | `--formular-replace-font-size` | Font size to replace formula text | `pdf2zh_next example.pdf --formular-replace-font-size 12` | | `--formular-replace-font-color` | Font color to replace formula text | `pdf2zh_next example.pdf --formular-replace-font-color "#000000"` | | `--formular-replace-font-bold` | Whether to bold formula text | `pdf2zh_next example.pdf --formular-replace-font-bold` | --- ### TRANSLATION RESULT | `--formular-font-pattern` | Padrão de fonte para identificar texto de fórmula | `pdf2zh_next example.pdf --formular-font-pattern "(MS.*)"` | | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--formular-replace-font` | Fonte para substituir o texto de fórmula | `pdf2zh_next example.pdf --formular-replace-font "Times New Roman"` | | `--formular-replace-font-size` | Tamanho da fonte para substituir o texto de fórmula | `pdf2zh_next example.pdf --formular-replace-font-size 12` | | `--formular-replace-font-color` | Cor da fonte para substituir o texto de fórmula | `pdf2zh_next example.pdf --formular-replace-font-color "#000000"` | | `--formular-replace-font-bold` | Se deve colocar o texto de fórmula em negrito | `pdf2zh_next example.pdf --formular-replace-font-bold` |
ru: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--formular-font-size-relative` | Relative size of formula text compared to normal text | `pdf2zh_next example.pdf --formular-font-size-relative 0.8` | | `--formular-merge-vertical` | Merge vertically adjacent formulas | `pdf2zh_next example.pdf --formular-merge-vertical` | | `--formular-merge-horizontal` | Merge horizontally adjacent formulas | `pdf2zh_next example.pdf --formular-merge-horizontal` | | `--formular-merge-max-distance` | Maximum distance for merging formulas (default: 1.0) | `pdf2zh_next example.pdf --formular-merge-max-distance 2.0` | | `--formular-merge-max-angle` | Maximum angle difference for merging formulas (default: 0.1) | `pdf2zh_next example.pdf --formular-merge-max-angle 0.2` | | `--formular-merge-same-font` | Only merge formulas with the same font | `pdf2zh_next example.pdf --formular-merge-same-font` | | `--formular-merge-same-size` | Only merge formulas with the same size | `pdf2zh_next example.pdf --formular-merge-same-size` | | `--formular-ocr-engine` | OCR engine for formula recognition (default: "mathpix") | `pdf2zh_next example.pdf --formular-ocr-engine paddle` | | `--formular-ocr-lang` | Language for formula OCR (default: "formula") | `pdf2zh_next example.pdf --formular-ocr-lang en` | | `--formular-ocr-format` | Output format for formula OCR (default: "latex") | `pdf2zh_next example.pdf --formular-ocr-format text` | | `--formular-ocr-mathpix-appid` | Mathpix App ID for formula OCR | `pdf2zh_next example.pdf --formular-ocr-mathpix-appid your_app_id` | | `--formular-ocr-mathpix-appkey` | Mathpix App Key for formula OCR | `pdf2zh_next example.pdf --formular-ocr-mathpix-appkey your_app_key` | | `--formular-ocr-paddle-model` | PaddleOCR model for formula recognition (default: "formula_rec") | `pdf2zh_next example.pdf --formular-ocr-paddle-model ch_ppocr_v3_rec` | | `--formular-ocr-paddle-lang` | PaddleOCR language for formula recognition (default: "ch") | `pdf2zh_next example.pdf --formular-ocr-paddle-lang en` | | `--formular-ocr-paddle-cpu` | Use CPU for PaddleOCR instead of GPU | `pdf2zh_next example.pdf --formular-ocr-paddle-cpu` | | `--formular-ocr-paddle-threads` | Number of threads for PaddleOCR (default: 4) | `pdf2zh_next example.pdf --formular-ocr-paddle-threads 8` | | `--formular-ocr-paddle-precision` | Precision mode for PaddleOCR (default: "fp32") | `pdf2zh_next example.pdf --formular-ocr-paddle-precision fp16` | | `--formular-ocr-paddle-layout` | Enable layout analysis for PaddleOCR | `pdf2zh_next example.pdf --formular-ocr-paddle-layout` | --- ### OUTPUT | `--formular-font-pattern` | Шаблон шрифта для идентификации текста формул | `pdf2zh_next example.pdf --formular-font-pattern "(MS.*)"` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--formular-font-size-relative` | Относительный размер текста формул по сравнению с обычным текстом | `pdf2zh_next example.pdf --formular-font-size-relative 0.8` | | `--formular-merge-vertical` | Объединять вертикально смежные формулы | `pdf2zh_next example.pdf --formular-merge-vertical` | | `--formular-merge-horizontal` | Объединять горизонтально смежные формулы | `pdf2zh_next example.pdf --formular-merge-horizontal` | | `--formular-merge-max-distance` | Максимальное расстояние для объединения формул (по умолчанию: 1.0) | `pdf2zh_next example.pdf --formular-merge-max-distance 2.0` | | `--formular-merge-max-angle` | Максимальная разница углов для объединения формул (по умолчанию: 0.1) | `pdf2zh_next example.pdf --formular-merge-max-angle 0.2` | | `--formular-merge-same-font` | Объединять только формулы с одинаковым шрифтом | `pdf2zh_next example.pdf --formular-merge-same-font` | | `--formular-merge-same-size` | Объединять только формулы с одинаковым размером | `pdf2zh_next example.pdf --formular-merge-same-size` | | `--formular-ocr-engine` | Движок OCR для распознавания формул (по умолчанию: "mathpix") | `pdf2zh_next example.pdf --formular-ocr-engine paddle` | | `--formular-ocr-lang` | Язык для OCR формул (по умолчанию: "formula") | `pdf2zh_next example.pdf --formular-ocr-lang en` | | `--formular-ocr-format` | Формат вывода для OCR формул (по умолчанию: "latex") | `pdf2zh_next example.pdf --formular-ocr-format text` | | `--formular-ocr-mathpix-appid` | Mathpix App ID для OCR формул | `pdf2zh_next example.pdf --formular-ocr-mathpix-appid your_app_id` | | `--formular-ocr-mathpix-appkey` | Mathpix App Key для OCR формул | `pdf2zh_next example.pdf --formular-ocr-mathpix-appkey your_app_key` | | `--formular-ocr-paddle-model` | Модель PaddleOCR для распознавания формул (по умолчанию: "formula_rec") | `pdf2zh_next example.pdf --formular-ocr-paddle-model ch_ppocr_v3_rec` | | `--formular-ocr-paddle-lang` | Язык PaddleOCR для распознавания формул (по умолчанию: "ch") | `pdf2zh_next example.pdf --formular-ocr-paddle-lang en` | | `--formular-ocr-paddle-cpu` | Использовать CPU для PaddleOCR вместо GPU | `pdf2zh_next example.pdf --formular-ocr-paddle-cpu` | | `--formular-ocr-paddle-threads` | Количество потоков для PaddleOCR (по умолчанию: 4) | `pdf2zh_next example.pdf --formular-ocr-paddle-threads 8` | | `--formular-ocr-paddle-precision` | Режим точности для PaddleOCR (по умолчанию: "fp32") | `pdf2zh_next example.pdf --formular-ocr-paddle-precision fp16` | | `--formular-ocr-paddle-layout` | Включить анализ макета для PaddleOCR | `pdf2zh_next example.pdf --formular-ocr-paddle-layout` |
