Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_B35D3C0C
source: | `--watermark-output-mode` | Watermark output mode for PDF files | `pdf2zh_next example.pdf --watermark-output-mode no_watermark` |
de: `no_watermark`, `watermark`, `only_watermark` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | --------------------------------------------- | --- ### RESPONSE | `--watermark-output-mode` | Wasserzeichen-Ausgabemodus für PDF-Dateien | `pdf2zh_next example.pdf --watermark-output-mode no_watermark` | `no_watermark`, `watermark`, `only_watermark` |
fr: `none` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | ------------------ | | `--watermark-text` | Watermark text | `pdf2zh_next example.pdf --watermark-text "Translated with PDFMathTranslate"` | `Translated with pdf2zh` | | `--watermark-font-family` | Watermark font family | `pdf2zh_next example.pdf --watermark-font-family "Times New Roman"` | `Arial` | | `--watermark-font-size` | Watermark font size | `pdf2zh_next example.pdf --watermark-font-size 20` | `20` | | `--watermark-color` | Watermark color in hex code | `pdf2zh_next example.pdf --watermark-color "#FF0000"` | `#000000` | | `--watermark-rotation` | Watermark rotation angle in degrees | `pdf2zh_next example.pdf --watermark-rotation 45` | `45` | | `--watermark-opacity` | Watermark opacity (0-1) | `pdf2zh_next example.pdf --watermark-opacity 0.5` | `0.2` | | `--watermark-spacing` | Spacing between watermark texts in points | `pdf2zh_next example.pdf --watermark-spacing 100` | `200` | | `--watermark-z-index` | Watermark layer position (higher values are on top) | `pdf2zh_next example.pdf --watermark-z-index 10` | `-1` | --- ### TRANSLATED TEXT | `--watermark-output-mode` | Mode de sortie du filigrane pour les fichiers PDF | `pdf2zh_next example.pdf --watermark-output-mode no_watermark` | `none` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | ------------------ | | `--watermark-text` | Texte du filigrane | `pdf2zh_next example.pdf --watermark-text "Translated with PDFMathTranslate"` | `Translated with pdf2zh` | | `--watermark-font-family` | Famille de police du filigrane | `pdf2zh_next example.pdf --watermark-font-family "Times New Roman"` | `Arial` | | `--watermark-font-size` | Taille de police du filigrane | `pdf2zh_next example.pdf --watermark-font-size 20` | `20` | | `--watermark-color` | Couleur du filigrane en code hexadécimal | `pdf2zh_next example.pdf --watermark-color "#FF0000"` | `#000000` | | `--watermark-rotation` | Angle de rotation du filigrane en degrés | `pdf2zh_next example.pdf --watermark-rotation 45` | `45` | | `--watermark-opacity` | Opacité du filigrane (0-1) | `pdf2zh_next example.pdf --watermark-opacity 0.5` | `0.2` | | `--watermark-spacing` | Espacement entre les textes du filigrane en points | `pdf2zh_next example.pdf --watermark-spacing 100` | `200` | | `--watermark-z-index` | Position de la couche du filigrane (les valeurs plus élevées sont au-dessus) | `pdf2zh_next example.pdf --watermark-z-index 10` | `-1` |
it: `no_watermark` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | ---------------------- | | `--watermark-text` | Custom watermark text | `pdf2zh_next example.pdf --watermark-text "Translated by PDFMathTranslate"` | `Translated by pdf2zh` | | `--watermark-font-family` | Font family for the watermark text | `pdf2zh_next example.pdf --watermark-font-family "Arial"` | `Times-Roman` | | `--watermark-font-size` | Font size for the watermark text | `pdf2zh_next example.pdf --watermark-font-size 24` | `48` | | `--watermark-color` | Color of the watermark text (in hex, e.g., #808080) | `pdf2zh_next example.pdf --watermark-color "#808080"` | `#D1D1D1` | | `--watermark-rotation` | Rotation angle of the watermark text | `pdf2zh_next example.pdf --watermark-rotation 45` | `45` | | `--watermark-opacity` | Opacity of the watermark text (0.0 to 1.0) | `pdf2zh_next example.pdf --watermark-opacity 0.5` | `0.2` | | `--watermark-density-horizontal`| Horizontal density of watermark placement (number of watermarks per horizontal unit) | `pdf2zh_next example.pdf --watermark-density-horizontal 2` | `2` | | `--watermark-density-vertical` | Vertical density of watermark placement (number of watermarks per vertical unit) | `pdf2zh_next example.pdf --watermark-density-vertical 2` | `2` | | `--watermark-position` | Position of the watermark on the page (e.g., "center", "top-left", "bottom-right", etc.)| `pdf2zh_next example.pdf --watermark-position "center"` | `center` | | `--watermark-page-range` | Page range to apply the watermark (e.g., "1-5,8,10-12") | `pdf2zh_next example.pdf --watermark-page-range "1-5,8,10-12"` | All pages | --- ### TRANSLATION | `--watermark-output-mode` | Modalità di output del watermark per i file PDF | `pdf2zh_next example.pdf --watermark-output-mode no_watermark` | `no_watermark` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | ---------------------- | | `--watermark-text` | Testo personalizzato del watermark | `pdf2zh_next example.pdf --watermark-text "Translated by PDFMathTranslate"` | `Translated by pdf2zh` | | `--watermark-font-family` | Famiglia di caratteri per il testo del watermark | `pdf2zh_next example.pdf --watermark-font-family "Arial"` | `Times-Roman` | | `--watermark-font-size` | Dimensione del carattere per il testo del watermark | `pdf2zh_next example.pdf --watermark-font-size 24` | `48` | | `--watermark-color` | Colore del testo del watermark (in esadecimale, ad esempio, #808080) | `pdf2zh_next example.pdf --watermark-color "#808080"` | `#D1D1D1` | | `--watermark-rotation` | Angolo di rotazione del testo del watermark | `pdf2zh_next example.pdf --watermark-rotation 45` | `45` | | `--watermark-opacity` | Opacità del testo del watermark (da 0.0 a 1.0) | `pdf2zh_next example.pdf --watermark-opacity 0.5` | `0.2` | | `--watermark-density-horizontal`| Densità orizzontale del posizionamento del watermark (numero di watermark per unità orizzontale) | `pdf2zh_next example.pdf --watermark-density-horizontal 2` | `2` | | `--watermark-density-vertical` | Densità verticale del posizionamento del watermark (numero di watermark per unità verticale) | `pdf2zh_next example.pdf --watermark-density-vertical 2` | `2` | | `--watermark-position` | Posizione del watermark sulla pagina (ad esempio, "center", "top-left", "bottom-right", ecc.) | `pdf2zh_next example.pdf --watermark-position "center"` | `center` | | `--watermark-page-range` | Intervallo di pagine a cui applicare il watermark (ad esempio, "1-5,8,10-12") | `pdf2zh_next example.pdf --watermark-page-range "1-5,8,10-12"` | Tutte le pagine |
pt: `no_watermark` / `watermark` / `watermark_only` | |---------------------------------|-----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------|-------------------------------------------------| | `--watermark-text` | Watermark text | `pdf2zh_next example.pdf --watermark-text "Translated by pdf2zh"` | | | `--watermark-font-size` | Watermark font size | `pdf2zh_next example.pdf --watermark-font-size 18` | | | `--watermark-font-family` | Watermark font family | `pdf2zh_next example.pdf --watermark-font-family "Arial"` | | | `--watermark-font-color` | Watermark font color | `pdf2zh_next example.pdf --watermark-font-color "#FF0000"` | | | `--watermark-opacity` | Watermark opacity (0-1) | `pdf2zh_next example.pdf --watermark-opacity 0.5` | | | `--watermark-rotation` | Watermark rotation angle (degrees) | `pdf2zh_next example.pdf --watermark-rotation 45` | | --- ### TRANSLATION RESULT | `--watermark-output-mode` | Modo de saída da marca d'água para arquivos PDF | `pdf2zh_next example.pdf --watermark-output-mode no_watermark` | `no_watermark` / `watermark` / `watermark_only` | |---------------------------------|-----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------|-------------------------------------------------| | `--watermark-text` | Texto da marca d'água | `pdf2zh_next example.pdf --watermark-text "Translated by pdf2zh"` | | | `--watermark-font-size` | Tamanho da fonte da marca d'água | `pdf2zh_next example.pdf --watermark-font-size 18` | | | `--watermark-font-family` | Família da fonte da marca d'água | `pdf2zh_next example.pdf --watermark-font-family "Arial"` | | | `--watermark-font-color` | Cor da fonte da marca d'água | `pdf2zh_next example.pdf --watermark-font-color "#FF0000"` | | | `--watermark-opacity` | Opacidade da marca d'água (0-1) | `pdf2zh_next example.pdf --watermark-opacity 0.5` | | | `--watermark-rotation` | Ângulo de rotação da marca d'água (graus) | `pdf2zh_next example.pdf --watermark-rotation 45` | |
ru: `none`, `watermark`, `no_watermark` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | -------------------------------------------------------------------------------------------------- | | `--watermark-text` | Watermark text for PDF files | `pdf2zh_next example.pdf --watermark-text "Translated by pdf2zh"` | Any string | | `--watermark-font-name` | Font name for watermark text | `pdf2zh_next example.pdf --watermark-font-name "Helvetica"` | Any font name | | `--watermark-font-size` | Font size for watermark text | `pdf2zh_next example.pdf --watermark-font-size 12` | Any positive integer | | `--watermark-color` | Color for watermark text | `pdf2zh_next example.pdf --watermark-color "gray"` | Any color name or hex code | | `--watermark-opacity` | Opacity for watermark text | `pdf2zh_next example.pdf --watermark-opacity 0.5` | Float value between 0 and 1 | | `--watermark-rotation` | Rotation angle for watermark text | `pdf2zh_next example.pdf --watermark-rotation 45` | Integer value between 0 and 360 | | `--watermark-position` | Position for watermark text | `pdf2zh_next example.pdf --watermark-position "center"` | `top-left`, `top-center`, `top-right`, `center-left`, `center`, `center-right`, `bottom-left`, `bottom-center`, `bottom-right` | | `--watermark-spacing` | Spacing between watermark texts | `pdf2zh_next example.pdf --watermark-spacing 100` | Any positive integer | | `--watermark-density` | Density of watermark texts | `pdf2zh_next example.pdf --watermark-density 10` | Any positive integer | | `--watermark-layout` | Layout of watermark texts | `pdf2zh_next example.pdf --watermark-layout "grid"` | `grid`, `diagonal` | | `--watermark-layer` | Layer for watermark text | `pdf2zh_next example.pdf --watermark-layer "above"` | `above`, `below` | --- ### TRANSLATION RESULT | `--watermark-output-mode` | Режим вывода водяного знака для файлов PDF | `pdf2zh_next example.pdf --watermark-output-mode no_watermark` | `none`, `watermark`, `no_watermark` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | -------------------------------------------------------------------------------------------------- | | `--watermark-text` | Текст водяного знака для файлов PDF | `pdf2zh_next example.pdf --watermark-text "Translated by pdf2zh"` | Любая строка | | `--watermark-font-name` | Название шрифта для текста водяного знака | `pdf2zh_next example.pdf --watermark-font-name "Helvetica"` | Любое название шрифта | | `--watermark-font-size` | Размер шрифта для текста водяного знака | `pdf2zh_next example.pdf --watermark-font-size 12` | Любое положительное целое число | | `--watermark-color` | Цвет текста водяного знака | `pdf2zh_next example.pdf --watermark-color "gray"` | Любое название цвета или шестнадцатеричный код | | `--watermark-opacity` | Прозрачность текста водяного знака | `pdf2zh_next example.pdf --watermark-opacity 0.5` | Значение с плавающей точкой от 0 до 1 | | `--watermark-rotation` | Угол поворота текста водяного знака | `pdf2zh_next example.pdf --watermark-rotation 45` | Целочисленное значение от 0 до 360 | | `--watermark-position` | Положение текста водяного знака | `pdf2zh_next example.pdf --watermark-position "center"` | `top-left`, `top-center`, `top-right`, `center-left`, `center`, `center-right`, `bottom-left`, `bottom-center`, `bottom-right` | | `--watermark-spacing` | Расстояние между текстами водяного знака | `pdf2zh_next example.pdf --watermark-spacing 100` | Любое положительное целое число | | `--watermark-density` | Плотность текстов водяного знака | `pdf2zh_next example.pdf --watermark-density 10` | Любое положительное целое число | | `--watermark-layout` | Расположение текстов водяного знака | `pdf2zh_next example.pdf --watermark-layout "grid"` | `grid`, `diagonal` | | `--watermark-layer` | Слой для текста водяного знака | `pdf2zh_next example.pdf --watermark-layer "above"` | `above`, `below` |
