Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_63121590
source: | `--dual-translate-first` | Put translated pages first in dual PDF mode | `pdf2zh_next example.pdf --dual-translate-first` |
de: |---------------------------------|-----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------| | `--dual-translate-second` | Put translated pages second in dual PDF mode | `pdf2zh_next example.pdf --dual-translate-second` | | `-o, --output` | Path to the output file, defaults to `{input_path}_translated.pdf` | `pdf2zh_next example.pdf -o example_translated.pdf` | | `--output-pdf-options` | Options for the output PDF, e.g., `--output-pdf-options="--no-pdf-compression"` | `pdf2zh_next example.pdf --output-pdf-options="--no-pdf-compression"` | | `--output-pdf-options-file` | Path to a file containing options for the output PDF, one per line | `pdf2zh_next example.pdf --output-pdf-options-file=options.txt` | | `--output-pdf-version` | PDF version of the output file, e.g., `1.4`, `1.5`, defaults to `1.4` | `pdf2zh_next example.pdf --output-pdf-version=1.5` | | `--output-pdf-version-file` | Path to a file containing the PDF version of the output file, e.g., `1.4` | `pdf2zh_next example.pdf --output-pdf-version-file=version.txt` | | `--output-pdf-version-override` | Override the PDF version of the output file, e.g., `1.4`, `1.5`, defaults to `1.4` | `pdf2zh_next example.pdf --output-pdf-version-override=1.5` | | `--output-pdf-version-override-file` | Path to a file containing the PDF version of the output file to override, e.g., `1.4` | `pdf2zh_next example.pdf --output-pdf-version-override-file=version.txt` | --- ### OUTPUT | `--dual-translate-first` | Platziere übersetzte Seiten zuerst im dualen PDF-Modus | `pdf2zh_next example.pdf --dual-translate-first` | |---------------------------------|-----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------| | `--dual-translate-second` | Platziere übersetzte Seiten an zweiter Stelle im dualen PDF-Modus | `pdf2zh_next example.pdf --dual-translate-second` | | `-o, --output` | Pfad zur Ausgabedatei, Standardwert ist `{input_path}_translated.pdf` | `pdf2zh_next example.pdf -o example_translated.pdf` | | `--output-pdf-options` | Optionen für die Ausgabe-PDF, z.B. `--output-pdf-options="--no-pdf-compression"` | `pdf2zh_next example.pdf --output-pdf-options="--no-pdf-compression"` | | `--output-pdf-options-file` | Pfad zu einer Datei mit Optionen für die Ausgabe-PDF, eine pro Zeile | `pdf2zh_next example.pdf --output-pdf-options-file=options.txt` | | `--output-pdf-version` | PDF-Version der Ausgabedatei, z.B. `1.4`, `1.5`, Standardwert ist `1.4` | `pdf2zh_next example.pdf --output-pdf-version=1.5` | | `--output-pdf-version-file` | Pfad zu einer Datei mit der PDF-Version der Ausgabedatei, z.B. `1.4` | `pdf2zh_next example.pdf --output-pdf-version-file=version.txt` | | `--output-pdf-version-override` | Überschreibe die PDF-Version der Ausgabedatei, z.B. `1.4`, `1.5`, Standardwert ist `1.4` | `pdf2zh_next example.pdf --output-pdf-version-override=1.5` | | `--output-pdf-version-override-file` | Pfad zu einer Datei mit der PDF-Version der Ausgabedatei zum Überschreiben, z.B. `1.4` | `pdf2zh_next example.pdf --output-pdf-version-override-file=version.txt` |
fr: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--dual-translate-first` | Placer les pages traduites en premier en mode PDF double | `pdf2zh_next example.pdf --dual-translate-first` | | `--dual-translate-first` | Put translated pages first in dual PDF mode | `pdf2zh_next example.pdf --dual-translate-first` | | `--dual-translate-first` | Placer les pages traduites en premier en mode PDF double | `pdf2zh_next example.pdf --dual-translate-first` | --- ### OUTPUT | `--dual-translate-first` | Placer les pages traduites en premier en mode PDF double | `pdf2zh_next example.pdf --dual-translate-first` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--dual-translate-first` | Placer les pages traduites en premier en mode PDF double | `pdf2zh_next example.pdf --dual-translate-first` | | `--dual-translate-first` | Placer les pages traduites en premier en mode PDF double | `pdf2zh_next example.pdf --dual-translate-first` | | `--dual-translate-first` | Placer les pages traduites en premier en mode PDF double | `pdf2zh_next example.pdf --dual-translate-first` |
it: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--dual-translate-second` | Put translated pages second in dual PDF mode | `pdf2zh_next example.pdf --dual-translate-second` | | `--dual-translate-both` | Put translated pages both first and second in dual PDF mode | `pdf2zh_next example.pdf --dual-translate-both` | | `--dual-translate-none` | Do not put translated pages in dual PDF mode | `pdf2zh_next example.pdf --dual-translate-none` | | `--dual-translate-first-inline` | Put translated pages first in dual PDF mode, but keep them inline with the original PDF | `pdf2zh_next example.pdf --dual-translate-first-inline` | | `--dual-translate-*` | These options are mutually exclusive | You can only use one of these options at a time. | --- ### TRANSLATION RESULT | `--dual-translate-first` | Inserisci le pagine tradotte per prime in modalità PDF duale | `pdf2zh_next example.pdf --dual-translate-first` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--dual-translate-second` | Inserisci le pagine tradotte per seconde in modalità PDF duale | `pdf2zh_next example.pdf --dual-translate-second` | | `--dual-translate-both` | Inserisci le pagine tradotte sia per prime che per seconde in modalità PDF duale | `pdf2zh_next example.pdf --dual-translate-both` | | `--dual-translate-none` | Non inserire le pagine tradotte in modalità PDF duale | `pdf2zh_next example.pdf --dual-translate-none` | | `--dual-translate-first-inline` | Inserisci le pagine tradotte per prime in modalità PDF duale, ma mantienile in linea con il PDF originale | `pdf2zh_next example.pdf --dual-translate-first-inline` | | `--dual-translate-*` | Queste opzioni si escludono a vicenda | Puoi utilizzare solo una di queste opzioni alla volta. |
pt: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--dual-translate-first-custom` | Put translated pages first in dual PDF mode, with custom text | `pdf2zh_next example.pdf --dual-translate-first-custom "Custom Text"` | --- ### TRANSLATION RESULT | `--dual-translate-first` | Colocar páginas traduzidas primeiro no modo PDF duplo | `pdf2zh_next example.pdf --dual-translate-first` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--dual-translate-first-custom` | Colocar páginas traduzidas primeiro no modo PDF duplo, com texto personalizado | `pdf2zh_next example.pdf --dual-translate-first-custom "Custom Text"` |
ru: |---------------------------------|-----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------| | `--dual-translate-first-cover` | Put translated cover page first in dual PDF mode | `pdf2zh_next example.pdf --dual-translate-first-cover` | | `--dual-translate-first-cover-translated` | Put translated cover page first in dual PDF mode, and translate the cover page. | `pdf2zh_next example.pdf --dual-translate-first-cover-translated` | --- ### TRANSLATION RESULT | `--dual-translate-first` | Помещать переведенные страницы первыми в режиме двойного PDF | `pdf2zh_next example.pdf --dual-translate-first` | |---------------------------------|-----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------| | `--dual-translate-first-cover` | Помещать переведенную титульную страницу первой в режиме двойного PDF | `pdf2zh_next example.pdf --dual-translate-first-cover` | | `--dual-translate-first-cover-translated` | Помещать переведенную титульную страницу первой в режиме двойного PDF и переводить титульную страницу. | `pdf2zh_next example.pdf --dual-translate-first-cover-translated` |
