Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_F1541146
source: ## Enforcement Responsibilities
de: ## Durchsetzungsverantwortung
fr: ## Responsabilités d'application
it: ## Responsabilità di applicazione
pt: ## Responsabilidades de Fiscalização
ru: ## Обязанности по обеспечению соблюдения

# chunk_EE74991B
source: Community leaders are responsible for clarifying and enforcing our standards of acceptable behavior and will take appropriate and fair corrective action in response to any behavior that they deem inappropriate, threatening, offensive, or harmful. Community leaders have the right and responsibility to remove, edit, or reject comments, commits, code, wiki edits, issues, and other contributions that are not aligned to this Code of Conduct, and will communicate reasons for moderation decisions when appropriate.
de: Gemeinschaftsleiter sind dafür verantwortlich, unsere Standards für akzeptables Verhalten zu klären und durchzusetzen. Sie werden angemessene und faire Korrekturmaßnahmen ergreifen, um auf jedes Verhalten zu reagieren, das sie als unangemessen, bedrohlich, beleidigend oder schädlich erachten. Gemeinschaftsleiter haben das Recht und die Verantwortung, Kommentare, Commits, Code, Wiki-Bearbeitungen, Issues und andere Beiträge zu entfernen, zu bearbeiten oder abzulehnen, die nicht mit diesem Verhaltenskodex übereinstimmen. Sie werden die Gründe für Moderationsentscheidungen kommunizieren, wenn dies angemessen ist.
fr: Les leaders de la communauté sont responsables de clarifier et de faire respecter nos normes de comportement acceptable et prendront des mesures correctives appropriées et équitables en réponse à tout comportement qu'ils jugent inapproprié, menaçant, offensant ou nuisible. Les leaders de la communauté ont le droit et la responsabilité de supprimer, modifier ou rejeter les commentaires, commits, code, modifications de wiki, problèmes et autres contributions qui ne sont pas conformes à ce Code de Conduite, et communiqueront les raisons des décisions de modération lorsque cela est approprié.
it: I leader della comunità sono responsabili di chiarire e far rispettare i nostri standard di comportamento accettabile e intraprenderanno azioni correttive appropriate ed eque in risposta a qualsiasi comportamento che ritengano inappropriato, minaccioso, offensivo o dannoso. I leader della comunità hanno il diritto e la responsabilità di rimuovere, modificare o rifiutare commenti, commit, codice, modifiche wiki, issue e altri contributi che non sono allineati a questo Codice di Condotta, e comunicheranno le ragioni delle decisioni di moderazione quando opportuno.
pt: Os líderes da comunidade são responsáveis por esclarecer e fazer cumprir nossos padrões de comportamento aceitável e tomarão medidas corretivas apropriadas e justas em resposta a qualquer comportamento que considerem inadequado, ameaçador, ofensivo ou prejudicial. Os líderes da comunidade têm o direito e a responsabilidade de remover, editar ou rejeitar comentários, commits, código, edições de wiki, problemas e outras contribuições que não estejam alinhadas a este Código de Conduta, e comunicarão os motivos das decisões de moderação quando apropriado.
ru: Лидеры сообщества несут ответственность за разъяснение и соблюдение наших стандартов приемлемого поведения и предпримут соответствующие и справедливые корректирующие действия в ответ на любое поведение, которое они сочтут неприемлемым, угрожающим, оскорбительным или вредным. Лидеры сообщества имеют право и обязанность удалять, редактировать или отклонять комментарии, коммиты, код, правки вики, вопросы и другие вклады, которые не соответствуют настоящему Кодексу поведения, и будут сообщать причины решений о модерации, когда это уместно.

# chunk_EC6E1121
source: ## Scope
de: ## Anwendungsbereich
fr: ## Portée
it: ## Ambito
pt: ## Escopo
ru: ## Область применения

# chunk_C8A3DB27
source: This Code of Conduct applies within all community spaces, and also applies when an individual is officially representing the community in public spaces. Examples of representing our community include using an official e-mail address, posting via an official social media account, or acting as an appointed representative at an online or offline event.
de: Dieser Verhaltenskodex gilt in allen Gemeinschaftsräumen und gilt auch, wenn eine Person die Gemeinschaft offiziell in öffentlichen Räumen vertritt. Beispiele für die Vertretung unserer Gemeinschaft sind die Verwendung einer offiziellen E-Mail-Adresse, das Posten über ein offizielles Social-Media-Konto oder das Handeln als ernannter Vertreter bei einer Online- oder Offline-Veranstaltung.
fr: Ce Code de conduite s'applique dans tous les espaces communautaires, et s'applique également lorsqu'un individu représente officiellement la communauté dans des espaces publics. Des exemples de représentation de notre communauté incluent l'utilisation d'une adresse e-mail officielle, la publication via un compte officiel sur les réseaux sociaux, ou le fait d'agir en tant que représentant désigné lors d'un événement en ligne ou hors ligne.
it: Questo Codice di Condotta si applica all'interno di tutti gli spazi della comunità e si applica anche quando un individuo rappresenta ufficialmente la comunità in spazi pubblici. Esempi di rappresentanza della nostra comunità includono l'utilizzo di un indirizzo e-mail ufficiale, la pubblicazione tramite un account ufficiale sui social media o l'azione come rappresentante designato in un evento online o offline.
pt: Este Código de Conduta se aplica dentro de todos os espaços da comunidade e também se aplica quando um indivíduo está representando oficialmente a comunidade em espaços públicos. Exemplos de representação da nossa comunidade incluem o uso de um endereço de e-mail oficial, postagens por meio de uma conta oficial de mídia social ou atuar como representante designado em um evento online ou offline.
ru: Этот Кодекс поведения применяется во всех сообществах и также действует, когда человек официально представляет сообщество в публичных пространствах. Примеры представления нашего сообщества включают использование официального адреса электронной почты, публикации через официальный аккаунт в социальных сетях или выступление в качестве назначенного представителя на онлайн- или оффлайн-мероприятиях.

# chunk_B7BB8282
source: ## Enforcement
de: ## Durchsetzung
fr: ## Application
it: ## Applicazione
pt: ## Aplicação
ru: ## Применение

# chunk_BBB24E28
source: Instances of abusive, harassing, or otherwise unacceptable behavior may be reported to the community leaders responsible for enforcement at `aw@funstory.ai` . All complaints will be reviewed and investigated promptly and fairly. All community leaders are obligated to respect the privacy and security of the reporter of any incident.
de: Fälle von missbräuchlichem, belästigendem oder anderweitig inakzeptablem Verhalten können den für die Durchsetzung verantwortlichen Gemeinschaftsleitern unter `aw@funstory.ai` gemeldet werden. Alle Beschwerden werden prompt und fair überprüft und untersucht. Alle Gemeinschaftsleiter sind verpflichtet, die Privatsphäre und Sicherheit des Meldenden eines Vorfalls zu respektieren.
fr: Les cas de comportement abusif, harcelant ou autrement inacceptable peuvent être signalés aux responsables de la communauté chargés de l'application des règles à l'adresse `aw@funstory.ai`. Toutes les plaintes seront examinées et traitées rapidement et équitablement. Tous les responsables de la communauté sont tenus de respecter la confidentialité et la sécurité du signalant de tout incident.
it: Gli episodi di comportamento abusivo, molesto o comunque inaccettabile possono essere segnalati ai leader della comunità responsabili dell'applicazione delle regole all'indirizzo `aw@funstory.ai`. Tutte le segnalazioni saranno esaminate e investigate in modo tempestivo ed equo. Tutti i leader della comunità sono tenuti a rispettare la privacy e la sicurezza del segnalante di qualsiasi incidente.
pt: Casos de comportamento abusivo, assédio ou qualquer outro comportamento inaceitável podem ser relatados aos líderes da comunidade responsáveis pela aplicação em `aw@funstory.ai`. Todas as reclamações serão revisadas e investigadas de forma rápida e justa. Todos os líderes da comunidade são obrigados a respeitar a privacidade e a segurança do denunciante de qualquer incidente.
ru: Экземпляры оскорбительного, преследующего или иного неприемлемого поведения могут быть сообщены лидерам сообщества, ответственным за соблюдение правил, по адресу `aw@funstory.ai`. Все жалобы будут рассмотрены и расследованы оперативно и справедливо. Все лидеры сообщества обязаны уважать конфиденциальность и безопасность лица, сообщившего о любом инциденте.

# chunk_917146E0
source: ## Enforcement Guidelines
de: ## Durchsetzungsrichtlinien
fr: ## Directives d'application
it: ## Linee guida per l'applicazione
pt: ## Diretrizes de Execução
ru: ## Руководство по применению

# chunk_40C51FE2
source: Community leaders will follow these Community Impact Guidelines in determining the consequences for any action they deem in violation of this Code of Conduct:
de: Gemeinschaftsleiter werden diese Richtlinien zur Gemeinschaftsauswirkung befolgen, um die Konsequenzen für jede Handlung zu bestimmen, die sie als Verstoß gegen diesen Verhaltenskodex erachten:
fr: Les leaders de la communauté suivront ces directives d'impact communautaire pour déterminer les conséquences de toute action qu'ils jugent en violation de ce code de conduite :
it: I leader della comunità seguiranno queste Linee guida sull'impatto della comunità nel determinare le conseguenze per qualsiasi azione che ritengano in violazione di questo Codice di condotta:
pt: Os líderes da comunidade seguirão estas Diretrizes de Impacto na Comunidade ao determinar as consequências para qualquer ação que considerem em violação deste Código de Conduta:
ru: Лидеры сообщества будут руководствоваться этими рекомендациями по влиянию на сообщество при определении последствий для любых действий, которые они сочтут нарушающими данный Кодекс поведения:

# chunk_7DC402F6
source: ### 1. Correction
de: ### 1. Korrektur
it: ### 1. Correzione
pt: ### 1. Correção
ru: ### 1. Исправление

# chunk_589DD968
source: **Community Impact**: Use of inappropriate language or other behavior deemed unprofessional or unwelcome in the community. **Consequence**: A private, written warning from community leaders, providing clarity around the nature of the violation and an explanation of why the behavior was inappropriate. A public apology may be requested.
de: **Auswirkungen auf die Gemeinschaft**: Verwendung unangemessener Sprache oder anderweitiges Verhalten, das in der Gemeinschaft als unprofessionell oder unerwünscht angesehen wird. **Konsequenz**: Eine private, schriftliche Verwarnung von den Gemeinschaftsleitern, die Klarheit über die Art des Verstoßes und eine Erklärung dafür bietet, warum das Verhalten unangemessen war. Eine öffentliche Entschuldigung kann verlangt werden.
fr: **Impact sur la communauté** : Utilisation d'un langage inapproprié ou tout autre comportement jugé non professionnel ou indésirable dans la communauté. **Conséquence** : Un avertissement privé et écrit des responsables de la communauté, clarifiant la nature de la violation et expliquant pourquoi le comportement était inapproprié. Des excuses publiques peuvent être demandées.
it: **Impatto sulla Comunità**: Uso di linguaggio inappropriato o altri comportamenti considerati non professionali o non graditi nella comunità. **Conseguenza**: Un avvertimento scritto e privato da parte dei leader della comunità, che chiarisce la natura della violazione e spiega perché il comportamento era inappropriato. Potrebbe essere richiesta una scusa pubblica.
pt: **Impacto na Comunidade**: Uso de linguagem inadequada ou outro comportamento considerado não profissional ou indesejado na comunidade. **Consequência**: Um aviso privado e por escrito dos líderes da comunidade, esclarecendo a natureza da violação e explicando por que o comportamento foi inadequado. Um pedido público de desculpas pode ser solicitado.
ru: **Влияние на сообщество**: Использование неуместного языка или другое поведение, считающееся непрофессиональным или нежелательным в сообществе. **Последствие**: Частное письменное предупреждение от лидеров сообщества с разъяснением характера нарушения и объяснением, почему поведение было неуместным. Может быть запрошено публичное извинение.

# chunk_4AE59666
source: ### 2. Warning
de: ### 2. Warnung
fr: ### 2. Avertissement
it: ### 2. Avviso
pt: ### 2. Aviso
ru: ### 2. Предупреждение

# chunk_8645DDC9
source: **Community Impact**: A violation through a single incident or series of actions. **Consequence**: A warning with consequences for continued behavior. No interaction with the people involved, including unsolicited interaction with those enforcing the Code of Conduct, for a specified period of time. This includes avoiding interactions in community spaces as well as external channels like social media. Violating these terms may lead to a temporary or permanent ban.
de: **Auswirkungen auf die Gemeinschaft**: Eine Verletzung durch einen einzelnen Vorfall oder eine Reihe von Handlungen. **Konsequenz**: Eine Warnung mit Konsequenzen für fortgesetztes Verhalten. Keine Interaktion mit den beteiligten Personen, einschließlich unerwünschter Interaktion mit denen, die den Verhaltenskodex durchsetzen, für einen bestimmten Zeitraum. Dies beinhaltet die Vermeidung von Interaktionen in Gemeinschaftsräumen sowie in externen Kanälen wie sozialen Medien. Die Verletzung dieser Bedingungen kann zu einer vorübergehenden oder dauerhaften Sperrung führen.
fr: **Impact sur la communauté** : Une violation à travers un incident unique ou une série d'actions. **Conséquence** : Un avertissement avec des conséquences pour un comportement persistant. Aucune interaction avec les personnes concernées, y compris les interactions non sollicitées avec celles faisant respecter le Code de conduite, pour une période de temps spécifiée. Cela inclut d'éviter les interactions dans les espaces communautaires ainsi que les canaux externes comme les médias sociaux. Enfreindre ces conditions peut entraîner une interdiction temporaire ou permanente.
it: **Impatto sulla Comunità**: Una violazione attraverso un singolo incidente o una serie di azioni. **Conseguenza**: Un avvertimento con conseguenze per il comportamento continuato. Nessuna interazione con le persone coinvolte, compresa l'interazione non richiesta con coloro che fanno rispettare il Codice di Condotta, per un periodo di tempo specificato. Ciò include evitare interazioni negli spazi della comunità così come nei canali esterni come i social media. La violazione di questi termini può portare a un ban temporaneo o permanente.
pt: **Impacto na Comunidade**: Uma violação através de um único incidente ou série de ações. **Consequência**: Um aviso com consequências para comportamento contínuo. Nenhuma interação com as pessoas envolvidas, incluindo interação não solicitada com aqueles que aplicam o Código de Conduta, por um período de tempo especificado. Isso inclui evitar interações nos espaços da comunidade, bem como em canais externos como mídias sociais. Violar esses termos pode levar a uma suspensão temporária ou permanente.
ru: **Влияние на сообщество**: Нарушение, совершенное в результате одного инцидента или серии действий. **Последствие**: Предупреждение с последствиями за продолжение подобного поведения. Запрет на взаимодействие с вовлеченными лицами, включая нежелательное взаимодействие с теми, кто обеспечивает соблюдение Кодекса поведения, на определенный период времени. Это включает избегание взаимодействий в пространствах сообщества, а также на внешних каналах, таких как социальные сети. Нарушение этих условий может привести к временному или постоянному бану.

# chunk_357EC7B7
source: ### 3. Temporary Ban
de: ### 3. Temporäres Verbot
fr: ### 3. Bannissement temporaire
it: ### 3. Divieto temporaneo
pt: ### 3. Banimento Temporário
ru: ### 3. Временный бан

# chunk_855D5A2A
source: **Community Impact**: A serious violation of community standards, including sustained inappropriate behavior. **Consequence**: A temporary ban from any sort of interaction or public communication with the community for a specified period of time. No public or private interaction with the people involved, including unsolicited interaction with those enforcing the Code of Conduct, is allowed during this period. Violating these terms may lead to a permanent ban.
de: **Auswirkungen auf die Gemeinschaft**: Eine schwerwiegende Verletzung der Gemeinschaftsstandards, einschließlich anhaltend unangemessenen Verhaltens. **Konsequenz**: Ein zeitweiliger Ausschluss von jeglicher Art der Interaktion oder öffentlichen Kommunikation mit der Gemeinschaft für einen bestimmten Zeitraum. Während dieses Zeitraums sind keine öffentlichen oder privaten Interaktionen mit den beteiligten Personen erlaubt, einschließlich unaufgeforderter Interaktionen mit denen, die den Verhaltenskodex durchsetzen. Die Verletzung dieser Bedingungen kann zu einem dauerhaften Ausschluss führen.
fr: **Impact sur la communauté** : Une violation grave des normes de la communauté, incluant un comportement inapproprié persistant. **Conséquence** : Un bannissement temporaire de toute forme d'interaction ou de communication publique avec la communauté pour une période déterminée. Aucune interaction publique ou privée avec les personnes concernées, y compris des interactions non sollicitées avec celles chargées de faire respecter le Code de conduite, n'est autorisée pendant cette période. Le non-respect de ces conditions peut entraîner un bannissement permanent.
it: **Impatto sulla Comunità**: Una grave violazione degli standard della comunità, inclusi comportamenti inappropriati prolungati. **Conseguenza**: Un ban temporaneo da qualsiasi tipo di interazione o comunicazione pubblica con la comunità per un periodo di tempo specificato. Durante questo periodo non è consentito alcun intervento pubblico o privato con le persone coinvolte, inclusi interventi non richiesti con coloro che fanno rispettare il Codice di Condotta. La violazione di questi termini può portare a un ban permanente.
pt: **Impacto na Comunidade**: Uma violação grave dos padrões da comunidade, incluindo comportamento inadequado contínuo. **Consequência**: Uma suspensão temporária de qualquer tipo de interação ou comunicação pública com a comunidade por um período de tempo especificado. Nenhuma interação pública ou privada com as pessoas envolvidas, incluindo interação não solicitada com aqueles que aplicam o Código de Conduta, é permitida durante este período. Violar esses termos pode levar a uma suspensão permanente.
ru: **Влияние на сообщество**: Серьезное нарушение стандартов сообщества, включая постоянное недопустимое поведение. **Последствие**: Временный запрет на любые виды взаимодействия или публичного общения с сообществом на определенный период времени. В течение этого периода не допускается публичное или частное взаимодействие с вовлеченными лицами, включая нежелательное взаимодействие с теми, кто обеспечивает соблюдение Кодекса поведения. Нарушение этих условий может привести к постоянному запрету.

# chunk_7C7DB2B5
source: ### 4. Permanent Ban
de: ### 4. Dauerhafte Sperre
fr: ### 4. Bannissement permanent
it: ### 4. Divieto permanente
pt: ### 4. Banimento permanente
ru: ### 4. Постоянный бан

# chunk_FAF381FA
source: **Community Impact**: Demonstrating a pattern of violation of community standards, including sustained inappropriate behavior, harassment of an individual, or aggression toward or disparagement of classes of individuals. **Consequence**: A permanent ban from any sort of public interaction within the community.
de: **Auswirkungen auf die Gemeinschaft**: Zeigt ein Muster der Verletzung von Gemeinschaftsstandards, einschließlich anhaltend unangemessenen Verhaltens, Belästigung einer Einzelperson oder Aggression gegenüber oder Herabsetzung von Gruppen von Personen. **Konsequenz**: Ein dauerhaftes Verbot jeglicher Art von öffentlicher Interaktion innerhalb der Gemeinschaft.
fr: **Impact sur la communauté** : Démontrer un schéma de violation des normes communautaires, incluant un comportement inapproprié persistant, le harcèlement d'un individu, ou de l'agressivité ou des propos dénigrants envers des groupes d'individus. **Conséquence** : Un bannissement permanent de toute forme d'interaction publique au sein de la communauté.
it: **Impatto sulla Comunità**: Dimostrare un modello di violazione degli standard della comunità, inclusi comportamenti inappropriati persistenti, molestie a un individuo o aggressione o denigrazione verso classi di individui. **Conseguenza**: Un ban permanente da qualsiasi tipo di interazione pubblica all'interno della comunità.
pt: **Impacto na Comunidade**: Demonstração de um padrão de violação dos padrões da comunidade, incluindo comportamento inadequado sustentado, assédio a um indivíduo ou agressão ou difamação de classes de indivíduos. **Consequência**: Uma proibição permanente de qualquer tipo de interação pública dentro da comunidade.
ru: **Влияние на сообщество**: Демонстрация модели нарушения стандартов сообщества, включая устойчивое неадекватное поведение, преследование отдельного лица или агрессию в отношении или унижение групп лиц. **Последствие**: Постоянный запрет на любые виды публичного взаимодействия в рамках сообщества.

# chunk_5C710B75
source: ## Attribution
de: ## Zuschreibung
it: ## Attribuzione
pt: ## Atribuição
ru: ## Атрибуция
