Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_0B12F3B2
source: ## Python API: do_translate_async_stream
de: --- `do_translate_async_stream` is a function in the `pdf2zh` package that provides asynchronous streaming translation capabilities. It allows you to translate a list of text segments in real-time, with the ability to process each translated segment as soon as it is available. ### Function Signature ```python async def do_translate_async_stream( text_list: List[str], target_language: str = 'zh', source_language: str = 'auto', translation_service: str = 'google', translation_service_config: Optional[Dict] = None, on_translated: Optional[Callable[[str], None]] = None, on_finished: Optional[Callable[[], None]] = None, on_error: Optional[Callable[[Exception], None]] = None ) -> None ``` ### Parameters - `text_list` (List[str]): A list of text segments to be translated. - `target_language` (str, optional): The target language code for translation. Defaults to 'zh' (Chinese). - `source_language` (str, optional): The source language code. Use 'auto' for automatic detection. Defaults to 'auto'. - `translation_service` (str, optional): The translation service to use. Defaults to 'google'. - `translation_service_config` (Dict, optional): Configuration parameters for the translation service. Defaults to None. - `on_translated` (Callable[[str], None], optional): A callback function that is called each time a segment is translated. The translated text is passed as an argument. - `on_finished` (Callable[[], None], optional): A callback function that is called when all segments have been translated. - `on_error` (Callable[[Exception], None], optional): A callback function that is called if an error occurs during translation. ### Usage Example ```python import asyncio from pdf2zh import do_translate_async_stream async def main(): text_list = [ "Hello, world!", "This is a test.", "How are you?" ] def on_translated(text): print(f"Translated: {text}") def on_finished(): print("All translations completed!") def on_error(error): print(f"Error: {error}") await do_translate_async_stream( text_list=text_list, target_language='de', on_translated=on_translated, on_finished=on_finished, on_error=on_error ) asyncio.run(main()) ``` ### Notes - This function is asynchronous and must be called with `await`. - The streaming nature allows for real-time processing of translations, which can be useful for applications that require immediate feedback. - For more details on available translation services and their configurations, refer to the [Documentation of Translation Services](translation_services.md). --- ## Python API: do_translate_async_stream --- `do_translate_async_stream` ist eine Funktion im `pdf2zh`-Paket, die asynchrone Streaming-Übersetzungsfunktionen bereitstellt. Sie ermöglicht die Echtzeitübersetzung einer Liste von Textsegmenten, wobei jedes übersetzte Segment sofort verarbeitet werden kann, sobald es verfügbar ist. ### Funktionssignatur ```python async def do_translate_async_stream( text_list: List[str], target_language: str = 'zh', source_language: str = 'auto', translation_service: str = 'google', translation_service_config: Optional[Dict] = None, on_translated: Optional[Callable[[str], None]] = None, on_finished: Optional[Callable[[], None]] = None, on_error: Optional[Callable[[Exception], None]] = None ) -> None ``` ### Parameter - `text_list` (List[str]): Eine Liste von Textsegmenten, die übersetzt werden sollen. - `target_language` (str, optional): Der Sprachcode der Zielsprache für die Übersetzung. Standardmäßig 'zh' (Chinesisch). - `source_language` (str, optional): Der Sprachcode der Ausgangssprache. Verwenden Sie 'auto' für automatische Erkennung. Standardmäßig 'auto'. - `translation_service` (str, optional): Der zu verwendende Übersetzungsdienst. Standardmäßig 'google'. - `translation_service_config` (Dict, optional): Konfigurationsparameter für den Übersetzungsdienst. Standardmäßig None. - `on_translated` (Callable[[str], None], optional): Eine Callback-Funktion, die jedes Mal aufgerufen wird, wenn ein Segment übersetzt wurde. Der übersetzte Text wird als Argument übergeben. - `on_finished` (Callable[[], None], optional): Eine Callback-Funktion, die aufgerufen wird, wenn alle Segmente übersetzt wurden. - `on_error` (Callable[[Exception], None], optional): Eine Callback-Funktion, die aufgerufen wird, wenn während der Übersetzung ein Fehler auftritt. ### Verwendungsbeispiel ```python import asyncio from pdf2zh import do_translate_async_stream async def main(): text_list = [ "Hello, world!", "This is a test.", "How are you?" ] def on_translated(text): print(f"Translated: {text}") def on_finished(): print("All translations completed!") def on_error(error): print(f"Error: {error}") await do_translate_async_stream( text_list=text_list, target_language='de', on_translated=on_translated, on_finished=on_finished, on_error=on_error ) asyncio.run(main()) ``` ### Hinweise - Diese Funktion ist asynchron und muss mit `await` aufgerufen werden. - Die Streaming-Fähigkeit ermöglicht die Echtzeitverarbeitung von Übersetzungen, was für Anwendungen nützlich sein kann, die sofortiges Feedback erfordern. - Weitere Details zu verfügbaren Übersetzungsdiensten und deren Konfigurationen finden Sie in der [Dokumentation der Übersetzungsdienste](translation_services.md).
fr: This function is an asynchronous generator that streams the translation results. It is useful for translating large documents without waiting for the entire translation to complete. ### Parameters - `pdf_path`: Path to the PDF file to be translated. - `source_lang`: Source language code (e.g., 'en' for English). - `target_lang`: Target language code (e.g., 'zh' for Chinese). - `api_key`: Your API key for the translation service. - `api_url`: Base URL for the translation service API. - `timeout`: Timeout for each API request in seconds. - `retries`: Number of retries for failed requests. - `retry_delay`: Delay between retries in seconds. - `batch_size`: Number of pages to process in each batch. - `batch_delay`: Delay between batches in seconds. - `callback`: Callback function to handle progress updates. ### Returns An asynchronous generator that yields tuples of `(page_number, translated_text)`. ### Example ```python import asyncio from pdf2zh import do_translate_async_stream async def main(): async for page_num, translated_text in do_translate_async_stream( pdf_path="document.pdf", source_lang="en", target_lang="zh", api_key="your_api_key", api_url="https://api.example.com/translate", timeout=30, retries=3, retry_delay=1, batch_size=5, batch_delay=0.5, callback=lambda progress: print(f"Progress: {progress}%") ): print(f"Page {page_num}: {translated_text}") asyncio.run(main()) ``` ### Notes - The function processes the PDF in batches to manage memory and API usage. - Use the `callback` parameter to monitor progress. - Ensure proper error handling for production use. --- ### TRANSLATION RESULT
it: The `do_translate_async_stream` function is an asynchronous generator that performs translation on a stream of text chunks. It is designed to handle continuous input streams, such as those from a file being read in chunks, and yields translated chunks as they become available. ### Function Signature ```python async def do_translate_async_stream( text_chunks: AsyncIterator[str], source_language: str = "en", target_language: str = "zh", translation_services: Optional[List[str]] = None, translation_service: Optional[str] = None, api_key: Optional[str] = None, glossary: Optional[List[Tuple[str, str]]] = None, context: Optional[str] = None, instruction: Optional[str] = None, request_params: Optional[Dict[str, Any]] = None, **kwargs: Any ) -> AsyncIterator[str]: ``` ### Parameters - `text_chunks` (AsyncIterator[str]): An asynchronous iterator that yields chunks of text to be translated. - `source_language` (str, optional): The language code of the source text. Defaults to "en". - `target_language` (str, optional): The language code of the target translation. Defaults to "zh". - `translation_services` (Optional[List[str]], optional): A list of translation service names to use. If not provided, defaults to the services configured in the environment. - `translation_service` (Optional[str], optional): A specific translation service to use. If provided, overrides `translation_services`. - `api_key` (Optional[str], optional): The API key for the translation service. If not provided, uses the key from environment variables. - `glossary` (Optional[List[Tuple[str, str]]], optional): A list of tuples representing custom glossary terms. Each tuple should be (source_term, target_term). - `context` (Optional[str], optional): Additional context to provide to the translation service for better accuracy. - `instruction` (Optional[str], optional): Specific instructions for the translation service. - `request_params` (Optional[Dict[str, Any]], optional): Additional parameters to pass to the translation service API request. - `**kwargs`: Additional keyword arguments that may be passed to the underlying translation functions. ### Returns - `AsyncIterator[str]`: An asynchronous iterator that yields translated chunks of text. ### Example Usage ```python import asyncio from pdf2zh import do_translate_async_stream async def text_chunk_generator(): # Simulate reading chunks from a file or stream chunks = ["First chunk of text.", "Second chunk of text.", "Third chunk."] for chunk in chunks: yield chunk await asyncio.sleep(0.1) # Simulate async delay async def main(): translated_chunks = [] async for translated_chunk in do_translate_async_stream( text_chunk_generator(), source_language="en", target_language="zh" ): translated_chunks.append(translated_chunk) print(f"Translated: {translated_chunk}") full_translation = "".join(translated_chunks) print("Full translation:", full_translation) asyncio.run(main()) ``` ### Notes - This function is useful for processing large texts in a memory-efficient manner, as it processes and yields translations chunk by chunk. - The function handles the concatenation of chunks internally to ensure coherent translations across chunk boundaries. - Error handling is built into the function, and it will raise exceptions if the translation services encounter issues. --- ### TRANSLATION RESULT ## API Python: do_translate_async_stream La funzione `do_translate_async_stream` è un generatore asincrono che esegue la traduzione su un flusso di blocchi di testo. È progettata per gestire flussi di input continui, come quelli provenienti da un file letto in blocchi, e restituisce i blocchi tradotti man mano che diventano disponibili. ### Firma della funzione ```python async def do_translate_async_stream( text_chunks: AsyncIterator[str], source_language: str = "en", target_language: str = "zh", translation_services: Optional[List[str]] = None, translation_service: Optional[str] = None, api_key: Optional[str] = None, glossary: Optional[List[Tuple[str, str]]] = None, context: Optional[str] = None, instruction: Optional[str] = None, request_params: Optional[Dict[str, Any]] = None, **kwargs: Any ) -> AsyncIterator[str]: ``` ### Parametri - `text_chunks` (AsyncIterator[str]): Un iteratore asincrono che restituisce blocchi di testo da tradurre. - `source_language` (str, opzionale): Il codice lingua del testo sorgente. Predefinito a "en". - `target_language` (str, opzionale): Il codice lingua della traduzione di destinazione. Predefinito a "zh". - `translation_services` (Optional[List[str]], opzionale): Un elenco di nomi di servizi di traduzione da utilizzare. Se non fornito, utilizza i servizi configurati nell'ambiente. - `translation_service` (Optional[str], opzionale): Un servizio di traduzione specifico da utilizzare. Se fornito, sovrascrive `translation_services`. - `api_key` (Optional[str], opzionale): La chiave API per il servizio di traduzione. Se non fornita, utilizza la chiave dalle variabili d'ambiente. - `glossary` (Optional[List[Tuple[str, str]]], opzionale): Un elenco di tuple che rappresentano termini personalizzati del glossario. Ogni tupla dovrebbe essere (termine_sorgente, termine_destinazione). - `context` (Optional[str], opzionale): Contesto aggiuntivo da fornire al servizio di traduzione per una migliore accuratezza. - `instruction` (Optional[str], opzionale): Istruzioni specifiche per il servizio di traduzione. - `request_params` (Optional[Dict[str, Any]], opzionale): Parametri aggiuntivi da passare alla richiesta API del servizio di traduzione. - `**kwargs`: Argomenti chiave aggiuntivi che possono essere passati alle funzioni di traduzione sottostanti. ### Restituisce - `AsyncIterator[str]`: Un iteratore asincrono che restituisce blocchi di testo tradotti. ### Esempio di utilizzo ```python import asyncio from pdf2zh import do_translate_async_stream async def text_chunk_generator(): # Simula la lettura di blocchi da un file o flusso chunks = ["First chunk of text.", "Second chunk of text.", "Third chunk."] for chunk in chunks: yield chunk await asyncio.sleep(0.1) # Simula un ritardo asincrono async def main(): translated_chunks = [] async for translated_chunk in do_translate_async_stream( text_chunk_generator(), source_language="en", target_language="zh" ): translated_chunks.append(translated_chunk) print(f"Translated: {translated_chunk}") full_translation = "".join(translated_chunks) print("Full translation:", full_translation) asyncio.run(main()) ``` ### Note - Questa funzione è utile per elaborare testi di grandi dimensioni in modo efficiente in termini di memoria, poiché elabora e restituisce le traduzioni blocco per blocco. - La funzione gestisce la concatenazione dei blocchi internamente per garantire traduzioni coerenti attraverso i confini dei blocchi. - La gestione degli errori è integrata nella funzione e solleverà eccezioni se i servizi di traduzione incontrano problemi.
pt: ```python async for chunk in do_translate_async_stream( file_path: str, source_lang_code: str = "en", target_lang_code: str = "zh", translation_service: str = "google", api_key: str = None, **kwargs, ): yield chunk ``` This function is designed for translating the content of a `PDF` file and streaming the results in real-time. It is particularly useful for applications that require immediate feedback or for handling large files where waiting for the entire translation to complete is not feasible. ### Parameters - **file_path** (`str`): The path to the `PDF` file to be translated. - **source_lang_code** (`str`, optional): The language code of the source document. Defaults to `"en"`. - **target_lang_code** (`str`, optional): The language code for the translation output. Defaults to `"zh"`. - **translation_service** (`str`, optional): The translation service to use. Options include `"google"`, `"openai"`, `"azure"`, `"claude"`, `"ollama"`, `"gemini"`, `"groq"`, and `"deepseek"`. Defaults to `"google"`. - **api_key** (`str`, optional): The API key for the chosen translation service. Required for services that need authentication. - **kwargs**: Additional keyword arguments that can be passed to customize the translation process. These may include settings specific to the translation service or other operational parameters. ### Returns - **chunk** (`str`): A chunk of the translated text. The function yields these chunks as they become available, allowing for real-time processing. ### Example Usage ```python import asyncio from pdf2zh import do_translate_async_stream async def main(): async for chunk in do_translate_async_stream( file_path="sample.pdf", source_lang_code="en", target_lang_code="es", translation_service="google" ): print(chunk, end="", flush=True) asyncio.run(main()) ``` In this example, the function streams the translation of `sample.pdf` from English to Spanish using Google's translation service. Each chunk of translated text is printed as it is received. ### Notes - The function is asynchronous and must be used within an async context. - Ensure that the necessary dependencies for the chosen translation service are installed and configured. - The streaming capability is beneficial for applications that need to display progress or handle the translation output incrementally. --- ### TRANSLATION RESULT
ru: `do_translate_async_stream` is an asynchronous generator function that takes a PDF file and translates it into the target language. It yields translation progress and the translated text in real-time. ### Parameters - **file_path** (`str`): The path to the PDF file to be translated. - **target_lang** (`str`): The target language code (e.g., `"zh"` for Chinese). See [Supported Languages](./SUPPORTED_LANGUAGES.md) for more details. - **source_lang** (`str`, optional): The source language code (e.g., `"en"` for English). If not provided, the language will be auto-detected. Defaults to `None`. - **page_range** (`str`, optional): The range of pages to translate (e.g., `"1-3,5"`). If not provided, all pages will be translated. Defaults to `None`. - **output_type** (`str`, optional): The output type. Can be `"markdown"`, `"text"`, or `"pdf"`. Defaults to `"markdown"`. - **translation_service** (`str`, optional): The translation service to use. Can be `"google"`, `"azure"`, `"openai"`, `"groq"`, `"anthropic"`, or `"deepseek"`. Defaults to `"google"`. - **translation_model** (`str`, optional): The specific model to use for translation. For example, `"gpt-4o"` for OpenAI or `"claude-3-sonnet-20240229"` for Anthropic. If not provided, a default model for the service will be used. Defaults to `None`. - **api_key** (`str`, optional): The API key for the translation service. If not provided, it will try to read from environment variables. Defaults to `None`. - **config_path** (`str`, optional): The path to a custom configuration file. Defaults to `None`. - **timeout** (`int`, optional): Timeout in seconds for the translation request. Defaults to `300`. - **max_concurrent_requests** (`int`, optional): The maximum number of concurrent requests to the translation service. Defaults to `5`. - **max_tokens_per_request** (`int`, optional): The maximum number of tokens per request to the translation service. Defaults to `1000`. - **additional_config** (`dict`, optional): Additional configuration options for the translation service. Defaults to `None`. ### Yields - **progress** (`float`): The progress of the translation (0.0 to 1.0). - **translated_text** (`str`): The translated text for the current page (if `output_type` is `"markdown"` or `"text"`) or the path to the translated PDF file (if `output_type` is `"pdf"`). ### Example ```python import asyncio from pdf2zh import do_translate_async_stream async def main(): async for progress, translated_text in do_translate_async_stream( file_path="input.pdf", target_lang="zh", output_type="markdown" ): print(f"Progress: {progress:.2%}") if translated_text: print(translated_text) asyncio.run(main()) ``` ### Notes - This function is asynchronous and must be called with `async for` or within an asynchronous context. - The function yields progress updates and translated text in real-time, making it suitable for large files or streaming applications. - For `output_type="pdf"`, the function yields the path to the translated PDF file only once at the end of the translation. --- Now, please translate the above content into ru.
