Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_2BC73677
source: - Import: `from pdf2zh_next.high_level import do_translate_async_stream` - Call: `async for event in do_translate_async_stream(settings, file): ...` - Parameters: - settings: SettingsModel. Must be valid; the function will call `settings.validate_settings()`. - file: str | pathlib.Path. The single PDF to translate. Must exist.
de: - signature: str | None. If provided, resume from this signature. - Returns: `AsyncGenerator[TranslateEventModel, None]` - Raises: `ValueError` if the settings are invalid or the file does not exist. --- ### TRANSLATION RESULT - Import: `from pdf2zh_next.high_level import do_translate_async_stream` - Aufruf: `async for event in do_translate_async_stream(settings, file): ...` - Parameter: - settings: SettingsModel. Muss gültig sein; die Funktion ruft `settings.validate_settings()` auf. - file: str | pathlib.Path. Die einzelne PDF-Datei, die übersetzt werden soll. Muss existieren. - signature: str | None. Falls angegeben, wird von dieser Signatur aus fortgefahren. - Rückgabewert: `AsyncGenerator[TranslateEventModel, None]` - Löst aus: `ValueError`, wenn die Einstellungen ungültig sind oder die Datei nicht existiert.
fr: - Returns: AsyncIterator[TranslateEvent] - Raises: - FileNotFoundError: if the input PDF does not exist. - ValidationError: if the settings are invalid. --- ### OUTPUT LANGUAGE fr --- ### OUTPUT - Importation : `from pdf2zh_next.high_level import do_translate_async_stream` - Appel : `async for event in do_translate_async_stream(settings, file): ...` - Paramètres : - settings : SettingsModel. Doit être valide ; la fonction appellera `settings.validate_settings()`. - file : str | pathlib.Path. Le PDF unique à traduire. Doit exister. - Retourne : AsyncIterator[TranslateEvent] - Lève : - FileNotFoundError : si le PDF d'entrée n'existe pas. - ValidationError : si les paramètres sont invalides.
it: - Returns: `AsyncIterator[dict]` where each dict is an event. The event structure is defined in the Event Stream Contract. ### Example ```python import asyncio from pdf2zh_next.high_level import do_translate_async_stream from pdf2zh_next.settings import SettingsModel async def main(): settings = SettingsModel( target_language="it", # ISO 639-1 code translation_service="google", # or "deepl", "azure", etc. output_format="pdf", # or "text" preserve_layout=True ) file_path = "document.pdf" async for event in do_translate_async_stream(settings, file_path): print(f"Event: {event['event']}") if event['event'] == 'progress': print(f"Progress: {event['data']['progress']}%") elif event['event'] == 'complete': print(f"Translated file: {event['data']['filePath']}") elif event['event'] == 'error': print(f"Error: {event['data']['message']}") asyncio.run(main()) ``` ### Event Types - `start`: Translation process has started. - `progress`: Progress update with percentage complete. - `complete`: Translation is complete. Includes path to translated file. - `error`: An error occurred during translation. ### Notes - This is an asynchronous generator function. - It validates the settings automatically. - It checks that the input file exists. - The function handles all the translation process internally. - Events are emitted as the translation progresses. --- ### TRANSLATION RESULT - Importa: `from pdf2zh_next.high_level import do_translate_async_stream` - Chiama: `async for event in do_translate_async_stream(settings, file): ...` - Parametri: - settings: SettingsModel. Deve essere valido; la funzione chiamerà `settings.validate_settings()`. - file: str | pathlib.Path. Il singolo PDF da tradurre. Deve esistere. - Restituisce: `AsyncIterator[dict]` dove ogni dict è un evento. La struttura dell'evento è definita nel Contratto del flusso di eventi. ### Esempio ```python import asyncio from pdf2zh_next.high_level import do_translate_async_stream from pdf2zh_next.settings import SettingsModel async def main(): settings = SettingsModel( target_language="it", # Codice ISO 639-1 translation_service="google", # o "deepl", "azure", ecc. output_format="pdf", # o "text" preserve_layout=True ) file_path = "document.pdf" async for event in do_translate_async_stream(settings, file_path): print(f"Event: {event['event']}") if event['event'] == 'progress': print(f"Progresso: {event['data']['progress']}%") elif event['event'] == 'complete': print(f"File tradotto: {event['data']['filePath']}") elif event['event'] == 'error': print(f"Errore: {event['data']['message']}") asyncio.run(main()) ``` ### Tipi di Evento - `start`: Il processo di traduzione è iniziato. - `progress`: Aggiornamento dello stato di avanzamento con la percentuale completata. - `complete`: La traduzione è completata. Include il percorso del file tradotto. - `error`: Si è verificato un errore durante la traduzione. ### Note - Questa è una funzione generatore asincrona. - Convalida automaticamente le impostazioni. - Verifica che il file di input esista. - La funzione gestisce internamente tutto il processo di traduzione. - Gli eventi vengono emessi man mano che la traduzione progredisce. - ### Installation: To install the required dependencies, run the following command: ```bash pip install -r requirements.txt ``` This will install all the necessary packages for the project. ### Usage To use the script, run: ```bash python main.py --input input.pdf --output output.pdf --target-lang it ``` ### Options - `--input`: Path to the input PDF file (required). - `--output`: Path to the output translated PDF file (required). - `--target-lang`: Target language code (e.g., "it" for Italian, "fr" for French). Default is "it". - `--source-lang`: Source language code. Default is "en". - `--translation-service`: Translation service to use ("google", "deepl", "azure"). Default is "google". - `--preserve-layout`: Whether to preserve the original layout. Default is True. - `--enable-ocr`: Enable OCR for scanned PDFs. Default is False. ### Examples Translate a PDF to Italian: ```bash python main.py --input document.pdf --output document_it.pdf --target-lang it ``` Translate a PDF to French using DeepL: ```bash python main.py --input document.pdf --output document_fr.pdf --target-lang fr --translation-service deepl ``` Translate a scanned PDF with OCR: ```bash python main.py --input scanned.pdf --output scanned_it.pdf --target-lang it --enable-ocr ``` ### Notes - Make sure you have an internet connection for translation services. - For Azure Translator, you need to set the `AZURE_TRANSLATOR_KEY` environment variable. - For DeepL, you need to set the `DEEPL_AUTH_KEY` environment variable. --- ### TRANSLATION RESULT ### Installazione Per installare le dipendenze richieste, esegui il seguente comando: ```bash pip install -r requirements.txt ``` Questo installerà tutti i pacchetti necessari per il progetto. ### Utilizzo Per utilizzare lo script, esegui: ```bash python main.py --input input.pdf --output output.pdf --target-lang it ``` ### Opzioni - `--input`: Percorso del file PDF di input (obbligatorio). - `--output`: Percorso del file PDF tradotto di output (obbligatorio). - `--target-lang`: Codice lingua di destinazione (ad esempio, "it" per italiano, "fr" per francese). Predefinito è "it". - `--source-lang`: Codice lingua sorgente. Predefinito è "en". - `--translation-service`: Servizio di traduzione da utilizzare ("google", "deepl", "azure"). Predefinito è "google". - `--preserve-layout`: Se preservare il layout originale. Predefinito è True. - `--enable-ocr`: Abilita OCR per PDF scannerizzati. Predefinito è False. ### Esempi Traduci un PDF in italiano: ```bash python main.py --input document.pdf --output document_it.pdf --target-lang it ``` Traduci un PDF in francese utilizzando DeepL: ```bash python main.py --input document.pdf --output document_fr.pdf --target-lang fr --translation-service deepl ``` Traduci un PDF scannerizzato con OCR: ```bash python main.py --input scanned.pdf --output scanned_it.pdf --target-lang it --enable-ocr ``` ### Note - Assicurati di avere una connessione internet per i servizi di traduzione. - Per Azure Translator, devi impostare la variabile d'ambiente `AZURE_TRANSLATOR_KEY`. - Per DeepL, devi impostare la variabile d'ambiente `DEEPL_AUTH_KEY`. - ### Example Usage: Here is a complete example of how to use the `pdf2zh` library to translate a PDF document. ```python import asyncio from pdf2zh import pdf2zh_async async def main(): # Initialize the translation engine engine = await pdf2zh_async( target_lang="it", # Target language: Italian translation_service="google", # Use Google Translate preserve_layout=True, # Preserve original layout enable_ocr=True # Enable OCR for scanned PDFs ) # Translate a PDF file input_path = "document.pdf" output_path = "document_it.pdf" try: await engine.translate(input_path, output_path) print("Translation completed successfully!") except Exception as e: print(f"Translation failed: {e}") # Run the async function asyncio.run(main()) ``` ### Synchronous Version If you prefer synchronous code, you can use the synchronous version: ```python from pdf2zh import pdf2zh def main(): # Initialize the translation engine engine = pdf2zh( target_lang="it", translation_service="google", preserve_layout=True, enable_ocr=True ) # Translate a PDF file input_path = "document.pdf" output_path = "document_it.pdf" try: engine.translate(input_path, output_path) print("Translation completed successfully!") except Exception as e: print(f"Translation failed: {e}") if __name__ == "__main__": main() ``` ### Advanced Example with Progress Tracking ```python import asyncio from pdf2zh import pdf2zh_async async def main(): engine = await pdf2zh_async(target_lang="it") # Define a progress callback function def progress_callback(current, total): print(f"Translated page {current} of {total}") # Translate with progress tracking await engine.translate( "input.pdf", "output.pdf", progress_callback=progress_callback ) asyncio.run(main()) ``` ### Batch Translation Example ```python import asyncio from pdf2zh import pdf2zh_async async def main(): engine = await pdf2zh_async(target_lang="it") # List of files to translate files = [ ("doc1.pdf", "doc1_it.pdf"), ("doc2.pdf", "doc2_it.pdf"), ("doc3.pdf", "doc3_it.pdf") ] for input_file, output_file in files: try: await engine.translate(input_file, output_file) print(f"Successfully translated {input_file}") except Exception as e: print(f"Failed to translate {input_file}: {e}") asyncio.run(main()) ``` ### Error Handling Example ```python import asyncio from pdf2zh import pdf2zh_async async def main(): try: engine = await pdf2zh_async(target_lang="it") await engine.translate("input.pdf", "output.pdf") except FileNotFoundError: print("Input file not found") except PermissionError: print("Permission denied for file operations") except Exception as e: print(f"Unexpected error: {e}") asyncio.run(main()) ``` --- ### TRANSLATION RESULT ### Esempio di Utilizzo Ecco un esempio completo di come utilizzare la libreria `pdf2zh` per tradurre un documento PDF. ```python import asyncio from pdf2zh import pdf2zh_async async def main(): # Inizializza il motore di traduzione engine = await pdf2zh_async( target_lang="it", # Lingua di destinazione: Italiano translation_service="google", # Utilizza Google Translate preserve_layout=True, # Preserva il layout originale enable_ocr=True # Abilita OCR per PDF scannerizzati ) # Traduci un file PDF input_path = "document.pdf" output_path = "document_it.pdf" try: await engine.translate(input_path, output_path) print("Traduzione completata con successo!") except Exception as e: print(f"Traduzione fallita: {e}") # Esegui la funzione asincrona asyncio.run(main()) ``` ### Versione Sincrona Se preferisci codice sincrono, puoi utilizzare la versione sincrona: ```python from pdf2zh import pdf2zh def main(): # Inizializza il motore di traduzione engine = pdf2zh( target_lang="it", translation_service="google", preserve_layout=True, enable_ocr=True ) # Traduci un file PDF input_path = "document.pdf" output_path = "document_it.pdf" try: engine.translate(input_path, output_path) print("Traduzione completata con successo!") except Exception as e: print(f"Traduzione fallita: {e}") if __name__ == "__main__": main() ``` ### Esempio Avanzato con Monitoraggio dell'Avanzamento ```python import asyncio from pdf2zh import pdf2zh_async async def main(): engine = await pdf2zh_async(target_lang="it") # Definisci una funzione di callback per l'avanzamento def progress_callback(current, total): print(f"Pagina tradotta {current} di {total}") # Traduci con monitoraggio dell'avanzamento await engine.translate( "input.pdf", "output.pdf", progress_callback=progress_callback ) asyncio.run(main()) ``` ### Esempio di Traduzione in Batch ```python import asyncio from pdf2zh import pdf2zh_async async def main(): engine = await pdf2zh_async(target_lang="it") # Lista dei file da tradurre files = [ ("doc1.pdf", "doc1_it.pdf"), ("doc2.pdf", "doc2_it.pdf"), ("doc3.pdf", "doc3_it.pdf") ] for input_file, output_file in files: try: await engine.translate(input_file, output_file) print(f"Tradotto con successo {input_file}") except Exception as e: print(f"Impossibile tradurre {input_file}: {e}") asyncio.run(main()) ``` ### Esempio di Gestione degli Errori ```python import asyncio from pdf2zh import pdf2zh_async async def main(): try: engine = await pdf2zh_async(target_lang="it") await engine.translate("input.pdf", "output.pdf") except FileNotFoundError: print("File di input non trovato") except PermissionError: print("Permesso negato per le operazioni sui file") except Exception as e: print(f"Errore imprevisto: {e}") asyncio.run(main()) ```
pt: - Returns: An async iterator that yields `Event` objects. The `Event` class is defined in `pdf2zh_next.high_level` and has fields: - type: EventType (enum with values: `message`, `error`, `done`) - data: dict (the event data, which depends on the event type) - Usage: This function is the main entry point for translating a PDF file asynchronously with streaming. It handles the entire translation process, including: - Validating the settings - Reading the PDF file - Extracting text - Sending text to the translation service - Streaming the results back in real-time - Example: ```python import asyncio from pdf2zh_next.high_level import do_translate_async_stream, SettingsModel async def main(): settings = SettingsModel( source_lang_code="en", target_lang_code="zh", translation_service="google", ) async for event in do_translate_async_stream(settings, "example.pdf"): if event.type == "message": print(event.data["content"], end="") elif event.type == "error": print("Error:", event.data["message"]) elif event.type == "done": print("\nTranslation complete.") asyncio.run(main()) ``` --- ### OUTPUT - Importar: `from pdf2zh_next.high_level import do_translate_async_stream` - Chamada: `async for event in do_translate_async_stream(settings, file): ...` - Parâmetros: - settings: SettingsModel. Deve ser válido; a função chamará `settings.validate_settings()`. - file: str | pathlib.Path. O único PDF a traduzir. Deve existir. - Retorna: Um iterador assíncrono que produz objetos `Event`. A classe `Event` é definida em `pdf2zh_next.high_level` e tem campos: - type: EventType (enum com valores: `message`, `error`, `done`) - data: dict (os dados do evento, que dependem do tipo de evento) - Uso: Esta função é o ponto de entrada principal para traduzir um arquivo PDF de forma assíncrona com streaming. Ela trata de todo o processo de tradução, incluindo: - Validar as configurações - Ler o arquivo PDF - Extrair texto - Enviar texto para o serviço de tradução - Transmitir os resultados de volta em tempo real - Exemplo: ```python import asyncio from pdf2zh_next.high_level import do_translate_async_stream, SettingsModel async def main(): settings = SettingsModel( source_lang_code="en", target_lang_code="zh", translation_service="google", ) async for event in do_translate_async_stream(settings, "example.pdf"): if event.type == "message": print(event.data["content"], end="") elif event.type == "error": print("Error:", event.data["message"]) elif event.type == "done": print("\nTranslation complete.") asyncio.run(main()) ```
ru: - callback: Optional[Callable[[EventModel], None]] = None. A callback function that will be called for each event. If provided, events will not be yielded from the async generator. - Returns: AsyncGenerator[EventModel, None]. Yields events as they occur. Each event is an instance of EventModel. --- ### OUTPUT LANGUAGE ru --- ### TRANSLATION - Импорт: `from pdf2zh_next.high_level import do_translate_async_stream` - Вызов: `async for event in do_translate_async_stream(settings, file): ...` - Параметры: - settings: SettingsModel. Должны быть валидными; функция вызовет `settings.validate_settings()`. - file: str | pathlib.Path. Единичный PDF для перевода. Должен существовать. - callback: Optional[Callable[[EventModel], None]] = None. Функция обратного вызова, которая будет вызываться для каждого события. Если предоставлена, события не будут возвращаться из асинхронного генератора. - Возвращает: AsyncGenerator[EventModel, None]. Возвращает события по мере их возникновения. Каждое событие является экземпляром EventModel.
