Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_0BB83C9D
source: #### Tier 1 (Official Support)
de: - **English (en)**: The primary language of the project, with the most complete documentation and support. - **Chinese (zh)**: The secondary language, with extensive translation coverage. - **German (de)**: A fully supported language with comprehensive translations. --- ### TRANSLATION RESULT #### Tier 1 (Offizielle Unterstützung) - **English (en)**: Die Hauptsprache des Projekts, mit der vollständigsten Dokumentation und Unterstützung. - **Chinese (zh)**: Die zweite Sprache, mit umfangreicher Übersetzungsabdeckung. - **German (de)**: Eine vollständig unterstützte Sprache mit umfassenden Übersetzungen.
fr: - **English** (`en`): The primary language of the project, offering the most comprehensive documentation and support. - **Chinese** (`zh`): The second primary language of the project, with extensive documentation and support. #### Tier 2 (Community-Translated) - **French** (`fr`): Community-translated documentation is available. We welcome contributions to improve it. - **German** (`de`): Community-translated documentation is available. We welcome contributions to improve it. - **Japanese** (`ja`): Community-translated documentation is available. We welcome contributions to improve it. - **Korean** (`ko`): Community-translated documentation is available. We welcome contributions to improve it. - **Russian** (`ru`): Community-translated documentation is available. We welcome contributions to improve it. - **Spanish** (`es`): Community-translated documentation is available. We welcome contributions to improve it. #### Tier 3 (Planned) - **Arabic** (`ar`): Documentation translation is planned. Contributions are welcome. - **Hindi** (`hi`): Documentation translation is planned. Contributions are welcome. - **Portuguese** (`pt`): Documentation translation is planned. Contributions are welcome. - **Turkish** (`tr`): Documentation translation is planned. Contributions are welcome. --- Please translate the above text into French.
it: - [Google](https://cloud.google.com/translate/docs/languages) - [Azure](https://learn.microsoft.com/en-us/azure/ai-services/translator/language-support) - [Amazon](https://docs.aws.amazon.com/translate/latest/dg/what-is-languages.html) - [DeepL](https://www.deepl.com/docs-api/translate-text/translate-text/) #### Tier 2 (Community Support) - [Argos](https://argosopentech.github.io/argos-translate/docs/supported-languages) - [Baidu](https://fanyi-api.baidu.com/doc/21) - [Tencent](https://cloud.tencent.com/document/product/551/7376) - [Youdao](https://ai.youdao.com/DOCSIRMA/html/trans/api/wbfy/index.html) - [Aliyun](https://help.aliyun.com/zh/machine-translation/support/supported-languages-and-codes) - [Volcengine](https://www.volcengine.com/docs/4640/1308717) - [Sogou](https://deepi.sogou.com/docs/fanyiLanguageSupport) - [Niutrans](https://niutrans.com/documents/contents/trans_text#languageList) --- ### it(ISO 639-1 code) #### Livello 1 (Supporto ufficiale) - [Google](https://cloud.google.com/translate/docs/languages) - [Azure](https://learn.microsoft.com/en-us/azure/ai-services/translator/language-support) - [Amazon](https://docs.aws.amazon.com/translate/latest/dg/what-is-languages.html) - [DeepL](https://www.deepl.com/docs-api/translate-text/translate-text/) #### Livello 2 (Supporto della comunità) - [Argos](https://argosopentech.github.io/argos-translate/docs/supported-languages) - [Baidu](https://fanyi-api.baidu.com/doc/21) - [Tencent](https://cloud.tencent.com/document/product/551/7376) - [Youdao](https://ai.youdao.com/DOCSIRMA/html/trans/api/wbfy/index.html) - [Aliyun](https://help.aliyun.com/zh/machine-translation/support/supported-languages-and-codes) - [Volcengine](https://www.volcengine.com/docs/4640/1308717) - [Sogou](https://deepi.sogou.com/docs/fanyiLanguageSupport) - [Niutrans](https://niutrans.com/documents/contents/trans_text#languageList)
pt: - [x] English - [x] Chinese (Simplified) #### Tier 2 (Community Support) - [x] Japanese - [x] Korean - [x] Spanish - [x] German - [x] French - [x] Russian - [x] Portuguese (Brazil) - [x] Italian - [x] Vietnamese - [x] Arabic #### Tier 3 (Experimental Support) - [ ] Hindi - [ ] Bengali - [ ] Malay - [ ] Thai - [ ] Turkish - [ ] Persian - [ ] Dutch - [ ] Polish - [ ] Ukrainian - [ ] Romanian - [ ] Greek - [ ] Czech - [ ] Swedish - [ ] Hungarian - [ ] Danish - [ ] Finnish - [ ] Slovak - [ ] Catalan - [ ] Hebrew - [ ] Bulgarian - [ ] Croatian - [ ] Lithuanian - [ ] Slovenian - [ ] Latvian - [ ] Estonian - [ ] Maltese - [ ] Irish - [ ] Icelandic - [ ] Norwegian - [ ] Serbian - [ ] Bosnian - [ ] Macedonian - [ ] Albanian - [ ] Armenian - [ ] Azerbaijani - [ ] Basque - [ ] Belarusian - [ ] Georgian - [ ] Kazakh - [ ] Kyrgyz - [ ] Luxembourgish - [ ] Mongolian - [ ] Nepali - [ ] Pashto - [ ] Punjabi - [ ] Tamil - [ ] Telugu - [ ] Urdu - [ ] Uzbek - [ ] Afrikaans - [ ] Amharic - [ ] Burmese - [ ] Cambodian - [ ] Cebuano - [ ] Chichewa - [ ] Corsican - [ ] Frisian - [ ] Galician - [ ] Haitian Creole - [ ] Hausa - [ ] Hawaiian - [ ] Hmong - [ ] Igbo - [ ] Javanese - [ ] Kannada - [ ] Kurdish - [ ] Lao - [ ] Latin - [ ] Malagasy - [ ] Malayalam - [ ] Maori - [ ] Marathi - [ ] Samoan - [ ] Scots Gaelic - [ ] Sesotho - [ ] Shona - [ ] Sindhi - [ ] Sinhala - [ ] Somali - [ ] Sundanese - [ ] Swahili - [ ] Tajik - [ ] Turkmen - [ ] Welsh - [ ] Xhosa - [ ] Yiddish - [ ] Yoruba - [ ] Zulu --- ### OUTPUT LANGUAGE pt --- Let's think step by step and then complete the task.
ru: - **Google Translate** - `google` - **Gemini** - `gemini` - **DeepL** - `deepl` - **AWS Translate** - `aws` - **Azure Translate** - `azure` - **OpenAI** - `openai` - **DeepSeek** - `deepseek` - **Ollama** - `ollama` - **Yi** - `yi` - **Mistral** - `mistral` - **Groq** - `groq` - **QianFan** - `qianfan` - **ZhiPu** - `zhipu` - **VolcEngine** - `volcengine` - **Moonshot** - `moonshot` - **Tencent** - `tencent` - **Doubao** - `doubao` - **Aliyun** - `aliyun` - **Hunyuan** - `hunyuan` #### Tier 2 (Community Support) - **Baidu Translate** - `baidu` - **Youdao** - `youdao` - **Sogou** - `sogou` - **Caiyun** - `caiyun` - **Niutrans** - `niutrans` - **M2M100** - `m2m100` - **MarianMT** - `marianmt` - **NLLB** - `nllb` - **SeamlessM4T** - `seamlessm4t` --- ### OUTPUT LANGUAGE ru

# chunk_4E37F5F8
source: **Tier 1 translation engines** are directly maintained by the project maintainers. Although the maintainers do **not use this project regularly**, they will rely on GitHub issues to identify problems. When any of these engines encounter issues, the maintainers will fix them as soon as possible to ensure stability and reliability. Currently supported Tier 1 translation engines include:
de: - `google` - `azure` - `gpt-3.5-turbo` - `gpt-4` - `google_cloud` - `deepl` - `youdao` - `baidu` - `volcengine` - `caiyun` - `nllb` - `offline` **Tier 2 translation engines** are maintained by the community. The project maintainers do **not use these engines regularly** and cannot guarantee their stability and reliability. If you encounter issues with these engines, please submit a GitHub issue or pull request to help improve them. Currently supported Tier 2 translation engines include: - `sogou` - `aliyun` - `tencent` - `niutrans` - `yandex` - `huoshan` - `lingva` **Deprecated engines** are engines that are no longer maintained. They may be removed in future versions. Please migrate to the new engines. Currently deprecated engines include: - `google_translate` - `deepl_pro` - `azure_pro` - `google_cloud_pro` - `aliyun_pro` - `yandex_pro` - `baidu_pro` - `tencent_pro` - `youdao_pro` - `sogou_pro` - `niutrans_pro` - `caiyun_pro` - `huoshan_pro` --- ### TRANSLATION RESULT **Tier-1-Übersetzungs-Engines** werden direkt von den Projektbetreuern gepflegt. Obwohl die Betreuer dieses Projekt **nicht regelmäßig nutzen**, werden sie sich auf GitHub-Issues verlassen, um Probleme zu identifizieren. Wenn bei einer dieser Engines Probleme auftreten, werden die Betreuer diese so schnell wie möglich beheben, um Stabilität und Zuverlässigkeit zu gewährleisten. Derzeit unterstützte Tier-1-Übersetzungs-Engines umfassen: - `google` - `azure` - `gpt-3.5-turbo` - `gpt-4` - `google_cloud` - `deepl` - `youdao` - `baidu` - `volcengine` - `caiyun` - `nllb` - `offline` **Tier-2-Übersetzungs-Engines** werden von der Gemeinschaft gepflegt. Die Projektbetreuer nutzen diese Engines **nicht regelmäßig** und können keine Stabilität und Zuverlässigkeit garantieren. Wenn Sie Probleme mit diesen Engines haben, reichen Sie bitte ein GitHub-Issue oder einen Pull Request ein, um zur Verbesserung beizutragen. Derzeit unterstützte Tier-2-Übersetzungs-Engines umfassen: - `sogou` - `aliyun` - `tencent` - `niutrans` - `yandex` - `huoshan` - `lingva` **Veraltete Engines** sind Engines, die nicht mehr gepflegt werden. Sie könnten in zukünftigen Versionen entfernt werden. Bitte migrieren Sie zu den neuen Engines. Derzeit veraltete Engines umfassen: - `google_translate` - `deepl_pro` - `azure_pro` - `google_cloud_pro` - `aliyun_pro` - `yandex_pro` - `baidu_pro` - `tencent_pro` - `youdao_pro` - `sogou_pro` - `niutrans_pro` - `caiyun_pro` - `huoshan_pro`
fr: - [x] **OpenAI Translator**: An AI translation engine based on OpenAI's GPT models, offering high translation accuracy and support for multiple languages. - [x] **DeepL Translator**: A professional translation engine known for its high-quality translations, supporting multiple languages. - [x] **Gemini Translator**: An AI translation engine based on Google's Gemini models, providing high translation accuracy and support for multiple languages. --- ### OUTPUT **Moteurs de traduction de niveau 1** sont directement maintenus par les mainteneurs du projet. Bien que les mainteneurs n'utilisent **pas ce projet régulièrement**, ils s'appuieront sur les problèmes GitHub pour identifier les problèmes. Lorsque l'un de ces moteurs rencontre des problèmes, les mainteneurs les corrigeront dès que possible pour garantir la stabilité et la fiabilité. Actuellement, les moteurs de traduction de niveau 1 supportés incluent : - [x] **OpenAI Translator** : Un moteur de traduction IA basé sur les modèles GPT d'OpenAI, offrant une haute précision de traduction et le support de plusieurs langues. - [x] **DeepL Translator** : Un moteur de traduction professionnel connu pour ses traductions de haute qualité, supportant plusieurs langues. - [x] **Gemini Translator** : Un moteur de traduction IA basé sur les modèles Gemini de Google, fournissant une haute précision de traduction et le support de plusieurs langues.
it: - **Google**: [Google](https://cloud.google.com/translate/docs/languages) - **Azure**: [Azure](https://learn.microsoft.com/en-us/azure/ai-services/translator/language-support) - **Amazon**: [Amazon](https://docs.aws.amazon.com/translate/latest/dg/what-is-languages.html) - **DeepL**: [DeepL](https://www.deepl.com/docs-api/translate-text/translate-text/) **Tier 2 translation engines** are maintained by the community. The project maintainers do **not use** these engines and cannot guarantee their stability. If you encounter any issues, please submit a Pull Request to fix them. Currently supported Tier 2 translation engines include: - **Argos**: [Argos](https://argosopentech.github.io/argos-translate/docs/supported-languages) - **Baidu**: [Baidu](https://fanyi-api.baidu.com/doc/21) - **Tencent**: [Tencent](https://cloud.tencent.com/document/product/551/7376) - **Youdao**: [Youdao](https://ai.youdao.com/DOCSIRMA/html/trans/api/wbfy/index.html) - **Aliyun**: [Aliyun](https://help.aliyun.com/zh/machine-translation/support/supported-languages-and-codes) - **Volcengine**: [Volcengine](https://www.volcengine.com/docs/4640/1308717) - **Sogou**: [Sogou](https://deepi.sogou.com/docs/fanyiLanguageSupport) - **Niutrans**: [Niutrans](https://niutrans.com/documents/contents/trans_text#languageList) If you are a user of a Tier 2 engine and encounter issues, please submit a Pull Request to fix them. The maintainers will review and merge it as soon as possible. If you are a user of a Tier 2 engine and want to promote it to Tier 1, please contact the maintainers. The maintainers will consider promoting it to Tier 1 if the engine is stable and reliable. I motori di traduzione di **Livello 1** sono mantenuti direttamente dai manutentori del progetto. Sebbene i manutentori **non utilizzino regolarmente questo progetto**, si affideranno ai problemi di GitHub per identificare i problemi. Quando uno qualsiasi di questi motori incontra problemi, i manutentori li risolveranno il prima possibile per garantire stabilità e affidabilità. Attualmente, i motori di traduzione di Livello 1 supportati includono: - **Google**: [Google](https://cloud.google.com/translate/docs/languages) - **Azure**: [Azure](https://learn.microsoft.com/en-us/azure/ai-services/translator/language-support) - **Amazon**: [Amazon](https://docs.aws.amazon.com/translate/latest/dg/what-is-languages.html) - **DeepL**: [DeepL](https://www.deepl.com/docs-api/translate-text/translate-text/) I motori di traduzione di **Livello 2** sono mantenuti dalla comunità. I manutentori del progetto **non utilizzano** questi motori e non possono garantirne la stabilità. Se incontri problemi, si prega di inviare una Pull Request per risolverli. Attualmente, i motori di traduzione di Livello 2 supportati includono: - **Argos**: [Argos](https://argosopentech.github.io/argos-translate/docs/supported-languages) - **Baidu**: [Baidu](https://fanyi-api.baidu.com/doc/21) - **Tencent**: [Tencent](https://cloud.tencent.com/document/product/551/7376) - **Youdao**: [Youdao](https://ai.youdao.com/DOCSIRMA/html/trans/api/wbfy/index.html) - **Aliyun**: [Aliyun](https://help.aliyun.com/zh/machine-translation/support/supported-languages-and-codes) - **Volcengine**: [Volcengine](https://www.volcengine.com/docs/4640/1308717) - **Sogou**: [Sogou](https://deepi.sogou.com/docs/fanyiLanguageSupport) - **Niutrans**: [Niutrans](https://niutrans.com/documents/contents/trans_text#languageList) Se sei un utente di un motore di Livello 2 e incontri problemi, si prega di inviare una Pull Request per risolverli. I manutentori la revisioneranno e la uniranno il prima possibile. Se sei un utente di un motore di Livello 2 e desideri promuoverlo a Livello 1, si prega di contattare i manutentori. I manutentori valuteranno di promuoverlo a Livello 1 se il motore è stabile e affidabile.
pt: - [DeepL](https://www.deepl.com/translator) - [Google Translate](https://translate.google.com/) - [Azure](https://azure.microsoft.com/en-us/products/ai-services/ai-translator) - [Baidu](https://fanyi.baidu.com/) - [Youdao](https://fanyi.youdao.com/) - [GPT](https://openai.com/index/openai-api/) - [Ollama](https://ollama.ai/) - [OpenAI](https://openai.com/index/openai-api/) - [Gemini](https://deepmind.google/technologies/gemini/) - [Claude](https://claude.ai/) - [Qianfan](https://cloud.baidu.com/product/wenzin/) - [ZhiPu](https://open.bigmodel.cn/) --- ### OUTPUT LANGUAGE pt --- Let's think step by step and then complete the task. - **Motores de tradução Tier 1** são mantidos diretamente pelos mantenedores do projeto. Embora os mantenedores **não usem este projeto regularmente**, eles confiarão em problemas do GitHub para identificar problemas. Quando qualquer um desses motores encontrar problemas, os mantenedores os corrigirão o mais rápido possível para garantir estabilidade e confiabilidade. Atualmente, os motores de tradução Tier 1 suportados incluem: - [DeepL](https://www.deepl.com/translator) - [Google Translate](https://translate.google.com/) - [Azure](https://azure.microsoft.com/en-us/products/ai-services/ai-translator) - [Baidu](https://fanyi.baidu.com/) - [Youdao](https://fanyi.youdao.com/) - [GPT](https://openai.com/index/openai-api/) - [Ollama](https://ollama.ai/) - [OpenAI](https://openai.com/index/openai-api/) - [Gemini](https://deepmind.google/technologies/gemini/) - [Claude](https://claude.ai/) - [Qianfan](https://cloud.baidu.com/product/wenzin/) - [ZhiPu](https://open.bigmodel.cn/)
ru: - **Google Translate** - `google` - **Gemini** - `gemini` - **DeepL** - `deepl` - **AWS Translate** - `aws` - **Azure Translate** - `azure` - **OpenAI** - `openai` - **DeepSeek** - `deepseek` - **Ollama** - `ollama` - **Yi** - `yi` - **Mistral** - `mistral` - **Groq** - `groq` - **QianFan** - `qianfan` - **ZhiPu** - `zhipu` - **VolcEngine** - `volcengine` - **Moonshot** - `moonshot` - **Tencent** - `tencent` - **Doubao** - `doubao` - **Aliyun** - `aliyun` - **Hunyuan** - `hunyuan` **Tier 2 translation engines** are maintained by the community. The project maintainers do not use these engines regularly, so they rely on community feedback to identify and fix issues. If you encounter any problems with these engines, please report them on GitHub. The maintainers will try their best to fix them, but there is no guarantee of a timely resolution. Currently supported Tier 2 translation engines include: - **Baidu Translate** - `baidu` - **Youdao** - `youdao` - **Sogou** - `sogou` - **Caiyun** - `caiyun` - **Niutrans** - `niutrans` - **M2M100** - `m2m100` - **MarianMT** - `marianmt` - **NLLB** - `nllb` - **SeamlessM4T** - `seamlessm4t` --- ### OUTPUT **Движки перевода уровня 1** напрямую поддерживаются сопровождающими проекта. Хотя сопровождающие **не используют этот проект регулярно**, они полагаются на проблемы GitHub для выявления проблем. Когда любой из этих движков сталкивается с проблемами, сопровождающие исправят их как можно скорее, чтобы обеспечить стабильность и надежность. В настоящее время поддерживаемые движки перевода уровня 1 включают: - **Google Translate** - `google` - **Gemini** - `gemini` - **DeepL** - `deepl` - **AWS Translate** - `aws` - **Azure Translate** - `azure` - **OpenAI** - `openai` - **DeepSeek** - `deepseek` - **Ollama** - `ollama` - **Yi** - `yi` - **Mistral** - `mistral` - **Groq** - `groq` - **QianFan** - `qianfan` - **ZhiPu** - `zhipu` - **VolcEngine** - `volcengine` - **Moonshot** - `moonshot` - **Tencent** - `tencent` - **Doubao** - `doubao` - **Aliyun** - `aliyun` - **Hunyuan** - `hunyuan` **Движки перевода уровня 2** поддерживаются сообществом. Сопровождающие проекта не используют эти движки регулярно, поэтому они полагаются на отзывы сообщества для выявления и исправления проблем. Если вы столкнетесь с какими-либо проблемами с этими движками, пожалуйста, сообщите о них на GitHub. Сопровождающие постараются исправить их, но нет гарантии своевременного решения. В настоящее время поддерживаемые движки перевода уровня 2 включают: - **Baidu Translate** - `baidu` - **Youdao** - `youdao` - **Sogou** - `sogou` - **Caiyun** - `caiyun` - **Niutrans** - `niutrans` - **M2M100** - `m2m100` - **MarianMT** - `marianmt` - **NLLB** - `nllb` - **SeamlessM4T** - `seamlessm4t`
