Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_3165C2A9
source: | `--warmup` | Only download and verify required assets then exit | `pdf2zh_next example.pdf --warmup` |
de: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--no-warmup` | Disable the warmup process, which includes downloading and verifying required assets | `pdf2zh_next example.pdf --no-warmup` | | `--log-level <level>` | Set the log level (default: `info`) | `pdf2zh_next example.pdf --log-level debug` | | `--log-to-file` | Save logs to a file (default: disabled) | `pdf2zh_next example.pdf --log-to-file` | | `--log-file <path>` | Specify the log file path (default: `pdf2zh_next.log`) | `pdf2zh_next example.pdf --log-file mylog.txt` | | `--log-format <format>` | Set the log format (`json` or `text`, default: `text`) | `pdf2zh_next example.pdf --log-format json` | | `--log-keep <number>` | Number of log files to keep (default: `5`) | `pdf2zh_next example.pdf --log-keep 10` | | `--log-compress` | Compress old log files (default: disabled) | `pdf2zh_next example.pdf --log-compress` | | `--config <path>` | Specify a custom configuration file | `pdf2zh_next example.pdf --config ./myconfig.yaml` | | `--cache-dir <path>` | Specify the cache directory (default: `~/.cache/pdf2zh_next`) | `pdf2zh_next example.pdf --cache-dir ./mycache` | | `--output-dir <path>` | Specify the output directory (default: current directory) | `pdf2zh_next example.pdf --output-dir ./output` | | `--output-suffix <suffix>` | Add a suffix to the output filename (default: `_translated`) | `pdf2zh_next example.pdf --output-suffix _zh` | | `--output-format <format>` | Set the output format (`pdf`, `markdown`, or `text`, default: `pdf`) | `pdf2zh_next example.pdf --output-format markdown` | | `--target-lang <lang>` | Set the target language (default: `zh`) | `pdf2zh_next example.pdf --target-lang en` | | `--source-lang <lang>` | Set the source language (default: `auto`) | `pdf2zh_next example.pdf --source-lang en` | | `--translator <translator>` | Set the translator service (`google`, `azure`, `deepl`, `openai`, default: `google`) | `pdf2zh_next example.pdf --translator deepl` | | `--translator-key <key>` | Set the translator API key (if required) | `pdf2zh_next example.pdf --translator-key YOUR_API_KEY` | | `--translator-endpoint <url>` | Set the translator endpoint (for self-hosted services) | `pdf2zh_next example.pdf --translator-endpoint http://localhost:8080` | | `--translator-region <region>` | Set the translator region (for some services like Azure) | `pdf2zh_next example.pdf --translator-region eastus` | | `--translator-model <model>` | Set the translator model (for some services like OpenAI) | `pdf2zh_next example.pdf --translator-model gpt-4` | | `--math-translator <translator>`| Set the math translator service (`none`, `pdfmathtranslate`, default: `pdfmathtranslate`) | `pdf2zh_next example.pdf --math-translator none` | | `--math-translator-key <key>` | Set the math translator API key (if required) | `pdf2zh_next example.pdf --math-translator-key YOUR_API_KEY` | | `--math-translator-endpoint <url>`| Set the math translator endpoint (for self-hosted services) | `pdf2zh_next example.pdf --math-translator-endpoint http://localhost:8081` | | `--math-keep-original` | Keep the original math expressions (default: disabled) | `pdf2zh_next example.pdf --math-keep-original` | | `--math-translate-words` | Translate words in math expressions (default: disabled) | `pdf2zh_next example.pdf --math-translate-words` | | `--ocr-engine <engine>` | Set the OCR engine (`tesseract`, `easyocr`, default: `tesseract`) | `pdf2zh_next example.pdf --ocr-engine easyocr` | | `--ocr-lang <lang>` | Set the OCR language (default: `eng`) | `pdf2zh_next example.pdf --ocr-lang chi_sim` | | `--ocr-dpi <dpi>` | Set the OCR DPI (default: `300`) | `pdf2zh_next example.pdf --ocr-dpi 600` | | `--ocr-timeout <seconds>` | Set the OCR timeout in seconds (default: `30`) | `pdf2zh_next example.pdf --ocr-timeout 60` | | `--concurrency <number>` | Set the number of concurrent tasks (default: `4`) | `pdf2zh_next example.pdf --concurrency 8` | | `--timeout <seconds>` | Set the overall timeout in seconds (default: `3600`) | `pdf2zh_next example.pdf --timeout 7200` | | `--retry <number>` | Set the number of retries for failed tasks (default: `3`) | `pdf2zh_next example.pdf --retry 5` | | `--retry-delay <seconds>` | Set the delay between retries in seconds (default: `1`) | `pdf2zh_next example.pdf --retry-delay 2` | | `--max-requests <number>` | Set the maximum number of requests per minute (default: `60`) | `pdf2zh_next example.pdf --max-requests 30` | | `--proxy <url>` | Set the proxy URL | `pdf2zh_next example.pdf --proxy http://proxy.example.com:8080` | | `--no-proxy` | Disable proxy usage | `pdf2zh_next example.pdf --no-proxy` | | `--user-agent <string>` | Set the user agent string | `pdf2zh_next example.pdf --user-agent "My Custom Agent"` | | `--cookie <string>` | Set the cookie string | `pdf2zh_next example.pdf --cookie "session=abc123"` | | `--header <string>` | Add a custom header (can be used multiple times) | `pdf2zh_next example.pdf --header "Authorization: Bearer token" --header "X-Custom: value"` | | `--page-range <range>` | Process only specified pages (e.g., `1-5,8,10-12`) | `pdf2zh_next example.pdf --page-range 1-5,10` | | `--ignore-images` | Skip image processing | `pdf2zh_next example.pdf --ignore-images` | | `--ignore-tables` | Skip table processing | `pdf2zh_next example.pdf --ignore-tables` | | `--ignore-math` | Skip math processing | `pdf2zh_next example.pdf --ignore-math` | | `--ignore-footnotes` | Skip footnote processing | `pdf2zh_next example.pdf --ignore-footnotes` | | `--ignore-headers` | Skip header processing | `pdf2zh_next example.pdf --ignore-headers` | | `--ignore-footers` | Skip footer processing | `pdf2zh_next example.pdf --ignore-footers` | | `--keep-layout` | Preserve the original layout as much as possible (default: enabled) | `pdf2zh_next example.pdf --no-keep-layout` | | `--keep-fonts` | Preserve the original fonts (default: enabled) | `pdf2zh_next example.pdf --no-keep-fonts` | | `--keep-colors` | Preserve the original colors (default: enabled) | `pdf2zh_next example.pdf --no-keep-colors` | | `--keep-links` | Preserve hyperlinks (default: enabled) | `pdf2zh_next example.pdf --no-keep-links` | | `--keep-annotations` | Preserve annotations (default: enabled) | `pdf2zh_next example.pdf --no-keep-annotations` | | `--watermark <text>` | Add a watermark to the output | `pdf2zh_next example.pdf --watermark "Translated by pdf2zh"` | | `--watermark-opacity <opacity>` | Set the watermark opacity (0.0 to 1.0, default: `0.2`) | `pdf2zh_next example.pdf --watermark-opacity 0.5` | | `--watermark-font-size <size>` | Set the watermark font size (default: `48`) | `pdf2zh_next example.pdf --watermark-font-size 24` | | `--watermark-rotation <angle>` | Set the watermark rotation angle in degrees (default: `45`) | `pdf2zh_next example.pdf --watermark-rotation 30` | | `--watermark-color <color>` | Set the watermark color (default: `#cccccc`) | `pdf2zh_next example.pdf --watermark-color #ff0000` | | `--progress` | Show progress bar (default: enabled) | `pdf2zh_next example.pdf --no-progress` | | `--verbose` | Enable verbose output | `pdf2zh_next example.pdf --verbose` | | `--quiet` | Disable all non-error output | `pdf2zh_next example.pdf --quiet` | | `--version` | Show version information and exit | `pdf2zh_next --version` | | `--help` | Show help message and exit | `pdf2zh_next --help` | --- ### OUTPUT | `--warmup` | Lädt und überprüft nur die erforderlichen Assets und beendet dann den Vorgang | `pdf2zh_next example.pdf --warmup` | | ------------------------------- | ----------------------------------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--no-warmup` | Deaktiviert den Warmup-Prozess, der das Herunterladen und Überprüfen der erforderlichen Assets umfasst | `pdf2zh_next example.pdf --no-warmup` | | `--log-level <level>` | Legt den Log-Level fest (Standard: `info`) | `pdf2zh_next example.pdf --log-level debug` | | `--log-to-file` | Speichert Logs in einer Datei (Standard: deaktiviert) | `pdf2zh_next example.pdf --log-to-file` | | `--log-file <path>` | Gibt den Pfad der Log-Datei an (Standard: `pdf2zh_next.log`) | `pdf2zh_next example.pdf --log-file mylog.txt` | | `--log-format <format>` | Legt das Log-Format fest (`json` oder `text`, Standard: `text`) | `pdf2zh_next example.pdf --log-format json` | | `--log-keep <number>` | Anzahl der aufzubewahrenden Log-Dateien (Standard: `5`) | `pdf2zh_next example.pdf --log-keep 10` | | `--log-compress` | Komprimiert alte Log-Dateien (Standard: deaktiviert) | `pdf2zh_next example.pdf --log-compress` | | `--config <path>` | Gibt eine benutzerdefinierte Konfigurationsdatei an | `pdf2zh_next example.pdf --config ./myconfig.yaml` | | `--cache-dir <path>` | Gibt das Cache-Verzeichnis an (Standard: `~/.cache/pdf2zh_next`) | `pdf2zh_next example.pdf --cache-dir ./mycache` | | `--output-dir <path>` | Gibt das Ausgabeverzeichnis an (Standard: aktuelles Verzeichnis) | `pdf2zh_next example.pdf --output-dir ./output` | | `--output-suffix <suffix>` | Fügt dem Ausgabedateinamen ein Suffix hinzu (Standard: `_translated`) | `pdf2zh_next example.pdf --output-suffix _zh` | | `--output-format <format>` | Legt das Ausgabeformat fest (`pdf`, `markdown` oder `text`, Standard: `pdf`) | `pdf2zh_next example.pdf --output-format markdown` | | `--target-lang <lang>` | Legt die Zielsprache fest (Standard: `zh`) | `pdf2zh_next example.pdf --target-lang en` | | `--source-lang <lang>` | Legt die Ausgangssprache fest (Standard: `auto`) | `pdf2zh_next example.pdf --source-lang en` | | `--translator <translator>` | Legt den Übersetzungsdienst fest (`google`, `azure`, `deepl`, `openai`, Standard: `google`) | `pdf2zh_next example.pdf --translator deepl` | | `--translator-key <key>` | Legt den Übersetzer-API-Schlüssel fest (falls erforderlich) | `pdf2zh_next example.pdf --translator-key YOUR_API_KEY` | | `--translator-endpoint <url>` | Legt den Übersetzer-Endpunkt fest (für selbst gehostete Dienste) | `pdf2zh_next example.pdf --translator-endpoint http://localhost:8080` | | `--translator-region <region>` | Legt die Übersetzer-Region fest (für einige Dienste wie Azure) | `pdf2zh_next example.pdf --translator-region eastus` | | `--translator-model <model>` | Legt das Übersetzer-Modell fest (für einige Dienste wie OpenAI) | `pdf2zh_next example.pdf --translator-model gpt-4` | | `--math-translator <translator>`| Legt den Mathematik-Übersetzungsdienst fest (`none`, `pdfmathtranslate`, Standard: `pdfmathtranslate`) | `pdf2zh_next example.pdf --math-translator none` | | `--math-translator-key <key>` | Legt den Mathematik-Übersetzer-API-Schlüssel fest (falls erforderlich) | `pdf2zh_next example.pdf --math-translator-key YOUR_API_KEY` | | `--math-translator-endpoint <url>`| Legt den Mathematik-Übersetzer-Endpunkt fest (für selbst gehostete Dienste) | `pdf2zh_next example.pdf --math-translator-endpoint http://localhost:8081` | | `--math-keep-original` | Behält die ursprünglichen mathematischen Ausdrücke bei (Standard: deaktiviert) | `pdf2zh_next example.pdf --math-keep-original` | | `--math-translate-words` | Übersetzt Wörter in mathematischen Ausdrücken (Standard: deaktiviert) | `pdf2zh_next example.pdf --math-translate-words` | | `--ocr-engine <engine>` | Legt die OCR-Engine fest (`tesseract`, `easyocr`, Standard: `tesseract`) | `pdf2zh_next example.pdf --ocr-engine easyocr` | | `--ocr-lang <lang>` | Legt die OCR-Sprache fest (Standard: `eng`) | `pdf2zh_next example.pdf --ocr-lang chi_sim` | | `--ocr-dpi <dpi>` | Legt die OCR-DPI fest (Standard: `300`) | `pdf2zh_next example.pdf --ocr-dpi 600` | | `--ocr-timeout <seconds>` | Legt den OCR-Timeout in Sekunden fest (Standard: `30`) | `pdf2zh_next example.pdf --ocr-timeout 60` | | `--concurrency <number>` | Legt die Anzahl der gleichzeitigen Aufgaben fest (Standard: `4`) | `pdf2zh_next example.pdf --concurrency 8` | | `--timeout <seconds>` | Legt den Gesamt-Timeout in Sekunden fest (Standard: `3600`) | `pdf2zh_next example.pdf --timeout 7200` | | `--retry <number>` | Legt die Anzahl der Wiederholungsversuche für fehlgeschlagene Aufgaben fest (Standard: `3`) | `pdf2zh_next example.pdf --retry 5` | | `--retry-delay <seconds>` | Legt die Verzögerung zwischen Wiederholungsversuchen in Sekunden fest (Standard: `1`) | `pdf2zh_next example.pdf --retry-delay 2` | | `--max-requests <number>` | Legt die maximale Anzahl der Anfragen pro Minute fest (Standard: `60`) | `pdf2zh_next example.pdf --max-requests 30` | | `--proxy <url>` | Legt die Proxy-URL fest | `pdf2zh_next example.pdf --proxy http://proxy.example.com:8080` | | `--no-proxy` | Deaktiviert die Proxy-Verwendung | `pdf2zh_next example.pdf --no-proxy` | | `--user-agent <string>` | Legt den User-Agent-String fest | `pdf2zh_next example.pdf --user-agent "My Custom Agent"` | | `--cookie <string>` | Legt den Cookie-String fest | `pdf2zh_next example.pdf --cookie "session=abc123"` | | `--header <string>` | Fügt einen benutzerdefinierten Header hinzu (kann mehrfach verwendet werden) | `pdf2zh_next example.pdf --header "Authorization: Bearer token" --header "X-Custom: value"` | | `--page-range <range>` | Verarbeitet nur angegebene Seiten (z. B. `1-5,8,10-12`) | `pdf2zh_next example.pdf --page-range 1-5,10` | | `--ignore-images` | Überspringt die Bildverarbeitung | `pdf2zh_next example.pdf --ignore-images` | | `--ignore-tables` | Überspringt die Tabellenverarbeitung | `pdf2zh_next example.pdf --ignore-tables` | | `--ignore-math` | Überspringt die mathematische Verarbeitung | `pdf2zh_next example.pdf --ignore-math` | | `--ignore-footnotes` | Überspringt die Fußnotenverarbeitung | `pdf2zh_next example.pdf --ignore-footnotes` | | `--ignore-headers` | Überspringt die Kopfzeilenverarbeitung | `pdf2zh_next example.pdf --ignore-headers` | | `--ignore-footers` | Überspringt die Fußzeilenverarbeitung | `pdf2zh_next example.pdf --ignore-footers` | | `--keep-layout` | Bewahrt die ursprüngliche Layout so weit wie möglich (Standard: aktiviert) | `pdf2zh_next example.pdf --no-keep-layout` | | `--keep-fonts` | Bewahrt die ursprünglichen Schriftarten (Standard: aktiviert) | `pdf2zh_next example.pdf --no-keep-fonts` | | `--keep-colors` | Bewahrt die ursprünglichen Farben (Standard: aktiviert) | `pdf2zh_next example.pdf --no-keep-colors` | | `--keep-links` | Bewahrt Hyperlinks (Standard: aktiviert) | `pdf2zh_next example.pdf --no-keep-links` | | `--keep-annotations` | Bewahrt Anmerkungen (Standard: aktiviert) | `pdf2zh_next example.pdf --no-keep-annotations` | | `--watermark <text>` | Fügt dem Ausgabedokument einen Wasserzeichen hinzu | `pdf2zh_next example.pdf --watermark "Translated by pdf2zh"` | | `--watermark-opacity <opacity>` | Legt die Deckkraft des Wasserzeichens fest (0.0 bis 1.0, Standard: `0.2`) | `pdf2zh_next example.pdf --watermark-opacity 0.5` | | `--watermark-font-size <size>` | Legt die Schriftgröße des Wasserzeichens fest (Standard: `48`) | `pdf2zh_next example.pdf --watermark-font-size 24` | | `--watermark-rotation <angle>` | Legt den Rotationswinkel des Wasserzeichens in Grad fest (Standard: `45`) | `pdf2zh_next example.pdf --watermark-rotation 30` | | `--watermark-color <color>` | Legt die Farbe des Wasserzeichens fest (Standard: `#cccccc`) | `pdf2zh_next example.pdf --watermark-color #ff0000` | | `--progress` | Zeigt die Fortschrittsleiste an (Standard: aktiviert) | `pdf2zh_next example.pdf --no-progress` | | `--verbose` | Aktiviert die ausführliche Ausgabe | `pdf2zh_next example.pdf --verbose` | | `--quiet` | Deaktiviert alle Nicht-Fehler-Ausgaben | `pdf2zh_next example.pdf --quiet` | | `--version` | Zeigt Versionsinformationen an und beendet das Programm | `pdf2zh_next --version` | | `--help` | Zeigt die Hilfemeldung an und beendet das Programm | `pdf2zh_next --help` |
fr: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--download-only` | Only download required assets then exit | `pdf2zh_next example.pdf --download-only` | | `--verify-only` | Only verify required assets then exit | `pdf2zh_next example.pdf --verify-only` | | `--download-models` | Download required models before processing | `pdf2zh_next example.pdf --download-models` | | `--force-download` | Force download assets even if they exist | `pdf2zh_next example.pdf --force-download` | | `--model-dir <path>` | Specify model directory, default is `~/.pdf2zh/models` | `pdf2zh_next example.pdf --model-dir ./my_models` | | `--cache-dir <path>` | Specify cache directory, default is `~/.pdf2zh/cache` | `pdf2zh_next example.pdf --cache-dir ./my_cache` | | `--output <path>` | Specify output file path, default is `{original_filename}_translated.{original_format}` | `pdf2zh_next example.pdf --output ./output/translated.pdf` | | `--format <format>` | Output format, default is same as input, support `pdf` and `docx` | `pdf2zh_next example.pdf --format docx` | | `--target-language <lang_code>` | Target language code, default is `zh` | `pdf2zh_next example.pdf --target-language ja` | | `--source-language <lang_code>` | Source language code, default is `auto` | `pdf2zh_next example.pdf --source-language en` | | `--translator <translator>` | Specify translator, default is `google` | `pdf2zh_next example.pdf --translator deeplx` | | `--translator-args <json>` | Arguments for translator, in JSON format | `pdf2zh_next example.pdf --translator-args '{"api_key": "your_api_key"}'` | | `--ocr <ocr>` | Specify OCR engine, default is `paddle` | `pdf2zh_next example.pdf --ocr easyocr` | | `--ocr-args <json>` | Arguments for OCR engine, in JSON format | `pdf2zh_next example.pdf --ocr-args '{"lang": ["en", "zh"]}'` | | `--concurrency <number>` | Number of concurrent tasks, default is `4` | `pdf2zh_next example.pdf --concurrency 8` | | `--timeout <seconds>` | Timeout for each task in seconds, default is `30` | `pdf2zh_next example.pdf --timeout 60` | | `--retry <number>` | Number of retries for failed tasks, default is `3` | `pdf2zh_next example.pdf --retry 5` | | `--log-level <level>` | Log level, default is `info`, support `debug`, `info`, `warning`, `error` | `pdf2zh_next example.pdf --log-level debug` | | `--log-file <path>` | Log file path, default is `stdout` | `pdf2zh_next example.pdf --log-file ./logs/translation.log` | | `--config <path>` | Configuration file path | `pdf2zh_next example.pdf --config ./config.json` | | `--dry-run` | Dry run without actual processing | `pdf2zh_next example.pdf --dry-run` | | `--version` | Show version and exit | `pdf2zh_next --version` | | `--help` | Show help and exit | `pdf2zh_next --help` | --- ### TRANSLATED TEXT | `--warmup` | Télécharge et vérifie uniquement les ressources requises puis quitte | `pdf2zh_next example.pdf --warmup` | | ------------------------------- | ---------------------------------------------------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--download-only` | Télécharge uniquement les ressources requises puis quitte | `pdf2zh_next example.pdf --download-only` | | `--verify-only` | Vérifie uniquement les ressources requises puis quitte | `pdf2zh_next example.pdf --verify-only` | | `--download-models` | Télécharge les modèles requis avant le traitement | `pdf2zh_next example.pdf --download-models` | | `--force-download` | Force le téléchargement des ressources même si elles existent | `pdf2zh_next example.pdf --force-download` | | `--model-dir <path>` | Spécifie le répertoire des modèles, par défaut `~/.pdf2zh/models` | `pdf2zh_next example.pdf --model-dir ./my_models` | | `--cache-dir <path>` | Spécifie le répertoire de cache, par défaut `~/.pdf2zh/cache` | `pdf2zh_next example.pdf --cache-dir ./my_cache` | | `--output <path>` | Spécifie le chemin du fichier de sortie, par défaut `{original_filename}_translated.{original_format}` | `pdf2zh_next example.pdf --output ./output/translated.pdf` | | `--format <format>` | Format de sortie, par défaut identique à l'entrée, supporte `pdf` et `docx` | `pdf2zh_next example.pdf --format docx` | | `--target-language <lang_code>` | Code de langue cible, par défaut `zh` | `pdf2zh_next example.pdf --target-language ja` | | `--source-language <lang_code>` | Code de langue source, par défaut `auto` | `pdf2zh_next example.pdf --source-language en` | | `--translator <translator>` | Spécifie le traducteur, par défaut `google` | `pdf2zh_next example.pdf --translator deeplx` | | `--translator-args <json>` | Arguments pour le traducteur, au format JSON | `pdf2zh_next example.pdf --translator-args '{"api_key": "your_api_key"}'` | | `--ocr <ocr>` | Spécifie le moteur OCR, par défaut `paddle` | `pdf2zh_next example.pdf --ocr easyocr` | | `--ocr-args <json>` | Arguments pour le moteur OCR, au format JSON | `pdf2zh_next example.pdf --ocr-args '{"lang": ["en", "zh"]}'` | | `--concurrency <number>` | Nombre de tâches concurrentes, par défaut `4` | `pdf2zh_next example.pdf --concurrency 8` | | `--timeout <seconds>` | Délai d'attente pour chaque tâche en secondes, par défaut `30` | `pdf2zh_next example.pdf --timeout 60` | | `--retry <number>` | Nombre de tentatives pour les tâches échouées, par défaut `3` | `pdf2zh_next example.pdf --retry 5` | | `--log-level <level>` | Niveau de journalisation, par défaut `info`, supporte `debug`, `info`, `warning`, `error` | `pdf2zh_next example.pdf --log-level debug` | | `--log-file <path>` | Chemin du fichier de journal, par défaut `stdout` | `pdf2zh_next example.pdf --log-file ./logs/translation.log` | | `--config <path>` | Chemin du fichier de configuration | `pdf2zh_next example.pdf --config ./config.json` | | `--dry-run` | Exécution à blanc sans traitement réel | `pdf2zh_next example.pdf --dry-run` | | `--version` | Affiche la version et quitte | `pdf2zh_next --version` | | `--help` | Affiche l'aide et quitte | `pdf2zh_next --help` |
it: | :------------------------------ | :-------------------------------------------------------------------------------------- | :-------------------------------------------------------------------------------------------------------------------- | | `--output-dir <output_dir>` | Specify the output directory for translated documents | `pdf2zh_next example.pdf --output-dir ./output` | | `--output-format <output_format>` | Specify the output format of the translated document | `pdf2zh_next example.pdf --output-format markdown` | | `--target-lang <target_lang>` | Specify the target language for translation | `pdf2zh_next example.pdf --target-lang zh-cn` | | `--force` | Force overwrite existing output files | `pdf2zh_next example.pdf --force` | | `--verbose` | Show verbose output | `pdf2zh_next example.pdf --verbose` | | `--version` | Show version information and exit | `pdf2zh_next --version` | | `--help` | Show help message and exit | `pdf2zh_next --help` | --- ### TARGET LANGUAGE it
pt: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--no-warmup` | Skip the warmup process | `pdf2zh_next example.pdf --no-warmup` | | `--model <model_name>` | Specify the model name for translation, default is `gpt-3.5-turbo` | `pdf2zh_next example.pdf --model gpt-4-turbo` | | `--target-lang <language_code>` | Specify the target language code, default is `zh` (Chinese), see [Supported Languages] | `pdf2zh_next example.pdf --target-lang ja` | | `--output <output_file_path>` | Specify the output file path | `pdf2zh_next example.pdf --output example_zh.pdf` | | `--proxy <proxy_url>` | Specify a proxy URL for the request | `pdf2zh_next example.pdf --proxy http://127.0.0.1:7890` | | `--api-key <your_api_key>` | Specify your OpenAI API key | `pdf2zh_next example.pdf --api-key sk-...` | | `--api-base <your_api_base>` | Specify your OpenAI API base URL | `pdf2zh_next example.pdf --api-base https://api.example.com` | | `--debug` | Enable debug mode, which will generate more detailed logs and intermediate files | `pdf2zh_next example.pdf --debug` | | `--help` | Show help message and exit | `pdf2zh_next --help` | --- ### TRANSLATED TEXT | `--warmup` | Apenas baixa e verifica os ativos necessários e depois sai | `pdf2zh_next example.pdf --warmup` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--no-warmup` | Ignora o processo de warmup | `pdf2zh_next example.pdf --no-warmup` | | `--model <model_name>` | Especifica o nome do modelo para tradução, o padrão é `gpt-3.5-turbo` | `pdf2zh_next example.pdf --model gpt-4-turbo` | | `--target-lang <language_code>` | Especifica o código do idioma de destino, o padrão é `zh` (Chinês), veja [Idiomas suportados] | `pdf2zh_next example.pdf --target-lang ja` | | `--output <output_file_path>` | Especifica o caminho do arquivo de saída | `pdf2zh_next example.pdf --output example_zh.pdf` | | `--proxy <proxy_url>` | Especifica uma URL de proxy para a requisição | `pdf2zh_next example.pdf --proxy http://127.0.0.1:7890` | | `--api-key <your_api_key>` | Especifica sua chave de API da OpenAI | `pdf2zh_next example.pdf --api-key sk-...` | | `--api-base <your_api_base>` | Especifica sua URL base da API da OpenAI | `pdf2zh_next example.pdf --api-base https://api.example.com` | | `--debug` | Ativa o modo de depuração, que irá gerar logs mais detalhados e arquivos intermediários | `pdf2zh_next example.pdf --debug` | | `--help` | Mostra a mensagem de ajuda e sai | `pdf2zh_next --help` |
ru: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--clean` | Clean all temporary files then exit | `pdf2zh_next --clean` | | `--clean-cache` | Clean the cache directory (default: `~/.cache/pdf2zh`) then exit | `pdf2zh_next --clean-cache` | | `--clean-translated-pdf` | Clean the translated PDF directory (default: `~/.cache/pdf2zh/translated_pdf`) then exit | `pdf2zh_next --clean-translated-pdf` | | `--clean-temp` | Clean the temporary directory (default: `~/.cache/pdf2zh/temp`) then exit | `pdf2zh_next --clean-temp` | | `--clean-all` | Clean all then exit | `pdf2zh_next --clean-all` | | `--version` | Show the version of pdf2zh | `pdf2zh_next --version` | | `--help` | Show the help message | `pdf2zh_next --help` | --- ### TRANSLATION RESULT | `--warmup` | Только загрузить и проверить необходимые ресурсы, затем выйти | `pdf2zh_next example.pdf --warmup` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--clean` | Очистить все временные файлы, затем выйти | `pdf2zh_next --clean` | | `--clean-cache` | Очистить кэш-директорию (по умолчанию: `~/.cache/pdf2zh`), затем выйти | `pdf2zh_next --clean-cache` | | `--clean-translated-pdf` | Очистить директорию переведенных PDF (по умолчанию: `~/.cache/pdf2zh/translated_pdf`), затем выйти | `pdf2zh_next --clean-translated-pdf` | | `--clean-temp` | Очистить временную директорию (по умолчанию: `~/.cache/pdf2zh/temp`), затем выйти | `pdf2zh_next --clean-temp` | | `--clean-all` | Очистить все, затем выйти | `pdf2zh_next --clean-all` | | `--version` | Показать версию pdf2zh | `pdf2zh_next --version` | | `--help` | Показать справочное сообщение | `pdf2zh_next --help` |
