Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_EBAC01C5
source: | `--ocr-workaround` | Force translated text to be black and add white background | `pdf2zh_next example.pdf --ocr-workaround` |
de: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--ocr-workaround-font-size` | Font size for OCR workaround (default: 16) | `pdf2zh_next example.pdf --ocr-workaround --ocr-workaround-font-size 20` | | `--ocr-workaround-font-family` | Font family for OCR workaround (default: "SimHei") | `pdf2zh_next example.pdf --ocr-workaround --ocr-workaround-font-family "Arial"` | | `--ocr-workaround-font-color` | Font color for OCR workaround (default: "black") | `pdf2zh_next example.pdf --ocr-workaround --ocr-workaround-font-color "white"` | | `--ocr-workaround-background` | Background color for OCR workaround (default: "white") | `pdf2zh_next example.pdf --ocr-workaround --ocr-workaround-background "black"` | | `--ocr-workaround-line-spacing` | Line spacing for OCR workaround (default: 1.5) | `pdf2zh_next example.pdf --ocr-workaround --ocr-workaround-line-spacing 2.0` | | `--ocr-workaround-font-weight` | Font weight for OCR workaround (default: "normal") | `pdf2zh_next example.pdf --ocr-workaround --ocr-workaround-font-weight "bold"` | | `--ocr-workaround-font-style` | Font style for OCR workaround (default: "normal") | `pdf2zh_next example.pdf --ocr-workaround --ocr-workaround-font-style "italic"` | | `--ocr-workaround-font-stretch` | Font stretch for OCR workaround (default: "normal") | `pdf2zh_next example.pdf --ocr-workaround --ocr-workaround-font-stretch "condensed"` | | `--ocr-workaround-font-variant` | Font variant for OCR workaround (default: "normal") | `pdf2zh_next example.pdf --ocr-workaround --ocr-workaround-font-variant "small-caps"` | --- ### TRANSLATION RESULT | `--ocr-workaround` | Erzwingt, dass übersetzter Text schwarz ist und fügt weißen Hintergrund hinzu | `pdf2zh_next example.pdf --ocr-workaround` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--ocr-workaround-font-size` | Schriftgröße für OCR-Workaround (Standard: 16) | `pdf2zh_next example.pdf --ocr-workaround --ocr-workaround-font-size 20` | | `--ocr-workaround-font-family` | Schriftfamilie für OCR-Workaround (Standard: "SimHei") | `pdf2zh_next example.pdf --ocr-workaround --ocr-workaround-font-family "Arial"` | | `--ocr-workaround-font-color` | Schriftfarbe für OCR-Workaround (Standard: "black") | `pdf2zh_next example.pdf --ocr-workaround --ocr-workaround-font-color "white"` | | `--ocr-workaround-background` | Hintergrundfarbe für OCR-Workaround (Standard: "white") | `pdf2zh_next example.pdf --ocr-workaround --ocr-workaround-background "black"` | | `--ocr-workaround-line-spacing` | Zeilenabstand für OCR-Workaround (Standard: 1.5) | `pdf2zh_next example.pdf --ocr-workaround --ocr-workaround-line-spacing 2.0` | | `--ocr-workaround-font-weight` | Schriftgewicht für OCR-Workaround (Standard: "normal") | `pdf2zh_next example.pdf --ocr-workaround --ocr-workaround-font-weight "bold"` | | `--ocr-workaround-font-style` | Schriftstil für OCR-Workaround (Standard: "normal") | `pdf2zh_next example.pdf --ocr-workaround --ocr-workaround-font-style "italic"` | | `--ocr-workaround-font-stretch` | Schriftdehnung für OCR-Workaround (Standard: "normal") | `pdf2zh_next example.pdf --ocr-workaround --ocr-workaround-font-stretch "condensed"` | | `--ocr-workaround-font-variant` | Schriftvariante für OCR-Workaround (Standard: "normal") | `pdf2zh_next example.pdf --ocr-workaround --ocr-workaround-font-variant "small-caps"` |
fr: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--ocr-workaround-text-color` | Force translated text to be the specified color (e.g., `black`, `#000000`) | `pdf2zh_next example.pdf --ocr-workaround-text-color black` | | `--ocr-workaround-bg-color` | Force translated background to be the specified color (e.g., `white`, `#ffffff`) | `pdf2zh_next example.pdf --ocr-workaround-bg-color white` | | `--ocr-workaround-border-color` | Force translated border to be the specified color (e.g., `black`, `#000000`) | `pdf2zh_next example.pdf --ocr-workaround-border-color black` | | `--ocr-workaround-border-width` | Force translated border to be the specified width (e.g., `0.5pt`) | `pdf2zh_next example.pdf --ocr-workaround-border-width 0.5pt` | | `--ocr-workaround-border-radius`| Force translated border to be the specified radius (e.g., `0.5pt`) | `pdf2zh_next example.pdf --ocr-workaround-border-radius 0.5pt` | --- ### TRANSLATED TEXT | `--ocr-workaround` | Force le texte traduit à être noir et ajoute un arrière-plan blanc | `pdf2zh_next example.pdf --ocr-workaround` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--ocr-workaround-text-color` | Force le texte traduit à être de la couleur spécifiée (par ex., `black`, `#000000`) | `pdf2zh_next example.pdf --ocr-workaround-text-color black` | | `--ocr-workaround-bg-color` | Force l'arrière-plan traduit à être de la couleur spécifiée (par ex., `white`, `#ffffff`) | `pdf2zh_next example.pdf --ocr-workaround-bg-color white` | | `--ocr-workaround-border-color` | Force la bordure traduite à être de la couleur spécifiée (par ex., `black`, `#000000`) | `pdf2zh_next example.pdf --ocr-workaround-border-color black` | | `--ocr-workaround-border-width` | Force la bordure traduite à être de la largeur spécifiée (par ex., `0.5pt`) | `pdf2zh_next example.pdf --ocr-workaround-border-width 0.5pt` | | `--ocr-workaround-border-radius`| Force la bordure traduite à être du rayon spécifié (par ex., `0.5pt`) | `pdf2zh_next example.pdf --ocr-workaround-border-radius 0.5pt` |
it: | ------------------------------ | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--ocr-allowlist` | Specify allowed characters for OCR | `pdf2zh_next example.pdf --ocr-allowlist "0123456789abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ"` | | `--ocr-blocklist` | Specify forbidden characters for OCR | `pdf2zh_next example.pdf --ocr-blocklist "0123456789"` | | `--ocr-font-name` | Specify font name for OCR (default: Arial) | `pdf2zh_next example.pdf --ocr-font-name "Times New Roman"` | | `--ocr-font-size` | Specify font size for OCR (default: 12) | `pdf2zh_next example.pdf --ocr-font-size 14` | | `--ocr-text-formatting` | Specify text formatting for OCR (default: plain) | `pdf2zh_next example.pdf --ocr-text-formatting "markdown"` | | `--ocr-text-formatting-options`| Specify text formatting options for OCR (default: {}) | `pdf2zh_next example.pdf --ocr-text-formatting-options '{"bold": true, "italic": false, "underline": false}'` | --- ### TRANSLATED TEXT | `--ocr-workaround` | Forza il testo tradotto a essere nero e aggiunge uno sfondo bianco | `pdf2zh_next example.pdf --ocr-workaround` | | ------------------------------ | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--ocr-allowlist` | Specifica i caratteri consentiti per l'OCR | `pdf2zh_next example.pdf --ocr-allowlist "0123456789abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ"` | | `--ocr-blocklist` | Specifica i caratteri vietati per l'OCR | `pdf2zh_next example.pdf --ocr-blocklist "0123456789"` | | `--ocr-font-name` | Specifica il nome del font per l'OCR (predefinito: Arial) | `pdf2zh_next example.pdf --ocr-font-name "Times New Roman"` | | `--ocr-font-size` | Specifica la dimensione del font per l'OCR (predefinito: 12) | `pdf2zh_next example.pdf --ocr-font-size 14` | | `--ocr-text-formatting` | Specifica la formattazione del testo per l'OCR (predefinito: plain) | `pdf2zh_next example.pdf --ocr-text-formatting "markdown"` | | `--ocr-text-formatting-options`| Specifica le opzioni di formattazione del testo per l'OCR (predefinito: {}) | `pdf2zh_next example.pdf --ocr-text-formatting-options '{"bold": true, "italic": false, "underline": false}'` |
pt: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--ocr-workaround-no-background` | Force translated text to be black without adding any background | `pdf2zh_next example.pdf --ocr-workaround-no-background` | | `--ocr-workaround-no-text` | Force adding white background without changing the text color | `pdf2zh_next example.pdf --ocr-workaround-no-text` | | `--ocr-workaround-color <color>` | Force translated text to be the specified color and add white background | `pdf2zh_next example.pdf --ocr-workaround-color red`<br>`pdf2zh_next example.pdf --ocr-workaround-color "#ff0000"` | | `--ocr-workaround-bg <color>` | Force translated text to be black and add the specified background | `pdf2zh_next example.pdf --ocr-workaround-bg yellow`<br>`pdf2zh_next example.pdf --ocr-workaround-bg "#ffff00"` | | `--ocr-workaround-custom <color> <color>` | Force translated text to be the first color and add the second background | `pdf2zh_next example.pdf --ocr-workaround-custom red yellow`<br>`pdf2zh_next example.pdf --ocr-workaround-custom "#ff0000" "#ffff00"` | --- ### OUTPUT | `--ocr-workaround` | Forçar o texto traduzido a ser preto e adicionar fundo branco | `pdf2zh_next example.pdf --ocr-workaround` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--ocr-workaround-no-background` | Forçar o texto traduzido a ser preto sem adicionar qualquer fundo | `pdf2zh_next example.pdf --ocr-workaround-no-background` | | `--ocr-workaround-no-text` | Forçar a adição de fundo branco sem alterar a cor do texto | `pdf2zh_next example.pdf --ocr-workaround-no-text` | | `--ocr-workaround-color <color>` | Forçar o texto traduzido a ser a cor especificada e adicionar fundo branco | `pdf2zh_next example.pdf --ocr-workaround-color red`<br>`pdf2zh_next example.pdf --ocr-workaround-color "#ff0000"` | | `--ocr-workaround-bg <color>` | Forçar o texto traduzido a ser preto e adicionar o fundo especificado | `pdf2zh_next example.pdf --ocr-workaround-bg yellow`<br>`pdf2zh_next example.pdf --ocr-workaround-bg "#ffff00"` | | `--ocr-workaround-custom <color> <color>` | Forçar o texto traduzido a ser a primeira cor e adicionar o segundo fundo | `pdf2zh_next example.pdf --ocr-workaround-custom red yellow`<br>`pdf2zh_next example.pdf --ocr-workaround-custom "#ff0000" "#ffff00"` |
ru: [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------- | | `--ocr-workaround-threshold` | Threshold (0 to 1) for OCR workaround, higher value means more text will be black | `pdf2zh_next example.pdf --ocr-workaround --ocr-workaround-threshold 0.5` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--ocr-workaround-whiten-bg` | Whether to whiten the background of the text box in OCR workaround, default is `true` | `pdf2zh_next example.pdf --ocr-workaround --ocr-workaround-whiten-bg false` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--ocr-workaround-whiten-fg` | Whether to whiten the foreground (text) in OCR workaround, default is `false` | `pdf2zh_next example.pdf --ocr-workaround --ocr-workaround-whiten-fg true` | [Using **Command Line**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | --- ### TRANSLATED TEXT | `--ocr-workaround` | Принудительно делает переведенный текст черным и добавляет белый фон | `pdf2zh_next example.pdf --ocr-workaround` | [Использование **Командной строки**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------- | | `--ocr-workaround-threshold` | Порог (от 0 до 1) для обходного решения OCR, более высокое значение означает, что больше текста будет черным | `pdf2zh_next example.pdf --ocr-workaround --ocr-workaround-threshold 0.5` | [Использование **Командной строки**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--ocr-workaround-whiten-bg` | Следует ли отбеливать фон текстового поля в обходном решении OCR, по умолчанию `true` | `pdf2zh_next example.pdf --ocr-workaround --ocr-workaround-whiten-bg false` | [Использование **Командной строки**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) | | `--ocr-workaround-whiten-fg` | Следует ли отбеливать передний план (текст) в обходном решении OCR, по умолчанию `false` | `pdf2zh_next example.pdf --ocr-workaround --ocr-workaround-whiten-fg true` | [Использование **Командной строки**](https://pdf2zh-next.com/getting-started/USAGE_command_line.html) |

# chunk_04D70854
source: | `--auto-enable-ocr-workaround` | Enable automatic OCR workaround. If a document is detected as heavily scanned, this will attempt to enable OCR processing and skip further scan detection. See documentation for details. (default: False) | `pdf2zh_next example.pdf --auto-enable-ocr-workaround` |
de: |---------------------------------|-----------------------------------------------------------------------------------------------------------------------------------------|----------------------------------------------------------------------------| | `--progress` | Display progress bar. (default: True) | `pdf2zh_next example.pdf --progress False` | --- ### OUTPUT | `--auto-enable-ocr-workaround` | Aktiviert die automatische OCR-Workaround. Wenn ein Dokument als stark gescannt erkannt wird, versucht dies, die OCR-Verarbeitung zu aktivieren und weitere Scan-Erkennung zu überspringen. Weitere Details finden Sie in der Dokumentation. (Standard: False) | `pdf2zh_next example.pdf --auto-enable-ocr-workaround` | |---------------------------------|-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|----------------------------------------------------------------------------| | `--progress` | Zeigt die Fortschrittsleiste an. (Standard: True) | `pdf2zh_next example.pdf --progress False` |
fr: | ------------------------------- | --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- | -------------------------------------------------------------------------- | | `--ocr-workaround-threshold` | Threshold for OCR workaround. If the ratio of scanned pages exceeds this value, OCR workaround will be enabled. (default: 0.5) | `pdf2zh_next example.pdf --ocr-workaround-threshold 0.7` | | `--ocr-workaround-skip-pages` | Skip the first N pages during scan detection. Useful for documents with cover pages that might be detected as scanned. (default: 0) | `pdf2zh_next example.pdf --ocr-workaround-skip-pages 2` | --- ### TRANSLATED TEXT | `--auto-enable-ocr-workaround` | Active le contournement automatique de l'OCR. Si un document est détecté comme étant fortement scanné, cela tentera d'activer le traitement OCR et sautera la détection de scan ultérieure. Voir la documentation pour plus de détails. (par défaut : False) | `pdf2zh_next example.pdf --auto-enable-ocr-workaround` | | ------------------------------- | --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- | -------------------------------------------------------------------------- | | `--ocr-workaround-threshold` | Seuil pour le contournement de l'OCR. Si le ratio de pages scannées dépasse cette valeur, le contournement OCR sera activé. (par défaut : 0.5) | `pdf2zh_next example.pdf --ocr-workaround-threshold 0.7` | | `--ocr-workaround-skip-pages` | Ignore les N premières pages pendant la détection de scan. Utile pour les documents avec des pages de couverture qui pourraient être détectées comme scannées. (par défaut : 0) | `pdf2zh_next example.pdf --ocr-workaround-skip-pages 2` |
it: --- Let's start translating step by step:
pt: --- ### OUTPUT | `--auto-enable-ocr-workaround` | Ativar solução alternativa automática de OCR. Se um documento for detectado como fortemente digitalizado, isso tentará ativar o processamento de OCR e ignorar a detecção de digitalização adicional. Consulte a documentação para obter detalhes. (padrão: Falso) | `pdf2zh_next example.pdf --auto-enable-ocr-workaround` |
ru: | ------------------------------- | ---------------------------------------------------------------------------------------------------------------------------------------- | -------------------------------------------------------------------------- | | `--disable-ocr-workaround` | Disable OCR workaround. This will skip OCR processing even if the document is detected as heavily scanned. (default: False) | `pdf2zh_next example.pdf --disable-ocr-workaround` | | `--ocr-workaround-threshold` | Set the threshold for OCR workaround. Documents with a scan score above this value will be considered heavily scanned. (default: 0.8) | `pdf2zh_next example.pdf --ocr-workaround-threshold 0.9` | --- ### TRANSLATION RESULT | `--auto-enable-ocr-workaround` | Включить автоматическое обходное решение OCR. Если документ определяется как сильно отсканированный, будет предпринята попытка включить обработку OCR и пропустить дальнейшее обнаружение сканирования. Подробности см. в документации. (по умолчанию: False) | `pdf2zh_next example.pdf --auto-enable-ocr-workaround` | | ------------------------------- | ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- | -------------------------------------------------------------------------- | | `--disable-ocr-workaround` | Отключить обходное решение OCR. Это пропустит обработку OCR, даже если документ определяется как сильно отсканированный. (по умолчанию: False) | `pdf2zh_next example.pdf --disable-ocr-workaround` | | `--ocr-workaround-threshold` | Установить порог для обходного решения OCR. Документы с оценкой сканирования выше этого значения будут считаться сильно отсканированными. (по умолчанию: 0.8) | `pdf2zh_next example.pdf --ocr-workaround-threshold 0.9` |

# chunk_DB9F7803
source: | `--only-include-translated-page`| Only include translated pages in the output PDF. Effective only when --pages is used. | `pdf2zh_next example.pdf --pages 1-5 --only-include-translated-page` |
de: | ------------------------------- | ------------------------------------------------------------------------------------- | -------------------------------------------------------------------------------------------------------------------- | | `--no-ocr` | Disable OCR for the entire PDF. | `pdf2zh_next example.pdf --no-ocr` | | `--ocr-whole-page` | Enable OCR for the entire page (use with caution, may introduce noise). | `pdf2zh_next example.pdf --ocr-whole-page` | | `--ocr-lang` | Specify the OCR language for the entire PDF. | `pdf2zh_next example.pdf --ocr-lang jpn_vert` | | `--ocr-timeout` | Set the timeout for OCR processing in seconds. | `pdf2zh_next example.pdf --ocr-timeout 120` | | `--ocr-skip-text` | Skip OCR for text that already exists in the PDF. | `pdf2zh_next example.pdf --ocr-skip-text` | | `--ocr-engine` | Choose the OCR engine to use. Options: `easyocr`, `tesseract`. | `pdf2zh_next example.pdf --ocr-engine tesseract` | | `--ocr-dpi` | Set the DPI for OCR processing. | `pdf2zh_next example.pdf --ocr-dpi 300` | | `--ocr-max-workers` | Set the maximum number of workers for OCR. | `pdf2zh_next example.pdf --ocr-max-workers 4` | | `--ocr-retry` | Number of retries for OCR. | `pdf2zh_next example.pdf --ocr-retry 3` | --- ### TRANSLATED TEXT | `--only-include-translated-page` | Nur übersetzte Seiten in der Ausgabe-PDF einbeziehen. Nur wirksam, wenn --pages verwendet wird. | `pdf2zh_next example.pdf --pages 1-5 --only-include-translated-page` | | ------------------------------- | ----------------------------------------------------------------------------------------------- | -------------------------------------------------------------------- | | `--no-ocr` | OCR für die gesamte PDF deaktivieren. | `pdf2zh_next example.pdf --no-ocr` | | `--ocr-whole-page` | OCR für die gesamte Seite aktivieren (mit Vorsicht verwenden, kann Rauschen verursachen). | `pdf2zh_next example.pdf --ocr-whole-page` | | `--ocr-lang` | Die OCR-Sprache für die gesamte PDF angeben. | `pdf2zh_next example.pdf --ocr-lang jpn_vert` | | `--ocr-timeout` | Timeout für die OCR-Verarbeitung in Sekunden festlegen. | `pdf2zh_next example.pdf --ocr-timeout 120` | | `--ocr-skip-text` | OCR für Text überspringen, der bereits in der PDF vorhanden ist. | `pdf2zh_next example.pdf --ocr-skip-text` | | `--ocr-engine` | Den zu verwendenden OCR-Engine auswählen. Optionen: `easyocr`, `tesseract`. | `pdf2zh_next example.pdf --ocr-engine tesseract` | | `--ocr-dpi` | DPI für die OCR-Verarbeitung festlegen. | `pdf2zh_next example.pdf --ocr-dpi 300` | | `--ocr-max-workers` | Maximale Anzahl von Workern für OCR festlegen. | `pdf2zh_next example.pdf --ocr-max-workers 4` | | `--ocr-retry` | Anzahl der Wiederholungsversuche für OCR. | `pdf2zh_next example.pdf --ocr-retry 3` |
fr: --- ### OUTPUT | `--only-include-translated-page`| Inclure uniquement les pages traduites dans le PDF de sortie. Efficace uniquement lorsque --pages est utilisé. | `pdf2zh_next example.pdf --pages 1-5 --only-include-translated-page` |
it: --- ### OUTPUT LANGUAGE it
pt: | `--only-include-translated-page`| Incluir apenas páginas traduzidas no PDF de saída. Eficaz apenas quando --pages é usado. | `pdf2zh_next example.pdf --pages 1-5 --only-include-translated-page` |
ru: | `--only-include-translated-page`| Включать в выходной PDF только переведённые страницы. Действует только при использовании --pages. | `pdf2zh_next example.pdf --pages 1-5 --only-include-translated-page` |
