Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_F8F61FC8
source: Error event (example):
de: The error event is emitted when an error occurs during the translation process. The event data contains the error message and an optional error code. ```json { "type": "error", "data": { "message": "Failed to translate page 5: Network error", "code": "NETWORK_ERROR" } } ``` Progress event (example): The progress event is emitted periodically to report the progress of the translation. The event data contains the current progress and the total number of pages. ```json { "type": "progress", "data": { "current": 5, "total": 10, "message": "Processing page 5 of 10" } } ``` Result event (example): The result event is emitted when a page has been successfully translated. The event data contains the translated text and the original text. ```json { "type": "result", "data": { "translatedText": "Dies ist ein Beispieltext.", "originalText": "This is an example text." } } ``` ### Complete Example Here is a complete example of how to handle these events in JavaScript: ```javascript const eventSource = new EventSource('/api/translate'); eventSource.onmessage = (event) => { const data = JSON.parse(event.data); switch (data.type) { case 'progress': console.log(`Progress: ${data.data.current}/${data.data.total} - ${data.data.message}`); break; case 'result': console.log(`Translated: ${data.data.translatedText}`); console.log(`Original: ${data.data.originalText}`); break; case 'error': console.error(`Error: ${data.data.message} (code: ${data.data.code})`); break; } }; eventSource.onerror = (error) => { console.error('EventSource failed:', error); }; ``` ### Notes - The event stream is a Server-Sent Events (SSE) stream. - Each event is a JSON object with a `type` field and a `data` field. - The `data` field contains the event-specific data. - The event stream is closed when the translation is complete or when an error occurs. --- ### OUTPUT Fehler-Event (Beispiel): Das Fehler-Event wird ausgegeben, wenn während des Übersetzungsprozesses ein Fehler auftritt. Die Event-Daten enthalten die Fehlermeldung und einen optionalen Fehlercode. ```json { "type": "error", "data": { "message": "Failed to translate page 5: Network error", "code": "NETWORK_ERROR" } } ``` Fortschritts-Event (Beispiel): Das Fortschritts-Event wird regelmäßig ausgegeben, um den Fortschritt der Übersetzung zu melden. Die Event-Daten enthalten den aktuellen Fortschritt und die Gesamtanzahl der Seiten. ```json { "type": "progress", "data": { "current": 5, "total": 10, "message": "Processing page 5 of 10" } } ``` Ergebnis-Event (Beispiel): Das Ergebnis-Event wird ausgegeben, wenn eine Seite erfolgreich übersetzt wurde. Die Event-Daten enthalten den übersetzten Text und den Originaltext. ```json { "type": "result", "data": { "translatedText": "Dies ist ein Beispieltext.", "originalText": "This is an example text." } } ``` ### Vollständiges Beispiel Hier ist ein vollständiges Beispiel, wie diese Events in JavaScript behandelt werden können: ```javascript const eventSource = new EventSource('/api/translate'); eventSource.onmessage = (event) => { const data = JSON.parse(event.data); switch (data.type) { case 'progress': console.log(`Progress: ${data.data.current}/${data.data.total} - ${data.data.message}`); break; case 'result': console.log(`Translated: ${data.data.translatedText}`); console.log(`Original: ${data.data.originalText}`); break; case 'error': console.error(`Error: ${data.data.message} (code: ${data.data.code})`); break; } }; eventSource.onerror = (error) => { console.error('EventSource failed:', error); }; ``` ### Hinweise - Der Event-Stream ist ein Server-Sent Events (SSE)-Stream. - Jedes Event ist ein JSON-Objekt mit einem `type`-Feld und einem `data`-Feld. - Das `data`-Feld enthält die eventspezifischen Daten. - Der Event-Stream wird geschlossen, wenn die Übersetzung abgeschlossen ist oder ein Fehler auftritt.
fr: This event is triggered when an error occurs during the translation process. ```json { "event_type": "translation_error", "timestamp": "2023-10-05T14:48:00.000Z", "file_path": "/path/to/file.pdf", "error_message": "Failed to connect to translation service", "error_code": "CONNECTION_ERROR" } ``` ### Event Data - `event_type`: Always "translation_error" - `timestamp`: The time the error occurred (ISO 8601 format) - `file_path`: The path to the PDF file being processed - `error_message`: A human-readable description of the error - `error_code`: A machine-readable error code ### Error Codes - `CONNECTION_ERROR`: Failed to connect to the translation service - `AUTHENTICATION_ERROR`: Invalid API key or authentication failure - `RATE_LIMIT_EXCEEDED`: Too many requests to the translation service - `INVALID_FILE`: The PDF file is invalid or corrupted - `UNKNOWN_ERROR`: An unexpected error occurred ### Handling Errors When this event is emitted, the translation process will be stopped. You should handle this event to provide user feedback and potentially retry the operation. For more information on error handling, see the [Error Handling](../advanced/error-handling.md) documentation. --- ### OUTPUT LANGUAGE fr --- ### OUTPUT Événement d'erreur (exemple) : Cet événement est déclenché lorsqu'une erreur se produit pendant le processus de traduction. ```json { "event_type": "translation_error", "timestamp": "2023-10-05T14:48:00.000Z", "file_path": "/path/to/file.pdf", "error_message": "Échec de la connexion au service de traduction", "error_code": "CONNECTION_ERROR" } ``` ### Données de l'événement - `event_type` : Toujours "translation_error" - `timestamp` : L'heure à laquelle l'erreur s'est produite (format ISO 8601) - `file_path` : Le chemin du fichier PDF en cours de traitement - `error_message` : Une description lisible par l'homme de l'erreur - `error_code` : Un code d'erreur lisible par machine ### Codes d'erreur - `CONNECTION_ERROR` : Échec de la connexion au service de traduction - `AUTHENTICATION_ERROR` : Clé API invalide ou échec d'authentification - `RATE_LIMIT_EXCEEDED` : Trop de requêtes au service de traduction - `INVALID_FILE` : Le fichier PDF est invalide ou corrompu - `UNKNOWN_ERROR` : Une erreur inattendue s'est produite ### Gestion des erreurs Lorsque cet événement est émis, le processus de traduction sera arrêté. Vous devez gérer cet événement pour fournir un retour à l'utilisateur et potentiellement réessayer l'opération. Pour plus d'informations sur la gestion des erreurs, consultez la documentation [Gestion des erreurs](../advanced/error-handling.md).
it: If an error occurs during translation, the event stream will send an error event with details about the error. ```json { "event": "error", "data": { "message": "Failed to translate document", "error": "The document is corrupted and cannot be read." } } ``` ### Event Stream Client Example Here's how you can listen to the event stream in a web application: ```javascript const eventSource = new EventSource('/api/translate/stream'); eventSource.onmessage = function(event) { const data = JSON.parse(event.data); switch (data.event) { case 'start': console.log('Translation started:', data.data.message); break; case 'progress': console.log(`Progress: ${data.data.progress}%`); break; case 'complete': console.log('Translation complete:', data.data.filePath); break; case 'error': console.error('Error:', data.data.message); break; } }; eventSource.onerror = function(error) { console.error('EventSource failed:', error); }; ``` ### Notes - The event stream will automatically close when the translation is complete or when an error occurs. - You can also manually close the event stream by calling `eventSource.close()`. - The progress event may not be emitted for very short translations. --- ### TRANSLATION RESULT Evento di errore (esempio): Se si verifica un errore durante la traduzione, il flusso di eventi invierà un evento di errore con i dettagli dell'errore. ```json { "event": "error", "data": { "message": "Failed to translate document", "error": "The document is corrupted and cannot be read." } } ``` ### Esempio di Client del Flusso di Eventi Ecco come puoi ascoltare il flusso di eventi in un'applicazione web: ```javascript const eventSource = new EventSource('/api/translate/stream'); eventSource.onmessage = function(event) { const data = JSON.parse(event.data); switch (data.event) { case 'start': console.log('Translation started:', data.data.message); break; case 'progress': console.log(`Progress: ${data.data.progress}%`); break; case 'complete': console.log('Translation complete:', data.data.filePath); break; case 'error': console.error('Error:', data.data.message); break; } }; eventSource.onerror = function(error) { console.error('EventSource failed:', error); }; ``` ### Note - Il flusso di eventi si chiuderà automaticamente quando la traduzione è completata o quando si verifica un errore. - Puoi anche chiudere manualmente il flusso di eventi chiamando `eventSource.close()`. - L'evento di avanzamento potrebbe non essere emesso per traduzioni molto brevi.
pt: The `error` event contains an error message. The error is a JSON object with the following fields: - `code`: The error code. - `message`: The error message. Example: ```json { "code": "rate_limit_exceeded", "message": "Rate limit exceeded. Please try again later." } ``` --- ### OUTPUT Evento de erro (exemplo): O evento `error` contém uma mensagem de erro. O erro é um objeto JSON com os seguintes campos: - `code`: O código de erro. - `message`: A mensagem de erro. Exemplo: ```json { "code": "rate_limit_exceeded", "message": "Limite de taxa excedido. Por favor, tente novamente mais tarde." } ```
ru: json { "type": "error", "data": { "message": "Failed to process the document", "code": "DOCUMENT_PROCESSING_ERROR" }, "timestamp": "2023-01-01T00:00:00.000Z" } ``` --- ### TRANSLATION RESULT Событие ошибки (пример): ```json { "type": "error", "data": { "message": "Failed to process the document", "code": "DOCUMENT_PROCESSING_ERROR" }, "timestamp": "2023-01-01T00:00:00.000Z" }

# chunk_C7DBFA5F
source: ### Notes & Best Practices
de: - **Language Code**: Please use the language code "de" for German translation. - **Translation Service**: You can use any translation service, such as Google Translate, DeepL, etc. If you are unsure, you can refer to the [Documentation of Translation Services](https://pdf2zh-next.com/advanced/DOCS_translation_service.html) for more information. - **Translation Quality**: The translation should be accurate and natural. If you are not confident in the translation, you can use a translation service to assist you. - **Terminology**: Please use the terminology provided in the glossary. If you encounter a term that is not in the glossary, you can use the original English term. - **Formatting**: Please maintain the original formatting, including markdown syntax, links, and code blocks. - **Testing**: After translation, you can test the translation by running the following command: ```bash npm run test:translation ``` This will check for any formatting issues or untranslated text. - **Community**: If you have any questions or need help, you can join our [Community](https://pdf2zh-next.com/community/) for support. - **Contributing**: If you would like to contribute to the translation, please check out the [For Translators](https://pdf2zh-next.com/community/FOR_TRANSLATORS.html) guide. --- ### TRANSLATION RESULT ### Hinweise & Best Practices - **Sprachcode**: Bitte verwenden Sie den Sprachcode "de" für die deutsche Übersetzung. - **Übersetzungsdienst**: Sie können jeden Übersetzungsdienst verwenden, wie z.B. Google Translate, DeepL usw. Wenn Sie unsicher sind, können Sie die [Dokumentation der Übersetzungsdienste](https://pdf2zh-next.com/advanced/DOCS_translation_service.html) für weitere Informationen konsultieren. - **Übersetzungsqualität**: Die Übersetzung sollte genau und natürlich sein. Wenn Sie sich bei der Übersetzung nicht sicher sind, können Sie einen Übersetzungsdienst zur Unterstützung verwenden. - **Terminologie**: Bitte verwenden Sie die im Glossar bereitgestellte Terminologie. Wenn Sie auf einen Begriff stoßen, der nicht im Glossar enthalten ist, können Sie den originalen englischen Begriff verwenden. - **Formatierung**: Bitte halten Sie die ursprüngliche Formatierung bei, einschließlich Markdown-Syntax, Links und Codeblöcken. - **Testen**: Nach der Übersetzung können Sie die Übersetzung testen, indem Sie den folgenden Befehl ausführen: ```bash npm run test:translation ``` Dadurch werden Formatierungsprobleme oder nicht übersetzter Text überprüft. - **Gemeinschaft**: Wenn Sie Fragen haben oder Hilfe benötigen, können Sie sich unserer [Gemeinschaft](https://pdf2zh-next.com/community/) anschließen, um Unterstützung zu erhalten. - **Mitwirken**: Wenn Sie zur Übersetzung beitragen möchten, lesen Sie bitte den Guide [For Translators](https://pdf2zh-next.com/community/FOR_TRANSLATORS.html).
fr: - **Translation Quality**: The quality of the translation depends on the translation service you choose. For more information, please refer to the [Documentation of Translation Services](https://pdf2zh-next.com/advanced/SERVICE.html). - **Text Recognition**: If the PDF contains images with text, OCR (Optical Character Recognition) is required. pdf2zh supports OCR functionality. For more information, please refer to the [OCR](https://pdf2zh-next.com/advanced/OCR.html) documentation. - **Mathematical Formulas**: If the PDF contains mathematical formulas, please refer to the [PDFMathTranslate](https://pdf2zh-next.com/advanced/MATH.html) documentation. - **Language Code**: For the list of supported languages and their corresponding language codes, please refer to the [Supported Languages](https://pdf2zh-next.com/advanced/LANGUAGE.html) documentation. --- ### OUTPUT LANGUAGE fr --- ### OUTPUT ### Notes & Bonnes pratiques - **Qualité de la traduction** : La qualité de la traduction dépend du service de traduction que vous choisissez. Pour plus d'informations, veuillez consulter la [Documentation des services de traduction](https://pdf2zh-next.com/advanced/SERVICE.html). - **Reconnaissance de texte** : Si le PDF contient des images avec du texte, une OCR (Reconnaissance Optique de Caractères) est nécessaire. pdf2zh prend en charge la fonctionnalité OCR. Pour plus d'informations, veuillez consulter la documentation [OCR](https://pdf2zh-next.com/advanced/OCR.html). - **Formules mathématiques** : Si le PDF contient des formules mathématiques, veuillez consulter la documentation [PDFMathTranslate](https://pdf2zh-next.com/advanced/MATH.html). - **Code de langue** : Pour la liste des langues supportées et leurs codes de langue correspondants, veuillez consulter la documentation [Langues supportées](https://pdf2zh-next.com/advanced/LANGUAGE.html).
it: - **Translation Quality**: While the service provides high-quality translations, it's important to review critical translations, especially for professional or academic use. - **File Size**: Large files may take longer to process. Consider breaking very large documents into smaller parts. - **Formatting**: Some complex formatting might not be preserved perfectly. Simple, text-based documents translate best. - **Privacy**: Be mindful of sensitive information. While the service is secure, avoid translating highly confidential documents through any online service. - **Supported Languages**: Check the list of supported languages before processing your documents. --- ### LANGUAGE it
pt: - **Check for Existing Translations**: Before starting a new translation, check the [Supported Languages](https://pdf2zh-next.com/getting-started/SUPPORTED_LANGUAGES.html) page to see if the language is already supported or if there's an ongoing effort. - **Use the Official Glossary**: To maintain consistency, always refer to the project's [official glossary](https://github.com/PDFMathTranslate/pdf2zh-next/blob/main/docs/GLOSSARY.md) for key terms. - **Consistency in Terminology**: Ensure that the same term is translated consistently throughout the documentation. - **Cultural Adaptation**: Adapt examples and references to be culturally relevant to the target audience when necessary. - **Keep It Simple**: Use clear and straightforward language. Avoid overly complex sentences. - **Test Your Translations**: After translating, test the functionality to ensure that the translated text works well in the application context. - **Collaborate**: Use pull requests and issues to collaborate with other translators and maintainers. ### Translation Style Guide 1. **Tone**: Maintain a professional and helpful tone. The documentation should be approachable yet authoritative. 2. **Voice**: Use active voice whenever possible to make the text more engaging and easier to understand. 3. **Punctuation**: Follow the punctuation rules of the target language. For example, in Chinese, use full-width punctuation marks. 4. **Formatting**: Preserve the original formatting, including code blocks, links, and headings. Only translate the textual content. 5. **Accessibility**: Ensure that the translation is accessible, using clear language and avoiding jargon unless it is well-defined. --- ### OUTPUT LANGUAGE pt --- ### OUTPUT ### Notas e Melhores Práticas - **Verifique Traduções Existentes**: Antes de iniciar uma nova tradução, verifique a página [Idiomas Suportados](https://pdf2zh-next.com/getting-started/SUPPORTED_LANGUAGES.html) para ver se o idioma já é suportado ou se há um esforço em andamento. - **Use o Glossário Oficial**: Para manter a consistência, consulte sempre o [glossário oficial](https://github.com/PDFMathTranslate/pdf2zh-next/blob/main/docs/GLOSSARY.md) do projeto para termos-chave. - **Consistência na Terminologia**: Certifique-se de que o mesmo termo seja traduzido de forma consistente em toda a documentação. - **Adaptação Cultural**: Adapte exemplos e referências para serem culturalmente relevantes para o público-alvo quando necessário. - **Mantenha Simples**: Use linguagem clara e direta. Evite frases excessivamente complexas. - **Teste Suas Traduções**: Após traduzir, teste a funcionalidade para garantir que o texto traduzido funcione bem no contexto da aplicação. - **Colabore**: Use pull requests e issues para colaborar com outros tradutores e mantenedores. ### Guia de Estilo de Tradução 1. **Tom**: Mantenha um tom profissional e prestativo. A documentação deve ser acessível, mas autoritária. 2. **Voz**: Use voz ativa sempre que possível para tornar o texto mais envolvente e fácil de entender. 3. **Pontuação**: Siga as regras de pontuação do idioma de destino. Por exemplo, em português, use sinais de pontuação de largura total. 4. **Formatação**: Preserve a formatação original, incluindo blocos de código, links e cabeçalhos. Traduza apenas o conteúdo textual. 5. **Acessibilidade**: Certifique-se de que a tradução seja acessível, usando linguagem clara e evitando jargões, a menos que estejam bem definidos.
ru: - **Use with Caution**: Be cautious when using this feature, especially if the document contains sensitive information. - **Test First**: Always test the feature on a non-critical document first to ensure it meets your expectations. - **Backup Documents**: Keep backups of your original documents before processing. - **Check Results**: After processing, review the document to ensure the translation is accurate and the formatting is preserved. --- ### OUTPUT LANGUAGE ru
