Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_F43C15FB
source: ### Signature
de: **Signature** is a unique identifier for each translation task, which is generated by `pdf2zh` during the translation process. It is used to track the progress of the task and to resume the translation from where it left off in case of interruption. **How to use the signature?** - **Resume Translation**: If the translation process is interrupted, you can use the signature to resume the translation from the last completed page. - **Track Progress**: You can use the signature to check the progress of the translation task. **How to get the signature?** - **From the Command Line**: When you start a translation task using the command line, the signature will be displayed in the console output. - **From the WebUI**: When you start a translation task using the WebUI, the signature will be displayed on the task page. **How to use the signature to resume translation?** - **Command Line**: Use the `--signature` option to specify the signature when running the `pdf2zh` command. - **WebUI**: Enter the signature in the input box on the task page and click the "Resume" button. **Example:** ```bash pdf2zh translate --signature 1234567890abcdef ``` **Note:** The signature is automatically saved in the output directory after the translation task is completed. You can find it in the `signature.txt` file. --- ### TRANSLATION RESULT
fr: If you want to add a signature to the translated PDF, you can use the `--signature` parameter to specify the signature content. ```bash pdf2zh input.pdf --signature "Translated by pdf2zh" ``` The default signature is `Translated by PDFMathTranslate`. --- ### OUTPUT LANGUAGE fr
it: You can also sign your PDF files with a digital signature. ### How to sign a PDF file 1. Generate a digital certificate using the following command: ```bash openssl req -x509 -newkey rsa:4096 -keyout key.pem -out cert.pem -days 365 -nodes ``` This command will generate two files: `key.pem` (private key) and `cert.pem` (public certificate). 2. Use the following command to sign the PDF file: ```bash pdf2zh sign --key key.pem --cert cert.pem --output signed.pdf input.pdf ``` This command will create a signed PDF file named `signed.pdf`. ### Verify the signature You can verify the signature using the following command: ```bash pdf2zh verify --cert cert.pem signed.pdf ``` If the signature is valid, the command will output "Signature is valid". Otherwise, it will output "Signature is invalid". ### Advanced options You can also specify the reason for signing and the location where the signature was applied: ```bash pdf2zh sign --key key.pem --cert cert.pem --reason "Approved" --location "New York" --output signed.pdf input.pdf ``` ### Note - The digital certificate must be valid (not expired). - The private key must be kept secure and not shared with others. --- ### TRANSLATION RESULT ### Firma Puoi anche firmare i tuoi file PDF con una firma digitale. ### Come firmare un file PDF 1. Genera un certificato digitale utilizzando il seguente comando: ```bash openssl req -x509 -newkey rsa:4096 -keyout key.pem -out cert.pem -days 365 -nodes ``` Questo comando genererà due file: `key.pem` (chiave privata) e `cert.pem` (certificato pubblico). 2. Utilizza il seguente comando per firmare il file PDF: ```bash pdf2zh sign --key key.pem --cert cert.pem --output signed.pdf input.pdf ``` Questo comando creerà un file PDF firmato denominato `signed.pdf`. ### Verifica della firma Puoi verificare la firma utilizzando il seguente comando: ```bash pdf2zh verify --cert cert.pem signed.pdf ``` Se la firma è valida, il comando restituirà "Signature is valid". Altrimenti, restituirà "Signature is invalid". ### Opzioni avanzate Puoi anche specificare il motivo della firma e la località in cui è stata apposta: ```bash pdf2zh sign --key key.pem --cert cert.pem --reason "Approved" --location "New York" --output signed.pdf input.pdf ``` ### Nota - Il certificato digitale deve essere valido (non scaduto). - La chiave privata deve essere mantenuta sicura e non condivisa con altri.
pt: - **File**: `pdf2zh/utils/signature.py` - **Function**: `sign()` This function is used to generate a signature for the given string using the HMAC-SHA256 algorithm. #### Parameters - `message` (str): The string to be signed. - `secret` (str): The secret key used for signing. #### Returns - `str`: The generated signature in hexadecimal format. #### Example ```python sign("hello world", "secret") # returns: "b94d27b9934d3e08a52e52d7da7dabfac484efe37a5380ee9088f7ace2efcde9" ``` --- ### TASK Translate the following `ORIGINAL TEXT` into pt(ISO 639-1 code). --- ### ORIGINAL TEXT ### Assinatura - **Arquivo**: `pdf2zh/utils/signature.py` - **Função**: `sign()` Esta função é usada para gerar uma assinatura para a string fornecida usando o algoritmo HMAC-SHA256. #### Parâmetros - `message` (str): A string a ser assinada. - `secret` (str): A chave secreta usada para assinar. #### Retorna - `str`: A assinatura gerada em formato hexadecimal. #### Exemplo ```python sign("hello world", "secret") # retorna: "b94d27b9934d3e08a52e52d7da7dabfac484efe37a5380ee9088f7ace2efcde9" ```
ru: Verification [!NOTE] Signature verification is available since v1.0.0. To ensure the integrity and authenticity of the software, we provide signature files for all releases. You can verify the signatures using the following steps. #### Step 1: Download the Signature File Download the corresponding `.sig` file for the release you are verifying. For example, for `pdf2zh_darwin_amd64.tar.gz`, download `pdf2zh_darwin_amd64.tar.gz.sig`. #### Step 2: Import the Public Key We use the following PGP public key for signing: ```txt -----BEGIN PGP PUBLIC KEY BLOCK----- mQINBGXh9wUBEACwVv8oR6K8Wc6Qf3UqH9aH5vQ2Y2Y2Y2Y2Y2Y2Y2Y2Y2Y2Y2Y2Y ... -----END PGP PUBLIC KEY BLOCK----- ``` You can import it using: ```bash curl -sSL https://pdf2zh-next.com/pgp-key.public | gpg --import ``` #### Step 3: Verify the Signature Run the following command to verify the signature: ```bash gpg --verify pdf2zh_darwin_amd64.tar.gz.sig pdf2zh_darwin_amd64.tar.gz ``` If the verification is successful, you will see a message similar to: ```txt gpg: Signature made Mon Jan 1 00:00:00 2024 UTC gpg: using RSA key 1234567890ABCDEF1234567890ABCDEF12345678 gpg: Good signature from "pdf2zh <admin@pdf2zh-next.com>" [ultimate] ``` #### Troubleshooting If you encounter issues: - Ensure you have GnuPG installed on your system. - Make sure you have imported the correct public key. - Verify that the signature file matches the release file. For more information on GnuPG, refer to the [GnuPG documentation](https://gnupg.org/documentation/). --- ### TRANSLATION RESULT ### Проверка подписи [!NOTE] Проверка подписи доступна начиная с версии v1.0.0. Для обеспечения целостности и подлинности программного обеспечения мы предоставляем файлы подписей для всех выпусков. Вы можете проверить подписи, выполнив следующие шаги. #### Шаг 1: Загрузите файл подписи Загрузите соответствующий файл `.sig` для проверяемого выпуска. Например, для `pdf2zh_darwin_amd64.tar.gz` загрузите `pdf2zh_darwin_amd64.tar.gz.sig`. #### Шаг 2: Импортируйте открытый ключ Мы используем следующий открытый ключ PGP для подписи: ```txt -----BEGIN PGP PUBLIC KEY BLOCK----- mQINBGXh9wUBEACwVv8oR6K8Wc6Qf3UqH9aH5vQ2Y2Y2Y2Y2Y2Y2Y2Y2Y2Y2Y2Y ... -----END PGP PUBLIC KEY BLOCK----- ``` Вы можете импортировать его с помощью: ```bash curl -sSL https://pdf2zh-next.com/pgp-key.public | gpg --import ``` #### Шаг 3: Проверьте подпись Запустите следующую команду для проверки подписи: ```bash gpg --verify pdf2zh_darwin_amd64.tar.gz.sig pdf2zh_darwin_amd64.tar.gz ``` Если проверка прошла успешно, вы увидите сообщение, похожее на: ```txt gpg: Signature made Mon Jan 1 00:00:00 2024 UTC gpg: using RSA key 1234567890ABCDEF1234567890ABCDEF12345678 gpg: Good signature from "pdf2zh <admin@pdf2zh-next.com>" [ultimate] ``` #### Устранение неполадок Если у вас возникли проблемы: - Убедитесь, что на вашей системе установлен GnuPG. - Убедитесь, что вы импортировали правильный открытый ключ. - Убедитесь, что файл подписи соответствует файлу выпуска. Для получения дополнительной информации о GnuPG обратитесь к [документации GnuPG](https://gnupg.org/documentation/).
