Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_4A87E333
source: | `--ignore-cache` | Ignore translation cache | `pdf2zh_next example.pdf --ignore-cache` |
de: | ------------------------------- | --------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--ignore-html-cache` | Ignore HTML cache | `pdf2zh_next example.pdf --ignore-html-cache` | | `--ignore-translation-cache` | Ignore translation cache (same as `--ignore-cache`) | `pdf2zh_next example.pdf --ignore-translation-cache` | | `--ignore-all-cache` | Ignore all cache (same as `--ignore-cache --ignore-html-cache`) | `pdf2zh_next example.pdf --ignore-all-cache` | | `--ignore-image` | Ignore image translation | `pdf2zh_next example.pdf --ignore-image` | | `--ignore-text` | Ignore text translation | `pdf2zh_next example.pdf --ignore-text` | | `--ignore-table` | Ignore table translation | `pdf2zh_next example.pdf --ignore-table` | | `--ignore-equation` | Ignore equation translation | `pdf2zh_next example.pdf --ignore-equation` | | `--ignore-list` | Ignore list translation | `pdf2zh_next example.pdf --ignore-list` | | `--ignore-figure` | Ignore figure translation | `pdf2zh_next example.pdf --ignore-figure` | | `--ignore-footnote` | Ignore footnote translation | `pdf2zh_next example.pdf --ignore-footnote` | | `--ignore-bib` | Ignore bibliography translation | `pdf2zh_next example.pdf --ignore-bib` | | `--ignore-code` | Ignore code block translation | `pdf2zh_next example.pdf --ignore-code` | | `--ignore-quote` | Ignore quote translation | `pdf2zh_next example.pdf --ignore-quote` | | `--ignore-all` | Ignore all content translation (same as `--ignore-image --ignore-text --ignore-table ...`) | `pdf2zh_next example.pdf --ignore-all` | --- ### TRANSLATION | `--ignore-cache` | Übersetzungscache ignorieren | `pdf2zh_next example.pdf --ignore-cache` | | ------------------------------- | -------------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------- | | `--ignore-html-cache` | HTML-Cache ignorieren | `pdf2zh_next example.pdf --ignore-html-cache` | | `--ignore-translation-cache` | Übersetzungscache ignorieren (gleich wie `--ignore-cache`) | `pdf2zh_next example.pdf --ignore-translation-cache` | | `--ignore-all-cache` | Alle Caches ignorieren (gleich wie `--ignore-cache --ignore-html-cache`) | `pdf2zh_next example.pdf --ignore-all-cache` | | `--ignore-image` | Bildübersetzung ignorieren | `pdf2zh_next example.pdf --ignore-image` | | `--ignore-text` | Textübersetzung ignorieren | `pdf2zh_next example.pdf --ignore-text` | | `--ignore-table` | Tabellenübersetzung ignorieren | `pdf2zh_next example.pdf --ignore-table` | | `--ignore-equation` | Gleichungsübersetzung ignorieren | `pdf2zh_next example.pdf --ignore-equation` | | `--ignore-list` | Listenübersetzung ignorieren | `pdf2zh_next example.pdf --ignore-list` | | `--ignore-figure` | Abbildungsübersetzung ignorieren | `pdf2zh_next example.pdf --ignore-figure` | | `--ignore-footnote` | Fußnotenübersetzung ignorieren | `pdf2zh_next example.pdf --ignore-footnote` | | `--ignore-bib` | Literaturverzeichnisübersetzung ignorieren | `pdf2zh_next example.pdf --ignore-bib` | | `--ignore-code` | Codeblockübersetzung ignorieren | `pdf2zh_next example.pdf --ignore-code` | | `--ignore-quote` | Zitatübersetzung ignorieren | `pdf2zh_next example.pdf --ignore-quote` | | `--ignore-all` | Alle Inhaltsübersetzungen ignorieren (gleich wie `--ignore-image --ignore-text --ignore-table ...`) | `pdf2zh_next example.pdf --ignore-all` |
fr: |---------------------------------|-----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------| | `--cache-dir` | Specify the cache directory | `pdf2zh_next example.pdf --cache-dir ~/.pdf2zh_next/cache` | | `--cache-format` | Specify the cache format (json, pickle) | `pdf2zh_next example.pdf --cache-format json` | | `--cache-max-size` | Maximum cache size in MB (default: 1024) | `pdf2zh_next example.pdf --cache-max-size 2048` | | `--cache-ttl` | Cache time-to-live in seconds (default: 604800, 7 days) | `pdf2zh_next example.pdf --cache-ttl 86400` | --- ### OUTPUT | `--ignore-cache` | Ignorer le cache de traduction | `pdf2zh_next example.pdf --ignore-cache` | |---------------------------------|-----------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------| | `--cache-dir` | Spécifier le répertoire du cache | `pdf2zh_next example.pdf --cache-dir ~/.pdf2zh_next/cache` | | `--cache-format` | Spécifier le format du cache (json, pickle) | `pdf2zh_next example.pdf --cache-format json` | | `--cache-max-size` | Taille maximale du cache en Mo (par défaut : 1024) | `pdf2zh_next example.pdf --cache-max-size 2048` | | `--cache-ttl` | Durée de vie du cache en secondes (par défaut : 604800, 7 jours) | `pdf2zh_next example.pdf --cache-ttl 86400` |
it: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--cache-dir <path>` | Set the directory to store translation cache | `pdf2zh_next example.pdf --cache-dir ./my-cache` | | `--cache-format <json\|sqlite>` | Set the format of the translation cache, defaults to `json` | `pdf2zh_next example.pdf --cache-format sqlite` | | `--no-cache` | Disable translation cache | `pdf2zh_next example.pdf --no-cache` | --- ### TRANSLATED TEXT | `--ignore-cache` | Ignora la cache di traduzione | `pdf2zh_next example.pdf --ignore-cache` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--cache-dir <path>` | Imposta la directory per memorizzare la cache di traduzione | `pdf2zh_next example.pdf --cache-dir ./my-cache` | | `--cache-format <json\|sqlite>` | Imposta il formato della cache di traduzione, predefinito a `json` | `pdf2zh_next example.pdf --cache-format sqlite` | | `--no-cache` | Disabilita la cache di traduzione | `pdf2zh_next example.pdf --no-cache` |
pt: --- ### TRANSLATED TEXT | `--ignore-cache` | Ignorar cache de tradução | `pdf2zh_next example.pdf --ignore-cache` |
ru: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--cache-dir <cache_dir>` | Set the directory to store translation cache, default is `./.pdf2zh_cache` | `pdf2zh_next example.pdf --cache-dir /path/to/cache` | | `--cache-size <cache_size>` | Set the maximum number of cache entries, default is 1000, set to 0 to disable cache | `pdf2zh_next example.pdf --cache-size 2000` | | `--cache-ttl <cache_ttl>` | Set the time to live for cache entries in seconds, default is 86400 (1 day) | `pdf2zh_next example.pdf --cache-ttl 3600` | | `--cache-cleanup-interval <sec>` | Set the interval in seconds for automatic cache cleanup, default is 3600 (1 hour) | `pdf2zh_next example.pdf --cache-cleanup-interval 1800` | | `--cache-storage <type>` | Set the cache storage type, `memory` or `disk`, default is `disk` | `pdf2zh_next example.pdf --cache-storage memory` | | `--cache-compress` | Enable compression for cache entries (only for disk storage) | `pdf2zh_next example.pdf --cache-compress` | --- ### OUTPUT | `--ignore-cache` | Игнорировать кэш перевода | `pdf2zh_next example.pdf --ignore-cache` | | ------------------------------- | ---------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--cache-dir <cache_dir>` | Установить директорию для хранения кэша перевода, по умолчанию `./.pdf2zh_cache` | `pdf2zh_next example.pdf --cache-dir /path/to/cache` | | `--cache-size <cache_size>` | Установить максимальное количество записей в кэше, по умолчанию 1000, установите 0 для отключения кэша | `pdf2zh_next example.pdf --cache-size 2000` | | `--cache-ttl <cache_ttl>` | Установить время жизни записей кэша в секундах, по умолчанию 86400 (1 день) | `pdf2zh_next example.pdf --cache-ttl 3600` | | `--cache-cleanup-interval <sec>` | Установить интервал в секундах для автоматической очистки кэша, по умолчанию 3600 (1 час) | `pdf2zh_next example.pdf --cache-cleanup-interval 1800` | | `--cache-storage <type>` | Установить тип хранения кэша, `memory` или `disk`, по умолчанию `disk` | `pdf2zh_next example.pdf --cache-storage memory` | | `--cache-compress` | Включить сжатие записей кэша (только для хранения на диске) | `pdf2zh_next example.pdf --cache-compress` |

# chunk_3DCF93F4
source: | `--custom-system-prompt` | Custom system prompt for translation. Used for `/no_think` in Qwen 3 | `pdf2zh_next example.pdf --custom-system-prompt "/no_think You are a professional, authentic machine translation engine"` |
de: --- ### OUTPUT | `--custom-system-prompt` | Benutzerdefinierte Systemaufforderung für Übersetzungen. Wird für `/no_think` in Qwen 3 verwendet | `pdf2zh_next example.pdf --custom-system-prompt "/no_think You are a professional, authentic machine translation engine"` |
fr: --- ### OUTPUT | `--custom-system-prompt` | Invite système personnalisée pour la traduction. Utilisée pour `/no_think` dans Qwen 3 | `pdf2zh_next example.pdf --custom-system-prompt "/no_think You are a professional, authentic machine translation engine"` |
it: `""` | | ------------------------------- | --------------------------------------------------------------------------------------- | ------------------------------------------------------------------------------------------------------------------------- | ---- | | `--custom-user-prompt` | Custom user prompt for translation. Used for `/no_think` in Qwen 3 | `pdf2zh_next example.pdf --custom-user-prompt "/no_think Please translate the following text into Chinese"` | `""` | | `--custom-system-prompt-format` | Custom system prompt for formatting. Used for `/no_think` in Qwen 3 | `pdf2zh_next example.pdf --custom-system-prompt-format "/no_think You are a professional, authentic machine translation engine"` | `""` | | `--custom-user-prompt-format` | Custom user prompt for formatting. Used for `/no_think` in Qwen 3 | `pdf2zh_next example.pdf --custom-user-prompt-format "/no_think Please format the following text"` | `""` | --- ### TRANSLATION RESULT | `--custom-system-prompt` | Prompt di sistema personalizzato per la traduzione. Utilizzato per `/no_think` in Qwen 3 | `pdf2zh_next example.pdf --custom-system-prompt "/no_think You are a professional, authentic machine translation engine"` | `""` | | ------------------------------- | --------------------------------------------------------------------------------------- | ------------------------------------------------------------------------------------------------------------------------- | ---- | | `--custom-user-prompt` | Prompt utente personalizzato per la traduzione. Utilizzato per `/no_think` in Qwen 3 | `pdf2zh_next example.pdf --custom-user-prompt "/no_think Please translate the following text into Chinese"` | `""` | | `--custom-system-prompt-format` | Prompt di sistema personalizzato per la formattazione. Utilizzato per `/no_think` in Qwen 3 | `pdf2zh_next example.pdf --custom-system-prompt-format "/no_think You are a professional, authentic machine translation engine"` | `""` | | `--custom-user-prompt-format` | Prompt utente personalizzato per la formattazione. Utilizzato per `/no_think` in Qwen 3 | `pdf2zh_next example.pdf --custom-user-prompt-format "/no_think Please format the following text"` | `""` |
pt: | `--custom-system-prompt` | Prompt de sistema personalizado para tradução. Usado para `/no_think` no Qwen 3 | `pdf2zh_next example.pdf --custom-system-prompt "/no_think You are a professional, authentic machine translation engine"` |
ru: `""` | | ------------------------------- | --------------------------------------------------------------------------------------- | -------------------------------------------------------------------------------------------------------------------------- | ------------------------- | | `--custom-user-prompt` | Custom user prompt for translation. Used for `/no_think` in Qwen 3 | `pdf2zh_next example.pdf --custom-user-prompt "/no_think Please translate the following text into Chinese"` | `""` | | `--custom-system-prompt-format` | Custom system prompt for format. Used for `/no_think` in Qwen 3 | `pdf2zh_next example.pdf --custom-system-prompt-format "/no_think You are a professional, authentic machine translation engine"` | `""` | | `--custom-user-prompt-format` | Custom user prompt for format. Used for `/no_think` in Qwen 3 | `pdf2zh_next example.pdf --custom-user-prompt-format "/no_think Please format the following text"` | `""` | | `--custom-system-prompt-ocr` | Custom system prompt for OCR. Used for `/no_think` in Qwen 3 | `pdf2zh_next example.pdf --custom-system-prompt-ocr "/no_think You are a professional, authentic machine translation engine"` | `""` | | `--custom-user-prompt-ocr` | Custom user prompt for OCR. Used for `/no_think` in Qwen 3 | `pdf2zh_next example.pdf --custom-user-prompt-ocr "/no_think Please OCR the following text"` | `""` | | `--custom-system-prompt-table` | Custom system prompt for table. Used for `/no_think` in Qwen 3 | `pdf2zh_next example.pdf --custom-system-prompt-table "/no_think You are a professional, authentic machine translation engine"` | `""` | | `--custom-user-prompt-table` | Custom user prompt for table. Used for `/no_think` in Qwen 3 | `pdf2zh_next example.pdf --custom-user-prompt-table "/no_think Please translate the following table into Chinese"` | `""` | | `--custom-system-prompt-math` | Custom system prompt for math. Used for `/no_think` in Qwen 3 | `pdf2zh_next example.pdf --custom-system-prompt-math "/no_think You are a professional, authentic machine translation engine"` | `""` | | `--custom-user-prompt-math` | Custom user prompt for math. Used for `/no_think` in Qwen 3 | `pdf2zh_next example.pdf --custom-user-prompt-math "/no_think Please translate the following math into Chinese"` | `""` | | `--custom-system-prompt-figure` | Custom system prompt for figure. Used for `/no_think` in Qwen 3 | `pdf2zh_next example.pdf --custom-system-prompt-figure "/no_think You are a professional, authentic machine translation engine"` | `""` | | `--custom-user-prompt-figure` | Custom user prompt for figure. Used for `/no_think` in Qwen 3 | `pdf2zh_next example.pdf --custom-user-prompt-figure "/no_think Please translate the following figure into Chinese"` | `""` | --- ### OUTPUT | `--custom-system-prompt` | Пользовательский системный промпт для перевода. Используется для `/no_think` в Qwen 3 | `pdf2zh_next example.pdf --custom-system-prompt "/no_think You are a professional, authentic machine translation engine"` | `""` | | ------------------------------- | --------------------------------------------------------------------------------------- | -------------------------------------------------------------------------------------------------------------------------- | ------------------------- | | `--custom-user-prompt` | Пользовательский пользовательский промпт для перевода. Используется для `/no_think` в Qwen 3 | `pdf2zh_next example.pdf --custom-user-prompt "/no_think Please translate the following text into Chinese"` | `""` | | `--custom-system-prompt-format` | Пользовательский системный промпт для форматирования. Используется для `/no_think` в Qwen 3 | `pdf2zh_next example.pdf --custom-system-prompt-format "/no_think You are a professional, authentic machine translation engine"` | `""` | | `--custom-user-prompt-format` | Пользовательский пользовательский промпт для форматирования. Используется для `/no_think` в Qwen 3 | `pdf2zh_next example.pdf --custom-user-prompt-format "/no_think Please format the following text"` | `""` | | `--custom-system-prompt-ocr` | Пользовательский системный промпт для OCR. Используется для `/no_think` в Qwen 3 | `pdf2zh_next example.pdf --custom-system-prompt-ocr "/no_think You are a professional, authentic machine translation engine"` | `""` | | `--custom-user-prompt-ocr` | Пользовательский пользовательский промпт для OCR. Используется для `/no_think` в Qwen 3 | `pdf2zh_next example.pdf --custom-user-prompt-ocr "/no_think Please OCR the following text"` | `""` | | `--custom-system-prompt-table` | Пользовательский системный промпт для таблиц. Используется для `/no_think` в Qwen 3 | `pdf2zh_next example.pdf --custom-system-prompt-table "/no_think You are a professional, authentic machine translation engine"` | `""` | | `--custom-user-prompt-table` | Пользовательский пользовательский промпт для таблиц. Используется для `/no_think` в Qwen 3 | `pdf2zh_next example.pdf --custom-user-prompt-table "/no_think Please translate the following table into Chinese"` | `""` | | `--custom-system-prompt-math` | Пользовательский системный промпт для математики. Используется для `/no_think` в Qwen 3 | `pdf2zh_next example.pdf --custom-system-prompt-math "/no_think You are a professional, authentic machine translation engine"` | `""` | | `--custom-user-prompt-math` | Пользовательский пользовательский промпт для математики. Используется для `/no_think` в Qwen 3 | `pdf2zh_next example.pdf --custom-user-prompt-math "/no_think Please translate the following math into Chinese"` | `""` | | `--custom-system-prompt-figure` | Пользовательский системный промпт для рисунков. Используется для `/no_think` в Qwen 3 | `pdf2zh_next example.pdf --custom-system-prompt-figure "/no_think You are a professional, authentic machine translation engine"` | `""` | | `--custom-user-prompt-figure` | Пользовательский пользовательский промпт для рисунков. Используется для `/no_think` в Qwen 3 | `pdf2zh_next example.pdf --custom-user-prompt-figure "/no_think Please translate the following figure into Chinese"` | `""` |
