Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_681FB271
source: | `--debug` | Use debug logging level | `pdf2zh_next example.pdf --debug` |
de: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--log-to-file` | Log to a file in the same directory as the output file | `pdf2zh_next example.pdf --log-to-file` | | `--log-level` | Set the log level, default is `info` | `pdf2zh_next example.pdf --log-level debug` | | `--log-format` | Set the log format, default is `text` | `pdf2zh_next example.pdf --log-format json` | | `--version` | Show version number | `pdf2zh_next --version` | | `--help` | Show help message | `pdf2zh_next --help` | | `--cache-dir` | Set the cache directory, default is `~/.cache/pdf2zh_next` | `pdf2zh_next example.pdf --cache-dir ./cache` | | `--cache-size` | Set the cache size, default is `100` MB | `pdf2zh_next example.pdf --cache-size 200` | | `--cache-ttl` | Set the cache TTL, default is `7` days | `pdf2zh_next example.pdf --cache-ttl 30` | | `--cache-cleanup-interval` | Set the cache cleanup interval, default is `1` hour | `pdf2zh_next example.pdf --cache-cleanup-interval 2` | | `--cache-max-files` | Set the maximum number of cache files, default is `1000` | `pdf2zh_next example.pdf --cache-max-files 2000` | | `--cache-max-size` | Set the maximum cache size, default is `100` MB | `pdf2zh_next example.pdf --cache-max-size 200` | | `--cache-compression` | Enable cache compression, default is `false` | `pdf2zh_next example.pdf --cache-compression` | | `--cache-encryption` | Enable cache encryption, default is `false` | `pdf2zh_next example.pdf --cache-encryption` | | `--cache-encryption-key` | Set the cache encryption key, default is empty | `pdf2zh_next example.pdf --cache-encryption-key mykey` | | `--cache-encryption-algorithm` | Set the cache encryption algorithm, default is `aes-256-gcm` | `pdf2zh_next example.pdf --cache-encryption-algorithm aes-128-gcm` | | `--cache-encryption-iv` | Set the cache encryption IV, default is empty | `pdf2zh_next example.pdf --cache-encryption-iv myiv` | | `--cache-encryption-salt` | Set the cache encryption salt, default is empty | `pdf2zh_next example.pdf --cache-encryption-salt mysalt` | | `--cache-encryption-iterations` | Set the cache encryption iterations, default is `10000` | `pdf2zh_next example.pdf --cache-encryption-iterations 20000` | | `--cache-encryption-key-length` | Set the cache encryption key length, default is `32` | `pdf2zh_next example.pdf --cache-encryption-key-length 16` | | `--cache-encryption-mode` | Set the cache encryption mode, default is `gcm` | `pdf2zh_next example.pdf --cache-encryption-mode cbc` | | `--cache-encryption-padding` | Set the cache encryption padding, default is `pkcs7` | `pdf2zh_next example.pdf --cache-encryption-padding none` | | `--cache-encryption-hash` | Set the cache encryption hash, default is `sha256` | `pdf2zh_next example.pdf --cache-encryption-hash sha512` | | `--cache-encryption-hmac` | Set the cache encryption HMAC, default is `false` | `pdf2zh_next example.pdf --cache-encryption-hmac` | | `--cache-encryption-hmac-key` | Set the cache encryption HMAC key, default is empty | `pdf2zh_next example.pdf --cache-encryption-hmac-key myhmackey` | | `--cache-encryption-hmac-algorithm` | Set the cache encryption HMAC algorithm, default is `sha256` | `pdf2zh_next example.pdf --cache-encryption-hmac-algorithm sha512` | | `--cache-encryption-hmac-length` | Set the cache encryption HMAC length, default is `32` | `pdf2zh_next example.pdf --cache-encryption-hmac-length 64` | | `--cache-encryption-hmac-mode` | Set the cache encryption HMAC mode, default is `sha256` | `pdf2zh_next example.pdf --cache-encryption-hmac-mode sha512` | | `--cache-encryption-hmac-padding` | Set the cache encryption HMAC padding, default is `pkcs7` | `pdf2zh_next example.pdf --cache-encryption-hmac-padding none` | | `--cache-encryption-hmac-hash` | Set the cache encryption HMAC hash, default is `sha256` | `pdf2zh_next example.pdf --cache-encryption-hmac-hash sha512` | | `--cache-encryption-hmac-iterations` | Set the cache encryption HMAC iterations, default is `10000` | `pdf2zh_next example.pdf --cache-encryption-hmac-iterations 20000` | | `--cache-encryption-hmac-key-length` | Set the cache encryption HMAC key length, default is `32` | `pdf2zh_next example.pdf --cache-encryption-hmac-key-length 16` | | `--cache-encryption-hmac-salt` | Set the cache encryption HMAC salt, default is empty | `pdf2zh_next example.pdf --cache-encryption-hmac-salt myhmacsalt` | | `--cache-encryption-hmac-iv` | Set the cache encryption HMAC IV, default is empty | `pdf2zh_next example.pdf --cache-encryption-hmac-iv myhmaciv` | | `--cache-encryption-hmac-mode` | Set the cache encryption HMAC mode, default is `sha256` | `pdf2zh_next example.pdf --cache-encryption-hmac-mode sha512` | | `--cache-encryption-hmac-padding` | Set the cache encryption HMAC padding, default is `pkcs7` | `pdf2zh_next example.pdf --cache-encryption-hmac-padding none` | | `--cache-encryption-hmac-hash` | Set the cache encryption HMAC hash, default is `sha256` | `pdf2zh_next example.pdf --cache-encryption-hmac-hash sha512` | | `--cache-encryption-hmac-iterations` | Set the cache encryption HMAC iterations, default is `10000` | `pdf2zh_next example.pdf --cache-encryption-hmac-iterations 20000` | | `--cache-encryption-hmac-key-length` | Set the cache encryption HMAC key length, default is `32` | `pdf2zh_next example.pdf --cache-encryption-hmac-key-length 16` | | `--cache-encryption-hmac-salt` | Set the cache encryption HMAC salt, default is empty | `pdf2zh_next example.pdf --cache-encryption-hmac-salt myhmacsalt` | | `--cache-encryption-hmac-iv` | Set the cache encryption HMAC IV, default is empty | `pdf2zh_next example.pdf --cache-encryption-hmac-iv myhmaciv` | | `--cache-encryption-hmac-mode` | Set the cache encryption HMAC mode, default is `sha256` | `pdf2zh_next example.pdf --cache-encryption-hmac-mode sha512` | | `--cache-encryption-hmac-padding` | Set the cache encryption HMAC padding, default is `pkcs7` | `pdf2zh_next example.pdf --cache-encryption-hmac-padding none` | | `--cache-encryption-hmac-hash` | Set the cache encryption HMAC hash, default is `sha256` | `pdf2zh_next example.pdf --cache-encryption-hmac-hash sha512` | | `--cache-encryption-hmac-iterations` | Set the cache encryption HMAC iterations, default is `10000` | `pdf2zh_next example.pdf --cache-encryption-hmac-iterations 20000` | | `--cache-encryption-hmac-key-length` | Set the cache encryption HMAC key length, default is `32` | `pdf2zh_next example.pdf --cache-encryption-hmac-key-length 16` | | `--cache-encryption-hmac-salt` | Set the cache encryption HMAC salt, default is empty | `pdf2zh_next example.pdf --cache-encryption-hmac-salt myhmacsalt` | | `--cache-encryption-hmac-iv` | Set the cache encryption HMAC IV, default is empty | `pdf2zh_next example.pdf --cache-encryption-hmac-iv myhmaciv` | | `--cache-encryption-hmac-mode` | Set the cache encryption HMAC mode, default is `sha256` | `pdf2zh_next example.pdf --cache-encryption-hmac-mode sha512` | | `--cache-encryption-hmac-padding` | Set the cache encryption HMAC padding, default is `pkcs7` | `pdf2zh_next example.pdf --cache-encryption-hmac-padding none` | | `--cache-encryption-hmac-hash` | Set the cache encryption HMAC hash, default is `sha256` | `pdf2zh_next example.pdf --cache-encryption-hmac-hash sha512` | | `--cache-encryption-hmac-iterations` | Set the cache encryption HMAC iterations, default is `极客时间` | `pdf2zh_next example.pdf --cache-encryption-hmac-iterations 20000` | --- ### OUTPUT | `--debug` | Debug-Logging-Level verwenden | `pdf2zh_next example.pdf --debug` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--log-to-file` | In eine Datei im selben Verzeichnis wie die Ausgabedatei loggen | `pdf2zh_next example.pdf --log-to-file` | | `--log-level` | Log-Level festlegen, Standard ist `info` | `pdf2zh_next example.pdf --log-level debug` | | `--log-format` | Log-Format festlegen, Standard ist `text` | `pdf2zh_next example.pdf --log-format json` | | `--version` | Versionsnummer anzeigen | `pdf2zh_next --version` | | `--help` | Hilfe-Nachricht anzeigen | `pdf2zh_next --help` | | `--cache-dir` | Cache-Verzeichnis festlegen, Standard ist `~/.cache/pdf2zh_next` | `pdf2zh_next example.pdf --cache-dir ./cache` | | `--cache-size` | Cache-Größe festlegen, Standard ist `100` MB | `pdf2zh_next example.pdf --cache-size 200` | | `--cache-ttl` | Cache-TTL festlegen, Standard ist `7` Tage | `pdf2zh_next example.pdf --cache-ttl 30` | | `--cache-cleanup-interval` | Cache-Bereinigungsintervall festlegen, Standard ist `1` Stunde | `pdf2zh_next example.pdf --cache-cleanup-interval 2` | | `--cache-max-files` | Maximale Anzahl an Cache-Dateien festlegen, Standard ist `1000` | `pdf2zh_next example.pdf --cache-max-files 2000` | | `--cache-max-size` | Maximale Cache-Größe festlegen, Standard ist `100` MB | `pdf2zh_next example.pdf --cache-max-size 200` | | `--cache-compression` | Cache-Kompression aktivieren, Standard ist `false` | `pdf2zh_next example.pdf --cache-compression` | | `--cache-encryption` | Cache-Verschlüsselung aktivieren, Standard ist `false` | `pdf2zh_next example.pdf --cache-encryption` | | `--cache-encryption-key` | Cache-Verschlüsselungsschlüssel festlegen, Standard ist leer | `pdf2zh_next example.pdf --cache-encryption-key mykey` | | `--cache-encryption-algorithm` | Cache-Verschlüsselungsalgorithmus festlegen, Standard ist `aes-256-gcm` | `pdf2zh_next example.pdf --cache-encryption-algorithm aes-128-gcm` | | `--cache-encryption-iv` | Cache-Verschlüsselungs-IV festlegen, Standard ist leer | `pdf2zh_next example.pdf --cache-encryption-iv myiv` | | `--cache-encryption-salt` | Cache-Verschlüsselungs-Salt festlegen, Standard ist leer | `pdf2zh_next example.pdf --cache-encryption-salt mysalt` | | `--cache-encryption-iterations` | Cache-Verschlüsselungs-Iterationen festlegen, Standard ist `10000` | `pdf2zh_next example.pdf --cache-encryption-iterations 极客时间` | | `--cache-encryption-key-length` | Cache-Verschlüsselungsschlüssellänge festlegen, Standard ist `32` | `极客时间 example.pdf --cache-encryption-key-length 16` | | `--cache-encryption-mode` | Cache-Verschlüsselungsmodus festlegen, Standard ist `gcm` | `pdf2zh_next example.pdf --cache-encryption-mode cbc` | | `--极客时间-padding` | Cache-Verschlüsselungs-Padding festlegen, Standard ist `pkcs7` | `pdf2zh_next example.pdf --cache-encryption-padding none` | | `--cache-encryption-hash` | Cache-Verschlüsselungs-Hash festlegen, Standard ist `sha256` | `pdf2zh_next example.pdf --cache-encryption-hash sha512` | | `--cache-encryption-hmac` | Cache-Verschlüsselungs-HMAC aktivieren, Standard ist `false` | `pdf 极客时间 example.pdf --cache-encryption-hmac` | | `--cache-encryption-hmac-key` | Cache-Verschlüsselungs-HMAC-Schlüssel festlegen, Standard ist leer | `pdf2zh_next example.pdf --cache-encryption-hmac-key myhmackey` | | `--cache-encryption-hmac-algorithm` | Cache-Verschlüsselungs-HMAC-Algorithmus festlegen, Standard ist `sha256` | `pdf2zh_next example.pdf --cache-encryption-hmac-algorithm sha512` | | `--cache-encryption-hmac-length` | Cache-Verschlüsselungs-HMAC-Länge festlegen, Standard ist `32` | `pdf2zh_next example.pdf --cache-encryption-hmac-length 64` | | `--cache-encryption-hmac-mode` | Cache-Verschlüsselungs-HMAC-Modus festlegen, Standard ist `sha256` | `pdf2zh_next example.pdf --cache-encryption-hmac-mode sha512` | | `--cache-encryption-hmac-padding` | Cache-Verschlüsselungs-HMAC-Padding festlegen, Standard ist `pkcs7` | `pdf2zh_next example.pdf --cache-encryption-hmac-padding none` | | `--cache-encryption-hmac-h 极客时间` | Cache-Verschlüsselungs-HMAC-Hash festlegen, Standard ist `sha256` | `pdf2zh_next example.pdf --cache-encryption-hmac-hash sha512` | | `--cache-encryption-hmac-iterations` | Cache-Verschlüsselungs-HMAC-Iterationen festlegen, Standard ist `10000` | `pdf2zh_next example.pdf --cache-encryption-hmac-iterations 20000` | | `--cache-encryption-hmac-key-length` | Cache-Verschlüsselungs-HMAC-Schlüssellänge festlegen, Standard ist `32` | `pdf2zh_next example.pdf --cache-encryption-hmac-key-length 16` | | `--cache-encryption-hmac-salt` | Cache-Verschlüsselungs-HMAC-Salt festlegen, Standard ist leer | `pdf2zh_next example.pdf --cache-encryption-hmac-salt myhmacsalt` | | `--cache-encryption-hmac-iv` | Cache-Verschlüsselungs-HMAC-IV festlegen, Standard ist leer | `pdf2zh_next example.pdf --cache-encryption-hmac-iv myhmac 极客时间` | | `--cache-encryption-hmac-mode` | Cache-Verschlüsselungs-HMAC-Modus festlegen, Standard ist `sha256` | `pdf2zh_next example.pdf --cache-encryption-hmac-mode sha512` | | `--cache-encryption-hmac-padding` | Cache-Verschlüsselungs-HMAC-Padding festlegen, Standard ist `pkcs7` | `pdf2zh_next example.pdf --cache-encryption-hmac-padding none` | | `--cache-encryption-hmac-hash` | Cache-Verschlüsselungs-HMAC-Hash festlegen, Standard ist `sha256` | `pdf2zh_next example.pdf --cache-encryption-hmac-hash sha512` | | `--cache-encryption-hmac-iterations` | Cache-Verschlüsselungs-HMAC-Iterationen festlegen, Standard ist `10000` | `pdf2zh_next example.pdf --cache-encryption-hmac-iterations 20000` | | `--cache-encryption-hmac-key-length` | Cache-Verschlüsselungs-HMAC-Schlüssellänge festlegen, Standard ist `32` | `pdf2zh_next example.pdf --cache-encryption-hmac-key-length 16` | | `--cache-encryption-hmac-salt` | Cache-Verschlüsselungs-HMAC-Salt festlegen, Standard ist leer | `pdf2zh_next example.pdf --cache-encryption-hmac-salt myhmacsalt` | | `--cache-encryption-hmac-iv` | Cache-Verschlüsselungs-HMAC-IV festlegen, Standard ist leer | `pdf2zh_next example.pdf --cache-encryption-hmac-iv myhmaciv` | | `--cache-encryption-hmac-mode` | Cache-Verschlüsselungs-HMAC-Modus festlegen, Standard ist `sha256` | `pdf2zh_next example.pdf --cache-encryption-hmac-mode sha512` | | `--cache-encryption-hmac-padding` | Cache-Verschlüsselungs-HMAC-Padding festlegen, Standard ist `pkcs 极客时间` | `pdf2zh_next example.pdf --cache-encryption-hmac-padding none` | | `--cache-encryption-hmac-hash` | Cache-Verschlüsselungs-HMAC-Hash festlegen, Standard ist `sha256` | `pdf2zh_next example.pdf --cache-encryption-hmac-hash sha512` | | `--cache-encryption-hmac-iterations` | Cache-Verschlüsselungs-HMAC-Iterationen festlegen, Standard ist `10000` | `pdf2zh_next example.pdf --cache-encryption-hmac-iterations 20000` | | `--cache-encryption-hmac-key-length 极客时间` | Cache-Verschlüsselungs-HMAC-Schlüssellänge festlegen, Standard ist `32` | `pdf2zh_next example.pdf --cache-encryption-hmac-key-length 16` | | `--cache-encryption-hmac-salt` | Cache-Verschlüsselungs-HMAC-Salt festlegen, Standard ist leer | `pdf2zh_next example.pdf --cache-encryption-hmac-salt myhmacsalt` | | `--cache-encryption-hmac-iv` | Cache-Verschlüsselungs-HMAC-IV festlegen, Standard ist leer | `pdf2zh_next example.pdf --cache-encryption-hmac-iv myhmaciv` | | `--cache-encryption-hmac-mode` | Cache-Verschlüsselungs-HMAC-Modus festlegen, Standard ist `sha256` | `pdf2zh_next example.pdf --cache-encryption-hmac-mode sha512` | | `--cache-encryption-hmac-padding` | Cache-Verschlüsselungs-HMAC-Padding festlegen, Standard ist `pkcs7` | `pdf2zh_next example.pdf --cache-encryption 极客时间-hmac-padding none` | | `--cache-encryption-hmac-hash` | Cache-Verschlüsselungs-HMAC-Hash festlegen, Standard ist `sha256` | `pdf2zh_next example.pdf --cache-encryption-hmac-hash sha512` | | `--cache-encryption-hmac-iterations` | Cache-Verschlüsselungs-HMAC-Iterationen festlegen, Standard ist `10000` | `pdf2zh_next example.pdf --cache-encryption-hmac-iterations 20000` | | `--cache-encryption-hmac-key-length` | Cache-Verschlüsselungs-HMAC-Schlüssellänge festlegen, Standard ist `32` | `pdf2zh_next example.pdf --cache-encryption-hmac-key-length 16` | | `--cache-encryption-hmac-salt` | Cache-Verschlüsselungs-HMAC-Salt festlegen, Standard ist leer | `pdf2zh_next example.pdf --cache-encryption-hmac-salt myhmacsalt` | | `--cache-encryption-hmac-iv` | Cache-Verschlüsselungs-HMAC-IV festlegen, Standard ist leer | `pdf2zh_next example.pdf --cache-encryption-hmac-iv myhmaciv` | | `--cache-encryption-hmac-mode` | Cache-Verschlüsselungs-HMAC-Modus festlegen, Standard ist `sha256` | `pdf2zh_next example.pdf --cache-encryption-hmac-mode sha512` | | `--cache-encryption-hmac-padding` | Cache-Verschlüsselungs-HMAC-Padding festlegen, Standard ist `pkcs7` | `pdf2zh_next example.pdf --cache-encryption-hmac-padding none` | | `--cache-encryption-hmac-hash` | Cache-Verschlüsselungs-HMAC-Hash festlegen, Standard ist `sha256` | `pdf2zh_next example.pdf --cache-encryption-hmac-hash sha512` | | `--cache-encryption-hmac-iterations` | Cache-Verschlüsselungs-HMAC-Iterationen festlegen, Standard ist `极客时间` | `pdf2zh_next example.pdf --cache-encryption-hmac-iterations 20000` |
fr: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--disable-ocr` | Disable OCR | `pdf2zh_next example.pdf --disable-ocr` | | `--disable-translate` | Disable Translate | `pdf2zh_next example.pdf --disable-translate` | | `--dry-run` | Run without generating files | `pdf2zh_next example.pdf --dry-run` | | `--force-rebuild` | Force rebuild all pages | `pdf2zh_next example.pdf --force-rebuild` | | `--help` | Show help message and exit | `pdf2zh_next --help` | | `--language <language_code>` | Set target language, default is `zh` | `pdf2zh_next example.pdf --language ja` | | `--log-level <level>` | Set log level, default is `info` | `pdf2zh_next example.pdf --log-level debug` | | `--max-workers <num>` | Set max workers for OCR and translate, default is `8` | `pdf2zh_next example.pdf --max-workers 4` | | `--no-cache` | Disable cache | `pdf2zh_next example.pdf --no-cache` | | `--only-ocr` | Only OCR, skip translate | `pdf2zh_next example.pdf --only-ocr` | | `--only-translate` | Only translate, skip OCR | `pdf2zh_next example.pdf --only-translate` | | `--output <path>` | Set output path | `pdf2zh_next example.pdf --output ./output/` | | `--page-range <start> [<end>]` | Set page range to process, e.g. `1-5` or `1,3,5-7` | `pdf2zh_next example.pdf --page-range 1-5` <br> `pdf2zh_next example.pdf --page-range 1,3,5-7` | | `--proxy <proxy_url>` | Set proxy for requests | `pdf2zh_next example.pdf --proxy http://127.0.0.1:7890` | | `--rebuild-failed` | Rebuild failed pages | `pdf2zh_next example.pdf --rebuild-failed` | | `--rebuild-page <page_number>` | Rebuild specific page | `pdf2zh_next example.pdf --rebuild-page 1` | | `--service <service_name>` | Set translation service, default is `google` | `pdf2zh_next example.pdf --service deepl` | | `--version` | Show version and exit | `pdf2zh_next --version` | --- ### TRANSLATION | `--debug` | Utiliser le niveau de journalisation de débogage | `pdf2zh_next example.pdf --debug` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--disable-ocr` | Désactiver l'OCR | `pdf2zh_next example.pdf --disable-ocr` | | `--disable-translate` | Désactiver la traduction | `pdf2zh_next example.pdf --disable-translate` | | `--dry-run` | Exécuter sans générer de fichiers | `pdf2zh_next example.pdf --dry-run` | | `--force-rebuild` | Forcer la reconstruction de toutes les pages | `pdf2zh_next example.pdf --force-rebuild` | | `--help` | Afficher le message d'aide et quitter | `pdf2zh_next --help` | | `--language <language_code>` | Définir la langue cible, par défaut `zh` | `pdf2zh_next example.pdf --language ja` | | `--log-level <level>` | Définir le niveau de journalisation, par défaut `info` | `pdf2zh_next example.pdf --log-level debug` | | `--max-workers <num>` | Définir le nombre maximum de workers pour l'OCR et la traduction, par défaut `8` | `pdf2zh_next example.pdf --max-workers 4` | | `--no-cache` | Désactiver le cache | `pdf2zh_next example.pdf --no-cache` | | `--only-ocr` | Uniquement l'OCR, ignorer la traduction | `pdf2zh_next example.pdf --only-ocr` | | `--only-translate` | Uniquement la traduction, ignorer l'OCR | `pdf2zh_next example.pdf --only-translate` | | `--output <path>` | Définir le chemin de sortie | `pdf2zh_next example.pdf --output ./output/` | | `--page-range <start> [<end>]` | Définir la plage de pages à traiter, par ex. `1-5` ou `1,3,5-7` | `pdf2zh_next example.pdf --page-range 1-5` <br> `pdf2zh_next example.pdf --page-range 1,3,5-7` | | `--proxy <proxy_url>` | Définir le proxy pour les requêtes | `pdf2zh_next example.pdf --proxy http://127.0.0.1:7890` | | `--rebuild-failed` | Reconstruire les pages échouées | `pdf2zh_next example.pdf --rebuild-failed` | | `--rebuild-page <page_number>` | Reconstruire une page spécifique | `pdf2zh_next example.pdf --rebuild-page 1` | | `--service <service_name>` | Définir le service de traduction, par défaut `google` | `pdf2zh_next example.pdf --service deepl` | | `--version` | Afficher la version et quitter | `pdf2zh_next --version` |
it: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--disable-xxx` | Disable the corresponding module | `pdf2zh_next example.pdf --disable-math` | | `--enable-xxx` | Enable the corresponding module | `pdf2zh_next example.pdf --enable-math` | | `--help` | Show help message and exit | `pdf2zh_next --help` | | `--log-level <level>` | Set the logging level. The available options are `debug`, `info`, `warning`, and `error` | `pdf2zh_next example.pdf --log-level debug` | | `--log-path <path>` | Set the log file path. If not specified, the log will be output to the terminal | `pdf2zh_next example.pdf --log-path log.txt` | | `--math-mode <mode>` | Set the math translation mode. The available options are `preserve`, `translate` | `pdf2zh_next example.pdf --math-mode preserve` | | `--no-xxx` | Disable the corresponding module | `pdf2zh_next example.pdf --no-math` | | `--output <path>` | Set the output file path. If not specified, the output will be saved to `output.pdf` | `pdf2zh_next example.pdf --output result.pdf` | | `--page-range <start> [<end>]` | Set the page range to translate. If `<end>` is not specified, only `<start>` is used | `pdf2zh_next example.pdf --page-range 1 10` | | `--timeout <seconds>` | Set the timeout for each translation request. Default is `10` seconds | `pdf2zh_next example.pdf --timeout 20` | | `--translate <service>` | Set the translation service. The available options are `google`, `deepl` | `pdf2zh_next example.pdf --translate deepl` | | `--version` | Show version information and exit | `pdf2zh_next --version` | | `--yes` | Skip the confirmation prompt and proceed directly | `pdf2zh_next example.pdf --yes` | --- ### TRANSLATION RESULT | `--debug` | Utilizza il livello di registrazione di debug | `pdf2zh_next example.pdf --debug` | | ------------------------------- | ------------------------------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--disable-xxx` | Disabilita il modulo corrispondente | `pdf2zh_next example.pdf --disable-math` | | `--enable-xxx` | Abilita il modulo corrispondente | `pdf2zh_next example.pdf --enable-math` | | `--help` | Mostra il messaggio di aiuto ed esce | `pdf2zh_next --help` | | `--log-level <level>` | Imposta il livello di registrazione. Le opzioni disponibili sono `debug`, `info`, `warning` e `error` | `pdf2zh_next example.pdf --log-level debug` | | `--log-path <path>` | Imposta il percorso del file di log. Se non specificato, il log verrà emesso nel terminale | `pdf2zh_next example.pdf --log-path log.txt` | | `--math-mode <mode>` | Imposta la modalità di traduzione matematica. Le opzioni disponibili sono `preserve`, `translate` | `pdf2zh_next example.pdf --math-mode preserve` | | `--no-xxx` | Disabilita il modulo corrispondente | `pdf2zh_next example.pdf --no-math` | | `--output <path>` | Imposta il percorso del file di output. Se non specificato, l'output verrà salvato in `output.pdf` | `pdf2zh_next example.pdf --output result.pdf` | | `--page-range <start> [<end>]` | Imposta l'intervallo di pagine da tradurre. Se `<end>` non è specificato, viene utilizzato solo `<start>` | `pdf2zh_next example.pdf --page-range 1 10` | | `--timeout <seconds>` | Imposta il timeout per ogni richiesta di traduzione. Il valore predefinito è `10` secondi | `pdf2zh_next example.pdf --timeout 20` | | `--translate <service>` | Imposta il servizio di traduzione. Le opzioni disponibili sono `google`, `deepl` | `pdf2zh_next example.pdf --translate deepl` | | `--version` | Mostra le informazioni sulla versione ed esce | `pdf2zh_next --version` | | `--yes` | Salta la richiesta di conferma e procede direttamente | `pdf2zh_next example.pdf --yes` |
pt: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `-h`, `--help` | Show help message and exit | `pdf2zh_next example.pdf -h` | | `--log-level` | Set the log level (DEBUG, INFO, WARNING, ERROR, CRITICAL) | `pdf2zh_next example.pdf --log-level DEBUG` | | `--log-path` | Set the log file path, default is `pdf2zh_next.log` | `pdf2zh_next example.pdf --log-path my_log.log` | | `--log-format` | Set the log format, default is `%(asctime)s - %(name)s - %(levelname)s - %(message)s` | `pdf2zh_next example.pdf --log-format "%(asctime)s - %(message)s"` | | `--log-encoding` | Set the log file encoding, default is `utf-8` | `pdf2zh_next example.pdf --log-encoding gbk` | --- ### TRANSLATED TEXT | `--debug` | Usar nível de logging de depuração | `pdf2zh_next example.pdf --debug` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `-h`, `--help` | Mostrar mensagem de ajuda e sair | `pdf2zh_next example.pdf -h` | | `--log-level` | Definir o nível de log (DEBUG, INFO, WARNING, ERROR, CRITICAL) | `pdf2zh_next example.pdf --log-level DEBUG` | | `--log-path` | Definir o caminho do arquivo de log, padrão é `pdf2zh_next.log` | `pdf2zh_next example.pdf --log-path my_log.log` | | `--log-format` | Definir o formato do log, padrão é `%(asctime)s - %(name)s - %(levelname)s - %(message)s` | `pdf2zh_next example.pdf --log-format "%(asctime)s - %(message)s"` | | `--log-encoding` | Definir a codificação do arquivo de log, padrão é `utf-8` | `pdf2zh_next example.pdf --log-encoding gbk` |
ru: | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--log-level` | Set logging level, default is `info` | `pdf2zh_next example.pdf --log-level debug` | | `--log-file` | Save logs to file | `pdf2zh_next example.pdf --log-file log.txt` | | `--log-format` | Set log format, default is `%(asctime)s - %(name)s - %(levelname)s - %(message)s` | `pdf2zh_next example.pdf --log-format "%(asctime)s - %(name)s - %(levelname)s - %(message)s"` | | `--log-rotate` | Enable log rotation, default is `False` | `pdf2zh_next example.pdf --log-rotate` | | `--log-rotate-max-bytes` | Max bytes per log file, default is `10485760` (10MB) | `pdf2zh_next example.pdf --log-rotate-max-bytes 20971520` | | `--log-rotate-backup-count` | Number of backup logs to keep, default is `5` | `pdf2zh_next example.pdf --log-rotate-backup-count 10` | | `--log-rotate-when` | When to rotate logs, default is `midnight` | `pdf2zh_next example.pdf --log-rotate-when midnight` | | `--log-rotate-interval` | Interval for log rotation, default is `1` | `pdf2zh_next example.pdf --log-rotate-interval 1` | | `--log-rotate-utc` | Use UTC time for log rotation, default is `False` | `pdf2zh_next example.pdf --log-rotate-utc` | | `--log-rotate-at-time` | Time to rotate logs, default is `None` | `pdf2zh_next example.pdf --log-rotate-at-time "00:00"` | | `--log-rotate-encoding` | Encoding for log files, default is `utf-8` | `pdf2zh_next example.pdf --log-rotate-encoding utf-8` | | `--log-rotate-delay` | Delay log rotation until next check, default is `False` | `pdf2zh_next example.pdf --log-rotate-delay` | | `--log-rotate-compression` | Compression method for rotated logs, default is `None` | `pdf2zh_next example.pdf --log-rotate-compression zip` | | `--log-rotate-compression-level` | Compression level, default is `None` | `pdf2zh_next example.pdf --log-rotate-compression-level 9` | --- ### OUTPUT LANGUAGE ru --- | `--debug` | Использовать уровень логирования отладки | `pdf2zh_next example.pdf --debug` | | ------------------------------- | -------------------------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | | `--log-level` | Установить уровень логирования, по умолчанию `info` | `pdf2zh_next example.pdf --log-level debug` | | `--log-file` | Сохранять логи в файл | `pdf2zh_next example.pdf --log-file log.txt` | | `--log-format` | Установить формат лога, по умолчанию `%(asctime)s - %(name)s - %(levelname)s - %(message)s` | `pdf2zh_next example.pdf --log-format "%(asctime)s - %(name)s - %(levelname)s - %(message)s"` | | `--log-rotate` | Включить ротацию логов, по умолчанию `False` | `pdf2zh_next example.pdf --log-rotate` | | `--log-rotate-max-bytes` | Максимальный размер файла лога в байтах, по умолчанию `10485760` (10 МБ) | `pdf2zh_next example.pdf --log-rotate-max-bytes 20971520` | | `--log-rotate-backup-count` | Количество резервных копий логов для хранения, по умолчанию `5` | `pdf2zh_next example.pdf --log-rotate-backup-count 10` | | `--log-rotate-when` | Когда выполнять ротацию логов, по умолчанию `midnight` | `pdf2zh_next example.pdf --log-rotate-when midnight` | | `--log-rotate-interval` | Интервал ротации логов, по умолчанию `1` | `pdf2zh_next example.pdf --log-rotate-interval 1` | | `--log-rotate-utc` | Использовать UTC время для ротации логов, по умолчанию `False` | `pdf2zh_next example.pdf --log-rotate-utc` | | `--log-rotate-at-time` | Время для ротации логов, по умолчанию `None` | `pdf2zh_next example.pdf --log-rotate-at-time "00:00"` | | `--log-rotate-encoding` | Кодировка файлов логов, по умолчанию `utf-8` | `pdf2zh_next example.pdf --log-rotate-encoding utf-8` | | `--log-rotate-delay` | Отложить ротацию логов до следующей проверки, по умолчанию `False` | `pdf2zh_next example.pdf --log-rotate-delay` | | `--log-rotate-compression` | Метод сжатия для ротированных логов, по умолчанию `None` | `pdf2zh_next example.pdf --log-rotate-compression zip` | | `--log-rotate-compression-level` | Уровень сжатия, по умолчанию `None` | `pdf2zh_next example.pdf --log-rotate-compression-level 9` |
