Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_773EEC89
source: > [!TIP] > `25-` includes all pages after page 25. If your document has 100 pages, this is equivalent to `25-100`. > > Similarly, `-25` includes all pages before page 25, which is equivalent to `1-25`.
de: > [!TIP] > `25-` schließt alle Seiten ab Seite 25 ein. Wenn Ihr Dokument 100 Seiten hat, entspricht dies `25-100`. > > Ebenso schließt `-25` alle Seiten vor Seite 25 ein, was `1-25` entspricht.
fr: > [!TIP] > `25-` inclut toutes les pages après la page 25. Si votre document comporte 100 pages, cela équivaut à `25-100`. > > De même, `-25` inclut toutes les pages avant la page 25, ce qui équivaut à `1-25`.
it: > [!TIP] > `25-` include tutte le pagine successive alla pagina 25. Se il tuo documento ha 100 pagine, questo è equivalente a `25-100`. > > Allo stesso modo, `-25` include tutte le pagine precedenti alla pagina 25, che è equivalente a `1-25`.
pt: > [!TIP] > `25-` inclui todas as páginas após a página 25. Se o seu documento tiver 100 páginas, isso é equivalente a `25-100`. > > Da mesma forma, `-25` inclui todas as páginas antes da página 25, o que é equivalente a `1-25`.
ru: > [!TIP] > `25-` включает все страницы после 25-й. Если ваш документ содержит 100 страниц, это эквивалентно `25-100`. > > Аналогично, `-25` включает все страницы до 25-й, что эквивалентно `1-25`.

# chunk_1A89F075
source: - If the pages are not consecutive, you can use a comma `,` to separate them.
de: - Wenn die Seiten nicht aufeinanderfolgend sind, können Sie ein Komma `,` verwenden, um sie zu trennen.
fr: - Si les pages ne sont pas consécutives, vous pouvez utiliser une virgule `,` pour les séparer.
it: - Se le pagine non sono consecutive, puoi usare una virgola `,` per separarle.
pt: - Se as páginas não forem consecutivas, você pode usar uma vírgula `,` para separá-las.
ru: - Если страницы не идут подряд, вы можете использовать запятую `,` для их разделения.

# chunk_046E7E79
source: For example, if you want to translate the first and third pages, you can use the following command:
de: Zum Beispiel, wenn Sie die erste und dritte Seite übersetzen möchten, können Sie den folgenden Befehl verwenden:
fr: Par exemple, si vous souhaitez traduire la première et la troisième page, vous pouvez utiliser la commande suivante :
it: Ad esempio, se vuoi tradurre la prima e la terza pagina, puoi usare il seguente comando:
pt: Por exemplo, se você deseja traduzir a primeira e a terceira páginas, pode usar o seguinte comando:
ru: Например, если вы хотите перевести первую и третью страницы, вы можете использовать следующую команду:

# chunk_376C9855
source: - If the pages include both consecutive and non-consecutive ranges, you can also connect them with a comma, like this:
de: - Wenn die Seiten sowohl aufeinanderfolgende als auch nicht aufeinanderfolgende Bereiche enthalten, können Sie diese auch mit einem Komma verbinden, wie folgt:
fr: - Si les pages incluent à la fois des plages consécutives et non consécutives, vous pouvez également les connecter avec une virgule, comme ceci :
it: - Se le pagine includono sia intervalli consecutivi che non consecutivi, puoi anche collegarli con una virgola, in questo modo:
pt: - Se as páginas incluírem intervalos consecutivos e não consecutivos, você também pode conectá-los com uma vírgula, assim:
ru: - Если страницы включают как последовательные, так и непоследовательные диапазоны, вы также можете соединить их запятой, например:

# chunk_16D6BA70
source: This command will translate the first page, the third page, pages 10-20, and all pages from 25 to the end. [⬆️ Back to top](#toc)
de: Dieser Befehl übersetzt die erste Seite, die dritte Seite, die Seiten 10-20 und alle Seiten von 25 bis zum Ende. [⬆️ Zurück zum Anfang](#toc)
fr: Cette commande traduira la première page, la troisième page, les pages 10 à 20, et toutes les pages de 25 jusqu'à la fin. [⬆️ Retour en haut](#toc)
it: Questo comando tradurrà la prima pagina, la terza pagina, le pagine da 10 a 20 e tutte le pagine da 25 alla fine. [⬆️ Torna all'inizio](#toc)
pt: Este comando irá traduzir a primeira página, a terceira página, as páginas 10-20 e todas as páginas de 25 até o final. [⬆️ Voltar ao topo](#toc)
ru: Эта команда переведет первую страницу, третью страницу, страницы с 10 по 20 и все страницы с 25 до конца. [⬆️ Наверх](#toc)

# chunk_482C5F18
source: #### Specify source and target languages
de: #### Quell- und Zielsprachen angeben
fr: #### Spécifier les langues source et cible
it: #### Specificare le lingue di origine e di destinazione
pt: #### Especificar idiomas de origem e destino
ru: #### Указание исходного и целевого языков

# chunk_3E16227B
source: See [Google Languages Codes](https://developers.google.com/admin-sdk/directory/v1/languages), [DeepL Languages Codes](https://developers.deepl.com/docs/resources/supported-languages)
de: Siehe [Google Languages Codes](https://developers.google.com/admin-sdk/directory/v1/languages), [DeepL Languages Codes](https://developers.deepl.com/docs/resources/supported-languages)
fr: Voir [Google Languages Codes](https://developers.google.com/admin-sdk/directory/v1/languages), [DeepL Languages Codes](https://developers.deepl.com/docs/resources/supported-languages)
it: Vedi [Google Languages Codes](https://developers.google.com/admin-sdk/directory/v1/languages), [DeepL Languages Codes](https://developers.deepl.com/docs/resources/supported-languages)
pt: Veja [Google Languages Codes](https://developers.google.com/admin-sdk/directory/v1/languages), [DeepL Languages Codes](https://developers.deepl.com/docs/resources/supported-languages)
ru: См. [Google Languages Codes](https://developers.google.com/admin-sdk/directory/v1/languages), [DeepL Languages Codes](https://developers.deepl.com/docs/resources/supported-languages)

# chunk_EA41DE52
source: #### Translate wih exceptions
de: #### Übersetzen mit Ausnahmen
fr: #### Traduire avec exceptions
it: #### Tradurre con eccezioni
pt: #### Traduzir com exceções
ru: #### Перевод с исключениями

# chunk_6BAF2E56
source: Use regex to specify formula fonts and characters that need to be preserved:
de: Verwenden Sie reguläre Ausdrücke, um Formelschriften und Zeichen anzugeben, die erhalten bleiben sollen:
fr: Utiliser des expressions régulières pour spécifier les polices de formule et les caractères à préserver :
it: Utilizza le espressioni regolari per specificare i caratteri e i font delle formule che devono essere preservati:
pt: Use regex para especificar fontes de fórmulas e caracteres que precisam ser preservados:
ru: Используйте регулярные выражения для указания шрифтов формул и символов, которые необходимо сохранить:

# chunk_8FEF09F4
source: Preserve `Latex`, `Mono`, `Code`, `Italic`, `Symbol` and `Math` fonts by default:
de: Standardmäßig werden `Latex`, `Mono`, `Code`, `Italic`, `Symbol` und `Math` Schriftarten beibehalten:
fr: Conserve par défaut les polices `Latex`, `Mono`, `Code`, `Italic`, `Symbol` et `Math` :
it: Preserva i caratteri `Latex`, `Mono`, `Code`, `Italic`, `Symbol` e `Math` per impostazione predefinita:
pt: Preservar as fontes `Latex`, `Mono`, `Code`, `Italic`, `Symbol` e `Math` por padrão:
ru: Сохранять шрифты `Latex`, `Mono`, `Code`, `Italic`, `Symbol` и `Math` по умолчанию:

# chunk_37A13558
source: #### Custom prompt
de: #### Benutzerdefinierte Eingabeaufforderung
fr: #### Invite personnalisée
it: #### Prompt personalizzato
pt: #### Prompt personalizado
ru: #### Пользовательский запрос

# chunk_5F141742
source: Custom system prompt for translation. It is mainly used to add the '/no_think' instruction of Qwen 3 in the prompt.
de: Benutzerdefinierte Systemeingabeaufforderung für die Übersetzung. Sie wird hauptsächlich verwendet, um die '/no_think'-Anweisung von Qwen 3 in die Eingabeaufforderung einzufügen.
fr: Invite système personnalisée pour la traduction. Elle est principalement utilisée pour ajouter l'instruction '/no_think' de Qwen 3 dans l'invite.
it: Prompt di sistema personalizzato per la traduzione. Viene principalmente utilizzato per aggiungere l'istruzione '/no_think' di Qwen 3 nel prompt.
pt: Prompt personalizado do sistema para tradução. Ele é usado principalmente para adicionar a instrução '/no_think' do Qwen 3 no prompt.
ru: Пользовательский системный запрос для перевода. В основном используется для добавления инструкции '/no_think' Qwen 3 в запрос.

# chunk_1EC5A9B5
source: #### Custom configuration
de: #### Benutzerdefinierte Konfiguration
fr: #### Configuration personnalisée
it: #### Configurazione personalizzata
pt: #### Configuração personalizada
ru: #### Пользовательская конфигурация

# chunk_754794E1
source: There are multiple ways to modify and import the configuration file.
de: Es gibt mehrere Möglichkeiten, die Konfigurationsdatei zu ändern und zu importieren.
fr: Il existe plusieurs façons de modifier et d'importer le fichier de configuration.
it: Esistono diversi modi per modificare e importare il file di configurazione.
pt: Existem várias maneiras de modificar e importar o arquivo de configuração.
ru: Существует несколько способов изменения и импорта файла конфигурации.

# chunk_B9BF8271
source: > [!NOTE] > **Configuration File Hierarchy** > > When modifying the same parameter using different methods, the software will apply changes according to the priority order below. > > Higher-ranked modifications will override lower-ranked ones. > > **cli/gui > env > user config file > default config file**
de: > [!NOTE] > **Konfigurationsdatei-Hierarchie** > > Wenn derselbe Parameter mit verschiedenen Methoden geändert wird, wendet die Software die Änderungen gemäß der folgenden Prioritätsreihenfolge an. > > Höherrangige Änderungen überschreiben niedrigerrangige. > > **cli/gui > env > Benutzerkonfigurationsdatei > Standardkonfigurationsdatei**
fr: > [!NOTE] > **Hiérarchie des fichiers de configuration** > > Lors de la modification d'un même paramètre à l'aide de différentes méthodes, le logiciel appliquera les modifications selon l'ordre de priorité ci-dessous. > > Les modifications de rang supérieur remplaceront celles de rang inférieur. > > **cli/gui > env > fichier de configuration utilisateur > fichier de configuration par défaut**
it: > [!NOTE] > **Gerarchia dei file di configurazione** > > Quando si modifica lo stesso parametro utilizzando metodi diversi, il software applicherà le modifiche secondo l'ordine di priorità riportato di seguito. > > Le modifiche con priorità più alta sovrascriveranno quelle con priorità più bassa. > > **cli/gui > env > file di configurazione utente > file di configurazione predefinito**
pt: > [!NOTE] > **Hierarquia do Arquivo de Configuração** > > Ao modificar o mesmo parâmetro usando métodos diferentes, o software aplicará as alterações de acordo com a ordem de prioridade abaixo. > > Modificações com classificação mais alta substituirão as de classificação mais baixa. > > **cli/gui > env > arquivo de configuração do usuário > arquivo de configuração padrão**
ru: > [!NOTE] > **Иерархия файлов конфигурации** > > При изменении одного и того же параметра разными способами, программное обеспечение будет применять изменения в соответствии с указанным ниже порядком приоритета. > > Изменения с более высоким приоритетом переопределяют изменения с более низким приоритетом. > > **cli/gui > env > пользовательский файл конфигурации > файл конфигурации по умолчанию**

# chunk_06B261DE
source: - Modifying Configuration via **Command Line Arguments**
de: - Konfiguration über **Kommandozeilen-Argumente** ändern
fr: - Modification de la configuration via **Arguments de ligne de commande**
it: - Modifica della configurazione tramite **Argomenti della riga di comando**
pt: - Modificando a Configuração via **Argumentos da Linha de Comando**
ru: - Изменение конфигурации через **аргументы командной строки**

# chunk_4579F74D
source: For most cases, you can directly pass your desired settings through command line arguments. Please refer to [Command Line Args](#cmd) for more information. For example, if you want to enable a GUI window, you can use the following command:
de: In den meisten Fällen können Sie Ihre gewünschten Einstellungen direkt über Kommandozeilen-Argumente übergeben. Weitere Informationen finden Sie unter [Kommandozeilen-Argumente](#kommandozeilen-argumente). Beispielsweise können Sie mit dem folgenden Befehl ein GUI-Fenster aktivieren:
fr: Pour la plupart des cas, vous pouvez directement passer vos paramètres souhaités via les arguments de ligne de commande. Veuillez vous référer à [Arguments de ligne de commande](#cmd) pour plus d'informations. Par exemple, si vous souhaitez activer une fenêtre d'interface graphique, vous pouvez utiliser la commande suivante :
it: Nella maggior parte dei casi, puoi passare direttamente le impostazioni desiderate attraverso gli argomenti della riga di comando. Per ulteriori informazioni, consulta [Argomenti della riga di comando](#cmd). Ad esempio, se desideri abilitare una finestra GUI, puoi utilizzare il seguente comando:
pt: Na maioria dos casos, você pode passar diretamente suas configurações desejadas através dos argumentos da linha de comando. Consulte [Argumentos da Linha de Comando](#cmd) para obter mais informações. Por exemplo, se você deseja habilitar uma janela GUI, pode usar o seguinte comando:
ru: В большинстве случаев вы можете напрямую передать желаемые настройки через аргументы командной строки. Подробнее см. в разделе [Аргументы командной строки](#cmd). Например, если вы хотите включить окно GUI, можно использовать следующую команду:

# chunk_85CC4581
source: - Modifying Configuration via **Environment Variables**
de: - Konfiguration über **Umgebungsvariablen** anpassen
fr: - Modification de la configuration via **Variables d'environnement**
it: - Modifica della configurazione tramite **Variabili d'ambiente**
pt: - Modificando a Configuração via **Variáveis de Ambiente**
ru: - Изменение конфигурации через **переменные среды**

# chunk_A3573A4C
source: You can replace the `--` in command line arguments with `PDF2ZH_`, connect parameters using `=`, and replace `-` with `_` as environment variables. For example, if you want to enable a GUI window, you can use the following command:
de: Sie können das `--` in Kommandozeilen-Argumenten durch `PDF2ZH_` ersetzen, Parameter mit `=` verbinden und `-` durch `_` als Umgebungsvariablen ersetzen. Zum Beispiel, wenn Sie ein GUI-Fenster aktivieren möchten, können Sie den folgenden Befehl verwenden:
fr: Vous pouvez remplacer le `--` dans les arguments de ligne de commande par `PDF2ZH_`, connecter les paramètres en utilisant `=`, et remplacer `-` par `_` comme variables d'environnement. Par exemple, si vous souhaitez activer une fenêtre d'interface graphique, vous pouvez utiliser la commande suivante :
it: Puoi sostituire il `--` negli argomenti della riga di comando con `PDF2ZH_`, collegare i parametri utilizzando `=` e sostituire `-` con `_` come variabili d'ambiente. Ad esempio, se vuoi abilitare una finestra GUI, puoi utilizzare il seguente comando:
pt: Você pode substituir o `--` nos argumentos da linha de comando por `PDF2ZH_`, conectar parâmetros usando `=` e substituir `-` por `_` como variáveis de ambiente. Por exemplo, se você quiser habilitar uma janela GUI, pode usar o seguinte comando:
ru: Вы можете заменить `--` в аргументах командной строки на `PDF2ZH_`, соединять параметры с помощью `=`, а также заменять `-` на `_` в качестве переменных окружения. Например, если вы хотите включить окно GUI, вы можете использовать следующую команду:

# chunk_11A0D60E
source: - User-Specified **Configuration File**
de: - Benutzerdefinierte **Konfigurationsdatei**
fr: - Fichier de **configuration** spécifié par l'utilisateur
it: - File di **Configurazione** specificato dall'utente
pt: - Arquivo de **Configuração** Especificado pelo Usuário
ru: - Пользовательский **Файл конфигурации**

# chunk_9EE9DFB5
source: You can specify a configuration file using the command line argument below:
de: Sie können eine Konfigurationsdatei mit dem folgenden Kommandozeilen-Argument angeben:
fr: Vous pouvez spécifier un fichier de configuration en utilisant l'argument de ligne de commande ci-dessous :
it: È possibile specificare un file di configurazione utilizzando l'argomento della riga di comando seguente:
pt: Você pode especificar um arquivo de configuração usando o argumento da linha de comando abaixo:
ru: Вы можете указать файл конфигурации, используя следующий аргумент командной строки:

# chunk_FC4FBE9E
source: If you are unsure about the config file format, please refer to the default configuration file described below.
de: Wenn Sie sich über das Format der Konfigurationsdatei unsicher sind, lesen Sie bitte die unten beschriebene Standardkonfigurationsdatei.
fr: Si vous n'êtes pas sûr du format du fichier de configuration, veuillez vous référer au fichier de configuration par défaut décrit ci-dessous.
it: Se non sei sicuro del formato del file di configurazione, consulta il file di configurazione predefinito descritto di seguito.
pt: Se você não tiver certeza sobre o formato do arquivo de configuração, consulte o arquivo de configuração padrão descrito abaixo.
ru: Если вы не уверены в формате конфигурационного файла, обратитесь к стандартному конфигурационному файлу, описанному ниже.

# chunk_A4C0C077
source: - **Default Configuration File**
de: - **Standardkonfigurationsdatei**
fr: - **Fichier de configuration par défaut**
it: - **File di configurazione predefinito**
pt: - **Arquivo de Configuração Padrão**
ru: - **Файл конфигурации по умолчанию**

# chunk_B17D9FE3
source: The default configuration file is located at `~/.config/pdf2zh`. Please do not modify the configuration files in the `default` directory. It is strongly recommended to refer to this configuration file's content and use **User-Specified Configuration File** to implement your own configuration file.
de: Die Standardkonfigurationsdatei befindet sich unter `~/.config/pdf2zh`. Bitte ändern Sie die Konfigurationsdateien im Verzeichnis `default` nicht. Es wird dringend empfohlen, sich auf den Inhalt dieser Konfigurationsdatei zu beziehen und **Benutzerdefinierte Konfigurationsdatei** zu verwenden, um Ihre eigene Konfigurationsdatei zu implementieren.
fr: Le fichier de configuration par défaut se trouve dans `~/.config/pdf2zh`. Veuillez ne pas modifier les fichiers de configuration dans le répertoire `default`. Il est fortement recommandé de se référer au contenu de ce fichier de configuration et d'utiliser **Configuration personnalisée** pour implémenter votre propre fichier de configuration.
it: Il file di configurazione predefinito si trova in `~/.config/pdf2zh`. Si prega di non modificare i file di configurazione nella directory `default`. Si consiglia vivamente di fare riferimento al contenuto di questo file di configurazione e utilizzare **Configurazione personalizzata** per implementare il proprio file di configurazione.
pt: O arquivo de configuração padrão está localizado em `~/.config/pdf2zh`. Por favor, não modifique os arquivos de configuração no diretório `default`. É altamente recomendável consultar o conteúdo deste arquivo de configuração e usar **Configuração personalizada** para implementar seu próprio arquivo de configuração.
ru: Файл конфигурации по умолчанию находится в `~/.config/pdf2zh`. Пожалуйста, не изменяйте файлы конфигурации в каталоге `default`. Настоятельно рекомендуется ознакомиться с содержимым этого файла конфигурации и использовать **Пользовательскую конфигурацию** для реализации собственного файла конфигурации.

# chunk_15DFB8EE
source: > [!TIP] > - By default, pdf2zh 2.0 automatically saves the current configuration to `~/.config/pdf2zh/config.v3.toml` each time you click the translate button in the GUI. This configuration file will be loaded by default on the next startup. > - The configuration files in the `default` directory are automatically generated by the program. You can copy them for modification, but please do not modify them directly. > - Configuration files may include version numbers such as "v2", "v3", etc. These are **configuration file version numbers**, **not** the version number of pdf2zh itself.
de: > [!TIP] > - Standardmäßig speichert pdf2zh 2.0 die aktuelle Konfiguration automatisch in `~/.config/pdf2zh/config.v3.toml` jedes Mal, wenn Sie im GUI auf die Übersetzungsschaltfläche klicken. Diese Konfigurationsdatei wird beim nächsten Start standardmäßig geladen. > - Die Konfigurationsdateien im Verzeichnis `default` werden automatisch vom Programm generiert. Sie können sie zur Modifikation kopieren, aber bitte ändern Sie sie nicht direkt. > - Konfigurationsdateien können Versionsnummern wie "v2", "v3" usw. enthalten. Dies sind **Versionsnummern der Konfigurationsdatei**, **nicht** die Versionsnummer von pdf2zh selbst.
fr: > [!TIP] > - Par défaut, pdf2zh 2.0 enregistre automatiquement la configuration actuelle dans `~/.config/pdf2zh/config.v3.toml` chaque fois que vous cliquez sur le bouton de traduction dans l'interface graphique. Ce fichier de configuration sera chargé par défaut au prochain démarrage. > - Les fichiers de configuration dans le répertoire `default` sont générés automatiquement par le programme. Vous pouvez les copier pour les modifier, mais veuillez ne pas les modifier directement. > - Les fichiers de configuration peuvent inclure des numéros de version tels que "v2", "v3", etc. Ce sont **des numéros de version des fichiers de configuration**, **et non** le numéro de version de pdf2zh lui-même.
it: > [!TIP] > - Per impostazione predefinita, pdf2zh 2.0 salva automaticamente la configurazione corrente in `~/.config/pdf2zh/config.v3.toml` ogni volta che si fa clic sul pulsante di traduzione nella GUI. Questo file di configurazione verrà caricato per impostazione predefinita al prossimo avvio. > - I file di configurazione nella directory `default` vengono generati automaticamente dal programma. È possibile copiarli per modificarli, ma si prega di non modificarli direttamente. > - I file di configurazione possono includere numeri di versione come "v2", "v3", ecc. Questi sono **numeri di versione del file di configurazione**, **non** il numero di versione di pdf2zh stesso.
pt: > [!TIP] > - Por padrão, o pdf2zh 2.0 salva automaticamente a configuração atual em `~/.config/pdf2zh/config.v3.toml` cada vez que você clica no botão de tradução na GUI. Este arquivo de configuração será carregado por padrão na próxima inicialização. > - Os arquivos de configuração no diretório `default` são gerados automaticamente pelo programa. Você pode copiá-los para modificação, mas por favor não os modifique diretamente. > - Os arquivos de configuração podem incluir números de versão como "v2", "v3", etc. Estes são **números de versão do arquivo de configuração**, **não** o número de versão do pdf2zh em si.
ru: > [!TIP] > - По умолчанию pdf2zh 2.0 автоматически сохраняет текущую конфигурацию в файл `~/.config/pdf2zh/config.v3.toml` каждый раз, когда вы нажимаете кнопку перевода в GUI. Этот файл конфигурации будет загружен по умолчанию при следующем запуске. > - Файлы конфигурации в директории `default` автоматически генерируются программой. Вы можете скопировать их для внесения изменений, но, пожалуйста, не изменяйте их напрямую. > - Файлы конфигурации могут включать номера версий, такие как "v2", "v3" и т.д. Это **номера версий файлов конфигурации**, а **не** номер версии самого pdf2zh.

# chunk_870EBD0C
source: #### Skip clean
de: #### Bereinigung überspringen
fr: #### Ignorer le nettoyage
it: #### Salta pulizia
pt: #### Pular limpeza
ru: #### Пропустить очистку
