Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_53A9759F
source: | `--max-pages-per-part` | Maximum pages per part for split translation | `pdf2zh_next example.pdf --max-pages-per-part 50` |
de: `50` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | ---------------------------------------------------------------- | | `--force-split` | Force split translation even if the PDF is small | `pdf2zh_next example.pdf --force-split` | `False` | | `--no-split` | Disable split translation | `pdf2zh_next example.pdf --no-split` | `False` | | `--max-characters-per-part` | Maximum characters per part for split translation | `pdf2zh_next example.pdf --max-characters-per-part 10000` | `10000` | | `--max-tokens-per-part` | Maximum tokens per part for split translation | `pdf2zh_next example.pdf --max-tokens-per-part 2000` | `2000` | | `--min-tokens-per-part` | Minimum tokens per part for split translation | `pdf2zh_next example.pdf --min-tokens-per-part 500` | `500` | | `--split-on-headers` | Split on headers | `pdf2zh_next example.pdf --split-on-headers` | `True` | | `--split-on-figures` | Split on figures | `pdf2zh_next example.pdf --split-on-figures` | `True` | | `--split-on-tables` | Split on tables | `pdf2zh_next example.pdf --split-on-tables` | `True` | | `--split-on-equations` | Split on equations | `pdf2zh_next example.pdf --split-on-equations` | `True` | | `--split-on-lists` | Split on lists | `pdf2zh_next example.pdf --split-on-lists` | `True` | | `--split-on-paragraphs` | Split on paragraphs | `pdf2zh_next example.pdf --split-on-paragraphs` | `True` | | `--split-on-sentences` | Split on sentences | `pdf2zh_next example.pdf --split-on-sentences` | `False` | | `--split-on-words` | Split on words | `pdf2zh_next example.pdf --split-on-words` | `False` | | `--split-on-characters` | Split on characters | `pdf2zh_next example.pdf --split-on-characters` | `False` | | `--split-on-pages` | Split on pages | `pdf2zh_next example.pdf --split-on-pages` | `False` | | `--split-on-chapters` | Split on chapters | `pdf2zh_next example.pdf --split-on-chapters` | `False` | | `--split-on-sections` | Split on sections | `pdf2zh_next example.pdf --split-on-sections` | `False` | | `--split-on-sub-sections` | Split on sub-sections | `pdf2zh_next example.pdf --split-on-sub-sections` | `False` | | `--split-on-sub-sub-sections` | Split on sub-sub-sections | `pdf2zh_next example.pdf --split-on-sub-sub-sections` | `False` | | `--split-on-sub-sub-sub-sections` | Split on sub-sub-sub-sections | `pdf2zh_next example.pdf --split-on-sub-sub-sub-sections` | `False` | | `--split-on-sub-sub-sub-sub-sections` | Split on sub-sub-sub-sub-sections | `pdf2zh_next example.pdf --split-on-sub-sub-sub-sub-sections` | `False` | | `--split-on-sub-sub-sub-sub-sub-sections` | Split on sub-sub-sub-sub-sub-sections | `pdf2zh_next example.pdf --split-on-sub-sub-sub-sub-sub-sections` | `False` | | `--split-on-sub-sub-sub-sub-sub-sub-sections` | Split on sub-sub-sub-sub-sub-sub-sections | `pdf2zh_next example.pdf --split-on-sub-sub-sub-sub-sub-sub-sections` | `False` | --- ### TRANSLATED TEXT | `--max-pages-per-part` | Maximale Seiten pro Teil für geteilte Übersetzung | `pdf2zh_next example.pdf --max-pages-per-part 50` | `50` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | ---------------------------------------------------------------- | | `--force-split` | Erzwinge geteilte Übersetzung auch wenn die PDF klein ist | `pdf2zh_next example.pdf --force-split` | `False` | | `--no-split` | Deaktiviere geteilte Übersetzung | `pdf2zh_next example.pdf --no-split` | `False` | | `--max-characters-per-part` | Maximale Zeichen pro Teil für geteilte Übersetzung | `pdf2zh_next example.pdf --max-characters-per-part 10000` | `10000` | | `--max-tokens-per-part` | Maximale Tokens pro Teil für geteilte Übersetzung | `pdf2zh_next example.pdf --max-tokens-per-part 2000` | `2000` | | `--min-tokens-per-part` | Minimale Tokens pro Teil für geteilte Übersetzung | `pdf2zh_next example.pdf --min-tokens-per-part 500` | `500` | | `--split-on-headers` | Teile bei Überschriften | `pdf2zh_next example.pdf --split-on-headers` | `True` | | `--split-on-figures` | Teile bei Abbildungen | `pdf2zh_next example.pdf --split-on-figures` | `True` | | `--split-on-tables` | Teile bei Tabellen | `pdf2zh_next example.pdf --split-on-tables` | `True` | | `--split-on-equations` | Teile bei Gleichungen | `pdf2zh_next example.pdf --split-on-equations` | `True` | | `--split-on-lists` | Teile bei Listen | `pdf2zh_next example.pdf --split-on-lists` | `True` | | `--split-on-paragraphs` | Teile bei Absätzen | `pdf2zh_next example.pdf --split-on-paragraphs` | `True` | | `--split-on-sentences` | Teile bei Sätzen | `pdf2zh_next example.pdf --split-on-sentences` | `False` | | `--split-on-words` | Teile bei Wörtern | `pdf2zh_next example.pdf --split-on-words` | `False` | | `--split-on-characters` | Teile bei Zeichen | `pdf2zh_next example.pdf --split-on-characters` | `False` | | `--split-on-pages` | Teile bei Seiten | `pdf2zh_next example.pdf --split-on-pages` | `False` | | `--split-on-chapters` | Teile bei Kapiteln | `pdf2zh_next example.pdf --split-on-chapters` | `False` | | `--split-on-sections` | Teile bei Abschnitten | `pdf2zh_next example.pdf --split-on-sections` | `False` | | `--split-on-sub-sections` | Teile bei Unterabschnitten | `pdf2zh_next example.pdf --split-on-sub-sections` | `False` | | `--split-on-sub-sub-sections` | Teile bei Unter-Unterabschnitten | `pdf2zh_next example.pdf --split-on-sub-sub-sections` | `False` | | `--split-on-sub-sub-sub-sections` | Teile bei Unter-Unter-Unterabschnitten | `pdf2zh_next example.pdf --split-on-sub-sub-sub-sections` | `False` | | `--split-on-sub-sub-sub-sub-sections` | Teile bei Unter-Unter-Unter-Unterabschnitten | `pdf2zh_next example.pdf --split-on-sub-sub-sub-sub-sections` | `False` | | `--split-on-sub-sub-sub-sub-sub-sections` | Teile bei Unter-Unter-Unter-Unter-Unterabschnitten | `pdf2zh_next example.pdf --split-on-sub-sub-sub-sub-sub-sections` | `False` | | `--split-on-sub-sub-sub-sub-sub-sub-sections` | Teile bei Unter-Unter-Unter-Unter-Unter-Unterabschnitten | `pdf2zh_next example.pdf --split-on-sub-sub-sub-sub-sub-sub-sections` | `False` |
fr: | :------------------------------ | :-------------------------------------------------------------------------------------- | :-------------------------------------------------------------------------------------------------------------------- | | `--min-pages-per-part` | Minimum pages per part for split translation | `pdf2zh_next example.pdf --min-pages-per-part 10` | | `--max-chars-per-part` | Maximum characters per part for split translation | `pdf2zh_next example.pdf --max-chars-per-part 100000` | | `--min-chars-per-part` | Minimum characters per part for split translation | `pdf2zh_next example.pdf --min-chars-per-part 10000` | | `--max-pages-per-doc` | Maximum pages per doc for split translation | `pdf2zh_next example.pdf --max-pages-per-doc 100` | | `--min-pages-per-doc` | Minimum pages per doc for split translation | `pdf2zh_next example.pdf --min-pages-per-doc 10` | | `--max-chars-per-doc` | Maximum characters per doc for split translation | `pdf2zh_next example.pdf --max-chars-per-doc 1000000` | | `--min-chars-per-doc` | Minimum characters per doc for split translation | `pdf2zh_next example.pdf --min-chars-per-doc 100000` | | `--max-pages-per-request` | Maximum pages per request for split translation | `pdf2zh_next example.pdf --max-pages-per-request 10` | | `--min-pages-per-request` | Minimum pages per request for split translation | `pdf2zh_next example.pdf --min-pages-per-request 1` | | `--max-chars-per-request` | Maximum characters per request for split translation | `pdf2zh_next example.pdf --max-chars-per-request 10000` | | `--min-chars-per-request` | Minimum characters per request for split translation | `pdf2zh_next example.pdf --min-chars-per-request 1000` | --- ### OUTPUT | `--max-pages-per-part` | Nombre maximum de pages par partie pour la traduction divisée | `pdf2zh_next example.pdf --max-pages-per-part 50` | | :------------------------------ | :------------------------------------------------------------------------------------------------------- | :-------------------------------------------------------------------------------------------------------------------- | | `--min-pages-per-part` | Nombre minimum de pages par partie pour la traduction divisée | `pdf2zh_next example.pdf --min-pages-per-part 10` | | `--max-chars-per-part` | Nombre maximum de caractères par partie pour la traduction divisée | `pdf2zh_next example.pdf --max-chars-per-part 100000` | | `--min-chars-per-part` | Nombre minimum de caractères par partie pour la traduction divisée | `pdf2zh_next example.pdf --min-chars-per-part 10000` | | `--max-pages-per-doc` | Nombre maximum de pages par document pour la traduction divisée | `pdf2zh_next example.pdf --max-pages-per-doc 100` | | `--min-pages-per-doc` | Nombre minimum de pages par document pour la traduction divisée | `pdf2zh_next example.pdf --min-pages-per-doc 10` | | `--max-chars-per-doc` | Nombre maximum de caractères par document pour la traduction divisée | `pdf2zh_next example.pdf --max-chars-per-doc 1000000` | | `--min-chars-per-doc` | Nombre minimum de caractères par document pour la traduction divisée | `pdf2zh_next example.pdf --min-chars-per-doc 100000` | | `--max-pages-per-request` | Nombre maximum de pages par requête pour la traduction divisée | `pdf2zh_next example.pdf --max-pages-per-request 10` | | `--min-pages-per-request` | Nombre minimum de pages par requête pour la traduction divisée | `pdf2zh_next example.pdf --min-pages-per-request 1` | | `--max-chars-per-request` | Nombre maximum de caractères par requête pour la traduction divisée | `pdf2zh_next example.pdf --max-chars-per-request 10000` | | `--min-chars-per-request` | Nombre minimum de caractères par requête pour la traduction divisée | `pdf2zh_next example.pdf --min-chars-per-request 1000` |
it: 50 | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | ----------------------------------------------------------------- | | `--max-characters-per-part` | Maximum characters per part for split translation | `pdf2zh_next example.pdf --max-characters-per-part 5000` | 5000 | | `--max-concurrent-parts` | Maximum number of concurrent parts for translation | `pdf2zh_next example.pdf --max-concurrent-parts 10` | 10 | | `--max-concurrent-requests` | Maximum number of concurrent requests for translation | `pdf2zh_next example.pdf --max-concurrent-requests 5` | 5 | | `--max-retries` | Maximum number of retries for translation requests | `pdf2zh_next example.pdf --max-retries 3` | 3 | | `--max-timeout` | Maximum timeout for translation requests in seconds | `pdf2zh_next example.pdf --max-timeout 30` | 30 | | `--max-tokens-per-request` | Maximum tokens per request for translation | `pdf2zh_next example.pdf --max-tokens-per-request 1000` | 1000 | | `--max-requests-per-minute` | Maximum requests per minute for translation | `pdf2zh_next example.pdf --max-requests-per-minute 60` | 60 | | `--max-requests-per-day` | Maximum requests per day for translation | `pdf2zh_next example.pdf --max-requests-per-day 1000` | 1000 | --- ### LANGUAGE it --- ### OUTPUT | `--max-pages-per-part` | Numero massimo di pagine per parte per la traduzione divisa | `pdf2zh_next example.pdf --max-pages-per-part 50` | 50 | | ------------------------------- | ------------------------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | ----------------------------------------------------------------- | | `--max-characters-per-part` | Numero massimo di caratteri per parte per la traduzione divisa | `pdf2zh_next example.pdf --max-characters-per-part 5000` | 5000 | | `--max-concurrent-parts` | Numero massimo di parti concorrenti per la traduzione | `pdf2zh_next example.pdf --max-concurrent-parts 10` | 10 | | `--max-concurrent-requests` | Numero massimo di richieste concorrenti per la traduzione | `pdf2zh_next example.pdf --max-concurrent-requests 5` | 5 | | `--max-retries` | Numero massimo di tentativi per le richieste di traduzione | `pdf2zh_next example.pdf --max-retries 3` | 3 | | `--max-timeout` | Timeout massimo per le richieste di traduzione in secondi | `pdf2zh_next example.pdf --max-timeout 30` | 30 | | `--max-tokens-per-request` | Numero massimo di token per richiesta per la traduzione | `pdf2zh_next example.pdf --max-tokens-per-request 1000` | 1000 | | `--max-requests-per-minute` | Numero massimo di richieste al minuto per la traduzione | `pdf2zh_next example.pdf --max-requests-per-minute 60` | 60 | | `--max-requests-per-day` | Numero massimo di richieste al giorno per la traduzione | `pdf2zh_next example.pdf --max-requests-per-day 1000` | 1000 |
pt: `50` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | --------------------------------------------------------------------- | | `--max-tokens-per-part` | Maximum tokens per part for split translation | `pdf2zh_next example.pdf --max-tokens-per-part 1000` | `1000` | | `--max-characters-per-part` | Maximum characters per part for split translation | `pdf2zh_next example.pdf --max-characters-per-part 10000` | `10000` | | `--max-words-per-part` | Maximum words per part for split translation | `pdf2zh_next example.pdf --max-words-per-part 2000` | `2000` | | `--max-sentences-per-part` | Maximum sentences per part for split translation | `pdf2zh_next example.pdf --max-sentences-per-part 100` | `100` | | `--max-paragraphs-per-part` | Maximum paragraphs per part for split translation | `pdf2zh_next example.pdf --max-paragraphs-per-part 10` | `10` | | `--split-by` | Split by `page`, `token`, `character`, `word`, `sentence`, `paragraph` | `pdf2zh_next example.pdf --split-by page` | `page` | --- ### OUTPUT | `--max-pages-per-part` | Número máximo de páginas por parte para tradução dividida | `pdf2zh_next example.pdf --max-pages-per-part 50` | `50` | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | --------------------------------------------------------------------- | | `--max-tokens-per-part` | Número máximo de tokens por parte para tradução dividida | `pdf2zh_next example.pdf --max-tokens-per-part 1000` | `1000` | | `--max-characters-per-part` | Número máximo de caracteres por parte para tradução dividida | `pdf2zh_next example.pdf --max-characters-per-part 10000` | `10000` | | `--max-words-per-part` | Número máximo de palavras por parte para tradução dividida | `pdf2zh_next example.pdf --max-words-per-part 2000` | `2000` | | `--max-sentences-per-part` | Número máximo de frases por parte para tradução dividida | `pdf2zh_next example.pdf --max-sentences-per-part 100` | `100` | | `--max-paragraphs-per-part` | Número máximo de parágrafos por parte para tradução dividida | `pdf2zh_next example.pdf --max-paragraphs-per-part 10` | `10` | | `--split-by` | Dividir por `page`, `token`, `character`, `word`, `sentence`, `paragraph` | `pdf2zh_next example.pdf --split-by page` | `page` |
ru: `None` (no split) | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | ----------------- | | `--split-by-chapter` | Split by chapter (if available) | `pdf2zh_next example.pdf --split-by-chapter` | `False` | | `--split-by-chapter-min-pages` | Minimum pages per chapter part (only when `--split-by-chapter` is enabled) | `pdf2zh_next example.pdf --split-by-chapter --split-by-chapter-min-pages 10` | `5` | | `--split-by-chapter-max-pages` | Maximum pages per chapter part (only when `--split-by-chapter` is enabled) | `pdf2zh_next example.pdf --split-by-chapter --split-by-chapter-max-pages 100` | `None` (no limit) | --- ### OUTPUT | `--max-pages-per-part` | Максимальное количество страниц на часть для раздельного перевода | `pdf2zh_next example.pdf --max-pages-per-part 50` | `None` (без разделения) | | ------------------------------- | --------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------- | ----------------------- | | `--split-by-chapter` | Разделять по главам (если доступно) | `pdf2zh_next example.pdf --split-by-chapter` | `False` | | `--split-by-chapter-min-pages` | Минимальное количество страниц на часть главы (только при включенном `--split-by-chapter`) | `pdf2zh_next example.pdf --split-by-chapter --split-by-chapter-min-pages 10` | `5` | | `--split-by-chapter-max-pages` | Максимальное количество страниц на часть главы (только при включенном `--split-by-chapter`) | `pdf2zh_next example.pdf --split-by-chapter --split-by-chapter-max-pages 100` | `None` (без ограничений) |
