Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_69EC4DA6
source: | `--auth-file` | Path to the authentication file | `pdf2zh_next --gui --auth-file /path` |
de: | ------------------------------- | -------------------------------------- | ----------------------------------------------- | | `--auth-service` | Service name for authentication | `pdf2zh_next --gui --auth-service myservice` | !!! note "Note" If `--auth-file` is specified, the `--auth-service` option is ignored. --- ### TRANSLATED TEXT | `--auth-file` | Pfad zur Authentifizierungsdatei | `pdf2zh_next --gui --auth-file /path` | | ------------------------------- | -------------------------------------- | ----------------------------------------------- | | `--auth-service` | Dienstname für die Authentifizierung | `pdf2zh_next --gui --auth-service myservice` | !!! note "Hinweis" Wenn `--auth-file` angegeben ist, wird die Option `--auth-service` ignoriert.
fr: | ------------------------------- | -------------------------------------- | ----------------------------------------------- | | `--auth-username` | Username for authentication | `pdf2zh_next --gui --auth-username user` | | `--auth-password` | Password for authentication | `pdf2zh_next --gui --auth-password pwd` | --- ### OUTPUT | `--auth-file` | Chemin vers le fichier d'authentification | `pdf2zh_next --gui --auth-file /path` | | ------------------------------- | ------------------------------------------------ | ----------------------------------------------- | | `--auth-username` | Nom d'utilisateur pour l'authentification | `pdf2zh_next --gui --auth-username user` | | `--auth-password` | Mot de passe pour l'authentification | `pdf2zh_next --gui --auth-password pwd` |
it: | ------------------------------- | -------------------------------------- | ----------------------------------------------- | | `--auth-type` | Authentication type, `bearer` or `key` | `pdf2zh_next --gui --auth-type bearer` | | `--auth-username` | Username for authentication | `pdf2zh_next --gui --auth-username user` | | `--auth-password` | Password for authentication | `pdf2zh_next --gui --auth-password pass` | | `--auth-key` | API key for authentication | `pdf2zh_next --gui --auth-key key` | | `--auth-token` | Token for authentication | `pdf2zh_next --gui --auth-token token` | | `--auth-endpoint` | Authentication endpoint URL | `pdf2zh_next --gui --auth-endpoint https://...` | | `--auth-refresh-token` | Refresh token for authentication | `pdf2zh_next --gui --auth-refresh-token token` | | `--auth-refresh-interval` | Refresh interval in seconds | `pdf2zh_next --gui --auth-refresh-interval 300` | --- ### TRANSLATION RESULT | `--auth-file` | Percorso del file di autenticazione | `pdf2zh_next --gui --auth-file /percorso` | | ------------------------------- | ------------------------------------------ | --------------------------------------------------- | | `--auth-type` | Tipo di autenticazione, `bearer` o `key` | `pdf2zh_next --gui --auth-type bearer` | | `--auth-username` | Nome utente per l'autenticazione | `pdf2zh_next --gui --auth-username utente` | | `--auth-password` | Password per l'autenticazione | `pdf2zh_next --gui --auth-password password` | | `--auth-key` | Chiave API per l'autenticazione | `pdf2zh_next --gui --auth-key chiave` | | `--auth-token` | Token per l'autenticazione | `pdf2zh_next --gui --auth-token token` | | `--auth-endpoint` | URL dell'endpoint di autenticazione | `pdf2zh_next --gui --auth-endpoint https://...` | | `--auth-refresh-token` | Token di aggiornamento per l'autenticazione | `pdf2zh_next --gui --auth-refresh-token token` | | `--auth-refresh-interval` | Intervallo di aggiornamento in secondi | `pdf2zh_next --gui --auth-refresh-interval 300` |
pt: | ------------------------------- | -------------------------------------- | ----------------------------------------------- | | `--auth-user` | Username for authentication | `pdf2zh_next --gui --auth-user username` | | `--auth-pass` | Password for authentication | `pdf2zh_next --gui --auth-pass password` | | `--auth-token` | Token for authentication | `pdf2zh_next --gui --auth-token token` | | `--auth-provider` | Authentication provider | `pdf2zh_next --gui --auth-provider google` | --- ### OUTPUT | `--auth-file` | Caminho para o arquivo de autenticação | `pdf2zh_next --gui --auth-file /caminho` | | ------------------------------- | -------------------------------------- | ----------------------------------------------- | | `--auth-user` | Nome de usuário para autenticação | `pdf2zh_next --gui --auth-user nome_de_usuario` | | `--auth-pass` | Senha para autenticação | `pdf2zh_next --gui --auth-pass senha` | | `--auth-token` | Token para autenticação | `pdf2zh_next --gui --auth-token token` | | `--auth-provider` | Provedor de autenticação | `pdf2zh_next --gui --auth-provider google` |
ru: `pdf2zh_next --gui --auth-file /path` | | ------------------------------- | -------------------------------------- | ----------------------------------------------- | ----------------------------------------------- | | `--auth-type` | Authentication type | `pdf2zh_next --gui --auth-type basic` | `pdf2zh_next --gui --auth-type basic` | | `--auth-username` | Authentication username | `pdf2zh_next --gui --auth-username user` | `pdf2zh_next --gui --auth-username user` | | `--auth-password` | Authentication password | `pdf2zh_next --gui --auth-password pass` | `pdf2zh_next --gui --auth-password pass` | | `--auth-token` | Authentication token | `pdf2zh_next --gui --auth-token token` | `pdf2zh_next --gui --auth-token token` | | `--auth-token-type` | Authentication token type | `pdf2zh_next --gui --auth-token-type Bearer` | `pdf2zh_next --gui --auth-token-type Bearer` | | `--auth-header-prefix` | Authentication header prefix | `pdf2zh_next --gui --auth-header-prefix Basic` | `pdf2zh_next --gui --auth-header-prefix Basic` | | `--auth-custom-header` | Custom authentication header | `pdf2zh_next --gui --auth-custom-header X-API` | `pdf2zh_next --gui --auth-custom-header X-API` | | `--auth-custom-header-value` | Custom authentication header value | `pdf2zh_next --gui --auth-custom-header-value` | `pdf2zh_next --gui --auth-custom-header-value` | | `--auth-custom-query-param` | Custom authentication query parameter | `pdf2zh_next --gui --auth-custom-query-param` | `pdf2zh_next --gui --auth-custom-query-param` | | `--auth-custom-query-param-value` | Custom authentication query parameter value | `pdf2zh_next --gui --auth-custom-query-param-value` | `pdf2zh_next --gui --auth-custom-query-param-value` | --- ### TRANSLATION RESULT | `--auth-file` | Путь к файлу аутентификации | `pdf2zh_next --gui --auth-file /path` | `pdf2zh_next --gui --auth-file /path` | | ------------------------------- | -------------------------------------- | ----------------------------------------------- | ----------------------------------------------- | | `--auth-type` | Тип аутентификации | `pdf2zh_next --gui --auth-type basic` | `pdf2zh_next --gui --auth-type basic` | | `--auth-username` | Имя пользователя для аутентификации | `pdf2zh_next --gui --auth-username user` | `pdf2zh_next --gui --auth-username user` | | `--auth-password` | Пароль для аутентификации | `pdf2zh_next --gui --auth-password pass` | `pdf2zh_next --gui --auth-password pass` | | `--auth-token` | Токен аутентификации | `pdf2zh_next --gui --auth-token token` | `pdf2zh_next --gui --auth-token token` | | `--auth-token-type` | Тип токена аутентификации | `pdf2zh_next --gui --auth-token-type Bearer` | `pdf2zh_next --gui --auth-token-type Bearer` | | `--auth-header-prefix` | Префикс заголовка аутентификации | `pdf2zh_next --gui --auth-header-prefix Basic` | `pdf2zh_next --gui --auth-header-prefix Basic` | | `--auth-custom-header` | Пользовательский заголовок аутентификации | `pdf2zh_next --gui --auth-custom-header X-API` | `pdf2zh_next --gui --auth-custom-header X-API` | | `--auth-custom-header-value` | Значение пользовательского заголовка аутентификации | `pdf2zh_next --gui --auth-custom-header-value` | `pdf2zh_next --gui --auth-custom-header-value` | | `--auth-custom-query-param` | Пользовательский параметр запроса аутентификации | `pdf2zh_next --gui --auth-custom-query-param` | `pdf2zh_next --gui --auth-custom-query-param` | | `--auth-custom-query-param-value` | Значение пользовательского параметра запроса аутентификации | `pdf2zh_next --gui --auth-custom-query-param-value` | `pdf2zh_next --gui --auth-custom-query-param-value` |

# chunk_7C537E64
source: | `--welcome-page` | Path to the welcome html file | `pdf2zh_next --gui --welcome-page /path` |
de: Show the welcome page at the specified path. | | ------------------------------- | -------------------------------------- | ----------------------------------------------- | -------------------------------------------- | --- ### OUTPUT | `--welcome-page` | Pfad zur Willkommens-HTML-Datei | `pdf2zh_next --gui --welcome-page /path` | Zeigt die Willkommensseite am angegebenen Pfad an. | | ------------------------------- | -------------------------------------- | ----------------------------------------------- | -------------------------------------------- |
fr: |---------------------------------|----------------------------------------|-------------------------------------------------| | `--help` | Show help message | `pdf2zh_next --help` | | `--version` | Show version info | `pdf2zh_next --version` | --- ### TRANSLATED TEXT | `--welcome-page` | Chemin vers le fichier html d'accueil | `pdf2zh_next --gui --welcome-page /path` | |---------------------------------|----------------------------------------|-------------------------------------------------| | `--help` | Afficher le message d'aide | `pdf2zh_next --help` | | `--version` | Afficher les informations de version | `pdf2zh_next --version` |
it: Show welcome page at given path instead of default one. | |---------------------------------|----------------------------------------|-------------------------------------------------|---------------------------------------------------------| | `--help` | Print help information. | `pdf2zh_next --help` | Print help information. | | `--version` | Print version information. | `pdf2zh_next --version` | Print version information. | --- ### TRANSLATION RESULT | `--welcome-page` | Percorso del file html di benvenuto | `pdf2zh_next --gui --welcome-page /percorso` | Mostra la pagina di benvenuto al percorso specificato invece di quella predefinita. | |---------------------------------|----------------------------------------|-------------------------------------------------|---------------------------------------------------------| | `--help` | Stampa le informazioni di aiuto. | `pdf2zh_next --help` | Stampa le informazioni di aiuto. | | `--version` | Stampa le informazioni sulla versione. | `pdf2zh_next --version` | Stampa le informazioni sulla versione. |
pt: | ------------------------------- | -------------------------------------- | ----------------------------------------------- | | `--disable-welcome-page` | Disable the welcome page | `pdf2zh_next --gui --disable-welcome-page` | --- ### OUTPUT | `--welcome-page` | Caminho para o arquivo HTML de boas-vindas | `pdf2zh_next --gui --welcome-page /caminho` | | ------------------------------- | -------------------------------------- | ----------------------------------------------- | | `--disable-welcome-page` | Desativar a página de boas-vindas | `pdf2zh_next --gui --disable-welcome-page` |
ru: Show the welcome page, and then the main window | --- ### OUTPUT | `--welcome-page` | Путь к HTML-файлу приветственной страницы | `pdf2zh_next --gui --welcome-page /path` | Показать приветственную страницу, а затем главное окно |
