Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_DCD0732A
source: #### Deprecated Engines
de: !!! Warning These engines are deprecated and will be removed in future versions. Please migrate to the new engines. ##### Google Translate - This engine uses the Google Translate API to translate documents. - It is a free engine but requires a Google Cloud account and API key. ##### DeepL - This engine uses the DeepL API to translate documents. - It is a paid engine and requires a DeepL API key. ##### Azure - This engine uses the Microsoft Azure Translator API to translate documents. - It is a paid engine and requires an Azure account and API key. ##### Google Cloud - This engine uses the Google Cloud Translation API to translate documents. - It is a paid engine and requires a Google Cloud account and API key. ##### Aliyun - This engine uses the Alibaba Cloud Machine Translation API to translate documents. - It is a paid engine and requires an Alibaba Cloud account and API key. ##### Yandex - This engine uses the Yandex Translate API to translate documents. - It is a paid engine and requires a Yandex account and API key. ##### Baidu - This engine uses the Baidu Translate API to translate documents. - It is a paid engine and requires a Baidu account and API key. ##### Tencent - This engine uses the Tencent Cloud Translation API to translate documents. - It is a paid engine and requires a Tencent Cloud account and API key. ##### Youdao - This engine uses the Youdao Translate API to translate documents. - It is a paid engine and requires a Youdao account and API key. ##### Sogou - This engine uses the Sogou Translate API to translate documents. - It is a paid engine and requires a Sogou account and API key. ##### Niutrans - This engine uses the Niutrans API to translate documents. - It is a paid engine and requires a Niutrans account and API key. ##### Caiyun - This engine uses the Caiyun Translate API to translate documents. - It is a paid engine and requires a Caiyun account and API key. ##### Huoshan - This engine uses the Huoshan Translate API to translate documents. - It is a paid engine and requires a Huoshan account and API key. #### Veraltete Engines !!! Warning Diese Engines sind veraltet und werden in zukünftigen Versionen entfernt. Bitte migrieren Sie zu den neuen Engines. ##### Google Translate - Dieser Engine verwendet die Google Translate API, um Dokumente zu übersetzen. - Es ist ein kostenloser Engine, erfordert jedoch ein Google Cloud-Konto und einen API-Schlüssel. ##### DeepL - Dieser Engine verwendet die DeepL API, um Dokumente zu übersetzen. - Es ist ein kostenpflichtiger Engine und erfordert einen DeepL API-Schlüssel. ##### Azure - Dieser Engine verwendet die Microsoft Azure Translator API, um Dokumente zu übersetzen. - Es ist ein kostenpflichtiger Engine und erfordert ein Azure-Konto und einen API-Schlüssel. ##### Google Cloud - Dieser Engine verwendet die Google Cloud Translation API, um Dokumente zu übersetzen. - Es ist ein kostenpflichtiger Engine und erfordert ein Google Cloud-Konto und einen API-Schlüssel. ##### Aliyun - Dieser Engine verwendet die Alibaba Cloud Machine Translation API, um Dokumente zu übersetzen. - Es ist ein kostenpflichtiger Engine und erfordert ein Alibaba Cloud-Konto und einen API-Schlüssel. ##### Yandex - Dieser Engine verwendet die Yandex Translate API, um Dokumente zu übersetzen. - Es ist ein kostenpflichtiger Engine und erfordert ein Yandex-Konto und einen API-Schlüssel. ##### Baidu - Dieser Engine verwendet die Baidu Translate API, um Dokumente zu übersetzen. - Es ist ein kostenpflichtiger Engine und erfordert ein Baidu-Konto und einen API-Schlüssel. ##### Tencent - Dieser Engine verwendet die Tencent Cloud Translation API, um Dokumente zu übersetzen. - Es ist ein kostenpflichtiger Engine und erfordert ein Tencent Cloud-Konto und einen API-Schlüssel. ##### Youdao - Dieser Engine verwendet die Youdao Translate API, um Dokumente zu übersetzen. - Es ist ein kostenpflichtiger Engine und erfordert ein Youdao-Konto und einen API-Schlüssel. ##### Sogou - Dieser Engine verwendet die Sogou Translate API, um Dokumente zu übersetzen. - Es ist ein kostenpflichtiger Engine und erfordert ein Sogou-Konto und einen API-Schlüssel. ##### Niutrans - Dieser Engine verwendet die Niutrans API, um Dokumente zu übersetzen. - Es ist ein kostenpflichtiger Engine und erfordert ein Niutrans-Konto und einen API-Schlüssel. ##### Caiyun - Dieser Engine verwendet die Caiyun Translate API, um Dokumente zu übersetzen. - Es ist ein kostenpflichtiger Engine und erfordert ein Caiyun-Konto und einen API-Schlüssel. ##### Huoshan - Dieser Engine verwendet die Huoshan Translate API, um Dokumente zu übersetzen. - Es ist ein kostenpflichtiger Engine und erfordert ein Huoshan-Konto und einen API-Schlüssel.
fr: --- !!! warning "Deprecated" These engines are no longer recommended for use, but are still kept for reference. - [x] **Google Translate**: Google Translate is a free online service provided by Google that supports over 100 languages. However, it may not be suitable for translating specialized content such as academic papers, as it may not accurately handle complex terminology and formatting. - [x] **Bing Translator**: Bing Translator is a free online service provided by Microsoft that supports over 70 languages. It may not be suitable for translating specialized content such as academic papers, as it may not accurately handle complex terminology and formatting. --- ### TARGET LANGUAGE CODE fr --- ### OUTPUT #### Moteurs dépréciés --- !!! warning "Déprécié" Ces moteurs ne sont plus recommandés pour une utilisation, mais sont toujours conservés à titre de référence. - [x] **Google Translate** : Google Translate est un service en ligne gratuit fourni par Google qui prend en charge plus de 100 langues. Cependant, il peut ne pas être adapté à la traduction de contenu spécialisé tel que des articles académiques, car il peut ne pas gérer avec précision la terminologie et le formatage complexes. - [x] **Bing Translator** : Bing Translator est un service en ligne gratuit fourni par Microsoft qui prend en charge plus de 70 langues. Il peut ne pas être adapté à la traduction de contenu spécialisé tel que des articles académiques, car il peut ne pas gérer avec précision la terminologie et le formatage complexes. ---
it: - [!WARNING] Deprecated Engines The following engines are deprecated and will be removed in the future. Please use the [Recommended Engines](#recommended-engines) instead. ##### Google Translate (Free) - **API**: `google` - **Status**: Deprecated - **Reason**: The free version of Google Translate API is no longer maintained and may be unstable. ##### Baidu Translate (Free) - **API**: `baidu` - **Status**: Deprecated - **Reason**: The free version of Baidu Translate API has been discontinued. ##### Youdao Translate (Free) - **API**: `youdao` - **Status**: Deprecated - **Reason**: The free version of Youdao Translate API is no longer available. ##### Caiyun Translate (Free) - **API**: `caiyun` - **Status**: Deprecated - **Reason**: The free version of Caiyun Translate API has been discontinued. #### Recommended Engines - [!NOTE] Recommended Engines The following engines are recommended for use. They are stable and provide good translation quality. ##### Google Translate (Paid) - **API**: `google` - **Status**: Recommended - **Reason**: The paid version of Google Translate API is stable and provides high-quality translations. ##### DeepSeek Translate (Free) - **API**: `deepseek` - **Status**: Recommended - **Reason**: DeepSeek Translate provides high-quality translations and is free to use. ##### OpenAI (GPT) - **API**: `openai` - **Status**: Recommended - **Reason**: OpenAI's GPT models provide high-quality translations but require an API key. ##### Azure AI Translator - **API**: `azure` - **Status**: Recommended - **Reason**: Azure AI Translator is a stable and reliable translation service. ##### DeepL Translate - **API**: `deepl` - **Status**: Recommended - **Reason**: DeepL Translate is known for its high-quality translations. ##### Aliyun Machine Translation - **API**: `aliyun` - **Status**: Recommended - **Reason**: Aliyun Machine Translation is a stable and reliable translation service. ##### Tencent Machine Translation - **API**: `tencent` - **Status**: Recommended - **Reason**: Tencent Machine Translation is a stable and reliable translation service. ##### Volcengine Machine Translation - **API**: `volcengine` - **Status**: Recommended - **Reason**: Volcengine Machine Translation is a stable and reliable translation service. ##### Niutrans Machine Translation - **API**: `niutrans` - **Status**: Recommended - **Reason**: Niutrans Machine Translation is a stable and reliable translation service. #### Other Engines - [!NOTE] Other Engines The following engines are available but may not be as stable or provide as high quality translations as the recommended engines. ##### ChatGPT (Free) - **API**: `chatgpt` - **Status**: Experimental - **Reason**: The free version of ChatGPT may be unstable and has usage limitations. ##### Gemini (Free) - **API**: `gemini` - **Status**: Experimental - **Reason**: The free version of Gemini may be unstable and has usage limitations. ##### Hunyuan (Free) - **API**: `hunyuan` - **Status**: Experimental - **Reason**: The free version of Hunyuan may be unstable and has usage limitations. ##### Minimax (Free) - **API**: `minimax` - **Status**: Experimental - **Reason**: The free version of Minimax may be unstable and has usage limitations. ##### Step (Free) - **API**: `step` - **Status**: Experimental - **Reason**: The free version of Step may be unstable and has usage limitations. ##### Iflyrec (Free) - **API**: `iflyrec` - **Status**: Experimental - **Reason**: The free version of Iflyrec may be unstable and has usage limitations. ##### Iflytek Spark (Free) - **API**: `iflytekSpark` - **Status**: Experimental - **Reason**: The free version of Iflytek Spark may be unstable and has usage limitations. ##### Baidu Wenxin (Free) - **API**: `baiduWenxin` - **Status**: Experimental - **Reason**: The free version of Baidu Wenxin may be unstable and has usage limitations. ##### Zhipu AI (Free) - **API**: `zhipu` - **Status**: Experimental - **Reason**: The free version of Zhipu AI may be unstable and has usage limitations. ##### Moonshot (Free) - **API**: `moonshot` - **Status**: Experimental - **Reason**: The free version of Moonshot may be unstable and has usage limitations. ##### 01.AI (Free) - **API**: `zeroOneAI` - **Status**: Experimental - **Reason**: The free version of 01.AI may be unstable and has usage limitations. ##### Grok (Free) - **API**: `grok` - **Status**: Experimental - **Reason**: The free version of Grok may be unstable and has usage limitations. ##### Coze (Free) - **API**: `coze` - **Status**: Experimental - **Reason**: The free version of Coze may be unstable and has usage limitations. ##### Doubao (Free) - **API**: `doubao` - **Status**: Experimental - **Reason**: The free version of Doubao may be unstable and has usage limitations. ##### Mistral (Free) - **API**: `mistral` - **Status**: Experimental - **Reason**: The free version of Mistral may be unstable and has usage limitations. ##### Anthropic (Free) - **API**: `anthropic` - **Status**: Experimental - **Reason**: The free version of Anthropic may be unstable and has usage limitations. ##### Ollama (Local) - **API**: `ollama` - **Status**: Experimental - **Reason**: Ollama is a local deployment solution that requires manual model deployment and may have performance issues. ##### Local Model (Local) - **API**: `local` - **Status**: Experimental - **Reason**: Local models require manual deployment and may have performance issues. --- Now, I will translate the provided text into Italian, following all the specified rules. #### Motori deprecati - [!WARNING] Motori deprecati I seguenti motori sono deprecati e verranno rimossi in futuro. Si prega di utilizzare invece i [Motori consigliati](#motori-consigliati). ##### Google Translate (Gratuito) - **API**: `google` - **Stato**: Deprecato - **Motivo**: La versione gratuita dell'API di Google Translate non è più mantenuta e potrebbe essere instabile. ##### Baidu Translate (Gratuito) - **API**: `baidu` - **Stato**: Deprecato - **Motivo**: La versione gratuita dell'API di Baidu Translate è stata dismessa. ##### Youdao Translate (Gratuito) - **API**: `youdao` - **Stato**: Deprecato - **Motivo**: La versione gratuita dell'API di Youdao Translate non è più disponibile. ##### Caiyun Translate (Gratuito) - **API**: `caiyun` - **Stato**: Deprecato - **Motivo**: La versione gratuita dell'API di Caiyun Translate è stata dismessa. #### Motori consigliati - [!NOTE] Motori consigliati I seguenti motori sono consigliati per l'uso. Sono stabili e forniscono una buona qualità di traduzione. ##### Google Translate (A pagamento) - **API**: `google` - **Stato**: Consigliato - **Motivo**: La versione a pagamento dell'API di Google Translate è stabile e fornisce traduzioni di alta qualità. ##### DeepSeek Translate (Gratuito) - **API**: `deepseek` - **Stato**: Consigliato - **Motivo**: DeepSeek Translate fornisce traduzioni di alta qualità ed è gratuito. ##### OpenAI (GPT) - **API**: `openai` - **Stato**: Consigliato - **Motivo**: I modelli GPT di OpenAI forniscono traduzioni di alta qualità ma richiedono una chiave API. ##### Azure AI Translator - **API**: `azure` - **Stato**: Consigliato - **Motivo**: Azure AI Translator è un servizio di traduzione stabile e affidabile. ##### DeepL Translate - **API**: `deepl` - **Stato**: Consigliato - **Motivo**: DeepL Translate è noto per le sue traduzioni di alta qualità. ##### Aliyun Machine Translation - **API**: `aliyun` - **Stato**: Consigliato - **Motivo**: Aliyun Machine Translation è un servizio di traduzione stabile e affidabile. ##### Tencent Machine Translation - **API**: `tencent` - **Stato**: Consigliato - **Motivo**: Tencent Machine Translation è un servizio di traduzione stabile e affidabile. ##### Volcengine Machine Translation - **API**: `volcengine` - **Stato**: Consigliato - **Motivo**: Volcengine Machine Translation è un servizio di traduzione stabile e affidabile. ##### Niutrans Machine Translation - **API**: `niutrans` - **Stato**: Consigliato - **Motivo**: Niutrans Machine Translation è un servizio di traduzione stabile e affidabile. #### Altri motori - [!NOTE] Altri motori I seguenti motori sono disponibili ma potrebbero non essere così stabili o fornire traduzioni di qualità elevata come i motori consigliati. ##### ChatGPT (Gratuito) - **API**: `chatgpt` - **Stato**: Sperimentale - **Motivo**: La versione gratuita di ChatGPT potrebbe essere instabile e ha limitazioni d'uso. ##### Gemini (Gratuito) - **API**: `gemini` - **Stato**: Sperimentale - **Motivo**: La versione gratuita di Gemini potrebbe essere instabile e ha limitazioni d'uso. ##### Hunyuan (Gratuito) - **API**: `hunyuan` - **Stato**: Sperimentale - **Motivo**: La versione gratuita di Hunyuan potrebbe essere instabile e ha limitazioni d'uso. ##### Minimax (Gratuito) - **API**: `minimax` - **Stato**: Sperimentale - **Motivo**: La versione gratuita di Minimax potrebbe essere instabile e ha limitazioni d'uso. ##### Step (Gratuito) - **API**: `step` - **Stato**: Sperimentale - **Motivo**: La versione gratuita di Step potrebbe essere instabile e ha limitazioni d'use. ##### Iflyrec (Gratuito) - **API**: `iflyrec` - **Stato**: Sperimentale - **Motivo**: La versione gratuita di Iflyrec potrebbe essere instabile e ha limitazioni d'uso. ##### Iflytek Spark (Gratuito) - **API**: `iflytekSpark` - **Stato**: Sperimentale - **Motivo**: La versione gratuita di Iflytek Spark potrebbe essere instabile e ha limitazioni d'uso. ##### Baidu Wenxin (Gratuito) - **API**: `baiduWenxin` - **Stato**: Sperimentale - **Motivo**: La versione gratuita di Baidu Wenxin potrebbe essere instabile e ha limitazioni d'uso. ##### Zhipu AI (Gratuito) - **API**: `zhipu` - **Stato**: Sperimentale - **Motivo**: La versione gratuita di Zhipu AI potrebbe essere instabile e ha limitazioni d'uso. ##### Moonshot (Gratuito) - **API**: `moonshot` - **Stato**: Sperimentale - **Motivo**: La versione gratuita di Moonshot potrebbe essere instabile e ha limitazioni d'uso. ##### 01.AI (Gratuito) - **API**: `zeroOneAI` - **Stato**: Sperimentale - **Motivo**: La versione gratuita di 01.AI potrebbe essere instabile e ha limitazioni d'uso. ##### Grok (Gratuito) - **API**: `grok` - **Stato**: Sperimentale - **Motivo**: La versione gratuita di Grok potrebbe essere instabile e ha limitazioni d'uso. ##### Coze (Gratuito) - **API**: `coze` - **Stato**: Sperimentale - **Motivo**: La versione gratuita di Coze potrebbe essere instabile e ha limitazioni d'uso. ##### Doubao (Gratuito) - **API**: `doubao` - **Stato**: Sperimentale - **Motivo**: La versione gratuita di Doubao potrebbe essere instabile e ha limitazioni d'uso. ##### Mistral (Gratuito) - **API**: `mistral` - **Stato**: Sperimentale - **Motivo**: La versione gratuita di Mistral potrebbe essere instabile e ha limitazioni d'uso. ##### Anthropic (Gratuito) - **API**: `anthropic` - **Stato**: Sperimentale - **Motivo**: La versione gratuita di Anthropic potrebbe essere instabile e ha limitazioni d'uso. ##### Ollama (Locale) - **API**: `ollama` - **Stato**: Sperimentale - **Motivo**: Ollama è una soluzione di deployment locale che richiede il deployment manuale del modello e potrebbe avere problemi di prestazioni. ##### Modello locale (Locale) - **API**: `local` - **Stato**: Sperimentale - **Motivo**: I modelli locali richiedono il deployment manuale e potrebbero avere problemi di prestazioni.
pt: > [!NOTE] > This section lists engines that are no longer recommended for use, as they have been replaced by better alternatives or are no longer maintained. ##### [Google Translate](https://translate.google.com/) (Deprecated) - **Reason for deprecation**: Google Translate's free API is no longer available, and the paid version is too expensive for most users. - **Alternative**: [Google Cloud Translation](https://cloud.google.com/translate) (Paid) ##### [Bing Translator](https://www.bing.com/translator) (Deprecated) - **Reason for deprecation**: Bing Translator's API is no longer publicly available. - **Alternative**: [Azure Translator](https://azure.microsoft.com/en-us/products/ai-translator) (Paid) ##### [Yandex Translate](https://translate.yandex.com/) (Deprecated) - **Reason for deprecation**: Yandex Translate's free API has been discontinued. - **Alternative**: Consider other free engines like [Argos Translate](https://argosopentech.com/) or [Lingva Translate](https://lingva.ml/). ##### [MyMemory](https://mymemory.translated.net/) (Deprecated) - **Reason for deprecation**: The quality of MyMemory's translations is often poor, as it relies on user-contributed translations that may be inaccurate. - **Alternative**: [DeepL](https://www.deepl.com/translator) (Free/Paid) or [Google Cloud Translation](https://cloud.google.com/translate) (Paid) --- ### OUTPUT LANGUAGE pt --- ### OUTPUT #### Motores descontinuados > [!NOTE] > Esta seção lista motores que não são mais recomendados para uso, pois foram substituídos por alternativas melhores ou não são mais mantidos. ##### [Google Translate](https://translate.google.com/) (Descontinuado) - **Motivo da descontinuação**: A API gratuita do Google Translate não está mais disponível, e a versão paga é muito cara para a maioria dos usuários. - **Alternativa**: [Google Cloud Translation](https://cloud.google.com/translate) (Pago) ##### [Bing Translator](https://www.bing.com/translator) (Descontinuado) - **Motivo da descontinuação**: A API do Bing Translator não está mais disponível publicamente. - **Alternativa**: [Azure Translator](https://azure.microsoft.com/en-us/products/ai-translator) (Pago) ##### [Yandex Translate](https://translate.yandex.com/) (Descontinuado) - **Motivo da descontinuação**: A API gratuita do Yandex Translate foi descontinuada. - **Alternativa**: Considere outros motores gratuitos como [Argos Translate](https://argosopentech.com/) ou [Lingva Translate](https://lingva.ml/). ##### [MyMemory](https://mymemory.translated.net/) (Descontinuado) - **Motivo da descontinuação**: A qualidade das traduções do MyMemory é frequentemente ruim, pois depende de traduções contribuídas por usuários que podem ser imprecisas. - **Alternativa**: [DeepL](https://www.deepl.com/translator) (Gratuito/Pago) ou [Google Cloud Translation](https://cloud.google.com/translate) (Pago)
ru: > [!WARNING] > The following engines will be removed in version 0.9.0. Please switch to the new engines as soon as possible. - **`gpt-3.5-turbo`** and **`gpt-4`**: These engines are deprecated and will be removed in version 0.9.0. Please use **`gpt-3.5-turbo-instruct`** or **`gpt-4-0125-preview`** instead. #### `gemini-pro` Gemini Pro is a model developed by Google. It is free to use, but requires a Google API key. **Usage**: 1. Get a Google API key from [Google AI Studio](https://makersuite.google.com/app/apikey). 2. Set the environment variable `GOOGLE_API_KEY` to your API key. 3. Set the engine to `gemini-pro` in the configuration file. **Configuration**: ```yaml engine: gemini-pro ``` **Note**: Gemini Pro may not be as good as GPT-3.5 at translating PDFs. It is recommended to use GPT-3.5 or GPT-4 for better results. #### `claude-3-opus-20240229` Claude 3 Opus is a model developed by Anthropic. It is not free to use, and requires an Anthropic API key. **Usage**: 1. Get an Anthropic API key from [Anthropic Console](https://console.anthropic.com/). 2. Set the environment variable `ANTHROPIC_API_KEY` to your API key. 3. Set the engine to `claude-3-opus-20240229` in the configuration file. **Configuration**: ```yaml engine: claude-3-opus-20240229 ``` **Note**: Claude 3 Opus may not be as good as GPT-4 at translating PDFs. It is recommended to use GPT-4 for better results. #### `claude-3-sonnet-20240229` Claude 3 Sonnet is a model developed by Anthropic. It is not free to use, and requires an Anthropic API key. **Usage**: 1. Get an Anthropic API key from [Anthropic Console](https://console.anthropic.com/). 2. Set the environment variable `ANTHROPIC_API_KEY` to your API key. 3. Set the engine to `claude-3-sonnet-20240229` in the configuration file. **Configuration**: ```yaml engine: claude-3-sonnet-20240229 ``` **Note**: Claude 3 Sonnet may not be as good as GPT-4 at translating PDFs. It is recommended to use GPT-4 for better results. #### `claude-3-haiku-20240307` Claude 3 Haiku is a model developed by Anthropic. It is not free to use, and requires an Anthropic API key. **Usage**: 1. Get an Anthropic API key from [Anthropic Console](https://console.anthropic.com/). 2. Set the environment variable `ANTHROPIC_API_KEY` to your API key. 3. Set the engine to `claude-3-haiku-20240307` in the configuration file. **Configuration**: ```yaml engine: claude-3-haiku-20240307 ``` **Note**: Claude 3 Haiku may not be as good as GPT-4 at translating PDFs. It is recommended to use GPT-4 for better results. --- ### OUTPUT #### Устаревшие движки > [!WARNING] > Следующие движки будут удалены в версии 0.9.0. Пожалуйста, перейдите на новые движки как можно скорее. - **`gpt-3.5-turbo`** и **`gpt-4`**: Эти движки устарели и будут удалены в версии 0.9.0. Пожалуйста, используйте **`gpt-3.5-turbo-instruct`** или **`gpt-4-0125-preview`** вместо них. #### `gemini-pro` Gemini Pro — это модель, разработанная Google. Она бесплатна для использования, но требует ключ API Google. **Использование**: 1. Получите ключ API Google из [Google AI Studio](https://makersuite.google.com/app/apikey). 2. Установите переменную окружения `GOOGLE_API_KEY` в значение вашего ключа API. 3. Установите движок `gemini-pro` в файле конфигурации. **Конфигурация**: ```yaml engine: gemini-pro ``` **Примечание**: Gemini Pro может быть не так хорош, как GPT-3.5, в переводе PDF-файлов. Рекомендуется использовать GPT-3.5 или GPT-4 для лучших результатов. #### `claude-3-opus-20240229` Claude 3 Opus — это модель, разработанная Anthropic. Она не бесплатна для использования и требует ключ API Anthropic. **Использование**: 1. Получите ключ API Anthropic из [Anthropic Console](https://console.anthropic.com/). 2. Установите переменную окружения `ANTHROPIC_API_KEY` в значение вашего ключа API. 3. Установите движок `claude-3-opus-20240229` в файле конфигурации. **Конфигурация**: ```yaml engine: claude-3-opus-20240229 ``` **Примечание**: Claude 3 Opus может быть не так хорош, как GPT-4, в переводе PDF-файлов. Рекомендуется использовать GPT-4 для лучших результатов. #### `claude-3-sonnet-20240229` Claude 3 Sonnet — это модель, разработанная Anthropic. Она не бесплатна для использования и требует ключ API Anthropic. **Использование**: 1. Получите ключ API Anthropic из [Anthropic Console](https://console.anthropic.com/). 2. Установите переменную окружения `ANTHROPIC_API_KEY` в значение вашего ключа API. 3. Установите движок `claude-3-sonnet-20240229` в файле конфигурации. **Конфигурация**: ```yaml engine: claude-3-sonnet-20240229 ``` **Примечание**: Claude 3 Sonnet может быть не так хорош, как GPT-4, в переводе PDF-файлов. Рекомендуется использовать GPT-4 для лучших результатов. #### `claude-3-haiku-20240307` Claude 3 Haiku — это модель, разработанная Anthropic. Она не бесплатна для использования и требует ключ API Anthropic. **Использование**: 1. Получите ключ API Anthropic из [Anthropic Console](https://console.anthropic.com/). 2. Установите переменную окружения `ANTHROPIC_API_KEY` в значение вашего ключа API. 3. Установите движок `claude-3-haiku-20240307` в файле конфигурации. **Конфигурация**: ```yaml engine: claude-3-haiku-20240307 ``` **Примечание**: Claude 3 Haiku может быть не так хорош, как GPT-4, в переводе PDF-файлов. Рекомендуется использовать GPT-4 для лучших результатов.
