Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_EB0CE4AC
source: ### Event Stream Contract
de: This document describes the event stream contract for the `pdf2zh` service. #### Event Types The service emits the following events: - `progress`: Emitted when a progress update is available. - `result`: Emitted when the translation result is available. - `error`: Emitted when an error occurs. #### Event Data Each event is a JSON object with the following structure: ```json { "type": "event-type", "data": { ... } } ``` ##### Progress Event The `progress` event contains the following data: ```json { "type": "progress", "data": { "current": 1, "total": 10, "message": "Processing page 1 of 10" } } ``` ##### Result Event The `result` event contains the following data: ```json { "type": "result", "data": { "translatedText": "The translated text", "originalText": "The original text" } } ``` ##### Error Event The `error` event contains the following data: ```json { "type": "error", "data": { "message": "Error message", "code": "ERROR_CODE" } } ``` #### Example Here's an example of how to consume the event stream: ```javascript const eventSource = new EventSource('/api/translate'); eventSource.onmessage = (event) => { const data = JSON.parse(event.data); switch (data.type) { case 'progress': console.log(`Progress: ${data.data.current}/${data.data.total}`); break; case 'result': console.log(`Result: ${data.data.translatedText}`); break; case 'error': console.error(`Error: ${data.data.message}`); break; } }; ``` --- ### OUTPUT ### Event Stream Contract Dieses Dokument beschreibt den Event-Stream-Vertrag für den `pdf2zh`-Dienst. #### Event-Typen Der Dienst sendet die folgenden Events: - `progress`: Wird gesendet, wenn ein Fortschrittsupdate verfügbar ist. - `result`: Wird gesendet, wenn das Übersetzungsergebnis verfügbar ist. - `error`: Wird gesendet, wenn ein Fehler auftritt. #### Event-Daten Jedes Event ist ein JSON-Objekt mit der folgenden Struktur: ```json { "type": "event-type", "data": { ... } } ``` ##### Progress-Event Das `progress`-Event enthält die folgenden Daten: ```json { "type": "progress", "data": { "current": 1, "total": 10, "message": "Processing page 1 of 10" } } ``` ##### Result-Event Das `result`-Event enthält die folgenden Daten: ```json { "type": "result", "data": { "translatedText": "The translated text", "originalText": "The original text" } } ``` ##### Error-Event Das `error`-Event enthält die folgenden Daten: ```json { "type": "error", "data": { "message": "Error message", "code": "ERROR_CODE" } } ``` #### Beispiel Hier ist ein Beispiel, wie der Event-Stream konsumiert werden kann: ```javascript const eventSource = new EventSource('/api/translate'); eventSource.onmessage = (event) => { const data = JSON.parse(event.data); switch (data.type) { case 'progress': console.log(`Progress: ${data.data.current}/${data.data.total}`); break; case 'result': console.log(`Result: ${data.data.translatedText}`); break; case 'error': console.error(`Error: ${data.data.message}`); break; } }; ```
fr: This document outlines the event stream contract for the PDFMathTranslate application. #### Event Types The application emits the following events: - `file_processing_started`: Emitted when a PDF file starts being processed. - `file_processing_completed`: Emitted when a PDF file has been processed. - `file_processing_failed`: Emitted when a PDF file fails to process. #### Event Data Each event includes the following data: - `event_type`: The type of event (as listed above). - `timestamp`: The time the event occurred (ISO 8601 format). - `file_path`: The path to the PDF file being processed. - `additional_data`: Additional context-specific data (if applicable). #### Example ```json { "event_type": "file_processing_started", "timestamp": "2023-10-05T14:48:00.000Z", "file_path": "/path/to/file.pdf", "additional_data": null } ``` --- ### OUTPUT LANGUAGE fr --- Please begin.
it: This document outlines the event stream contract for the **pdf2zh** application. The event stream is used to communicate the progress and status of the translation process to the client. #### Events The event stream will send the following events: - `start`: Sent when the translation process starts. - `progress`: Sent periodically to report the progress of the translation. - `complete`: Sent when the translation is complete. - `error`: Sent when an error occurs during the translation. #### Event Data Each event will be sent as a JSON object with the following structure: ```json { "event": "event_name", "data": { // event-specific data } } ``` ##### Start Event Sent when the translation process starts. ```json { "event": "start", "data": { "message": "Translation started" } } ``` ##### Progress Event Sent periodically to report the progress of the translation. The progress is reported as a percentage. ```json { "event": "progress", "data": { "progress": 50, // percentage "message": "Processing page 10 of 20" } } ``` ##### Complete Event Sent when the translation is complete. The data includes the path to the translated file. ```json { "event": "complete", "data": { "message": "Translation complete", "filePath": "/path/to/translated/file.pdf" } } ``` ##### Error Event Sent when an error occurs during the translation. ```json { "event": "error", "data": { "message": "Error message", "error": "Error details" } } ``` #### Example Here is an example of a typical event stream: ```plaintext event: start data: {"event": "start", "data": {"message": "Translation started"}} event: progress data: {"event": "progress", "data": {"progress": 25, "message": "Processing page 5 of 20"}} event: progress data: {"event": "progress", "data": {"progress": 50, "message": "Processing page 10 of 20"}} event: progress data: {"event": "progress", "data": {"progress": 75, "message": "Processing page 15 of 20"}} event: complete data: {"event": "complete", "data": {"message": "Translation complete", "filePath": "/path/to/translated/file.pdf"}} ``` #### Notes - The event stream is implemented using Server-Sent Events (SSE). - The client should listen for these events and update the UI accordingly. - The progress event may be sent multiple times with increasing progress values. - The error event may be sent at any time during the translation process. --- ### TRANSLATION RESULT ### Contratto del flusso di eventi Questo documento delinea il contratto del flusso di eventi per l'applicazione **pdf2zh**. Il flusso di eventi viene utilizzato per comunicare lo stato di avanzamento e lo stato del processo di traduzione al client. #### Eventi Il flusso di eventi invierà i seguenti eventi: - `start`: Inviato quando inizia il processo di traduzione. - `progress`: Inviato periodicamente per segnalare lo stato di avanzamento della traduzione. - `complete`: Inviato quando la traduzione è completata. - `error`: Inviato quando si verifica un errore durante la traduzione. #### Dati dell'evento Ogni evento verrà inviato come un oggetto JSON con la seguente struttura: ```json { "event": "event_name", "data": { // event-specific data } } ``` ##### Evento di inizio Inviato quando inizia il processo di traduzione. ```json { "event": "start", "data": { "message": "Translation started" } } ``` ##### Evento di avanzamento Inviato periodicamente per segnalare lo stato di avanzamento della traduzione. Lo stato di avanzamento viene segnalato come percentuale. ```json { "event": "progress", "data": { "progress": 50, // percentage "message": "Processing page 10 of 20" } } ``` ##### Evento di completamento Inviato quando la traduzione è completata. I dati includono il percorso del file tradotto. ```json { "event": "complete", "data": { "message": "Translation complete", "filePath": "/path/to/translated/file.pdf" } } ``` ##### Evento di errore Inviato quando si verifica un errore durante la traduzione. ```json { "event": "error", "data": { "message": "Error message", "error": "Error details" } } ``` #### Esempio Ecco un esempio di un tipico flusso di eventi: ```plaintext event: start data: {"event": "start", "data": {"message": "Translation started"}} event: progress data: {"event": "progress", "data": {"progress": 25, "message": "Processing page 5 of 20"}} event: progress data: {"event": "progress", "data": {"progress": 50, "message": "Processing page 10 of 20"}} event: progress data: {"event": "progress", "data": {"progress": 75, "message": "Processing page 15 of 20"}} event: complete data: {"event": "complete", "data": {"message": "Translation complete", "filePath": "/path/to/translated/file.pdf"}} ``` #### Note - Il flusso di eventi è implementato utilizzando Server-Sent Events (SSE). - Il client dovrebbe ascoltare questi eventi e aggiornare l'interfaccia utente di conseguenza. - L'evento di avanzamento può essere inviato più volte con valori di avanzamento crescenti. - L'evento di errore può essere inviato in qualsiasi momento durante il processo di traduzione.
pt: The Event Stream Contract defines the format of the SSE (Server-Sent Events) messages that the server sends to the client. The server sends a stream of events, each of which is a JSON object. #### Event Types The server sends the following types of events: - `message`: A message from the assistant. - `error`: An error occurred. - `done`: The assistant has finished generating the response. #### Message Event The `message` event contains a message from the assistant. The message is a JSON object with the following fields: - `id`: The unique identifier for the message. - `role`: The role of the message sender. Always `assistant`. - `content`: The content of the message. This is a string that may contain markdown. - `created_at`: The timestamp when the message was created. Example: ```json { "id": "msg_123", "role": "assistant", "content": "Hello! How can I help you today?", "created_at": 1620000000 } ``` #### Error Event The `error` event contains an error message. The error is a JSON object with the following fields: - `code`: The error code. - `message`: The error message. Example: ```json { "code": "rate_limit_exceeded", "message": "Rate limit exceeded. Please try again later." } ``` #### Done Event The `done` event indicates that the assistant has finished generating the response. The event is a JSON object with the following fields: - `id`: The unique identifier for the message that was generated. - `model`: The model that was used to generate the response. - `usage`: The usage statistics for the response. This is a JSON object with the following fields: - `prompt_tokens`: The number of tokens in the prompt. - `completion_tokens`: The number of tokens in the completion. - `total_tokens`: The total number of tokens. Example: ```json { "id": "msg_123", "model": "gpt-4", "usage": { "prompt_tokens": 10, "completion_tokens": 20, "total_tokens": 30 } } ``` #### Event Stream Format The server sends events in the following format: ``` event: message data: {"id": "msg_123", "role": "assistant", "content": "Hello!", "created_at": 1620000000} event: done data: {"id": "msg_123", "model": "gpt-4", "usage": {"prompt_tokens": 10, "completion_tokens": 20, "total_tokens": 30}} ``` Each event is separated by two newlines. The `event` field specifies the type of event, and the `data` field contains the JSON object for the event. --- ### TRANSLATION RESULT ### Contrato de Fluxo de Eventos O Contrato de Fluxo de Eventos define o formato das mensagens SSE (Server-Sent Events) que o servidor envia para o cliente. O servidor envia um fluxo de eventos, cada um dos quais é um objeto JSON. #### Tipos de Eventos O servidor envia os seguintes tipos de eventos: - `message`: Uma mensagem do assistente. - `error`: Ocorreu um erro. - `done`: O assistente terminou de gerar a resposta. #### Evento de Mensagem O evento `message` contém uma mensagem do assistente. A mensagem é um objeto JSON com os seguintes campos: - `id`: O identificador único da mensagem. - `role`: O papel do remetente da mensagem. Sempre `assistant`. - `content`: O conteúdo da mensagem. Esta é uma string que pode conter markdown. - `created_at`: O timestamp de quando a mensagem foi criada. Exemplo: ```json { "id": "msg_123", "role": "assistant", "content": "Olá! Como posso ajudá-lo hoje?", "created_at": 1620000000 } ``` #### Evento de Erro O evento `error` contém uma mensagem de erro. O erro é um objeto JSON com os seguintes campos: - `code`: O código de erro. - `message`: A mensagem de erro. Exemplo: ```json { "code": "rate_limit_exceeded", "message": "Limite de taxa excedido. Por favor, tente novamente mais tarde." } ``` #### Evento de Conclusão O evento `done` indica que o assistente terminou de gerar a resposta. O evento é um objeto JSON com os seguintes campos: - `id`: O identificador único da mensagem que foi gerada. - `model`: O modelo que foi usado para gerar a resposta. - `usage`: As estatísticas de uso para a resposta. Este é um objeto JSON com os seguintes campos: - `prompt_tokens`: O número de tokens no prompt. - `completion_tokens`: O número de tokens na conclusão. - `total_tokens`: O número total de tokens. Exemplo: ```json { "id": "msg_123", "model": "gpt-4", "usage": { "prompt_tokens": 10, "completion_tokens": 20, "total_tokens": 30 } } ``` #### Formato do Fluxo de Eventos O servidor envia eventos no seguinte formato: ``` event: message data: {"id": "msg_123", "role": "assistant", "content": "Olá!", "created_at": 1620000000} event: done data: {"id": "msg_123", "model": "gpt-4", "usage": {"prompt_tokens": 10, "completion_tokens": 20, "total_tokens": 30}} ``` Cada evento é separado por duas novas linhas. O campo `event` especifica o tipo de evento, e o campo `data` contém o objeto JSON para o evento.
ru: This document outlines the contract for the event stream used by the application. It is intended for developers who wish to consume the event stream directly or integrate with it. --- ### Event Types The following event types are emitted by the application: - **`translation_started`**: Emitted when a translation job starts. - **`translation_progress`**: Emitted periodically to report translation progress. - **`translation_completed`**: Emitted when a translation job completes successfully. - **`translation_failed`**: Emitted when a translation job fails. - **`translation_cancelled`**: Emitted when a translation job is cancelled by the user. --- ### Event Data Structure Each event is a JSON object with the following structure: ```json { "type": "event_type", "data": { // Event-specific data }, "timestamp": "2023-01-01T00:00:00.000Z" } ``` --- ### Event Details #### `translation_started` Emitted when a translation job starts. **Data:** - `jobId` (string): The unique identifier for the translation job. - `fileName` (string): The name of the file being translated. **Example:** ```json { "type": "translation_started", "data": { "jobId": "123e4567-e89b-12d3-a456-426614174000", "fileName": "document.pdf" }, "timestamp": "2023-01-01T00:00:00.000Z" } ``` #### `translation_progress` Emitted periodically to report translation progress. **Data:** - `jobId` (string): The unique identifier for the translation job. - `progress` (number): The progress percentage (0-100). - `message` (string): Optional progress message. **Example:** ```json { "type": "translation_progress", "data": { "jobId": "123e4567-e89b-12d3-a456-426614174000", "progress": 50, "message": "Processing page 10 of 20" }, "timestamp": "2023-01-01T00:00:01.000Z" } ``` #### `translation_completed` Emitted when a translation job completes successfully. **Data:** - `jobId` (string): The unique identifier for the translation job. - `fileName` (string): The name of the translated file. - `outputPath` (string): The path to the translated file. **Example:** ```json { "type": "translation_completed", "data": { "jobId": "123e4567-e89b-12d3-a456-426614174000", "fileName": "document.pdf", "outputPath": "/path/to/translated/document_zh.pdf" }, "timestamp": "2023-01-01T00:00:02.000Z" } ``` #### `translation_failed` Emitted when a translation job fails. **Data:** - `jobId` (string): The unique identifier for the translation job. - `fileName` (string): The name of the file that failed to translate. - `error` (string): The error message. **Example:** ```json { "type": "translation_failed", "data": { "jobId": "123e4567-e89b-12d3-a456-426614174000", "fileName": "document.pdf", "error": "Failed to extract text from PDF" }, "timestamp": "2023-01-01T00:00:03.000Z" } ``` #### `translation_cancelled` Emitted when a translation job is cancelled by the user. **Data:** - `jobId` (string): The unique identifier for the translation job. - `fileName` (string): The name of the file that was being translated. **Example:** ```json { "type": "translation_cancelled", "data": { "jobId": "123e4567-e89b-12d3-a456-426614174000", "fileName": "document.pdf" }, "timestamp": "2023-01-01T00:00:04.000Z" } ``` --- ### Consuming the Event Stream The event stream is available at `/api/events` when the application is running. Events are sent as Server-Sent Events (SSE). **Example using JavaScript:** ```javascript const eventSource = new EventSource('/api/events'); eventSource.onmessage = (event) => { const data = JSON.parse(event.data); console.log('Received event:', data); }; eventSource.onerror = (error) => { console.error('EventSource failed:', error); }; ``` --- ### Notes - Events are emitted in real-time as translation jobs progress. - The event stream may contain events from multiple concurrent translation jobs. - Clients should filter events by `jobId` if they are interested in specific jobs. - The event stream connection may be reestablished automatically if disconnected.
