Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_D91B42A2
source: 1. Documentation internationalization/translation 2. Contributions related to core infrastructure, such as HTTP API, etc. 3. Issues explicitly marked as "No help needed" (including issues in the [Byaidu/PDFMathTranslate](Byaidu/PDFMathTranslate) and the [PDFMathTranslate-next/PDFMathTranslate-next](PDFMathTranslate-next/PDFMathTranslate-next) repository). 4. Other contributions deemed inappropriate by the maintainers. 5. Contributing documentation, but changing the documentation in languages other than English. 6. PRs that require modifying PDF files. 7. PRs that modify the `pdf2zh_next/gui_translation.yaml` file.
de: 1. Dokumentationsinternationalisierung/-übersetzung 2. Beiträge zur Kerninfrastruktur, wie z. B. HTTP-API usw. 3. Probleme, die explizit als "Keine Hilfe benötigt" markiert sind (einschließlich Probleme in den Repositorys [Byaidu/PDFMathTranslate](Byaidu/PDFMathTranslate) und [PDFMathTranslate-next/PDFMathTranslate-next](PDFMathTranslate-next/PDFMathTranslate-next)). 4. Andere Beiträge, die von den Maintainern als unangemessen erachtet werden. 5. Beiträge zur Dokumentation, aber Änderungen an der Dokumentation in anderen Sprachen als Englisch. 6. PRs, die Änderungen an PDF-Dateien erfordern. 7. PRs, die die Datei `pdf2zh_next/gui_translation.yaml` modifizieren.
fr: 1. Documentation internationalisation/traduction 2. Contributions liées à l'infrastructure principale, telles que l'API HTTP, etc. 3. Problèmes explicitement marqués comme "No help needed" (y compris les problèmes dans les dépôts [Byaidu/PDFMathTranslate](Byaidu/PDFMathTranslate) et [PDFMathTranslate-next/PDFMathTranslate-next](PDFMathTranslate-next/PDFMathTranslate-next)). 4. Autres contributions jugées inappropriées par les mainteneurs. 5. Contribution à la documentation, mais modification de la documentation dans des langues autres que l'anglais. 6. PRs nécessitant la modification de fichiers PDF. 7. PRs modifiant le fichier `pdf2zh_next/gui_translation.yaml`.
it: 1. Documentazione internazionalizzazione/traduzione 2. Contributi relativi all'infrastruttura di base, come API HTTP, ecc. 3. Problemi contrassegnati esplicitamente come "No help needed" (inclusi i problemi nei repository [Byaidu/PDFMathTranslate](Byaidu/PDFMathTranslate) e [PDFMathTranslate-next/PDFMathTranslate-next](PDFMathTranslate-next/PDFMathTranslate-next)). 4. Altri contributi ritenuti inappropriati dai maintainer. 5. Contribuire alla documentazione, ma modificando la documentazione in lingue diverse dall'inglese. 6. PR che richiedono la modifica di file PDF. 7. PR che modificano il file `pdf2zh_next/gui_translation.yaml`.
pt: 1. Internacionalização/tradução da documentação 2. Contribuições relacionadas à infraestrutura principal, como API HTTP, etc. 3. Problemas explicitamente marcados como "No help needed" (incluindo problemas nos repositórios [Byaidu/PDFMathTranslate](Byaidu/PDFMathTranslate) e [PDFMathTranslate-next/PDFMathTranslate-next](PDFMathTranslate-next/PDFMathTranslate-next)). 4. Outras contribuições consideradas inadequadas pelos mantenedores. 5. Contribuição com documentação, mas alterando a documentação em idiomas diferentes do inglês. 6. PRs que exigem modificação de arquivos PDF. 7. PRs que modificam o arquivo `pdf2zh_next/gui_translation.yaml`.
ru: 1. Интернационализация/перевод документации 2. Вклад в основную инфраструктуру, например, HTTP API и т. д. 3. Проблемы, явно помеченные как "No help needed" (включая проблемы в репозиториях [Byaidu/PDFMathTranslate](Byaidu/PDFMathTranslate) и [PDFMathTranslate-next/PDFMathTranslate-next](PDFMathTranslate-next/PDFMathTranslate-next)). 4. Другие вклады, которые модераторы сочтут неуместными. 5. Вклад в документацию, но изменение документации на языках, отличных от английского. 6. PR, требующие изменения файлов PDF. 7. PR, изменяющие файл `pdf2zh_next/gui_translation.yaml`.

# chunk_7828B7C7
source: Please do NOT submit PRs related to the above types.
de: Bitte reichen Sie keine PRs ein, die sich auf die oben genannten Arten beziehen.
fr: Veuillez ne PAS soumettre de PR liées aux types mentionnés ci-dessus.
it: Per favore NON inviare PR relativi ai tipi sopra menzionati.
pt: Por favor, NÃO envie PRs relacionados aos tipos mencionados acima.
ru: Пожалуйста, НЕ отправляйте PR, связанные с вышеуказанными типами.

# chunk_56FADEC9
source: > [!NOTE] > > If you want to contribute documentation, please **only modify the English version of the documentation**. Other language versions are translated by contributors themselves.
de: > [!NOTE] > > Wenn Sie zur Dokumentation beitragen möchten, **ändern Sie bitte nur die englische Version der Dokumentation**. Andere Sprachversionen werden von den Mitwirkenden selbst übersetzt.
fr: > [!NOTE] > > Si vous souhaitez contribuer à la documentation, veuillez **uniquement modifier la version anglaise de la documentation**. Les autres versions linguistiques sont traduites par les contributeurs eux-mêmes.
it: > [!NOTE] > > Se vuoi contribuire alla documentazione, **modifica solo la versione inglese della documentazione**. Le altre versioni linguistiche sono tradotte dai contributori stessi.
pt: > [!NOTE] > > Se você deseja contribuir com a documentação, por favor **modifique apenas a versão em inglês da documentação**. As outras versões em outros idiomas são traduzidas pelos próprios contribuidores.
ru: > [!NOTE] > > Если вы хотите внести вклад в документацию, пожалуйста, **изменяйте только английскую версию документации**. Другие языковые версии переводятся самими участниками.

# chunk_82B30F3F
source: ## PRs that are recommended to discuss with maintainers via Issue before submission
de: ## PRs, die vor der Einreichung mit den Maintainern über ein Issue besprochen werden sollten To avoid wasting time and effort, we recommend that you discuss the following types of PRs with the maintainers before submitting them: Um Zeit und Mühe zu sparen, empfehlen wir, dass Sie die folgenden Arten von PRs vor der Einreichung mit den Maintainern besprechen: - **Major feature additions**: If you plan to add a major feature, please open an issue first to discuss the necessity and implementation plan. - **Hauptfunktionserweiterungen**: Wenn Sie planen, eine Hauptfunktion hinzuzufügen, öffnen Sie bitte zuerst ein Issue, um die Notwendigkeit und den Implementierungsplan zu besprechen. - **Architectural changes**: Changes that affect the overall architecture of the project, such as modifying the core data structures or algorithms. - **Architekturänderungen**: Änderungen, die die Gesamtarchitektur des Projekts betreffen, wie z.B. die Änderung der Kerndatenstrukturen oder -algorithmen. - **Breaking changes**: Changes that may break existing functionality or require significant adjustments from users. - **Breaking Changes**: Änderungen, die bestehende Funktionalität beeinträchtigen könnten oder erhebliche Anpassungen seitens der Benutzer erfordern. - **Dependency updates**: Upgrading major versions of dependencies or adding new dependencies. - **Abhängigkeitsaktualisierungen**: Das Upgrade von Hauptversionen von Abhängigkeiten oder das Hinzufügen neuer Abhängigkeiten. - **Performance optimizations**: If you have ideas for performance optimization, please discuss them first to ensure they align with the project's goals. - **Leistungsoptimierungen**: Wenn Sie Ideen zur Leistungsoptimierung haben, besprechen Sie diese bitte zuerst, um sicherzustellen, dass sie mit den Zielen des Projekts übereinstimmen. - **UI/UX changes**: Significant changes to the user interface or user experience. - **UI/UX-Änderungen**: Wesentliche Änderungen an der Benutzeroberfläche oder Benutzererfahrung. By discussing these changes in advance, we can ensure that your contributions align with the project's direction and avoid unnecessary rework. Durch die vorherige Besprechung dieser Änderungen können wir sicherstellen, dass Ihre Beiträge mit der Ausrichtung des Projekts übereinstimmen und unnötige Nacharbeit vermieden wird. --- ### TRANSLATION RESULT ## PRs, die vor der Einreichung mit den Maintainern über ein Issue besprochen werden sollten Um Zeit und Mühe zu sparen, empfehlen wir, dass Sie die folgenden Arten von PRs vor der Einreichung mit den Maintainern besprechen: - **Hauptfunktionserweiterungen**: Wenn Sie planen, eine Hauptfunktion hinzuzufügen, öffnen Sie bitte zuerst ein Issue, um die Notwendigkeit und den Implementierungsplan zu besprechen. - **Architekturänderungen**: Änderungen, die die Gesamtarchitektur des Projekts betreffen, wie z.B. die Änderung der Kerndatenstrukturen oder -algorithmen. - **Breaking Changes**: Änderungen, die bestehende Funktionalität beeinträchtigen könnten oder erhebliche Anpassungen seitens der Benutzer erfordern. - **Abhängigkeitsaktualisierungen**: Das Upgrade von Hauptversionen von Abhängigkeiten oder das Hinzufügen neuer Abhängigkeiten. - **Leistungsoptimierungen**: Wenn Sie Ideen zur Leistungsoptimierung haben, besprechen Sie diese bitte zuerst, um sicherzustellen, dass sie mit den Zielen des Projekts übereinstimmen. - **UI/UX-Änderungen**: Wesentliche Änderungen an der Benutzeroberfläche oder Benutzererfahrung. Durch die vorherige Besprechung dieser Änderungen können wir sicherstellen, dass Ihre Beiträge mit der Ausrichtung des Projekts übereinstimmen und unnötige Nacharbeit vermieden wird.
fr: ### 1. UI/UX changes - **Major UI/UX changes** (e.g., redesigning the entire interface or adding significant new features) - **Changes to existing workflows** that could affect user experience - **Addition of new dependencies** for UI components ### 2. Core functionality modifications - **Changes to the core translation engine** or algorithms - **Modifications to file handling** or processing logic - **Performance optimizations** that alter existing behavior ### 3. Architectural changes - **Refactoring large portions** of the codebase - **Changing the project structure** or build system - **Database schema changes** or migrations ### 4. New feature proposals - **Significant new features** that would expand the project's scope - **Integration with external services** or APIs - **Authentication/authorization systems** ### 5. Breaking changes - **Any changes** that break backward compatibility - **Deprecation of existing features** - **Changes to public APIs** or interfaces ### 6. Security-related changes - **Security patches** or vulnerability fixes - **Authentication/authorization improvements** - **Data privacy enhancements** ### 7. Documentation updates - **Major rewrites** of documentation - **Translation of documentation** into new languages - **Structural changes** to documentation --- ### TRANSLATION RESULT ## PR qu'il est recommandé de discuter avec les mainteneurs via une Issue avant la soumission ### 1. Modifications de l'interface utilisateur / de l'expérience utilisateur - **Modifications majeures de l'interface utilisateur / de l'expérience utilisateur** (par exemple, refonte de l'interface entière ou ajout de fonctionnalités nouvelles importantes) - **Modifications des workflows existants** qui pourraient affecter l'expérience utilisateur - **Ajout de nouvelles dépendances** pour les composants de l'interface utilisateur ### 2. Modifications des fonctionnalités principales - **Modifications du moteur de traduction principal** ou des algorithmes - **Modifications de la gestion des fichiers** ou de la logique de traitement - **Optimisations des performances** qui modifient le comportement existant ### 3. Modifications architecturales - **Refactorisation de grandes parties** de la base de code - **Modification de la structure du projet** ou du système de build - **Modifications du schéma de base de données** ou des migrations ### 4. Propositions de nouvelles fonctionnalités - **Nouvelles fonctionnalités importantes** qui étendraient la portée du projet - **Intégration avec des services externes** ou des API - **Systèmes d'authentification / d'autorisation** ### 5. Changements cassants - **Toute modification** qui brise la rétrocompatibilité - **Dépréciation de fonctionnalités existantes** - **Modifications des API publiques** ou des interfaces ### 6. Modifications liées à la sécurité - **Correctifs de sécurité** ou corrections de vulnérabilités - **Améliorations de l'authentification / de l'autorisation** - **Améliorations de la confidentialité des données** ### 7. Mises à jour de la documentation - **Réécritures majeures** de la documentation - **Traduction de la documentation** dans de nouvelles langues - **Modifications structurelles** de la documentation
it: - **New feature or major changes** (e.g., adding a new translation service, changing the core architecture, etc.) - **Changes that may affect user experience** (e.g., modifying the default configuration, changing the UI/UX, etc.) - **Changes that may affect performance** (e.g., modifying the core algorithms, changing the caching strategy, etc.) - **Changes that may affect security** (e.g., modifying the authentication mechanism, changing the data storage method, etc.) - **Changes that may affect compatibility** (e.g., modifying the API, changing the data format, etc.) - **Changes that may affect the project's long-term maintenance** (e.g., modifying the project structure, changing the dependency management method, etc.) --- ### OUTPUT LANGUAGE it
pt: - [ ] Add new features - [ ] Add new translation services - [ ] Add new languages - [ ] Add new dependencies - [ ] Add new CLI options - [ ] Add new configuration options - [ ] Add new environment variables - [ ] Add new tests - [ ] Add new documentation - [ ] Add new examples - [ ] Add new CI/CD pipelines - [ ] Add new scripts - [ ] Add new tools - [ ] Add new dependencies - [ ] Add new files - [ ] Add new directories - [ ] Add new licenses - [ ] Add new code of conduct - [ ] Add new contributing guidelines - [ ] Add new issue templates - [ ] Add new pull request templates - [ ] Add new security policies - [ ] Add new support files - [ ] Add new assets - [ ] Add new data - [ ] Add new resources - [ ] Add new fonts - [ ] Add new images - [ ] Add new videos - [ ] Add new audio - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] Add new other files - [ ] Add new other directories - [ ] Add new other resources - [ ] Add new other assets - [ ] Add new other data - [ ] Add new other media - [ ] 极不推荐添加新的依赖，除非是必要的 --- ### OUTPUT ## PRs que são recomendados discutir com os mantenedores via Issue antes da submissão - [ ] Adicionar novos recursos - [ ] Adicionar novos serviços de tradução - [ ] Adicionar novos idiomas - [ ] Adicionar novas dependências - [ ] Adicionar novas opções de CLI - [ ] Adicionar novas opções de configuração - [ ] Adicionar novas variáveis de ambiente - [ ] Adicionar novos testes - [ ] Adicionar nova documentação - [ ] Adicionar novos exemplos - [ ] Adicionar novos pipelines de CI/CD - [ ] Adicionar novos scripts - [ ] Adicionar novas ferramentas - [ ] Adicionar novas dependências - [ ] Adicionar novos arquivos - [ ] Adicionar novos diretórios - [ ] Adicionar novas licenças - [ ] Adicionar novo código de conduta - [ ] Adicionar novas diretrizes de contribuição - [ ] Adicionar novos modelos de issue - [ ] Adicionar novos modelos de pull request - [ ] Adicionar novas políticas de segurança - [ ] Adicionar novos arquivos de suporte - [ ] Adicionar novos ativos - [ ] Adicionar novos dados - [ ] Adicionar novos recursos - [ ] Adicionar novas fontes - [ ] Adicionar novas imagens - [ ] Adicionar novos vídeos - [ ] Adicionar novos áudios - [ ] Adicionar outras mídias - [ ] Adicionar outros arquivos - [ ] Adicionar outros diretórios - [ ] Adicionar outros recursos - [ ] Adicionar outros ativos - [ ] Adicionar outros dados - [ ] Adicionar outras mídias - [ ] Adicionar outros arquivos - [ ] Adicionar outros diretórios - [ ] Adicionar outros recursos - [ ] Adicionar outros ativos - [ ] Adicionar outros dados - [ ] Adicionar outras mídias - [ ] Adicionar outros arquivos - [ ] Adicionar outros diretórios - [ ] Adicionar outros recursos - [ ] Adicionar outros ativos - [ ] Adicionar outros dados - [ ] Adicionar outras mídias - [ ] Adicionar outros arquivos - [ ] Adicionar outros diretórios - [ ] Adicionar outros recursos - [ ] Adicionar outros ativos - [ ] Adicionar outros dados - [ ] Adicionar outras mídias - [ ] Adicionar outros arquivos - [ ] Adicionar outros diretórios - [ ] Adicionar outros recursos - [ ] Adicionar outros ativos - [ ] Adicionar outros dados - [ ] Adicionar outras mídias - [ ] Adicionar outros arquivos - [ ] Adicionar outros diretórios - [ ] Adicionar outros recursos - [ ] Adicionar outros ativos - [ ] Adicionar outros dados - [ ] Adicionar outras mídias - [ ] Adicionar outros arquivos - [ ] Adicionar outros diretórios -极不推荐添加新的依赖，除非是必要的
ru: - [ ] Any changes to the core functionality of pdf2zh (including, but not limited to, changes to the translation engine, changes to the translation process, etc.) - [ ] Any changes to the CLI interface - [ ] Any changes to the configuration file format - [ ] Any changes to the output file format - [ ] Any changes to the project structure --- ### OUTPUT ## PR, которые рекомендуется обсудить с сопровождающими через Issue перед отправкой - [ ] Любые изменения в основной функциональности pdf2zh (включая, но не ограничиваясь, изменениями в механизме перевода, изменениями в процессе перевода и т.д.) - [ ] Любые изменения в интерфейсе CLI - [ ] Любые изменения в формате файла конфигурации - [ ] Любые изменения в формате выходного файла - [ ] Любые изменения в структуре проекта
