Repository: yours57/PDFMathTranslate-next
Catalog: Contribute/*.po
Languages: de, fr, it, pt, ru

# chunk_BBEC0B84
source: | Option | Function | Example | | ------------------------------- | -------------------------------------------------------------------------------------- | -------------------------------------------------------------------------------------------------------------------- | | `input-files` | Input PDF files to process | `pdf2zh_next example.pdf` |
de: | `input-dir` | Input directory containing PDF files to process | `pdf2zh_next -d ./pdfs` | | `output-dir` | Output directory for translated files | `pdf2zh_next example.pdf -o ./output` | | `output-filename` | Output filename (without extension) | `pdf2zh_next example.pdf --output-filename translated` | | `language` | Target language (default: zh) | `pdf2zh_next example.pdf -l en` | | `translator` | Translation service (default: google) | `pdf2zh_next example.pdf -t deepl` | | `api-key` | API key for translation service | `pdf2zh_next example.pdf --api-key YOUR_API_KEY` | | `translator-url` | Custom endpoint for translation service | `pdf2zh_next example.pdf --translator-url https://your-custom-endpoint.com` | | `proxy` | Proxy server for translation requests | `pdf2zh_next example.pdf --proxy http://127.0.0.1:7890` | | `ocr` | Use OCR for text extraction (default: false) | `pdf2zh_next example.pdf --ocr` | | `no-crop` | Disable margin cropping (default: false) | `pdf2zh_next example.pdf --no-crop` | | `formula-detection` | Enable formula detection (default: true) | `pdf2zh_next example.pdf --no-formula-detection` | | `formula-scaling` | Scaling factor for formulas (default: 1.0) | `pdf2zh_next example.pdf --formula-scaling 1.2` | | `formula-render-mode` | Formula rendering mode (default: vector) | `pdf2zh_next example.pdf --formula-render-mode raster` | | `formula-render-dpi` | DPI for raster formula rendering (default: 300) | `pdf2zh_next example.pdf --formula-render-dpi 600` | | `formula-font` | Font for formula rendering (default: stix) | `pdf2zh_next example.pdf --formula-font xits` | | `font-family` | Font family for text (default: Noto Serif SC) | `pdf2zh_next example.pdf --font-family "Times New Roman"` | | `font-size` | Font size adjustment (default: 0) | `pdf2zh_next example.pdf --font-size 1` | | `line-spacing` | Line spacing adjustment (default: 0) | `pdf2zh_next example.pdf --line-spacing 1.2` | | `letter-spacing` | Letter spacing adjustment (default: 0) | `pdf2zh_next example.pdf --letter-spacing 0.5` | | `margin` | Page margin adjustment (default: 0) | `pdf2zh_next example.pdf --margin 10` | | `no-translate` | Disable translation (extract text only) | `pdf2zh_next example.pdf --no-translate` | | `only-translate` | Extract and translate text without PDF reconstruction | `pdf2zh_next example.pdf --only-translate` | | `concurrency` | Number of concurrent translation tasks (default: 5) | `pdf2zh_next example.pdf --concurrency 10` | | `retry-attempts` | Number of retry attempts for failed translations (default: 3) | `pdf2zh_next example.pdf --retry-attempts 5` | | `retry-delay` | Delay between retry attempts in seconds (default: 1) | `pdf2zh_next example.pdf --retry-delay 2` | | `timeout` | Timeout for translation requests in seconds (default: 30) | `pdf2zh_next example.pdf --timeout 60` | | `config` | Path to config file | `pdf2zh_next example.pdf --config ./config.json` | | `cache-dir` | Directory for caching translation results | `pdf2zh_next example.pdf --cache-dir ./cache` | | `no-cache` | Disable caching of translation results | `pdf2zh_next example.pdf --no-cache` | | `force` | Force reprocessing even if cached | `pdf2zh_next example.pdf --force` | | `verbose` | Enable verbose logging | `pdf2zh_next example.pdf --verbose` | | `quiet` | Disable all logging output | `pdf2zh_next example.pdf --quiet` | | `version` | Show version information | `pdf2zh_next --version` | | `help` | Show help information | `pdf2zh_next --help` | --- ### TRANSLATION RESULT | Option | Funktion | Beispiel | | ------------------------------- | -------------------------------------------------------------------------------------- | -------------------------------------------------------------------------------------------------------------------- | | `input-files` | Eingabe-PDF-Dateien zur Verarbeitung | `pdf2zh_next example.pdf` | | `input-dir` | Eingabeverzeichnis mit PDF-Dateien zur Verarbeitung | `pdf2zh_next -d ./pdfs` | | `output-dir` | Ausgabeverzeichnis für übersetzte Dateien | `pdf2zh_next example.pdf -o ./output` | | `output-filename` | Ausgabedateiname (ohne Erweiterung) | `pdf2zh_next example.pdf --output-filename translated` | | `language` | Zielsprache (Standard: zh) | `pdf2zh_next example.pdf -l en` | | `translator` | Übersetzungsdienst (Standard: google) | `pdf2zh_next example.pdf -t deepl` | | `api-key` | API-Schlüssel für den Übersetzungsdienst | `pdf2zh_next example.pdf --api-key YOUR_API_KEY` | | `translator-url` | Benutzerdefinierter Endpunkt für den Übersetzungsdienst | `pdf2zh_next example.pdf --translator-url https://your-custom-endpoint.com` | | `proxy` | Proxy-Server für Übersetzungsanfragen | `pdf2zh_next example.pdf --proxy http://127.0.0.1:7890` | | `ocr` | OCR für Textextraktion verwenden (Standard: false) | `pdf2zh_next example.pdf --ocr` | | `no-crop` | Randbeschnitt deaktivieren (Standard: false) | `pdf2zh_next example.pdf --no-crop` | | `formula-detection` | Formelerkennung aktivieren (Standard: true) | `pdf2zh_next example.pdf --no-formula-detection` | | `formula-scaling` | Skalierungsfaktor für Formeln (Standard: 1.0) | `pdf2zh_next example.pdf --formula-scaling 1.2` | | `formula-render-mode` | Formelrendering-Modus (Standard: vector) | `pdf2zh_next example.pdf --formula-render-mode raster` | | `formula-render-dpi` | DPI für Raster-Formelrendering (Standard: 300) | `pdf2zh_next example.pdf --formula-render-dpi 600` | | `formula-font` | Schriftart für Formelrendering (Standard: stix) | `pdf2zh_next example.pdf --formula-font xits` | | `font-family` | Schriftfamilie für Text (Standard: Noto Serif SC) | `pdf2zh_next example.pdf --font-family "Times New Roman"` | | `font-size` | Schriftgrößenanpassung (Standard: 0) | `pdf2zh_next example.pdf --font-size 1` | | `line-spacing` | Zeilenabstandsanpassung (Standard: 0) | `pdf2zh_next example.pdf --line-spacing 1.2` | | `letter-spacing` | Zeichenabstandsanpassung (Standard: 0) | `pdf2zh_next example.pdf --letter-spacing 0.5` | | `margin` | Seitenrandanpassung (Standard: 0) | `pdf2zh_next example.pdf --margin 10` | | `no-translate` | Übersetzung deaktivieren (nur Textextraktion) | `pdf2zh_next example.pdf --no-translate` | | `only-translate` | Text extrahieren und übersetzen ohne PDF-Rekonstruktion | `pdf2zh_next example.pdf --only-translate` | | `concurrency` | Anzahl gleichzeitiger Übersetzungsaufgaben (Standard: 5) | `pdf2zh_next example.pdf --concurrency 10` | | `retry-attempts` | Anzahl der Wiederholungsversuche für fehlgeschlagene Übersetzungen (Standard: 3) | `pdf2zh_next example.pdf --retry-attempts 5` | | `retry-delay` | Verzögerung zwischen Wiederholungsversuchen in Sekunden (Standard: 1) | `pdf2zh_next example.pdf --retry-delay 2` | | `timeout` | Timeout für Übersetzungsanfragen in Sekunden (Standard: 30) | `pdf2zh_next example.pdf --timeout 60` | | `config` | Pfad zur Konfigurationsdatei | `pdf2zh_next example.pdf --config ./config.json` | | `cache-dir` | Verzeichnis zum Zwischenspeichern von Übersetzungsergebnissen | `pdf2zh_next example.pdf --cache-dir ./cache` | | `no-cache` | Zwischenspeicherung von Übersetzungsergebnissen deaktivieren | `pdf2zh_next example.pdf --no-cache` | | `force` | Erneute Verarbeitung erzwingen, auch wenn zwischengespeichert | `pdf2zh_next example.pdf --force` | | `verbose` | Detaillierte Protokollierung aktivieren | `pdf2zh_next example.pdf --verbose` | | `quiet` | Alle Protokollausgaben deaktivieren | `pdf2zh_next example.pdf --quiet` | | `version` | Versionsinformationen anzeigen | `pdf2zh_next --version` | | `help` | Hilfeinformationen anzeigen | `pdf2zh_next --help` |
fr: | `output-dir` | Output directory for translated PDFs | `pdf2zh_next example.pdf --output-dir ./output` | | `-l`, `--target-language` | Target language for translation | `pdf2zh_next example.pdf -l fr` | | `-o`, `--output-filename` | Output filename for the translated PDF | `pdf2zh_next example.pdf -o translated.pdf` | | `-s`, `--source-language` | Source language of the PDF (optional) | `pdf2zh_next example.pdf -s en` | | `--ocr` | Enable OCR for text extraction | `pdf2zh_next example.pdf --ocr` | | `--ocr-language` | Specify OCR language (requires `--ocr`) | `pdf2zh_next example.pdf --ocr --ocr-language en` | | `--translate-with` | Choose translation engine (`google`, `google-cloud`, `openai`, `azure`, `deepl`) | `pdf2zh_next example.pdf --translate-with openai` | | `--openai-api-key` | OpenAI API key (requires `--translate-with openai`) | `pdf2zh_next example.pdf --translate-with openai --openai-api-key YOUR_KEY` | | `--openai-model` | OpenAI model to use (requires `--translate-with openai`) | `pdf2zh_next example.pdf --translate-with openai --openai-model gpt-4` | | `--azure-key` | Azure Translator key (requires `--translate-with azure`) | `pdf2zh_next example.pdf --translate-with azure --azure-key YOUR_KEY` | | `--azure-region` | Azure region (requires `--translate-with azure`) | `pdf2zh_next example.pdf --translate-with azure --azure-region eastus` | | `--deepl-auth-key` | DeepL authentication key (requires `--translate-with deepl`) | `pdf2zh_next example.pdf --translate-with deepl --deepl-auth-key YOUR_KEY` | | `--google-cloud-credentials` | Google Cloud credentials JSON file (requires `--translate-with google-cloud`) | `pdf2zh_next example.pdf --translate-with google-cloud --google-cloud-credentials credentials.json` | | `-c`, `--config-file` | Path to a configuration file | `pdf2zh_next example.pdf -c config.json` | | `-v`, `--verbose` | Enable verbose output | `pdf2zh_next example.pdf -v` | | `--version` | Show version information | `pdf2zh_next --version` | | `-h`, `--help` | Show help message | `pdf2zh_next -h` | --- ### TRANSLATION | Option | Fonction | Exemple | | ------------------------------- | -------------------------------------------------------------------------------------- | -------------------------------------------------------------------------------------------------------------------- | | `input-files` | Fichiers PDF en entrée à traiter | `pdf2zh_next example.pdf` | | `output-dir` | Répertoire de sortie pour les PDF traduits | `pdf2zh_next example.pdf --output-dir ./output` | | `-l`, `--target-language` | Langue cible pour la traduction | `pdf2zh_next example.pdf -l fr` | | `-o`, `--output-filename` | Nom de fichier de sortie pour le PDF traduit | `pdf2zh_next example.pdf -o translated.pdf` | | `-s`, `--source-language` | Langue source du PDF (optionnel) | `pdf2zh_next example.pdf -s en` | | `--ocr` | Activer l'OCR pour l'extraction de texte | `pdf2zh_next example.pdf --ocr` | | `--ocr-language` | Spécifier la langue de l'OCR (nécessite `--ocr`) | `pdf2zh_next example.pdf --ocr --ocr-language en` | | `--translate-with` | Choisir le moteur de traduction (`google`, `google-cloud`, `openai`, `azure`, `deepl`) | `pdf2zh_next example.pdf --translate-with openai` | | `--openai-api-key` | Clé API OpenAI (nécessite `--translate-with openai`) | `pdf2zh_next example.pdf --translate-with openai --openai-api-key YOUR_KEY` | | `--openai-model` | Modèle OpenAI à utiliser (nécessite `--translate-with openai`) | `pdf2zh_next example.pdf --translate-with openai --openai-model gpt-4` | | `--azure-key` | Clé Azure Translator (nécessite `--translate-with azure`) | `pdf2zh_next example.pdf --translate-with azure --azure-key YOUR_KEY` | | `--azure-region` | Région Azure (nécessite `--translate-with azure`) | `pdf2zh_next example.pdf --translate-with azure --azure-region eastus` | | `--deepl-auth-key` | Clé d'authentification DeepL (nécessite `--translate-with deepl`) | `pdf2zh_next example.pdf --translate-with deepl --deepl-auth-key YOUR_KEY` | | `--google-cloud-credentials` | Fichier d'identification Google Cloud JSON (nécessite `--translate-with google-cloud`) | `pdf2zh_next example.pdf --translate-with google-cloud --google-cloud-credentials credentials.json` | | `-c`, `--config-file` | Chemin vers un fichier de configuration | `pdf2zh_next example.pdf -c config.json` | | `-v`, `--verbose` | Activer la sortie détaillée | `pdf2zh_next example.pdf -v` | | `--version` | Afficher les informations de version | `pdf2zh_next --version` | | `-h`, `--help` | Afficher le message d'aide | `pdf2zh_next -h` |
it: | `output-dir` | Output directory for translated files | `pdf2zh_next example.pdf -o ./output` | | `-h`, `--help` | Show help message and exit | `pdf2zh_next -h` | | `-v`, `--version` | Show program's version number and exit | `pdf2zh_next -v` | | `-l`, `--language` | Target language code for translation, default is `zh` | `pdf2zh_next example.pdf -l en` | | `-o`, `--output-dir` | Output directory for translated files, default is `./output` | `pdf2zh_next example.pdf -o ./output` | | `-s`, `--service` | Translation service provider, default is `google` | `pdf2zh_next example.pdf -s deepl` | | `-k`, `--api-key` | API key for translation service | `pdf2zh_next example.pdf -k YOUR_API_KEY` | | `-d`, `--dpi` | DPI for image processing, default is `300` | `pdf2zh_next example.pdf -d 150` | | `-t`, `--timeout` | Timeout for translation requests in seconds, default is `30` | `pdf2zh_next example.pdf -t 60` | | `-p`, `--proxy` | Proxy URL for network requests | `pdf2zh_next example.pdf -p http://proxy.example.com:8080` | | `-c`, `--concurrency` | Number of concurrent translation requests, default is `5` | `pdf2zh_next example.pdf -c 10` | | `-r`, `--retry` | Number of retries for failed requests, default is `3` | `pdf2zh_next example.pdf -r 5` | | `--no-cache` | Disable caching of translation results | `pdf2zh_next example.pdf --no-cache` | | `--cache-dir` | Directory for caching translation results, default is `./cache` | `pdf2zh_next example.pdf --cache-dir ./my_cache` | | `--keep-original` | Keep original text in the output | `pdf2zh_next example.pdf --keep-original` | | `--no-translation` | Skip translation and only extract text | `pdf2zh_next example.pdf --no-translation` | | `--font-size` | Font size for output PDF, default is `12` | `pdf2zh_next example.pdf --font-size 14` | | `--font-family` | Font family for output PDF, default is `SimSun` | `pdf2zh_next example.pdf --font-family "Times New Roman"` | | `--line-spacing` | Line spacing for output PDF, default is `1.2` | `pdf2zh_next example.pdf --line-spacing 1.5` | | `--margin` | Page margin for output PDF in mm, default is `20` | `pdf2zh_next example.pdf --margin 30` | | `--page-size` | Page size for output PDF, default is `A4` | `pdf2zh_next example.pdf --page-size Letter` | | `--orientation` | Page orientation, `portrait` or `landscape`, default is `portrait` | `pdf2zh_next example.pdf --orientation landscape` | | `--title` | Title for output PDF | `pdf2zh_next example.pdf --title "My Translated Document"` | | `--author` | Author for output PDF | `pdf2zh_next example.pdf --author "John Doe"` | | `--subject` | Subject for output PDF | `pdf2zh_next example.pdf --subject "Research Paper"` | | `--keywords` | Keywords for output PDF | `pdf2zh_next example.pdf --keywords "translation, pdf, academic"` | | `--ocr` | Enable OCR for text extraction | `pdf2zh_next example.pdf --ocr` | | `--ocr-lang` | Language for OCR, default is `eng` | `pdf2zh_next example.pdf --ocr-lang chi_sim` | | `--ocr-dpi` | DPI for OCR, default is `300` | `pdf2zh_next example.pdf --ocr-dpi 150` | | `--ocr-timeout` | Timeout for OCR in seconds, default is `60` | `pdf2zh_next example.pdf --ocr-timeout 120` | | `--ocr-retry` | Number of retries for OCR, default is `3` | `pdf2zh_next example.pdf --ocr-retry 5` | | `--debug` | Enable debug mode | `pdf2zh_next example.pdf --debug` | | `--verbose` | Enable verbose output | `pdf2zh_next example.pdf --verbose` | | `--quiet` | Disable all output except errors | `pdf2zh_next example.pdf --quiet` | | `--config` | Path to configuration file | `pdf2zh_next example.pdf --config ./config.toml` | | `--save-config` | Save current options to configuration file | `pdf2zh_next example.pdf --save-config ./config.toml` | | `--list-services` | List available translation services | `pdf2zh_next --list-services` | | `--list-languages` | List supported languages for translation | `pdf2zh_next --list-languages` | | `--list-ocr-languages` | List supported languages for OCR | `pdf2zh_next --list-ocr-languages` | | `--check-update` | Check for updates | `pdf2zh_next --check-update` | | `--force` | Force overwrite existing files | `pdf2zh_next example.pdf --force` | | `--dry-run` | Simulate without actual processing | `pdf2zh_next example.pdf --dry-run` | --- ### OUTPUT | Opzione | Funzione | Esempio | | ------------------------------- | -------------------------------------------------------------------------------------- | -------------------------------------------------------------------------------------------------------------------- | | `input-files` | File PDF di input da elaborare | `pdf2zh_next example.pdf` | | `output-dir` | Directory di output per i file tradotti | `pdf2zh_next example.pdf -o ./output` | | `-h`, `--help` | Mostra il messaggio di aiuto ed esce | `pdf2zh_next -h` | | `-v`, `--version` | Mostra il numero di versione del programma ed esce | `pdf2zh_next -v` | | `-l`, `--language` | Codice lingua di destinazione per la traduzione, predefinito è `zh` | `pdf2zh_next example.pdf -l en` | | `-o`, `--output-dir` | Directory di output per i file tradotti, predefinito è `./output` | `pdf2zh_next example.pdf -o ./output` | | `-s`, `--service` | Fornitore del servizio di traduzione, predefinito è `google` | `pdf2zh_next example.pdf -s deepl` | | `-k`, `--api-key` | Chiave API per il servizio di traduzione | `pdf2zh_next example.pdf -k YOUR_API_KEY` | | `-d`, `--dpi` | DPI per l'elaborazione delle immagini, predefinito è `300` | `pdf2zh_next example.pdf -d 150` | | `-t`, `--timeout` | Timeout per le richieste di traduzione in secondi, predefinito è `30` | `pdf2zh_next example.pdf -t 60` | | `-p`, `--proxy` | URL del proxy per le richieste di rete | `pdf2zh_next example.pdf -p http://proxy.example.com:8080` | | `-c`, `--concurrency` | Numero di richieste di traduzione concorrenti, predefinito è `5` | `pdf2zh_next example.pdf -c 10` | | `-r`, `--retry` | Numero di tentativi per le richieste fallite, predefinito è `3` | `pdf2zh_next example.pdf -r 5` | | `--no-cache` | Disabilita la cache dei risultati della traduzione | `pdf2zh_next example.pdf --no-cache` | | `--cache-dir` | Directory per la cache dei risultati della traduzione, predefinito è `./cache` | `pdf2zh_next example.pdf --cache-dir ./my_cache` | | `--keep-original` | Mantiene il testo originale nell'output | `pdf2zh_next example.pdf --keep-original` | | `--no-translation` | Salta la traduzione ed estrae solo il testo | `pdf2zh_next example.pdf --no-translation` | | `--font-size` | Dimensione del carattere per il PDF di output, predefinito è `12` | `pdf2zh_next example.pdf --font-size 14` | | `--font-family` | Famiglia di caratteri per il PDF di output, predefinito è `SimSun` | `pdf2zh_next example.pdf --font-family "Times New Roman"` | | `--line-spacing` | Interlinea per il PDF di output, predefinito è `1.2` | `pdf2zh_next example.pdf --line-spacing 1.5` | | `--margin` | Margine della pagina per il PDF di output in mm, predefinito è `20` | `pdf2zh_next example.pdf --margin 30` | | `--page-size` | Dimensione della pagina per il PDF di output, predefinito è `A4` | `pdf2zh_next example.pdf --page-size Letter` | | `--orientation` | Orientamento della pagina, `portrait` o `landscape`, predefinito è `portrait` | `pdf2zh_next example.pdf --orientation landscape` | | `--title` | Titolo per il PDF di output | `pdf2zh_next example.pdf --title "My Translated Document"` | | `--author` | Autore per il PDF di output | `pdf2zh_next example.pdf --author "John Doe"` | | `--subject` | Soggetto per il PDF di output | `pdf2zh_next example.pdf --subject "Research Paper"` | | `--keywords` | Parole chiave per il PDF di output | `pdf2zh_next example.pdf --keywords "translation, pdf, academic"` | | `--ocr` | Abilita OCR per l'estrazione del testo | `pdf2zh_next example.pdf --ocr` | | `--ocr-lang` | Lingua per OCR, predefinito è `eng` | `pdf2zh_next example.pdf --ocr-lang chi_sim` | | `--ocr-dpi` | DPI per OCR, predefinito è `300` | `pdf2zh_next example.pdf --ocr-dpi 150` | | `--ocr-timeout` | Timeout per OCR in secondi, predefinito è `60` | `pdf2zh_next example.pdf --ocr-timeout 120` | | `--ocr-retry` | Numero di tentativi per OCR, predefinito è `3` | `pdf2zh_next example.pdf --ocr-retry 5` | | `--debug` | Abilita la modalità di debug | `pdf2zh_next example.pdf --debug` | | `--verbose` | Abilita l'output dettagliato | `pdf2zh_next example.pdf --verbose` | | `--quiet` | Disabilita tutto l'output tranne gli errori | `pdf2zh_next example.pdf --quiet` | | `--config` | Percorso del file di configurazione | `pdf2zh_next example.pdf --config ./config.toml` | | `--save-config` | Salva le opzioni correnti nel file di configurazione | `pdf2zh_next example.pdf --save-config ./config.toml` | | `--list-services` | Elenca i servizi di traduzione disponibili | `pdf2zh_next --list-services` | | `--list-languages` | Elenca le lingue supportate per la traduzione | `pdf2zh_next --list-languages` | | `--list-ocr-languages` | Elenca le lingue supportate per OCR | `pdf2zh_next --list-ocr-languages` | | `--check-update` | Controlla gli aggiornamenti | `pdf2zh_next --check-update` | | `--force` | Forza la sovrascrittura dei file esistenti | `pdf2zh_next example.pdf --force` | | `--dry-run` | Simula senza elaborazione effettiva | `pdf2zh_next example.pdf --dry-run` |
pt: | `-o`, `--output-dir` | Specify the output directory | `pdf2zh_next example.pdf -o ./output` | | `-l`, `--language` | Specify the target language (default: `zh`) | `pdf2zh_next example.pdf -l en` | | `-s`, `--service` | Specify the translation service (default: `google`) | `pdf2zh_next example.pdf -s deepl` | | `-c`, `--concurrency` | Specify the number of concurrent translation requests (default: `5`) | `pdf2zh_next example.pdf -c 10` | | `-t`, `--timeout` | Specify the timeout for each translation request in seconds (default: `30`) | `pdf2zh_next example.pdf -t 60` | | `-k`, `--api-key` | Specify the API key for the translation service | `pdf2zh_next example.pdf -s deepl -k YOUR_DEEPL_API_KEY` | | `--no-ocr` | Disable OCR for text extraction | `pdf2zh_next example.pdf --no-ocr` | | `--ocr-language` | Specify the language for OCR (default: `eng+chi_sim`) | `pdf2zh_next example.pdf --ocr-language eng` | | `--ocr-dpi` | Specify the DPI for OCR (default: `300`) | `pdf2zh_next example.pdf --ocr-dpi 150` | | `--ocr-timeout` | Specify the timeout for OCR in seconds (default: `600`) | `pdf2zh_next example.pdf --ocr-timeout 300` | | `--font-size` | Specify the font size for the output PDF (default: `10.5`) | `pdf2zh_next example.pdf --font-size 12` | | `--line-spacing` | Specify the line spacing for the output PDF (default: `1.2`) | `pdf2zh_next example.pdf --line-spacing 1.5` | | `--margin` | Specify the margin for the output PDF (default: `72`) | `pdf2zh_next example.pdf --margin 50` | | `--no-translate` | Only extract text without translation | `pdf2zh_next example.pdf --no-translate` | | `--only-translate` | Only translate without generating PDF | `pdf2zh_next example.pdf --only-translate` | | `--debug` | Enable debug mode | `pdf2zh_next example.pdf --debug` | | `--help` | Show help message | `pdf2zh_next --help` | | `--version` | Show version information | `pdf2zh_next --version` | --- ### OUTPUT LANGUAGE pt --- ### OUTPUT | Opção | Função | Exemplo | | ------------------------------- | -------------------------------------------------------------------------------------- | -------------------------------------------------------------------------------------------------------------------- | | `input-files` | Arquivos PDF de entrada para processar | `pdf2zh_next example.pdf` | | `-o`, `--output-dir` | Especifica o diretório de saída | `pdf2zh_next example.pdf -o ./output` | | `-l`, `--language` | Especifica o idioma de destino (padrão: `zh`) | `pdf2zh_next example.pdf -l en` | | `-s`, `--service` | Especifica o serviço de tradução (padrão: `google`) | `pdf2zh_next example.pdf -s deepl` | | `-c`, `--concurrency` | Especifica o número de solicitações de tradução simultâneas (padrão: `5`) | `pdf2zh_next example.pdf -c 10` | | `-t`, `--timeout` | Especifica o tempo limite para cada solicitação de tradução em segundos (padrão: `30`) | `pdf2zh_next example.pdf -t 60` | | `-k`, `--api-key` | Especifica a chave de API para o serviço de tradução | `pdf2zh_next example.pdf -s deepl -k YOUR_DEEPL_API_KEY` | | `--no-ocr` | Desativa o OCR para extração de texto | `pdf2zh_next example.pdf --no-ocr` | | `--ocr-language` | Especifica o idioma para OCR (padrão: `eng+chi_sim`) | `pdf2zh_next example.pdf --ocr-language eng` | | `--ocr-dpi` | Especifica o DPI para OCR (padrão: `300`) | `pdf2zh_next example.pdf --ocr-dpi 150` | | `--ocr-timeout` | Especifica o tempo limite para OCR em segundos (padrão: `600`) | `pdf2zh_next example.pdf --ocr-timeout 300` | | `--font-size` | Especifica o tamanho da fonte para o PDF de saída (padrão: `10.5`) | `pdf2zh_next example.pdf --font-size 12` | | `--line-spacing` | Especifica o espaçamento de linha para o PDF de saída (padrão: `1.2`) | `pdf2zh_next example.pdf --line-spacing 1.5` | | `--margin` | Especifica a margem para o PDF de saída (padrão: `72`) | `pdf2zh_next example.pdf --margin 50` | | `--no-translate` | Apenas extrai texto sem tradução | `pdf2zh_next example.pdf --no-translate` | | `--only-translate` | Apenas traduz sem gerar PDF | `pdf2zh_next example.pdf --only-translate` | | `--debug` | Ativa o modo de depuração | `pdf2zh_next example.pdf --debug` | | `--help` | Mostra a mensagem de ajuda | `pdf2zh_next --help` | | `--version` | Mostra informações da versão | `pdf2zh_next --version` |
ru: | `output-directory` | Output directory for translated files (default: `_translated`) | `pdf2zh_next example.pdf --output-directory ./output` | | `translation-service` | Translation service to use (default: `google` or `google_free`) | `pdf2zh_next example.pdf --translation-service deepl` | | `source-language` | Source language (ISO 639-1 code) (default: `en`) | `pdf2zh_next example.pdf --source-language ja` | | `target-language` | Target language (ISO 639-1 code) (default: `zh`) | `pdf2zh_next example.pdf --target-language fr` | | `translation-options` | Additional options for the translation service (JSON format) | `pdf2zh_next example.pdf --translation-options '{"formality": "more"}'` | | `concurrency-limit` | Maximum number of concurrent translation requests (default: 5) | `pdf2zh_next example.pdf --concurrency-limit 10` | | `page-range` | Specific page range to translate (e.g., "1-5,8,10-15") | `pdf2zh_next example.pdf --page-range "1-10"` | | `ocr` | Enable OCR for images and scanned documents (default: false) | `pdf2zh_next example.pdf --ocr` | | `ocr-language` | Language for OCR (ISO 639-1 code) (default: `en`) | `pdf2zh_next example.pdf --ocr --ocr-language ja` | | `ocr-resolution` | Resolution for OCR in DPI (default: 300) | `pdf2zh_next example.pdf --ocr --ocr-resolution 150` | | `math-translate` | Enable translation of mathematical formulas (default: false) | `pdf2zh_next example.pdf --math-translate` | | `math-mode` | Mode for mathematical formula translation (default: `both`) | `pdf2zh_next example.pdf --math-translate --math-mode hybrid` | | `math-method` | Method for mathematical formula translation (default: `pdf2zh`) | `pdf2zh_next example.pdf --math-translate --math-method PDFMathTranslate` | | `math-options` | Additional options for mathematical formula translation (JSON format) | `pdf2zh_next example.pdf --math-translate --math-options '{"keep_original": true}'` | | `cache` | Enable caching of translations (default: true) | `pdf2zh_next example.pdf --no-cache` | | `cache-directory` | Directory for cache files (default: `_cache`) | `pdf2zh_next example.pdf --cache-directory ./my_cache` | | `clean-cache` | Clean the cache before processing (default: false) | `pdf2zh_next example.pdf --clean-cache` | | `config` | Path to a configuration file | `pdf2zh_next example.pdf --config ./config.json` | | `help` | Show help message | `pdf2zh_next --help` | | `version` | Show version information | `pdf2zh_next --version` | --- ### TRANSLATED TEXT | Опция | Функция | Пример | | ------------------------------- | -------------------------------------------------------------------------------------- | -------------------------------------------------------------------------------------------------------------------- | | `input-files` | Входные PDF-файлы для обработки | `pdf2zh_next example.pdf` | | `output-directory` | Выходная директория для переведённых файлов (по умолчанию: `_translated`) | `pdf2zh_next example.pdf --output-directory ./output` | | `translation-service` | Служба перевода для использования (по умолчанию: `google` или `google_free`) | `pdf2zh_next example.pdf --translation-service deepl` | | `source-language` | Исходный язык (код ISO 639-1) (по умолчанию: `en`) | `pdf2zh_next example.pdf --source-language ja` | | `target-language` | Целевой язык (код ISO 639-1) (по умолчанию: `zh`) | `pdf2zh_next example.pdf --target-language fr` | | `translation-options` | Дополнительные опции для службы перевода (формат JSON) | `pdf2zh_next example.pdf --translation-options '{"formality": "more"}'` | | `concurrency-limit` | Максимальное количество одновременных запросов перевода (по умолчанию: 5) | `pdf2zh_next example.pdf --concurrency-limit 10` | | `page-range` | Определённый диапазон страниц для перевода (например, "1-5,8,10-15") | `pdf2zh_next example.pdf --page-range "1-10"` | | `ocr` | Включить OCR для изображений и сканированных документов (по умолчанию: false) | `pdf2zh_next example.pdf --ocr` | | `ocr-language` | Язык для OCR (код ISO 639-1) (по умолчанию: `en`) | `pdf2zh_next example.pdf --ocr --ocr-language ja` | | `ocr-resolution` | Разрешение для OCR в DPI (по умолчанию: 300) | `pdf2zh_next example.pdf --ocr --ocr-resolution 150` | | `math-translate` | Включить перевод математических формул (по умолчанию: false) | `pdf2zh_next example.pdf --math-translate` | | `math-mode` | Режим перевода математических формул (по умолчанию: `both`) | `pdf2zh_next example.pdf --math-translate --math-mode hybrid` | | `math-method` | Метод перевода математических формул (по умолчанию: `pdf2zh`) | `pdf2zh_next example.pdf --math-translate --math-method PDFMathTranslate` | | `math-options` | Дополнительные опции для перевода математических формул (формат JSON) | `pdf2zh_next example.pdf --math-translate --math-options '{"keep_original": true}'` | | `cache` | Включить кэширование переводов (по умолчанию: true) | `pdf2zh_next example.pdf --no-cache` | | `cache-directory` | Директория для файлов кэша (по умолчанию: `_cache`) | `pdf2zh_next example.pdf --cache-directory ./my_cache` | | `clean-cache` | Очистить кэш перед обработкой (по умолчанию: false) | `pdf2zh_next example.pdf --clean-cache` | | `config` | Путь к файлу конфигурации | `pdf2zh_next example.pdf --config ./config.json` | | `help` | Показать сообщение справки | `pdf2zh_next --help` | | `version` | Показать информацию о версии | `pdf2zh_next --version` |
